{"title": "A self-help critique to self-help mechanisms.", "name": "t3_pf696t", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pf696t/a_selfhelp_critique_to_selfhelp_mechanisms/", "selftext": "\n\nThe book by Danish psychologist Svend Brinkmann starts from a critique of modern society that we have heard all too often.  In “liquid” modernity, people live uprooted, always in motion, always looking for new sensory experiences, trained in a constant positive attitude even at work.  But for this very reason they are easier to stress.  Life coaches, mindfulness gurus, self-help books and sometimes psychotherapy itself constitute the paraphernalia with which people encounter this \"culture of acceleration\": introspection, continuous learning, positive thinking are some of the mantras of this philosophy of success and constant improvement, in personal life as well as at work.  If we are unhappy or stressed, in short, it is also this fault of capitalism.\n \n  B.mann's is an effective self-help against self-help that intends to re-evaluate which, in his opinion, we often tend to put aside the value of negative emotions, such as melancholy or sadness, or life quiet, opposed to the obsessive search for the new.  We can read it, if we want, as a philosophy of laziness: there is nothing wrong if for once we give up an experience to sit in slippers and watch a TV series.  But Brinkmann, who refers to the stoicism of Seneca and Marcus Aurelius, sees it as rather the reconquest of an inner stability from which a greater awareness of one's limitations should arise, as well as greater attention to our moral responsibilities towards others.", "score": 3, "upvote_ratio": 0.81, "permalink": "/r/TheFlyingTree/comments/pf696t/a_selfhelp_critique_to_selfhelp_mechanisms/", "id": "pf696t", "author": "10000x100", "link_flair_text": "Discussion", "num_comments": 5, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630417827.0, "comments": [{"author": "PalatableNourishment", "id": "hb2boxq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "pf696t", "stickied": false, "body": "Society also has a problem with consumption. We consume too much physical stuff. Perhaps the idea from the book that people are always in motion/looking for new sensory experiences, and the problem of over consumption are related? If people were more content to relax and do very little, companies wouldn’t make as much money…", "is_submitter": false, "distinguished": null, "created_utc": 1630421820.0, "parent_id": "t3_pf696t", "replies": []}, {"author": "ganznormal", "id": "hb2smli", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #139", "submission": "pf696t", "stickied": false, "body": "Beautiful. To be able to see oneself as mediocre and one's own life as ordinary is almost revolutionary in these times and can be deeply relaxing.\n\n> But Brinkmann, who refers to the stoicism of Seneca and Marcus Aurelius, sees it as rather the reconquest of an inner stability from which a greater awareness of one's limitations should arise, as well as greater attention to our moral responsibilities towards others.\n\nI love this. Thanks for sharing.", "is_submitter": false, "distinguished": null, "created_utc": 1630428665.0, "parent_id": "t3_pf696t", "replies": []}, {"author": "Akeldama22", "id": "hb48g9x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #423", "submission": "pf696t", "stickied": false, "body": "I like what you say friend! I like to think of sadness and other hard to deal with emotions as growth opportunities instead of negative emotions. IMO, negative emotions and thought come from a negative place such as envy, anger (while it is justified to be angry about certain things, untamed anger is a death sentence), or can be caused by societal/environmental influences like \"I feel ugly because of today's beauty standards\" is negative and helps nobody. Feelings that don't necessarily feel good can still be good for us! But truly negative feelings usually reflect our lack of awareness of ourselves and the causality of what we feel. When we dig deep in there, we tend to find there's no reason to feel those things at all.", "is_submitter": false, "distinguished": null, "created_utc": 1630450287.0, "parent_id": "t3_pf696t", "replies": []}, {"author": "dreamtimee", "id": "hb5m4u3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #254", "submission": "pf696t", "stickied": false, "body": "I love this.  I despise life coaches, whom I believe prey on the weak or the temporarily weakened.  There is no colder circle of hell that I can see than making a profit from people going through a rough patch.", "is_submitter": false, "distinguished": null, "created_utc": 1630475742.0, "parent_id": "t3_pf696t", "replies": []}, {"author": "roundhashbrowntown", "id": "hb9fli7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #435", "submission": "pf696t", "stickied": false, "body": "ive been able to capture moments of The Life Quiet  but im not sure how to maintain that state of peace. i have to actively step off my usual train of thought to get there. how do i make the peace the default?", "is_submitter": false, "distinguished": null, "created_utc": 1630546181.0, "parent_id": "t3_pf696t", "replies": []}]}