{"title": "What do you think are the 5 long and short term problem's that humanity has?", "name": "t3_pfrd78", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pfrd78/what_do_you_think_are_the_5_long_and_short_term/", "selftext": "And how would you solve them if you were given absolute control over humanity?", "score": 2, "upvote_ratio": 0.75, "permalink": "/r/TheFlyingTree/comments/pfrd78/what_do_you_think_are_the_5_long_and_short_term/", "id": "pfrd78", "author": "_RedditMan69", "link_flair_text": "Question", "num_comments": 21, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630493294.0, "comments": [{"author": "SmileFirstThenSpeak", "id": "hb6a01p", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "pfrd78", "stickied": false, "body": "First short term one is people not doing their own homework.", "is_submitter": false, "distinguished": null, "created_utc": 1630495247.0, "parent_id": "t3_pfrd78", "replies": [{"author": "_RedditMan69", "id": "hb6affy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #446", "submission": "pfrd78", "stickied": false, "body": "Facts", "is_submitter": true, "distinguished": null, "created_utc": 1630495528.0, "parent_id": "t1_hb6a01p", "replies": [{"author": "SmileFirstThenSpeak", "id": "hb6bj5f", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "pfrd78", "stickied": false, "body": "Second one is people not understanding where apostrophes do and don’t belong.", "is_submitter": false, "distinguished": null, "created_utc": 1630496246.0, "parent_id": "t1_hb6affy", "replies": [{"author": "_RedditMan69", "id": "hb6bo4s", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #446", "submission": "pfrd78", "stickied": false, "body": "Oops didn't notice that.", "is_submitter": true, "distinguished": null, "created_utc": 1630496334.0, "parent_id": "t1_hb6bj5f", "replies": [{"author": "SmileFirstThenSpeak", "id": "hb6bwdg", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "pfrd78", "stickied": false, "body": "Check your title, too. \n\nYou know I’m just busting on you. Good luck with your assignment. 🙂", "is_submitter": false, "distinguished": null, "created_utc": 1630496477.0, "parent_id": "t1_hb6bo4s", "replies": []}]}, {"author": "shig23", "id": "hb6fbxt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pfrd78", "stickied": false, "body": "You mean it doesn’t stand for \"here comes an S?\"", "is_submitter": false, "distinguished": null, "created_utc": 1630498525.0, "parent_id": "t1_hb6bj5f", "replies": []}]}]}]}, {"author": "ETL6000yotru", "id": "hb6f5fy", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #138", "submission": "pfrd78", "stickied": false, "body": "1. Reliance on fossil fuels\n2. The horrendous resource black hole that is the meat industry\n3. North Korea\n4. Crazy religious people in power\n5. Overpopulation\n\nSolutions: (note: these are what i thought of at the top of my head and given minimal thoughts on the consequences of these \"solutions\") \n1. Replace all fossil with nuclear power (not the old big chimney kinds the new modern ones plus using thorium instead of uranium)\n2. Put a big budget on the research of \"growable\" meat/synthetic meat\n3. Just assassinate Kim and take hold of the nuclear launch codes thanks to the super cool spys that definitely can infiltrate NK military bases with no danger\n4. Put them in asylums and replace them with better people\n5. Restrict childbirth to only 2 per family but no amount restrictions on adoptions (also putting more security on who can adopt to keep the pedos and abusers out)", "is_submitter": false, "distinguished": null, "created_utc": 1630498424.0, "parent_id": "t3_pfrd78", "replies": [{"author": "DragonLadyArt", "id": "hb81itr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #307", "submission": "pfrd78", "stickied": false, "body": "5 would take care of itself if there was more support for couples who chose not to have kids.\n\n•Don’t penalize in taxes for not having children or offer diffident types of tax breaks/incentives for choosing to be child free. Being a DINK is a thing and it’s a pain. \n\n•Make fact based sexual education the norm in all states, communities, and schools. Don’t allow religious groups to control the dialog here at all. Also teach consent and body autonomy at a young age. (Ask if you can hug someone, and it’s ok if you don’t want to hug)\n\n•Offer free or low cost wide access to birth control. That includes abortions, but the best way to prevent them is education and access to other forms of BC. \n\n•Add a whole slew of after school programs, trade school, continuing education, life style, how to manage money, etc. Raise communities out of poverty, and give young people something else to do. \n\n•offer better support and aftercare for rape and sexual trauma, and spousal abuse victims. Also harsher punishments for those who are caught. \n\n•Create better options for elderly care so people don’t feel like they have to have children in order to have someone to take care of them as they get older. \n\nHonestly most of these would improve society as a whole, and not just over population rates. In general educate country(s) that being child free is ok. We’re child free by choice, but the amount of pushback from all sides because we went that route not healthy. Luckily not from parents, but strangers, doctors, religious groups, and society as a whole. For whatever reason you’re a selfish, horrible, inhuman person if you choose not to have children.  \n\nThat being said it’s my understanding that many industrial countries are experiencing a drop in birth rates and they’re population numbers are going backwards.", "is_submitter": false, "distinguished": null, "created_utc": 1630523505.0, "parent_id": "t1_hb6f5fy", "replies": []}, {"author": "_RedditMan69", "id": "hb6km26", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #446", "submission": "pfrd78", "stickied": false, "body": "1.Look i agree that Nuclear is a good option but it's not THE option , it's only a finite resource that will last for a few centuries , even with thorium and better technology remember Nuclear right now only provides 10% of the worlds energy , and if we used it as a main energy source we would have to multiply our nuclear production TEN times , including the amount of nuclear fuel we spend.\n\nAnd yes you might argue that we can recycle nuclear fuel , but the problem with that is it's 3 times the cost to recycle nuclear fuel then to dispose it. Naturally we would need a more cost effective option.\n\nI believe we should use Nuclear fuel to supplement our energy production and help our transition to a clean energy world , and to give us enough time to make solar panels in space a reliable energy source and hopefully help give us enough time to slowly start building a Dyson sphere/Dyson Swarm.\n\n2.Agree\n\n3.North Korea is not a threat , their military is weak compared to the western countries , their nuclear arsenal is minuscule compared to the nuclear arsenal of the US . And i'm pretty sure China would prevent North Korea from Invading South Korea because they KNOW they can't compete with the military of the US , yet.\n\n4.Agree\n\n5.I would ristrict it to three , also i would promote vertical living like apartment buildings.", "is_submitter": true, "distinguished": null, "created_utc": 1630501321.0, "parent_id": "t1_hb6f5fy", "replies": [{"author": "ETL6000yotru", "id": "hb6qmvn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #138", "submission": "pfrd78", "stickied": false, "body": "1. Yeah i agree only relying on a single power source is stupid (unless it's a fucking Dysonsphere) \n3. Im not worrying about north Korea because of their military strength or even the amount of nukes they have \nIm worried that in result of them launching a nuke other countries with nukes (ie US and Russia) will also launch their nukes resulting in a nuclear war and that's beryy vad", "is_submitter": false, "distinguished": null, "created_utc": 1630504152.0, "parent_id": "t1_hb6km26", "replies": [{"author": "_RedditMan69", "id": "hb6rtrt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #446", "submission": "pfrd78", "stickied": false, "body": "Well as long as the US maintains it's dominance , im pretty sure North Korea won't be launching a nuke knowing that the US would have no problem beating them to submition.", "is_submitter": true, "distinguished": null, "created_utc": 1630504675.0, "parent_id": "t1_hb6qmvn", "replies": []}]}]}]}, {"author": "Niskanen204", "id": "hb6xmwr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "pfrd78", "stickied": false, "body": "Biggest long-term problem is the Sun dying.\n\nI'd establish numerous competing research institutes oriented around pure and applied science and technology in the space (pun intended) of extrasolar survival.", "is_submitter": false, "distinguished": null, "created_utc": 1630507168.0, "parent_id": "t3_pfrd78", "replies": []}, {"author": "Cognizant_Psyche", "id": "hb6czf4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pfrd78", "stickied": false, "body": "There are a lot, and no real way to fix them that doesn’t involve time, external objective awareness, compromise, and personal accountability.  We are too young of a species still clinging to tribalistic mentalities in order to gain a sense of belonging and identity: be it nationalism, religion, or race.  In order to get ourselves out of the hole we’ve dug ourselves in with climate change, overstocking of extinction level weapons, and international tension/division we would need to unite as a collective to tackle them and search for other places to expand to in the cosmos.  I just don’t see that happening since everyone thinks their way is the correct and only way to do things. We’re still apes flinging figurative (and sometimes literal) shit at each other when mad or something doesn’t go our way, so how the hell do we fix… well all of everything? We can’t even agree on safety measures to combat a global pandemic, or convince large swaths of the population it is even happening when they are dropping dead from it.  It would take an external threat to our existence strong enough to unite all of us to ignore the barriers we’ve put up to have a chance.", "is_submitter": false, "distinguished": null, "created_utc": 1630497152.0, "parent_id": "t3_pfrd78", "replies": []}, {"author": "BobbyCostner", "id": "hb6vwyw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #466", "submission": "pfrd78", "stickied": false, "body": "The first problem is people talking about fight club when the rules are pretty clear not to.", "is_submitter": false, "distinguished": null, "created_utc": 1630506443.0, "parent_id": "t3_pfrd78", "replies": []}, {"author": "rambling_RN", "id": "hb9vs0t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #258", "submission": "pfrd78", "stickied": false, "body": "The main problem at the moment is that everyone thinks they deserve individual attention and solutions from the masses. \n\nThere should be no special treatment for race,  religion, sex, orientation,  or beliefs.", "is_submitter": false, "distinguished": null, "created_utc": 1630554309.0, "parent_id": "t3_pfrd78", "replies": []}, {"author": "DoglessDyslexic", "id": "hb6sodl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pfrd78", "stickied": false, "body": "1.  Overpopulation.  To solve this I'd say we need population management techniques.  Many first world countries have negative population growth already, which is roughly good, but it can have some serious implications to labor availability if not well managed.  Getting experts on population management to plot and help maintain a course of reduced population with multinational agreement is almost certainly not feasible.  But I think it's what we need.  Note that the alternative method of reducing population aka diebacks, are typically really really unpleasant.  And in the future, likely worse than they were in the past.  Nobody during the Irish potato famine had access to nukes, but now if one country starts starving to death there's a real possibility that they'll try to take what their neighbors have and that very well may go nuclear.  Or worse, biological for those countries that have been carrying out bioweapons research on the sly (which is likely most of them).  Far better to have a few hundred years of managed population gradually reducing our population to more manageable levels than having a few years of famine followed by a couple days of nuclear war wiping out 95% of humanity.  This is both a short term and long term issue.\n\n2.  Habitat destruction.  Humans are a wrecking ball environmentally.  Part of this stems from our overpopulation, but honestly a lot of it is economical.  To fix it, you again need an international agreement and dedicated professionals managing human expansion and habitat use, and they have to have both the willingness to act and the power to do so.  So environmental warriors that can override sovereign powers.  Again, this doesn't seem likely to happen.  This is also both a near and short term issue.\n\n3.  Carbon.  Namely our propensity to put a lot of it in the air.  It needs to stop, and right damn soon.  I'll classify it as a short term problem, but that's because if we don't fix it, there won't be a long term.  Both of the first two issues will be greatly exacerbated by rising global temperatures.\n\n4. Nukes.  In and of themselves I don't particular object to them, they've ushered in an age of unprecedented peace (Yes, really! Look at history and the frequency of wars between nations in the 200 years before nuclear weapons).  But the value in nuclear weapons is in not using them.  Should we get to a point where it looks like they actually will get used, then we're all kinda fucked.  Like, for instance, if overpopulation, coupled with habitat destruction and global warming rendered large amounts of arable land unusable causing a bunch of nations to go to war with each other.  Fallout is bad enough, but coupled with their tendency to destroy a lot of electrical infrastructure which is one of the legs our technological civilization stands on, and you're looking at some really bad things happening.  There is no solution to this, because one country getting rid of nukes just means any other country that doesn't has an advantage over them.  And if you could magically get rid of all of them, that means that there's nothing to stop countries from going at each other the way they used to, only with more deadly conventional arms.  On the plus side, nuclear winter might offset global warming, but we'd likely be too dead to appreciate that.\n\n5. People.  To quote Tommy Lee Jones' character Kay \"A person is smart. People are dumb, panicky dangerous animals and you know it.\"  While I don't necessarily agree that this is always the case (and I don't think revealing aliens would cause that much issue), almost all our problems stem from people being dumb, panicky, dangerous animals.  While I'm fond of people, as a species we've got some major shortcomings that nobody appears to either able or willing (or both) to address.  I strongly hope that this will not be the death of us.", "is_submitter": false, "distinguished": null, "created_utc": 1630505054.0, "parent_id": "t3_pfrd78", "replies": []}, {"author": "DoglessDyslexic", "id": "hb6isgx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pfrd78", "stickied": false, "body": "> And how would you solve them if you were given absolute control over humanity?\n\nIronically, people wanting absolute control over humanity is one of humanity's problems.  In theory, it's not a bad idea, if you could find somebody who was smart, empathetic, incorruptible and good at the job.  The problem is that most people that actually want control over their fellow man are usually at least lacking the empathetic part of that description, and in the vast majority of cases are 0 for 4.", "is_submitter": false, "distinguished": null, "created_utc": 1630500403.0, "parent_id": "t3_pfrd78", "replies": [{"author": "_RedditMan69", "id": "hb6mlpi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #446", "submission": "pfrd78", "stickied": false, "body": "Human history in a nutshell.", "is_submitter": true, "distinguished": null, "created_utc": 1630502294.0, "parent_id": "t1_hb6isgx", "replies": []}]}, {"author": "mikczas", "id": "hb6o2vh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #146", "submission": "pfrd78", "stickied": false, "body": "1. Religious beliefs that completely ignores the reality\n2. Taking authorities for truth, not the truth for authority\n3. Not believing in oneselves, and the people around us\n4. Not embracing individuality in people, but trying to make them the same\n5. Conforming to some bullshit society constructs\n6. Putting pineapple on pizza", "is_submitter": false, "distinguished": null, "created_utc": 1630502988.0, "parent_id": "t3_pfrd78", "replies": [{"author": "JivePrintingDotCom", "id": "hbc12nz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pfrd78", "stickied": false, "body": "Point number one here is actually the subject of the continual news cycle alarmism: environmentalism, covid-19, social inequalities and the like are all religious beliefs held in religious discussions with no quarter for analysis and where disagreement is on the basis of fact, not opinion.", "is_submitter": false, "distinguished": null, "created_utc": 1630600344.0, "parent_id": "t1_hb6o2vh", "replies": []}]}, {"author": "PurpleDevilR", "id": "hb7jya8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "pfrd78", "stickied": false, "body": "For the short term;\n\n1: Imminent economic collapse.\n\n2: Automation causing massive unemployment.\n\n3: Possible collapse of western civilisation.\n\n4: A sudden rise in new religions & ideologies. \n\n5: WW3.\n\nAs for long term problems; \n\n6: Climate change.\n\n7: Markets flooded with space mining causing a collapse in mineral value.\n\n8: Industrialisation of the entire world creating multiple great powers and the 2nd Cold War. \n\n9: Mind control chips used by an authoritarian regime (google the mice).\n\n10: AI uprising.\n\nHonourable mentions are;\n\n11: Terrorist bio weapons.\n\n12: Extra-terrestrial life (the more advanced the more likely there is a great filter). \n\nThese problems can’t really be stopped, only prepared for, fought, endured and eventually overcome. They’re more challenges than anything else. But if I had complete control.\n\nSolutions;\n\n1: ending the stock market and monopolies. I would create state-owned franchises for local businesses. \n\n2: nationalise any fully automated industry and provide these resources for free.\n\n3: cultural renaissance program and awareness of the cycle of civilisations (barbaric mysticism, civilisation, disconnected logical decadence).\n\n4: enforce 1 of the new faith/ideology upon the people (preferably I’d influence or write it)\n\n5: well I have absolute control, simply stop it from happening.\n\n6: enforce strict climate regulations, convert to a 0 CO2 economy, invest and hope for new technologies of carbon capture from the atmosphere.\n\n7: my regulations of the market and break up of monopolies should turn this into a boon.\n\n8: i refer to solution 5.\n\n9: I think in this scenario I’m using it since I have absolute control over humanity, otherwise simply don’t do it.\n\n10: restrict all AI development to 1 highly secure location. Also upload my mind and become the singularity so I can prevent enemy AIs that may rebel. Yeah in this scenario I’m definitely using the mind control.\n\n11: I refer to solution 5.\n\n12: I dunno, hope we’re alone in the universe so I have complete control, or hope that we at least have past the filter.\n\nEdit: formatting & solutions.", "is_submitter": false, "distinguished": null, "created_utc": 1630516310.0, "parent_id": "t3_pfrd78", "replies": []}]}