{"title": "I've caught a breakthrough case of the COVID. Have any of y'all had it/ any top tips?", "name": "t3_oym0wh", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oym0wh/ive_caught_a_breakthrough_case_of_the_covid_have/", "selftext": "I'm fully vaccinated but traveled to see my family for the first time in ~16 months and tested positive when I came back. \n\nSo far it has just been a low fever, sniffles, body ache. I live with 10 housemates so figuring out isolation was/is pretty stressful - ha one of them even asked why I was still home and didn't 'go live in the woods like in a tent'.", "score": 21, "upvote_ratio": 0.84, "permalink": "/r/TheFlyingTree/comments/oym0wh/ive_caught_a_breakthrough_case_of_the_covid_have/", "id": "oym0wh", "author": "abraham1inco1n", "link_flair_text": "Question", "num_comments": 63, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628180926.0, "comments": [{"author": "bluesam3", "id": "h7tqhgi", "score": 16, "subreddit": "TheFlyingTree", "author_flair": "Seeker #23", "submission": "oym0wh", "stickied": false, "body": "It will, on average, be massively less severe than a non-breakthrough case. You're probably going to feel a bit off for a few days and a bit bored for the rest of the isolation period. \n\nObviously, if it does get serious, seek professional medical advice/etc.", "is_submitter": false, "distinguished": null, "created_utc": 1628181331.0, "parent_id": "t3_oym0wh", "replies": [{"author": "abraham1inco1n", "id": "h7tqy1m", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "yea for sure. I'm glad this happened after vaccination and not before. My parents who are in their 60s got it July 2020 and said it was the worst illness they've ever had (and my dad's had malaria and typhoid).", "is_submitter": true, "distinguished": null, "created_utc": 1628181521.0, "parent_id": "t1_h7tqhgi", "replies": [{"author": "TSM-", "id": "h7uet78", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #39", "submission": "oym0wh", "stickied": false, "body": "Do make sure you prioritize having a good, restful sleep. Sleep is incredibly important for your immune system, as that is when it goes into recovery and repair mode, whereas during the day your body is more focused on powering through and keeping you active. [For example, see this document by the CDC](https://www.cdc.gov/niosh/work-hour-training-for-nurses/longhours/mod2/05.html)", "is_submitter": false, "distinguished": null, "created_utc": 1628191207.0, "parent_id": "t1_h7tqy1m", "replies": []}, {"author": "Nothemagain", "id": "h7ts8gu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #134", "submission": "oym0wh", "stickied": false, "body": "You could try green tea the \"epicatechin gallate\" in green tea has been shown to reduce symptoms in certain viral loads with 24 - 48 at 2 - 3 cups per day.\n\nDo your own research, not real medical advice just trying to be of use. Tea is also tree.", "is_submitter": false, "distinguished": null, "created_utc": 1628182051.0, "parent_id": "t1_h7tqy1m", "replies": []}, {"author": "NobilisUltima", "id": "h7vj4nw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #209", "submission": "oym0wh", "stickied": false, "body": "I'm glad your parents survived.", "is_submitter": false, "distinguished": null, "created_utc": 1628209098.0, "parent_id": "t1_h7tqy1m", "replies": []}]}]}, {"author": "cocobisoil", "id": "h7tuu5c", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #87", "submission": "oym0wh", "stickied": false, "body": "I had it last march & it was brutal but my double jabbed pal just had it & he was just run down, aches, sore throat etc so hopefully it'll be alright. Just lie in bed.\n\nEdit: edibles were not a good idea lol", "is_submitter": false, "distinguished": null, "created_utc": 1628183118.0, "parent_id": "t3_oym0wh", "replies": [{"author": "abraham1inco1n", "id": "h7tvbc9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "hahah thanks on the update on edibles - I think that's the last thing I want right now :D", "is_submitter": true, "distinguished": null, "created_utc": 1628183316.0, "parent_id": "t1_h7tuu5c", "replies": [{"author": "cocobisoil", "id": "h7tvkgj", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #87", "submission": "oym0wh", "stickied": false, "body": "Yeah, I thought I was over the worst & deserved a treat, oh boy what a mistake lol felt like I was drowning.", "is_submitter": false, "distinguished": null, "created_utc": 1628183422.0, "parent_id": "t1_h7tvbc9", "replies": []}]}, {"author": "S_thyrsoidea", "id": "h7ud773", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "oym0wh", "stickied": false, "body": "I want to hear more about your experience of edibles + COVID, please?\n\nI caught what was plausibly COVID in Mar 2020 (there were no tests in the US at the time), at which time there was a lot of consternation about whether or not one should take any OTC analgesics (aspirin, acetaminophen, ibuprofin) when one had it, because all(?) of them are also anti-fever medications, and it was unknown whether letting a fever burn might be helpful in fighting it off.  Someone pointed out that edibles are the rare analgesic which is not also an anti-fever med, but someone else pointed out that consuming CNS depressants while having a respiratory illness is nt smrt.  I've been wondering ever since about the tradeoff there.\n\nSo what did you experience?", "is_submitter": false, "distinguished": null, "created_utc": 1628190549.0, "parent_id": "t1_h7tuu5c", "replies": [{"author": "toad4409", "id": "h7wpae1", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #145", "submission": "oym0wh", "stickied": false, "body": ">COVID in Mar 2020 (there were no tests in the US at the time),\n\nThat's odd...I was tested for it a few times while on business. All within 2020.\n\nI understand the first few were people scrambling... there were still tests though.", "is_submitter": false, "distinguished": null, "created_utc": 1628233091.0, "parent_id": "t1_h7ud773", "replies": [{"author": "S_thyrsoidea", "id": "h7wtjmx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "oym0wh", "stickied": false, "body": "Not in March you didn't.", "is_submitter": false, "distinguished": null, "created_utc": 1628236657.0, "parent_id": "t1_h7wpae1", "replies": [{"author": "toad4409", "id": "h89aa48", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #145", "submission": "oym0wh", "stickied": false, "body": "I did actually. In March. They were not the best tests but they still were tests.", "is_submitter": false, "distinguished": null, "created_utc": 1628489690.0, "parent_id": "t1_h7wtjmx", "replies": [{"author": "S_thyrsoidea", "id": "h89axhm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "oym0wh", "stickied": false, "body": "On March 17, 2020 [the entire state of California had managed to test fewer than 9,000 people](https://web.archive.org/web/20200317134140/https://www.latimes.com/california/story/2020-03-17/california-promised-coronavirus-testing-expansion-meets-harsh-reality): \n\n> Federal and state officials on Monday said they had finally turned a corner on the coronavirus pandemic and promised a massive expansion of testing, but hopes remained dim in hospitals and clinics as patients still awaited results and overworked doctors sharply questioned the government’s latest pledge.\n>\n> Some physicians in Los Angeles County said it is still nearly impossible to order a coronavirus test because the process is slowed by bureaucratic hurdles and shortages of key materials. “The testing spigot has definitely not opened up,” said one L.A. County emergency room doctor. She still faces tight restrictions on which patients qualify for testing and then has to wait for results for five days, she said.\n>\n> Leigha Hodnet, 42, said she was still waiting for test results nearly one week after she and her partner were tested at a lab in Burbank. “We’re trying to self-quarantine, but it’s just really crazy,” said Hodnet, who lives in Echo Park and said her symptoms included a fever, cough and extreme fatigue. “One way to stop it is to make sure everyone can get tested and self-quarantine. But if they can’t, that’s how this becomes a pandemic.”\n\nOther states had even less access to tests.  Check your dates again.\n\nP.S. Also, I assume you were traveling to either China or Italy, because well into April the CDC was \"recommending\" (which had the force of law in health care settings) that the only people who should be allowed to be tested were those who had personally traveled abroad to a country with known spread, or had close contact with someone who themselves had a positive PCR test, which, famously lead to the hideous situation with the first hospitalized patient in NJ, whom the hospital initially wouldn't test and boarded in the ER, because neither was true in his case.", "is_submitter": false, "distinguished": null, "created_utc": 1628490227.0, "parent_id": "t1_h89aa48", "replies": [{"author": "toad4409", "id": "h89e928", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #145", "submission": "oym0wh", "stickied": false, "body": "I was traveling to several European countries. This was not something in your statement though. You stated that tests did not exist in the US in March 2020.\nI'm coming to understand that you meant that to the general public (aka the tests were in abundance and accurate) they were not available.", "is_submitter": false, "distinguished": null, "created_utc": 1628492995.0, "parent_id": "t1_h89axhm", "replies": []}]}]}]}]}]}]}, {"author": "S_thyrsoidea", "id": "h7uf6vo", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "oym0wh", "stickied": false, "body": "Yeah, three things.\n\nA pulse oximeter.  Get one.  Someone got me one when I came down with what was plausibly COVID and it saved my damn mind.  It allows you to monitor your blood oxygenation.  It's that little thing they clip on your finger at the doctor, while taking your blood pressure. This means that if you start feeling it's hard to breathe, you have an objective way to test whether or not you need to go to a hospital or even doctor.  It was amazing that in the height of the first surge, I was able to tell that despite my discomfort breathing, and how it was getting effortful to breathe, I **didn't** need to go to an emergency room, because I was still getting enough O2 into me.  I could tell my doc over the phone or in email how I was progressing with actual SpO2 numbers, just like they would in her office or the ER. Fucking splendid.  And they can be had for like $30 at your favorite drugstore, or Amazon.  Make sure it comes with batteries or also buy those too.\n\nPost nasal drip leads to sore throat; for upper wind way irritation, chicken soup is the bomb.  If you don't have chicken soup, you can reconstitute it from chicken bouillon cubes/powder, per the package directions, if you also add like a teaspoon of olive oil (or other oil), which makes it coat your throat properly.\n\nIf you don't have a body thermometer to monitor your fever precisely, get one of those too: you want to let your fever burn as much as you can, but not over 103ºF.  Also have something handy that reduces fever (either acetaminophen or ibuprofen; don't use aspirin, b/c Reyes syndrome), in case you do need it.  But fever is the body's defense against invaders, and it may help to burn off the virus (we don't know.)", "is_submitter": false, "distinguished": null, "created_utc": 1628191360.0, "parent_id": "t3_oym0wh", "replies": [{"author": "NoSuchKotH", "id": "h7v40u2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oym0wh", "stickied": false, "body": ">A pulse oximeter.  Get one.  Someone got me one when I came down with what was plausibly COVID and it saved my damn mind.  It allows you to monitor your blood oxygenation.\n\nSome clarification here: These finger pulse oxymeters are pretty inaccurate. Most have +/-5% accuracy in day-to-day use. +/- 10% is not unheard of. So don't panic when you read 90% at some point. It's most likely the oximeter and not your blood oxygen level that's off. Trying different finger or sitting/lying differently will lead to different results too.\n\nThat said, if you ever get below 80% and it doesn't get higher on another finger, call a doctor!", "is_submitter": false, "distinguished": null, "created_utc": 1628201881.0, "parent_id": "t1_h7uf6vo", "replies": []}, {"author": "abraham1inco1n", "id": "h7ughhy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "Thank you!", "is_submitter": true, "distinguished": null, "created_utc": 1628191897.0, "parent_id": "t1_h7uf6vo", "replies": [{"author": "SurprisedPotato", "id": "h7vmc66", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #192", "submission": "oym0wh", "stickied": false, "body": "To add to what others have said, a pulse oximeter isn't just for \"I feel like shit, but O2 is at 98%, so at least it's not an emergency\"\n\nIt's also for \"I am feel fine. The thingy on my finger is says 70% and is making a beeping noise. Beep beep. It's annoying and makes my head hurt. What was I supposed to do again? Oh yeah, something to do with to do with 911. To do with. Am fine. Ok, calling now\"", "is_submitter": false, "distinguished": null, "created_utc": 1628210688.0, "parent_id": "t1_h7ughhy", "replies": []}, {"author": "S_thyrsoidea", "id": "h7vunft", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "oym0wh", "stickied": false, "body": "You're welcome!  Also, I just thought of something else:\n\nThere's a bunch of scientific evidence, which is taken much more seriously in Asian countries than in the West, that ventilation matters.  Severity of disease is known to be a function of the dose-response relationship, meaning more actual viruses in your body, the sicker you are.  Which means that, hypothetically, sitting in an enclosed space rebreathing your own exhaled SARS-CoV-2 could reinfect you, exacerbating the severity of your infection.  Try to get fresh air through your space as much as you can.\n\nI was reminded of this by the crack from your roommate about off living in a tent in the woods: that's actually good advice. :)  There was a study during the Spanish Flu that found that patients in the field hospitals (tents!) did much better than those indoors.  Now, that study is, far and away, the worst \"scientific\" study I have ever read that wasn't just based on falsified data, so take it with a grain of salt.  But the subsequent research into viral disease severity and the dose-response relationship in it gives that an extremely plausible mechanism of action.\n\nRelatedly, if you can assess and change the humidity of your space, try to get within 40%-60%.  You'll be more comfortable breathing, and it will help mitigate transmission, whether self-reinfection or to housemates.  Aerosols linger in the air less long in that range.", "is_submitter": false, "distinguished": null, "created_utc": 1628214747.0, "parent_id": "t1_h7ughhy", "replies": [{"author": "abraham1inco1n", "id": "h7wfmd1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "Hahah I think I might have heard something similar - the fresh air movement in the early 1900s: https://99percentinvisible.org/episode/mini-stories-volume-11/\n\nI'll keep my windows open and a fan going!", "is_submitter": true, "distinguished": null, "created_utc": 1628225959.0, "parent_id": "t1_h7vunft", "replies": [{"author": "S_thyrsoidea", "id": "h7whvut", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "oym0wh", "stickied": false, "body": "A-ha! I remember reading that article, and had lost track of it.  Thanks for the link!\n\nThe problem with that article, is that it takes a \"look at the wacky history people, not knowing real science like us moderns, thinking that fresh air has some magical property!\" tone.  \n\nI have... rather a lot to say about that.  I am a medical professional, and am in a weak sense a historian.  A huge amount of what has gone terribly in the US through this pandemic is directly traceable back to this terrible attitude towards the scientists and science of that time.\n\nFor instance, the six foot social distancing guideline?  It was debunked by two scientists about a month and a half (!!!) after the Spanish Flu broke out in the US.  They did a very clever experiment that proved that droplets adequate to infect if carrying an infectious agent travel more than10 feet from loud speech. Mere days after they published, health official here in Boston ran something in the Boston Globe telling everyone the new distance is 10 feet.\n\nSo when the CDC started promulgating the 6ft standard (the WHO did it too, two meters) in Jan 2020, I was like: WTF?  Did something happen to debunk the 1918 droplet dispersal paper?  How did we get back to 6 ft?  Apparently the answer is that a theoretical physics (!!) paper in the 1950s proposed that it was probably 6 ft, so everyone decided that was the most recent!cutting-edge!sciencey science and the right answer, and ignored the experimental finding from the ignorant old days of the early 20th century.\n\nThe reason the outcomes study was done on the tent hospital vs traditional hospital in the very first months of the 1918 pandemic was because the first people to come down with it in the US were men in the Navy, stationed in Boston, and bunked down on ships, and as they fell sick in great numbers with this terrifying new mystery illness, folks started noting that, apparently, the less well-ventilated a sailor's quarters were – the deeper into the ship they were quartered – the sicker they got.  So they decided to examine fresh air as a factor.\n\nI swear: this pandemic really is an IQ test, and it's not just the bleach drinkers who are flunking it.", "is_submitter": false, "distinguished": null, "created_utc": 1628227501.0, "parent_id": "t1_h7wfmd1", "replies": []}]}]}]}]}, {"author": "exceptionaluser", "id": "h7tr18l", "score": 19, "subreddit": "TheFlyingTree", "author_flair": "Seeker #189", "submission": "oym0wh", "stickied": false, "body": "Try not to die. \n\nI've been told dying is put on your permanent record, and furthermore has possible negative consequences in career searching.", "is_submitter": false, "distinguished": null, "created_utc": 1628181558.0, "parent_id": "t3_oym0wh", "replies": [{"author": "abraham1inco1n", "id": "h7tr8o4", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "Definitely not something you'd want to put on a CV. Really puts the hiring process on ice :D", "is_submitter": true, "distinguished": null, "created_utc": 1628181642.0, "parent_id": "t1_h7tr18l", "replies": [{"author": "FalconRelevant", "id": "h7u3vej", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oym0wh", "stickied": false, "body": "Not for all jobs, it might actually be a plus if they're looking for cult leaders, vampires, mystics, zombies etc.", "is_submitter": false, "distinguished": null, "created_utc": 1628186803.0, "parent_id": "t1_h7tr8o4", "replies": [{"author": "helloreddit321567", "id": "h7u6zen", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #247", "submission": "oym0wh", "stickied": false, "body": "You're all missing the big upside : unlimited holidays", "is_submitter": false, "distinguished": null, "created_utc": 1628188054.0, "parent_id": "t1_h7u3vej", "replies": []}, {"author": "SuddenProfile", "id": "h7vmf9k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "oym0wh", "stickied": false, "body": "I was raised to be a cult leader \\*seriously\\*. That'd disqualify me. I'm supposed to be a pure will-less vessel of divine energy. Divine vessels can't get sick.\n\nNote: My love of Hollow Knight is a coincidence.", "is_submitter": false, "distinguished": null, "created_utc": 1628210730.0, "parent_id": "t1_h7u3vej", "replies": []}]}, {"author": "SurprisedPotato", "id": "h7vlnys", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #192", "submission": "oym0wh", "stickied": false, "body": "Depends on the field really. What line are you in?", "is_submitter": false, "distinguished": null, "created_utc": 1628210356.0, "parent_id": "t1_h7tr8o4", "replies": [{"author": "abraham1inco1n", "id": "h7wfqqb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "taste tester for butchers that specialize in brainssss", "is_submitter": true, "distinguished": null, "created_utc": 1628226037.0, "parent_id": "t1_h7vlnys", "replies": [{"author": "SurprisedPotato", "id": "h7whw90", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #192", "submission": "oym0wh", "stickied": false, "body": "You may need to have been dead for 6 months to qualify for that. There's a lot of competition", "is_submitter": false, "distinguished": null, "created_utc": 1628227509.0, "parent_id": "t1_h7wfqqb", "replies": []}]}]}]}, {"author": "SmileFirstThenSpeak", "id": "h7tzyyl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "oym0wh", "stickied": false, "body": "I can’t believe multiple people downvoted this. I thought it was ~~fine~~ hilarious, so I upvoted, trying to get you out of negative numbers.", "is_submitter": false, "distinguished": null, "created_utc": 1628185234.0, "parent_id": "t1_h7tr18l", "replies": [{"author": "NoSuchKotH", "id": "h7u19sq", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oym0wh", "stickied": false, "body": "Fine? Just fine? That was hilarious!", "is_submitter": false, "distinguished": null, "created_utc": 1628185767.0, "parent_id": "t1_h7tzyyl", "replies": [{"author": "SmileFirstThenSpeak", "id": "h7u1h0z", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "oym0wh", "stickied": false, "body": "I fixed my comment. Thank you. Upvote for you!", "is_submitter": false, "distinguished": null, "created_utc": 1628185848.0, "parent_id": "t1_h7u19sq", "replies": []}]}]}, {"author": "craftycontrarian", "id": "h7u97tf", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #125", "submission": "oym0wh", "stickied": false, "body": "Heard you can still vote though.", "is_submitter": false, "distinguished": null, "created_utc": 1628188949.0, "parent_id": "t1_h7tr18l", "replies": []}]}, {"author": "iamnotroberts", "id": "h7u9uhs", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oym0wh", "stickied": false, "body": ">I'm fully vaccinated but traveled to see my family for the first time in \\~16 months and tested positive when I came back.  \n>  \n>So far it has just been a low fever, sniffles, body ache. I live with 10 housemates so figuring out isolation was/is pretty stressful - ha one of them even asked why I was still home and didn't 'go live in the woods like in a tent'.\n\nAnd what's the vaccination status of your 10 housemates? You can't honestly quarantine in a house with 10 other people unless they are quarantining as well. Otherwise, they will be potentially spreading COVID-19 as well.", "is_submitter": false, "distinguished": null, "created_utc": 1628189202.0, "parent_id": "t3_oym0wh", "replies": [{"author": "abraham1inco1n", "id": "h7wfxl6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "everyone's completely vaccinated and also isolating so hopefully things go well", "is_submitter": true, "distinguished": null, "created_utc": 1628226162.0, "parent_id": "t1_h7u9uhs", "replies": []}]}, {"author": "nergalelite", "id": "h7uvtgp", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #84", "submission": "oym0wh", "stickied": false, "body": "expecting people to properly isolate is like abstinence only sex-ed. \nit's a lot easier to tell everyone to use a condom then to expect them to not have sex, but if you're adamant about avoiding pregnancy/std then the only garunteed option is to not have sex.  \n  \nvaccinating everyone and trying to rush back to pre pandemic 'normal' is like giving everyone a condom and telling them to join the orgy!  \nit's not safe, it's safe *enough*. but the solution was, is, and continues to be: avoiding non-essential exposure to others.  \nSadly the solution has been declared not worth it by our overlords, so get back to work and die for them with a smile on your face; the only reason you had been told gatherings were okay was so that you would accept going back to work/school/etc. Management needs you back in-person in order to justify keeping themselves on the payroll.  \n  \n  \nall of this said, i wish you a swift recovery OP. get plenty of rest and stay hydrated. i would try to avoid getting the housemates ill but would ensure that they properly report their condition if they get sick; you are statistically valuable and have power influence the world, use that knowledge however you see fit", "is_submitter": false, "distinguished": null, "created_utc": 1628198297.0, "parent_id": "t3_oym0wh", "replies": []}, {"author": "Netzapper", "id": "h7tsbfs", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #213 | Classis Veritatus", "submission": "oym0wh", "stickied": false, "body": "I've had covid twice now, once after being vaccinated (about a month ago). And maybe I have it a third fucking time now (waiting on test results).\n\nFirst time was absolutely terrible. Felt like I was going to die for most of a month, and it took probably 6 months before I felt at all \"okay\" again. It was before the covid story even broke, so we didn't even know what it was. But it laid the smack down on me, my girlfriend, and both our cats.\n\nHad delta-variant last month, after being vaccinated early in the summer. Cats got it too. That was like having a shitty head-cold for two weeks. Not fun, but honestly the isolation was the shitty part.\n\nNow my girlfriend and I are sick again after she took a plane flight last week. She got a PCR test on Monday that came up negative, but the cats are coughing again and I don't know of another common infection that jumps species like that, so she's getting tested _again_ tomorrow. So there's a pretty fucking good chance I've had covid three times.", "is_submitter": false, "distinguished": null, "created_utc": 1628182085.0, "parent_id": "t3_oym0wh", "replies": [{"author": "PalatableNourishment", "id": "h7u3s2q", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "oym0wh", "stickied": false, "body": "Damn, I don’t know anyone that’s had it more than once. Do you work in a job where there’s a high risk of getting it?", "is_submitter": false, "distinguished": null, "created_utc": 1628186766.0, "parent_id": "t1_h7tsbfs", "replies": [{"author": "Netzapper", "id": "h7u7bmv", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #213 | Classis Veritatus", "submission": "oym0wh", "stickied": false, "body": "> Do you work in a job where there’s a high risk of getting it?\n\nNot even. I work from home. First time it was before Patient Zero was even announced; got it from my girlfriend who got it from a dude at work who'd been traveling.\n\nSecond time was Delta Variant, post-vax... and I just relaxed a bit, went out to a big public store, ate at a couple restaurants.\n\nThis time the second round of tests say it probably isn't covid! Wooooo! Third round of tests tomorrow hopefully will put my mind at rest.", "is_submitter": false, "distinguished": null, "created_utc": 1628188191.0, "parent_id": "t1_h7u3s2q", "replies": [{"author": "PalatableNourishment", "id": "h7usyqk", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "oym0wh", "stickied": false, "body": "Wow. Well I’m glad you (probably) don’t have it again!", "is_submitter": false, "distinguished": null, "created_utc": 1628197083.0, "parent_id": "t1_h7u7bmv", "replies": []}, {"author": "abraham1inco1n", "id": "h7wfufg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "I'm glad it probably isn't covid! Best of luck getting better after being sick though!", "is_submitter": true, "distinguished": null, "created_utc": 1628226103.0, "parent_id": "t1_h7u7bmv", "replies": []}]}]}, {"author": "abraham1inco1n", "id": "h7tvhyx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "ugh I'm sorry you've had such a rough time- I wonder how common it is to have so many infections?", "is_submitter": true, "distinguished": null, "created_utc": 1628183393.0, "parent_id": "t1_h7tsbfs", "replies": [{"author": "Netzapper", "id": "h7twin5", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #213 | Classis Veritatus", "submission": "oym0wh", "stickied": false, "body": "I'm not sure, but I am sure it's going to get increasingly common. People are are \"tired of isolating\" and are \"returning to normal\". And a shocking proportion of those people are choosing not to get vaccinated either. My state has _most_ of the top 50 counties for hospitalizations right now, because we're at something like 30-40% immunized because... I guess they're owning the libs?", "is_submitter": false, "distinguished": null, "created_utc": 1628183817.0, "parent_id": "t1_h7tvhyx", "replies": [{"author": "NoSuchKotH", "id": "h7u15h5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oym0wh", "stickied": false, "body": "Applied Darwinism.", "is_submitter": false, "distinguished": null, "created_utc": 1628185718.0, "parent_id": "t1_h7twin5", "replies": []}]}, {"author": "NoSuchKotH", "id": "h7u11mp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oym0wh", "stickied": false, "body": "Friend of mine had Covid 3 times last year already. Now that he is vaccinated, we hope that he stays out of it... But he is an \"at risk\" group in the sense that he is exposed to people a lot. And numbers are rising again :-(", "is_submitter": false, "distinguished": null, "created_utc": 1628185675.0, "parent_id": "t1_h7tvhyx", "replies": []}]}, {"author": "ktpr", "id": "h7v3gge", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #90", "submission": "oym0wh", "stickied": false, "body": "I’m curious, what state do you live in? So sorry you’ve been sick three times!", "is_submitter": false, "distinguished": null, "created_utc": 1628201627.0, "parent_id": "t1_h7tsbfs", "replies": []}]}, {"author": "IonOtter", "id": "h7uqokm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #112", "submission": "oym0wh", "stickied": false, "body": "Become a cat.\n\nNo, really!  Find a nice, warm spot, then eat, drink, sleep: repeat until you feel better.\n\nTagentially, stay home, mask up if anyone comes over, avoid contact with others for two weeks after, and keep wearing your mask.", "is_submitter": false, "distinguished": null, "created_utc": 1628196116.0, "parent_id": "t3_oym0wh", "replies": [{"author": "abraham1inco1n", "id": "h7wfz92", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "apparently cats can get covid as well? Another person was talking about it above", "is_submitter": true, "distinguished": null, "created_utc": 1628226192.0, "parent_id": "t1_h7uqokm", "replies": []}]}, {"author": "cuddle_tyrant", "id": "h7ux24e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oym0wh", "stickied": false, "body": "Rip that is a crap ton of housemates. I hope you feel better soon and that your housemates remain cautious of their health as well", "is_submitter": false, "distinguished": null, "created_utc": 1628198822.0, "parent_id": "t3_oym0wh", "replies": []}, {"author": "TesseractToo", "id": "h7trza3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "oym0wh", "stickied": false, "body": "See if you can get bit by a vampire or some other kind of undead-immortal being just to be safe.", "is_submitter": false, "distinguished": null, "created_utc": 1628181946.0, "parent_id": "t3_oym0wh", "replies": [{"author": "abraham1inco1n", "id": "h7wfvcb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "you got a hookup?", "is_submitter": true, "distinguished": null, "created_utc": 1628226120.0, "parent_id": "t1_h7trza3", "replies": [{"author": "TesseractToo", "id": "h7wjxz0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "oym0wh", "stickied": false, "body": "I'm sorry I don't I'm a complete shut in :D\n\nI hope that you get better soon <3  \n\n\nHere is a hug I drew for people who need one :)  \nhttp://tesseract.ca/images/Art/PandasHugging2.png", "is_submitter": false, "distinguished": null, "created_utc": 1628228982.0, "parent_id": "t1_h7wfvcb", "replies": []}]}]}, {"author": "amitym", "id": "h7u035b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "oym0wh", "stickied": false, "body": "Top tips?\n\nDon't travel in the middle of a pandemic.  >\\_>\n\nBut it's a bit late for that.\n\nKeep hydrated, rest a lot, do not exert yourself, and keep an eye on your symptoms.  Hopefully your case will be mild.  But if you start feeling markedly worse, get to a hospital and get checked out.", "is_submitter": false, "distinguished": null, "created_utc": 1628185282.0, "parent_id": "t3_oym0wh", "replies": []}, {"author": "JaimelesBN", "id": "h7tvddy", "score": -5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "oym0wh", "stickied": false, "body": "Imagine being vaccinated and having covid with symptom, while most of the non vaccinated people with covid don't have symptoms.", "is_submitter": false, "distinguished": null, "created_utc": 1628183340.0, "parent_id": "t3_oym0wh", "replies": [{"author": "NoSuchKotH", "id": "h7u1w5k", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oym0wh", "stickied": false, "body": "Federal run research in Germany has shown that vaccinated people are quite a bit less likely to show symptoms than unvaccinated people. But please don't tell the covidiots. We don't want the facts to confuse them.", "is_submitter": false, "distinguished": null, "created_utc": 1628186013.0, "parent_id": "t1_h7tvddy", "replies": [{"author": "JaimelesBN", "id": "h7u69db", "score": -7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "oym0wh", "stickied": false, "body": ">quite a bit less likely\n\nSo the vaccine is quite a bit useless ok. And i'm vaccinated btw.", "is_submitter": false, "distinguished": null, "created_utc": 1628187764.0, "parent_id": "t1_h7u1w5k", "replies": [{"author": "NoSuchKotH", "id": "h7ubmi0", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oym0wh", "stickied": false, "body": "Vaccines do not protect 100%. The cannot for various reasons. What they do is to lower the probability of \n\n1. Catching Covid and getting ill enough to show symptoms\n2. Catching Covid and getting ill enough to spread it to others\n3. Catching Covid and getting seriously ill\n4. Catching Covid and dying.\n\nSure, this does not sounds like the panacea people were hoping for. And the probabilities for each of those are lowered by a different factor. But diseases in general and epidemics in particular have always been a probability game. If there is a high probability of catching a disease and getting seriously ill, then it's an epidemic or potentially even a pandemic and lots of people die. If there is a low probability of catching a disease and/or getting seriously ill, then it's just a nuisance, like getting the sniffles. And every percent less probability adds up and saves lives.\n\nVaccines have the power to make a highly infectious and deadly disease into a tame little cold. That's why we don't have measles epidemics ravaging through whole countries every couple of years anymore. (I encourage everyone to read up on the infectiousness, the etiopathology and the long term effects on mortality of measles if you don't know them already). That's why \"a cold\" is not a reason for grave concern anymore. People were dying like flies just a mere 50-60 years ago. And it wasn't that much longer ago that the most common reason of death was \"fever\".", "is_submitter": false, "distinguished": null, "created_utc": 1628189912.0, "parent_id": "t1_h7u69db", "replies": []}]}]}]}, {"author": "Alert_Watercress4998", "id": "h7ty776", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #34", "submission": "oym0wh", "stickied": false, "body": "Sort of just make yourself comfortable and ride it out, like you have just the flu", "is_submitter": false, "distinguished": null, "created_utc": 1628184505.0, "parent_id": "t3_oym0wh", "replies": []}, {"author": "roguezebra", "id": "h7tyatc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #15", "submission": "oym0wh", "stickied": false, "body": "I use High dose Vit C & focus on sleep & hydration for viruses", "is_submitter": false, "distinguished": null, "created_utc": 1628184546.0, "parent_id": "t3_oym0wh", "replies": [{"author": "NoSuchKotH", "id": "h7v2vvy", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oym0wh", "stickied": false, "body": "Nonsteroid anti-inflametory drugs (e.g. Ibuprofene) are the better choice than vitamins once an infection has started. You want to limit the secondary immune reactions low in order to prevent the immune system from destroying your body while fighting the pathogens when it doesn't need to. And vitamins don't do that.\n\nDisclaimer: I'm not a licensed doctor, so please don't take the above as gospel. Ask your doctor or pharmacist for advice.", "is_submitter": false, "distinguished": null, "created_utc": 1628201373.0, "parent_id": "t1_h7tyatc", "replies": []}]}, {"author": "vanillaandzombie", "id": "h7upqkz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #154", "submission": "oym0wh", "stickied": false, "body": "I hope you get better fast.", "is_submitter": false, "distinguished": null, "created_utc": 1628195720.0, "parent_id": "t3_oym0wh", "replies": []}, {"author": "Parking_Pineapple440", "id": "h7vv1zn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #224", "submission": "oym0wh", "stickied": false, "body": "I’m sending you lots of support and health! Rest well", "is_submitter": false, "distinguished": null, "created_utc": 1628214943.0, "parent_id": "t3_oym0wh", "replies": [{"author": "abraham1inco1n", "id": "h7wfel1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oym0wh", "stickied": false, "body": "Thanks friend", "is_submitter": true, "distinguished": null, "created_utc": 1628225813.0, "parent_id": "t1_h7vv1zn", "replies": []}]}]}