{"title": "The World's Decrease in Violence", "name": "t3_pah3ej", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pah3ej/the_worlds_decrease_in_violence/", "selftext": "Pre-historic humans used to be really, really violent towards each other. In one archeological site in South Dakota it was determined that upwards 60% of deaths were caused by humans killing each other. The development of states helped decrease violence significantly.\n\nHowever, also from the 1300s onwards each century has seen a decrease in violence from the last. Even today, we continue to see the trend of fewer murders and fewer wars. And so I'd like to ask you what you think has driven the historical trend of decreasing violence, or your general opinions.\n\nI will say historians contribute many factors, ranging from the development of common manners, dispute management systems, rising literacy and education rates, the decrease in dictatorships, and many other things that haven't come to mind. To give some ideas.", "score": 33, "upvote_ratio": 0.97, "permalink": "/r/TheFlyingTree/comments/pah3ej/the_worlds_decrease_in_violence/", "id": "pah3ej", "author": "ACivilWolf", "link_flair_text": "Discussion", "num_comments": 57, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629783063.0, "comments": [{"author": "DoglessDyslexic", "id": "ha4novu", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pah3ej", "stickied": false, "body": "Have you read Pinker's \"Better Angels of our Nature\"?  He discusses trends from the 1500s on (prior to that reliable statistics are not available) as well as various different comparisons of possible factors.", "is_submitter": false, "distinguished": null, "created_utc": 1629783317.0, "parent_id": "t3_pah3ej", "replies": [{"author": "MisanthropicScott", "id": "ha4piz7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pah3ej", "stickied": false, "body": "Came to this thread to recommend this book as well.\n\nI didn't read the book. I just attended the lecture and book signing. I may or may not have bought a signed copy.\n\nDuring the lecture, he did state that he met with people in the few remaining hunter gatherer societies and found that they are still quite violent. He also worked with paleontologists/anthropologists studying the bones of early humans. Many of the bones do show signs of violent deaths.\n\nI believe he was able to estimate statistics for these peoples. And, I think the violence was much higher.\n\nI found the whole concept rather shocking that the 20th century might have been less violent than any century that came before it, given Hitler, Stalin, and others. But, he did include those numbers in the violence statistics for the modern day.", "is_submitter": false, "distinguished": null, "created_utc": 1629784664.0, "parent_id": "t1_ha4novu", "replies": [{"author": "DoglessDyslexic", "id": "ha4rz5g", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pah3ej", "stickied": false, "body": "His method of measuring violence is per capita.  Meaning the more people that exist the less weight individual deaths have.  The crusades killed an estimated 10% of the world's population at the time.  At the start of WW2, the world population was 2.3 billion, meaning 230 million people would have had to die to compare.  But \"only\" 75 million people died as a result of WW2, making it roughly 1/3 as violent as the crusades.\n\nHe notes that some dispute his measuring methods,  but I think he lays out a good case for measuring violence in that way.  Individual events can of course be highly violent, but as a general tendency, fewer of us per capita die to violence than used to (roughly 1/100th of the rate that people used to die violently in the 1500s)", "is_submitter": false, "distinguished": null, "created_utc": 1629786559.0, "parent_id": "t1_ha4piz7", "replies": [{"author": "MisanthropicScott", "id": "ha4s2yp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pah3ej", "stickied": false, "body": "Yes. I remember it was per capita. It still sounded surprising though. That doesn't mean I don't accept a fact as a fact, just that sometimes facts are not as we expect.", "is_submitter": false, "distinguished": null, "created_utc": 1629786643.0, "parent_id": "t1_ha4rz5g", "replies": [{"author": "DoglessDyslexic", "id": "ha4sj7g", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pah3ej", "stickied": false, "body": "Honestly the book is a huge eye opener to just how bad violence in the past was.  If you are like me, you have a vague notion that the past was more violent but don't have any sense of scope and magnitude.  This book really drives home just how bad the past could be.  Even with some of the horrible genocides of the last century, modern day existence in almost all countries is still safer than it was just a mere few centuries ago.", "is_submitter": false, "distinguished": null, "created_utc": 1629787002.0, "parent_id": "t1_ha4s2yp", "replies": [{"author": "MisanthropicScott", "id": "ha4swrw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pah3ej", "stickied": false, "body": "I think that may be why I didn't buy it. The topic is incredibly interesting. But, I'm not sure I want to know the details.\n\nBut, here's a nice image of a Fijian ceremonial [cannibal fork](https://theculturetrip.com/wp-content/uploads/2017/01/img_0114.jpg) ... mmm ... [long pig](https://www.dictionary.com/browse/long-pig)!", "is_submitter": false, "distinguished": null, "created_utc": 1629787303.0, "parent_id": "t1_ha4sj7g", "replies": []}]}]}]}]}, {"author": "ACivilWolf", "id": "ha4nwsy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #183", "submission": "pah3ej", "stickied": false, "body": "no I haven't got to it yet but I recently watched a film where they bring in Pinker to talk about it", "is_submitter": true, "distinguished": null, "created_utc": 1629783474.0, "parent_id": "t1_ha4novu", "replies": [{"author": "DoglessDyslexic", "id": "ha4r7dl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pah3ej", "stickied": false, "body": "I'd highly recommend it.  If you do wish to know about factors that are correlated to violent behavior then his book is pretty thorough.", "is_submitter": false, "distinguished": null, "created_utc": 1629785955.0, "parent_id": "t1_ha4nwsy", "replies": []}, {"author": "LoreleiOpine", "id": "ha5faci", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "pah3ej", "stickied": false, "body": "I recommend that book too if you're interested in the subject. Pinker is staggeringly intelligent and he writes clearly and stylishly.", "is_submitter": false, "distinguished": null, "created_utc": 1629805518.0, "parent_id": "t1_ha4nwsy", "replies": []}]}]}, {"author": "Cognizant_Psyche", "id": "ha5fwri", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pah3ej", "stickied": false, "body": "Resource availability.  Where there is less desire for securing supplies to survive there is less desperation to secure them from those around you, and typically other members of your species will have what you need.  This obviously doesn’t account for all violence and being such an aggressive ape creature we’ll always find something to fight about, even go as far as invent reasons to do so, but it’s more chaotic when you’re trying to stave off death due to hunger and shelter.", "is_submitter": false, "distinguished": null, "created_utc": 1629805902.0, "parent_id": "t3_pah3ej", "replies": [{"author": "145676337", "id": "ha668tq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #116", "submission": "pah3ej", "stickied": false, "body": "I have no training so this is all speculation. What if it's what you say, an abundance of resources, tied in with just having more to lose?\n\nSure, life is always valuable but when you have all the things that come even with less affluent lives in 1st world countries, you have a lot to lose and things could be much worse. You've got a TV, a phone, a place to live, generally have food...\n\nSo I'm agreeing that having needs met and not needing to be agressive to meet them helps. But also, that tied in with that is having more that you personally could lose and the double edged nature of that makes us all think twice.", "is_submitter": false, "distinguished": null, "created_utc": 1629818570.0, "parent_id": "t1_ha5fwri", "replies": [{"author": "zebediah49", "id": "ha6ofh8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #131", "submission": "pah3ej", "stickied": false, "body": "Less motivation to acquire more resources.\n\nMore motivation to not take risks.\n\nTwo sides of that same coin.", "is_submitter": false, "distinguished": null, "created_utc": 1629825949.0, "parent_id": "t1_ha668tq", "replies": []}, {"author": "Cognizant_Psyche", "id": "ha6drq9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pah3ej", "stickied": false, "body": "It's a multifaceted issue and problem, I should have clarified that this is only one of the factors contributing to the decrease, and even then only in certain parts of the world that have a well supply of necessary resources in order to survive.  You are correct that we are greedy, and seeing an abundance of recourses being hoarded by or in possession by one or a few will spark jealousy and desire.  But Desire for excess invokes a different level of tenacity (typically) than desperation for survival.  A starving cornered animal will fight more ferociously than one wanting a second helping of food.  That all being said we possess more awareness and cognizance than a basic mammal (usually), but in the end we are still animals and those primitive instincts and behaviors is deeply ingrained within our psyche and lifestyle.  And then with that comes a skewing of what is perceived as essential, especially in people who have grown accustomed to affluent lifestyles.  Its delusional but a lifelong millionaire loosing a bulk of their fortune may see it on the same level as a homeless person not eaten in a week.  They are not the same but... its all about perspective isnt it?\n\nSociety is a fragile stabilizer for co-existence, and one of the foundations is a well fed and cared for populace.  Take that away and it quickly devolves into anarchy and chaos.  Look at what happens after a natural disaster if things like food, water, shelter, and energy (fuel to support the former for instance) are scarce and in limited supplies for extended periods - people become real primal real quick and violence isn't in short supply.  Like after Katrina, people were killing each other over bags of ice... even the threat of shortages and people lose their fucking minds.\n\nJust an observation.", "is_submitter": false, "distinguished": null, "created_utc": 1629821680.0, "parent_id": "t1_ha668tq", "replies": []}]}, {"author": "smbell", "id": "ha6ex1q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #158", "submission": "pah3ej", "stickied": false, "body": "I came here to say this. Nothing is as motivating as starvation of you and those around you.\n\nWhich makes me very concerned about the coming climate crisis and what kind of resource interruptions we might see.", "is_submitter": false, "distinguished": null, "created_utc": 1629822148.0, "parent_id": "t1_ha5fwri", "replies": [{"author": "Cognizant_Psyche", "id": "ha6goy7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pah3ej", "stickied": false, "body": "I dont think it's any surprise that they chose the recent Big Bad of the MCU to try and fix resource scarcity as their goal...", "is_submitter": false, "distinguished": null, "created_utc": 1629822865.0, "parent_id": "t1_ha6ex1q", "replies": []}]}]}, {"author": "SybariteAussie", "id": "ha4oqjb", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pah3ej", "stickied": false, "body": "I like Dan Carlin’s hardcore history on YouTube. I don’t have the courage to listen to Painfotainment. Can imagine how grisly it could be. Genghis khan audiobook gave me nightmares that lasted weeks.", "is_submitter": false, "distinguished": null, "created_utc": 1629784075.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "123456789-1234567890", "id": "ha4rzyx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pah3ej", "stickied": false, "body": "Well, _Logic_ suggests that people realize that they tend to last longer if they (and thus other people) didn't kill eachother, and instead encouraged people to live longer via things like technological advancement.  \nBut people don't follow machine logic, and I don't understand psychology or much in that field.", "is_submitter": false, "distinguished": null, "created_utc": 1629786578.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "KesterGW", "id": "ha4sscl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pah3ej", "stickied": false, "body": "I think about this a lot", "is_submitter": false, "distinguished": null, "created_utc": 1629787205.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "iamgarlic", "id": "ha4xurz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #129", "submission": "pah3ej", "stickied": false, "body": "I think democracy was a big one. Now that politicians have to face consequences for failed wars, they are more reluctant to enter into them. Of course, the opposite argument could also be made that with democracy, politicians are likely to go to war just for the good or and to get the whole nation behind something.", "is_submitter": false, "distinguished": null, "created_utc": 1629791446.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "Transparency2Thee", "id": "ha5vs69", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #32", "submission": "pah3ej", "stickied": false, "body": "It’s all about resources. Scarcity spurs competition and competition, aggression. The reason we don’t fight as much in more developed countries and don’t see as much crime in higher class areas is because resources are more plentiful. The crimes you see most often perpetrated by the rich are greed related which further compounds the argument that resource accumulation is a fundamental component of not only human behavior but arguably, life in general.", "is_submitter": false, "distinguished": null, "created_utc": 1629814049.0, "parent_id": "t3_pah3ej", "replies": [{"author": "tessapotamus", "id": "ha67gp3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #35", "submission": "pah3ej", "stickied": false, "body": "I read that the guy who first shared the idea of 'alphas' was studying wolves in captivity. Published his research, and some people expanded the alpha concept to human dynamics and pop culture.\n\nIt was later discovered that the intra-pack aggression and fierce hierarchy he observed only occurs among wolves in captivity, and he recanted. We now have more examples where animal aggression only increases like this when in captivity or experiencing severe scarcity. Too late for pop culture to drop the concept though, and now it's a self-fulfilling prophecy for some people.\n\nAnyway it looks like you're right, it's all about scarcity.", "is_submitter": false, "distinguished": null, "created_utc": 1629819077.0, "parent_id": "t1_ha5vs69", "replies": [{"author": "Transparency2Thee", "id": "ha6fn00", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #32", "submission": "pah3ej", "stickied": false, "body": "Thanks for the reply! I hadn’t heard about that research. It’s very interesting.", "is_submitter": false, "distinguished": null, "created_utc": 1629822440.0, "parent_id": "t1_ha67gp3", "replies": []}]}]}, {"author": "atlasgaveup", "id": "ha60y9c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "pah3ej", "stickied": false, "body": "I have often wondered if the rise in men's mental health issues has anything to do with the reduction in violence. Evolution helped us develop in very specific ways", "is_submitter": false, "distinguished": null, "created_utc": 1629816312.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "Least_Land", "id": "ha8gwe8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "pah3ej", "stickied": false, "body": "I dunno… I think this sentiment undermines institutional oppression, exploitation, and hidden slavery. No need to kill when you can exploit. I just don’t think it’s as cut and dry as people might want to believe.", "is_submitter": false, "distinguished": null, "created_utc": 1629853012.0, "parent_id": "t3_pah3ej", "replies": [{"author": "haz_mat_", "id": "ha8hqol", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "pah3ej", "stickied": false, "body": "This. Idk if OP is accounting for all the collateral damage caused by various industries - fast food, tobacco, and hydrocarbons being big ones.\n\nPlus, I think theres a strong argument to be made about \"financial violence\" conducted by the likes of wall street and the fed. They might not be out to kill you, but they certainly have figured out a way to effectively steal your opportunity to improve your living conditions - all through market manipulation and inflation.", "is_submitter": false, "distinguished": null, "created_utc": 1629853401.0, "parent_id": "t1_ha8gwe8", "replies": [{"author": "Least_Land", "id": "ha8iej8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "pah3ej", "stickied": false, "body": "I’ve heard this argument before. It’s really championed by people who oppose private citizens owing guns. \n\nI’m at a point of seeing a lot of different sides right now, not quite sure which way is up. \n\nIf we break it down to basics, people are self-interested, feeling safe is required for peace, but also makes you vulnerable to exploitation. \n\nI think I favor a diversity of factions. The fighting is chaotic and exhausting, but it reminds us of the merits and dangers of any one argument winning all.", "is_submitter": false, "distinguished": null, "created_utc": 1629853702.0, "parent_id": "t1_ha8hqol", "replies": [{"author": "haz_mat_", "id": "ha8jt6n", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "pah3ej", "stickied": false, "body": ">I’ve heard this argument before. It’s really championed by people who oppose private citizens owing guns. \n\nNot the case with me, but I see the correlation. The gun industry is a tricky example, given they've already been subject to a lot of public scrutiny, stigma, and regulations. The product is specifically meant to cause harm, and isn't marketed as otherwise.\n\nBut for something like fast food, I think they go way overboard with the manipulation - Carl's Jr being my favorite example: their commercials are so raunchy idk if I'm supposed to eat their product or have sex with it. McDonald's specifically engineers their food to be addictive - and if you eat that crap every day it will kill you. \n\nI guess I kind of look at it like how many European countries have outlawed pharmaceutical advertising. If your product has been engineered like a drug, maybe it should be regulated like one.", "is_submitter": false, "distinguished": null, "created_utc": 1629854349.0, "parent_id": "t1_ha8iej8", "replies": [{"author": "Least_Land", "id": "ha8kiae", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "pah3ej", "stickied": false, "body": "Fast food is especially tricky. I am also fascinated with the industry, as McDonnald’s is a reals estate company… they are in the business of real estate, and junk food is their “drug” of choice. \n\nBut that’s not just the food… the rainforests de estates to provide this industry with beef is pretty nauseating. So you follow the addictive nature of the food, the human life cost, and the rainforest, which underpins the survival of 99.9% of life on earth… \n\nAnd it’s appallingly right under our noses.", "is_submitter": false, "distinguished": null, "created_utc": 1629854671.0, "parent_id": "t1_ha8jt6n", "replies": [{"author": "haz_mat_", "id": "ha8lj43", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "pah3ej", "stickied": false, "body": "The effects of vertical integration is a great point to bring up. Like how our entire economy is underpinned by the continued existence of cheap hydrocarbons - McDonald's would have a hard time sourcing all that beef if transport costs weren't cheap.\n\nSeems like its all one big house of cards. And no one can stop the winds of change.", "is_submitter": false, "distinguished": null, "created_utc": 1629855147.0, "parent_id": "t1_ha8kiae", "replies": [{"author": "Least_Land", "id": "ha8mnek", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "pah3ej", "stickied": false, "body": "Yep.\n\nI’ve taken an interest in carbon capture technology and the impossible self-propelled motor. Haven’t looked at it for a while, but I might be working on it again soon. \n\nI haven’t thought about that thing in ten years…", "is_submitter": false, "distinguished": null, "created_utc": 1629855663.0, "parent_id": "t1_ha8lj43", "replies": [{"author": "haz_mat_", "id": "ha8tvrw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "pah3ej", "stickied": false, "body": "I always thought that tropical rainforest was nature's best carbon capture technology - but it's no longer net-negative, and its actually the coastal redwoods that soak up the most carbon. \n\nPer acre, no other forest type comes close to old growth redwoods - and its all locked up in the trunks of the giant trees that are 500+ years old. The rate at which they absorb carbon increases throughout their life as well, right up until the death of the tree, or some other weather/environment effect that sets it back.\n\nSure, we need something to kick-start mass carbon capture for the short term, but in the long term nature already has an efficient solution. Maybe they can engineer some new type of tree that can grow like the redwoods in more climates.\n\nI hope you get your perpetual motion machine working, we need it.", "is_submitter": false, "distinguished": null, "created_utc": 1629859072.0, "parent_id": "t1_ha8mnek", "replies": []}]}]}]}]}]}]}]}, {"author": "Rebelmind17", "id": "ha8gwf8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #137", "submission": "pah3ej", "stickied": false, "body": "The natural evolution of psychological paradigms could very well cause this effect. As outlined in the spiral dynamics model (recommend looking this up). As worldviews shift, we identify with larger and larger groups perpetually reducing the amount of people we see as other/enemy.", "is_submitter": false, "distinguished": null, "created_utc": 1629853012.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "ThegreatestHK", "id": "ha8qh2z", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #196 | Consortii Concordus", "submission": "pah3ej", "stickied": false, "body": "We we become as violent as we were back then with our modern weaponry... who knows how long humanity would last.", "is_submitter": false, "distinguished": null, "created_utc": 1629857451.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "joanitobnn", "id": "haenbet", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pah3ej", "stickied": false, "body": "I think religion has helped a bit, though it might just be a product of the reduction of violence so idk if it's a main factor in decreasing it.", "is_submitter": false, "distinguished": null, "created_utc": 1629972593.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "ARtEmiS_Oo", "id": "ha4t4nc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "pah3ej", "stickied": false, "body": "It’s a slow and painful process for such a retarded race…Idk how it’s so hard to grasp that if you don’t kill each other you can both benefit. Idk, the whole thing is very stupid to me…", "is_submitter": false, "distinguished": null, "created_utc": 1629787481.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "Golden-Snowflake", "id": "ha54mnl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pah3ej", "stickied": false, "body": "if you murder a murderer, there will be less murder.   \n\n\nNow, explode that to billions of people, and you will drastically lower that amount.   \n\n\neach time two murderer's got into a fight, there was one less murderer.   \n\n\neasy.   \n\n\nThe farther you go, the less likely a murderer will be born, and the more likely folks will become more susceptible, to placate such a person, rather than fight back.", "is_submitter": false, "distinguished": null, "created_utc": 1629797475.0, "parent_id": "t3_pah3ej", "replies": [{"author": "KuriousKhemicals", "id": "ha5z8nq", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pah3ej", "stickied": false, "body": "Don't you think a lot of murderers killed people that wouldn't have done the same back though? I don't see why we should assume that murderers eliminated each other more than they eliminated innocent people.\n\nIt's known that there's an equilibrium level of liars/cheaters in society. If there are too many, then lying/cheating becomes the expected behavior and no longer confers an advantage. But if most people follow rules and agreements, then lying or cheating confers an advantage to the individual doing it, so some number of individuals are apt to do it.\n\nYou would think there is probably a similar equilibrium of murderers. If trying to murder someone comes with basically a 100% chance the other person tries to murder you first, then it's not a very attractive option. It's only a good shot at getting what you want if you can probably win.", "is_submitter": false, "distinguished": null, "created_utc": 1629815570.0, "parent_id": "t1_ha54mnl", "replies": [{"author": "Golden-Snowflake", "id": "ha66zrj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pah3ej", "stickied": false, "body": "You more or less said it better than I did, yes, thank you for explaining it in not only a better way, but more accurately.\n\nYours is more or less my ideal explanation.  \n\n\n(Just remember that one generation, is more or less fixed in its ways, unless there is a major upset.)", "is_submitter": false, "distinguished": null, "created_utc": 1629818883.0, "parent_id": "t1_ha5z8nq", "replies": []}]}]}, {"author": "RumoCrytuf", "id": "ha4prp0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #122", "submission": "pah3ej", "stickied": false, "body": "I would have thought it due to the increased risk of MAD as time goes on, but perhaps it's also true that more people realize as time goes on that there will always be more to gain through cooperation, rather than competition.", "is_submitter": false, "distinguished": null, "created_utc": 1629784851.0, "parent_id": "t3_pah3ej", "replies": [{"author": "Kweldulf", "id": "ha4yhl4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "pah3ej", "stickied": false, "body": "MAD has only been a thing for a hundred years or so, but the trend is much older than that.", "is_submitter": false, "distinguished": null, "created_utc": 1629792005.0, "parent_id": "t1_ha4prp0", "replies": [{"author": "Alatain", "id": "ha6o9pw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pah3ej", "stickied": false, "body": "The formal concept of nuclear-weapon-enforced Mutually Assured Destruction is recent, but the concept of \"if you attack me, I am going to try and kill you too\" is as old as life. That concept has only gotten more certain as our technology makes killing easier. Many of my sword-fighting matches end in a double kill where both people are wounded in a potentially fatal way. That only grows when you add in guns.", "is_submitter": false, "distinguished": null, "created_utc": 1629825888.0, "parent_id": "t1_ha4yhl4", "replies": [{"author": "Kweldulf", "id": "ha6udpt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "pah3ej", "stickied": false, "body": "Yes there is a difference between an attack which is a risk-reward kind of thing, and Mutually Assured Destruction which literally means that if either of us attacks we will both die.", "is_submitter": false, "distinguished": null, "created_utc": 1629828288.0, "parent_id": "t1_ha6o9pw", "replies": [{"author": "Alatain", "id": "ha6vgzr", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pah3ej", "stickied": false, "body": "Mutually Assured Destruction is not a certainty that both sides will die. It is a threat that I likely will be able to destroy you if you try to destroy me. We have always had ways to potentially stop or mitigate a nuclear strike. It has always been a risk-reward analysis in which we want to convince the other side that the risk is greater than the reward.", "is_submitter": false, "distinguished": null, "created_utc": 1629828725.0, "parent_id": "t1_ha6udpt", "replies": [{"author": "Kweldulf", "id": "ha6xqnf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "pah3ej", "stickied": false, "body": "1. Please read the dictionary definition of the word assured, because you seem to misunderstand it.\n\n2. Neither the US nor Russia have a way of stopping all of their respective nuclear arsenal. US has 3800 active warheads. Suppose you are able to stop 99% of them. That still means 38 nuclear explosions. Experts estimate that around 100 hiroshima sized explosions are needed to get us a nice little nuclear winter, for the world. Of course that would make Russia inhabitable for centuries, especially if a nuclear powerplant was hit. Similarily Russia has 4500, so with 99% prevention rate we get 45 hits. And the thing all these warheads are bigger than Hiroshima.\n\nNot to mention that currently the only way of stopping an ICBM is to detonate it before it reaches the target - and a nuclear explosion or say 4500 nuclear explosions in US airspace won't help peeps on the land much - the radiation and shockwave will still come, only the firestorm will be mitigated. \n\nMutuatlly Assured Destruction is not a threat. It is exactly what it says it is. It's a fact. This is why the Bulletin of Atomic Scientists was created, and why they remind us each year that we are getting closer to midnight. Don't ever downplay how stupid nuclear weapons are. They literally assure the destruction of humanity if ever fired.", "is_submitter": false, "distinguished": null, "created_utc": 1629829609.0, "parent_id": "t1_ha6vgzr", "replies": [{"author": "Alatain", "id": "ha7a3jz", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pah3ej", "stickied": false, "body": "I am going to assume from your comment that you have never been involved in administering or maintaining the nuclear triad. If that is wrong, please let me know. \n\nMutually Assured Destruction has *always* been a threat. It is a threat that both sides are trying to prop up to prevent the other side from attacking *which is the entire point*. That is not downplaying the stupidity of that threat, or endorsing it. It is just what the concept is. It has always been an attempt to make the risk-reward calculus go toward choosing to not attack. \n\nAnd that is exactly why I made my original post. Having weapons has always factored into the risk-reward estimation of wheather you should attack someone or not. This is an evolution of that. A bad evolution, but still an extension of that idea.", "is_submitter": false, "distinguished": null, "created_utc": 1629834484.0, "parent_id": "t1_ha6xqnf", "replies": []}]}]}]}]}]}]}, {"author": "DeMonstratio", "id": "ha4ue9y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #70", "submission": "pah3ej", "stickied": false, "body": "Way to go us!", "is_submitter": false, "distinguished": null, "created_utc": 1629788518.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "painusmcanus", "id": "ha4vwr7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #241", "submission": "pah3ej", "stickied": false, "body": "The advantages of being part of society.", "is_submitter": false, "distinguished": null, "created_utc": 1629789779.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "dogs_like_me", "id": "ha4xpkl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "pah3ej", "stickied": false, "body": "Trade.", "is_submitter": false, "distinguished": null, "created_utc": 1629791324.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "developedby", "id": "ha5xonv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #71 | Consortii Concordus", "submission": "pah3ej", "stickied": false, "body": "Yes, but don't naively think that this trend will extend to future history", "is_submitter": false, "distinguished": null, "created_utc": 1629814889.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "yes_its_him", "id": "ha64iqq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #186", "submission": "pah3ej", "stickied": false, "body": "I've always wondered about the narrative that natives were living in harmony in the New World until European colonists came along and fucked things up.\n\nDatapoints like the one you cite suggest that there were battles over something, whether land, resources, etc., well before any exploration opened things up to more arrivals across the Atlantic.\n\nCan't really be too upset if you lose something the same way you acquired it: by conquest.", "is_submitter": false, "distinguished": null, "created_utc": 1629817837.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "DDumpTruckK", "id": "ha6j93a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "pah3ej", "stickied": false, "body": "Fallout was wrong.  They say war never changes.  It changes.\n\nIt's probably a good thing that conventional war is going away.  I won't miss it.  However, what its replaced with isn't necessarily better either.  Sure less people might be dying as a result of wars, but that doesn't mean war is going away.  How many people did Obama or Trump kill with drone strikes?  How many were civilians?\n\nWar is just different now, and in that way, it's a little more insidious.  In WW2 everyone gave up their access to fancy treats and cars and everyone had gardens in their yard to support the effort.  In the 2000s, George Brush Jr went into a country with the military and no one at home even noticed.  Is this an improvement?  Is it better that we can now wage war without our citizen population having to change their way of life?\n\nLess death is better, but if war becomes less visible then it falls under less scrutiny and criticism.  The horrors get hidden behind a veneer and people stop caring because they don't see it.  I think it would be pre-emptive to say war is going away.  It's just changing.  We don't know what it will look like in 100 years.", "is_submitter": false, "distinguished": null, "created_utc": 1629823895.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "TheLittlestHibou", "id": "haba8hb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "pah3ej", "stickied": false, "body": "The end of natural scarcity.\n\nA post-scarcity economy.\n\nArtificial scarcity isn't worth killing people over. People don't want to fight to prop up a system that perpetuates *artificial* poverty and *unnecessary* suffering. It doesn't make logical sense to send people off to die in wars if we have the ability to create an abundance of everything we need to survive. Then what are we fighting for, exactly?\n\nFor warlords to play war games with each other for their own entertainment, using poor people as fodder? Rich people pitting the strongest and most powerful men in our communities against each other in fight-to-the-death Gladiator games, with a modern twist...?\n\nThat's what it feels like, when I see homeless people setting up camps around major cities, all over North America now. Like a certain subset of society is trying to prevent us from building affordable housing and growing nutritious, locally sourced food and a good education and health care system. Why are there so many homeless people when we have the technology to build abundant shelter? It doesn't make sense, and it can't last much longer like this. We're going to need to build housing eventually, delaying the inevitable is stupid. Regressive.\n\nTraditionalists are fighting back hard against technological innovation but they're losing fast and they know it. The future is coming whether or not they like it.\n\nFor the first time in human history we have the technological (scientific) ability to create an abundance of food, shelter, medicine, clean water, energy, education and recreational activities. There is no logical reason for anyone on this planet to be living and suffering from abject poverty anymore.\n\nWe have entered the age of technological abundance. We don't need to kill to survive anymore.\n\n&#x200B;\n\n>Artificial scarcity is scarcity of items despite the technology for production or the sufficient capacity for sharing.\n\n[https://en.wikipedia.org/wiki/Artificial\\_scarcity](https://en.wikipedia.org/wiki/Artificial_scarcity)\n\n[https://en.wikipedia.org/wiki/Abundance:\\_The\\_Future\\_Is\\_Better\\_Than\\_You\\_Think](https://en.wikipedia.org/wiki/Abundance:_The_Future_Is_Better_Than_You_Think)\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nedit:\n\nKarl Marx, in a section of his Grundrisse that came to be known as the \"Fragment on Machines\", argued that the transition to a post-capitalist society combined with advances in automation would allow for significant reductions in labor needed to produce necessary goods, eventually reaching a point where all people would have significant amounts of leisure time to pursue science, the arts, and creative activities; a state some commentators later labeled as \"post-scarcity\". Marx argued that capitalism—the dynamic of economic growth based on capital accumulation—depends on exploiting the surplus labor of workers, but a post-capitalist society would allow for:\n\n>\"The free development of individualities, and hence not the reduction of necessary labour time so as to posit surplus labour, but rather the general reduction of the necessary labour of society to a minimum, which then corresponds to the artistic, scientific etc. development of the individuals in the time set free, and with the means created, for all of them.\"\n\nMarx's concept of a post-capitalist communist society involves the free distribution of goods made possible by the abundance provided by automation. The fully developed communist economic system is postulated to develop from a preceding socialist system. Marx held the view that socialism—a system based on social ownership of the means of production—would enable progress toward the development of fully developed communism by further advancing productive technology. Under socialism, with its increasing levels of automation, an increasing proportion of goods would be distributed freely.\n\nMarx did not believe in the elimination of most physical labor through technological advancements alone in a capitalist society, because he believed capitalism contained within it certain tendencies which countered increasing automation and prevented it from developing beyond a limited point, so that manual industrial labor could not be eliminated until the overthrow of capitalism. Some commentators on Marx have argued that at the time he wrote the Grundrisse, he thought that the collapse of capitalism due to advancing automation was inevitable despite these counter-tendencies, but that by the time of his major work Capital: Critique of Political Economy he had abandoned this view, and came to believe that capitalism could continually renew itself unless overthrown.\n\n[https://en.wikipedia.org/wiki/Post-scarcity\\_economy](https://en.wikipedia.org/wiki/Post-scarcity_economy)", "is_submitter": false, "distinguished": null, "created_utc": 1629910561.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "hydrospanner", "id": "habhw50", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #46", "submission": "pah3ej", "stickied": false, "body": "Communication, transportation, and technology.\n\nMore open, faster communication enables the exchange of ideas, greater possibility for cooperation over confrontation, and a greater chance for breaking down the \"us / them\" way of thinking, making way for the possibility of a \"we\" way of thinking. On a more direct level, communication can help avoid and suppress wars, whether through the channels of diplomacy or threat of war (think an alliance of countries forcing a rogue nation to back down).\n\nSecond, transportation. Not only does transportation facilitate and indeed necessitate communication, but it allows us to move resources from where they're located to where they're needed, and fosters a greater sense of community over a larger area. You're less likely to want to go raid the village downriver when you bring them hides and in exchange they give you fish. Later on in our history, transportation opens up the world to you in ways that were never before possible. When you're able to visit and do business with others, see how they live, and barter for resources to get what you need in exchange for what you have in excess, you are more likely to want to deal peacefully with your neighbors...also, greater transportation means your people are no longer so limited in their advancement by the amount of land they claim. As long as what you produce is in demand, you can translate your strengths into prosperity without having to directly control the land where other resources come from. Of course this doesn't account for scarcity...both natural and intentional...and in this case, transportation advancements can be applied in a military context, to bring your implements of force to your enemy's doorstep...knowing the horrors of battle can no longer be so easily contained to far away fields makes one rethink their appetite for war. \n\nLastly, technology. In many ways, technology directly advances the first two items, but other applications dampen violence in their own ways. Technology can be applied to industry, to allow one man with a machine to produce what ten unaided men might manage. This allows fewer people to produce, process, and deliver more resources, and more resources means more security. When you don't have to worry about where tonight's dinner might come from, you're less willing to risk your own health to steal that dinner. When your nation can produce and process more than it needs, it can export its excess, turning resources into economic power and making trade allies of otherwise aloof neighbors. And of course on the other hand, having an edge in destructive technology makes you less of an speaking target to those same neighbors...and if you're exploiting the less fortunate, advanced technology can overwhelm any of their dissent, and likely even force them into submission without a fight.", "is_submitter": false, "distinguished": null, "created_utc": 1629913628.0, "parent_id": "t3_pah3ej", "replies": []}, {"author": "AlternativeMint", "id": "ha4s20j", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "pah3ej", "stickied": false, "body": "That theory only applies in 1st and 2nd world countries because culture and education. But it is only a fachade that will last as long as social rules apply.\n\nHuman nature didn't change a bit, there are plenty of people using extreme violence against other humans in 3rd world.\n\nViolence is an answer, set the proper conditions and you will soon see the world in flames.", "is_submitter": false, "distinguished": null, "created_utc": 1629786622.0, "parent_id": "t3_pah3ej", "replies": [{"author": "Alatain", "id": "ha6ogza", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pah3ej", "stickied": false, "body": "Doesn't change that the total amount of violence and war has dropped across the entire world.", "is_submitter": false, "distinguished": null, "created_utc": 1629825966.0, "parent_id": "t1_ha4s20j", "replies": [{"author": "AlternativeMint", "id": "ha6ovnw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "pah3ej", "stickied": false, "body": "That's right.", "is_submitter": false, "distinguished": null, "created_utc": 1629826128.0, "parent_id": "t1_ha6ogza", "replies": []}]}]}]}