{"title": "What do you think of this quote?", "name": "t3_p4k9y9", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p4k9y9/what_do_you_think_of_this_quote/", "selftext": "\"If something's not going to matter in five years, don't think about it for more than five minutes.\"\n\nWhile obviously hyperbolic, I think the overall message does make a lot of sense: don't stress about that which will probably have no major effects.", "score": 8, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/p4k9y9/what_do_you_think_of_this_quote/", "id": "p4k9y9", "author": "agaminon22", "link_flair_text": "Discussion", "num_comments": 11, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628990614.0, "comments": [{"author": "Walking_the_Cascades", "id": "h8zbggg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #68", "submission": "p4k9y9", "stickied": false, "body": "I suppose I would need some examples from the author as to what constitutes \"not going to matter in five years\". \n\nIf I'm at an expensive restaurant that I'll never visit again, perhaps I don't need to spend 30 minutes laboring over what I'm going to order.\n\nIf I can't decide which shirt to wear around the house today, and I've spent more than five minutes looking at my options, perhaps I'm better off going back to bed and getting more sleep.\n\nOther things, like \"Should I strike up a conversation with the nice lady walking her dog?\" might or might not matter in five years. There's no way of knowing.", "is_submitter": false, "distinguished": null, "created_utc": 1628991447.0, "parent_id": "t3_p4k9y9", "replies": [{"author": "Muroid", "id": "h8zdzh1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p4k9y9", "stickied": false, "body": "Should you spend more than five minutes thinking about whether to strike up a conversation with a stranger in public?\n\nThat *might* matter in five years, but I think that could safely be put in the “won’t matter in five years” bucket, because it probably won’t.", "is_submitter": false, "distinguished": null, "created_utc": 1628992730.0, "parent_id": "t1_h8zbggg", "replies": []}]}, {"author": "Cognizant_Psyche", "id": "h8zfq58", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "p4k9y9", "stickied": false, "body": "I get the general idea of what is trying to be conveyed but I have some issues with it, especially with how it is worded. Matter to who? In what context?  Why must something have longevity in order to have worth? While I agree that we shouldn’t fret or stress over things we have zero control or influence over, everything matters to the one it matters to, regardless of when it will happen.  I’m of the opinion that things like worth, value, purpose, and meaning are purely subjective, lacking any inherent objective anchorage in reality (Existential Nihilist here).  So dismissing the value of something lacking everlasting or world shaking effects and impact only serves to put undue stress and unrealistic expectations on the individual, essentially implying that unless you make a difference you’re shit.  It leads to an unfulfilled life filled with regret IMO.  Just do what you want (accepting the consequences of the actions of course), life is short enough as it is, and suppressing yourself does nothing but damage and wastes what little time we have. Just two cents from a former apostate who wasted decades always looking toward the forever promised, instead of what was right in front of them passing by - countless opportunities and experiences wasted and lost.", "is_submitter": false, "distinguished": null, "created_utc": 1628993631.0, "parent_id": "t3_p4k9y9", "replies": []}, {"author": "Rude_Ladder_9474", "id": "h90dwmk", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #266", "submission": "p4k9y9", "stickied": false, "body": "It's good rule of thumb for us overthinking folk", "is_submitter": false, "distinguished": null, "created_utc": 1629016490.0, "parent_id": "t3_p4k9y9", "replies": []}, {"author": "solarshado", "id": "h8zftlr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #459", "submission": "p4k9y9", "stickied": false, "body": "The rough idea's alright, but IMO it's not really useful advice. It can be hard to know if something's going to matter in five years.\n\nI'm sure this's partially due to my own tendency towards anxiety, but a lot of the decisions that I end up agonizing over are things that I don't know exactly what the consequences of will be or how long they'll last.", "is_submitter": false, "distinguished": null, "created_utc": 1628993680.0, "parent_id": "t3_p4k9y9", "replies": []}, {"author": "IamTJcon", "id": "h8zxu2p", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #10 | Ordo Cognitus", "submission": "p4k9y9", "stickied": false, "body": "Nice.  Saved.  Thank you", "is_submitter": false, "distinguished": null, "created_utc": 1629004021.0, "parent_id": "t3_p4k9y9", "replies": []}, {"author": "MisanthropicScott", "id": "h9061dr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4k9y9", "stickied": false, "body": "> What do you think of this quote?\n\n> \"If something's not going to matter in five years, don't think about it for more than five minutes.\"\n\nI guess for some things it makes some sense. But, there are things that matter in the short term that can be incredibly important. Imagine the case of when to take a patient off life support or when or whether to euthanize a beloved pet.\n\nIn either case, in five years the patient will be dead. But, it matters a lot to the patient and probably to your own psyche going forward.\n\nI'll throw the question back to you.\n\nWhat would you think of your quote in such cases? Would that be something that would still matter in five years or not?", "is_submitter": false, "distinguished": null, "created_utc": 1629009975.0, "parent_id": "t3_p4k9y9", "replies": []}, {"author": "unicornprincess420", "id": "h90oo98", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #41", "submission": "p4k9y9", "stickied": false, "body": "A similar but a more striking quote would be something along the lines of 'if something can be fixed, you do not need to worry about it; if it cannot be fixed, worrying about it is of no use' (thought by the Dalai Lama).", "is_submitter": false, "distinguished": null, "created_utc": 1629025872.0, "parent_id": "t3_p4k9y9", "replies": []}, {"author": "Niskanen204", "id": "h90wzw2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "p4k9y9", "stickied": false, "body": "You have to take it loosely as intended.", "is_submitter": false, "distinguished": null, "created_utc": 1629031616.0, "parent_id": "t3_p4k9y9", "replies": []}, {"author": "VenomOUShazard", "id": "h91igxi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4k9y9", "stickied": false, "body": "agree, not much reason to overthink on things that wont matter. still one cant be sure if a things would matter or not in the long run", "is_submitter": false, "distinguished": null, "created_utc": 1629042110.0, "parent_id": "t3_p4k9y9", "replies": []}, {"author": "YashinNashi", "id": "h91xa2u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #226", "submission": "p4k9y9", "stickied": false, "body": "If I die tomorrow, it probably won't matter in 5 years.  I still spend more than 5 minutes to think when doing something that might kill me   Also, maybe something you do will have an effect in 30 years but not in 5.  Opening a retirement savings or removing asbestos without abatement or a respirator.  Those won't matter in 5 years.", "is_submitter": false, "distinguished": null, "created_utc": 1629048256.0, "parent_id": "t3_p4k9y9", "replies": []}]}