{"title": "Anyone that Holds to Biblical Literalism Want to Talk Morality?", "name": "t3_pcz1vq", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pcz1vq/anyone_that_holds_to_biblical_literalism_want_to/", "selftext": "I am looking for an honest discussion on morality in the bible from a biblical literalist standpoint. Any takers? Either here or in PM.", "score": 1, "upvote_ratio": 0.57, "permalink": "/r/TheFlyingTree/comments/pcz1vq/anyone_that_holds_to_biblical_literalism_want_to/", "id": "pcz1vq", "author": "Alatain", "link_flair_text": "Discussion", "num_comments": 56, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630108262.0, "comments": [{"author": "SuddenProfile", "id": "hamgl2x", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "pcz1vq", "stickied": false, "body": "I would, but PTSD. My parents were literalists and it lead to mortification rituals that genuinely became life threatening.\n\nI was able to determine though, that a literalist lifestyle is impossible except for the wealthy.", "is_submitter": false, "distinguished": null, "created_utc": 1630109217.0, "parent_id": "t3_pcz1vq", "replies": [{"author": "Alatain", "id": "hamh7w3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "Not exactly what I was going for, but I hope you get over your trauma! If there is anything you would like to talk about, feel free to reach out.", "is_submitter": true, "distinguished": null, "created_utc": 1630109532.0, "parent_id": "t1_hamgl2x", "replies": []}, {"author": "MisanthropicScott", "id": "han9lda", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "> I would, but PTSD.\n\nVery sorry to hear that and all the best dealing with it. Is it from another cause or specifically due to religious upbringing?\n\nAre you aware that the latter is now being called [Religious Trauma Syndrome](https://www.salon.com/2014/11/01/the_sad_twisted_truth_about_conservative_christianitys_effect_on_the_mind_partner/)?", "is_submitter": false, "distinguished": null, "created_utc": 1630124551.0, "parent_id": "t1_hamgl2x", "replies": [{"author": "SuddenProfile", "id": "han9q99", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "pcz1vq", "stickied": false, "body": "No, I wasn't. I'll have to read that! Thank you!\n\nAnd, yes, it's from self-harm rituals and some doctrine...", "is_submitter": false, "distinguished": null, "created_utc": 1630124638.0, "parent_id": "t1_han9lda", "replies": [{"author": "MisanthropicScott", "id": "hana9ax", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "I'm terribly sorry to hear that you went through that. I'm always impressed by anyone who manages to break free of a truly deep indoctrination into any religion.\n\nI was raised only weakly Jewish myself. I started to doubt at age 8 precisely because I learned that my parents weren't truly following the religion. Specifically, the rabbi on the first day of Hebrew school explained that Shabbat (the sabbath) is a high holiday just like the three on which we actually went to temple. I asked my father why we didn't go every week and he just said, \"we're not that religious.\" In my mind, we either believe or we don't.\n\nSo, I often wonder if my parents had been orthodox and followed the rules if I never would have had my early doubts and might still be stuck in religion. I'll never know if I could have broken free as you did.\n\nSo, you have my respect and admiration as well as my sympathy for your situation. I hope you can find a treatment that works for you and eases your pain.\n\nAll the best.", "is_submitter": false, "distinguished": null, "created_utc": 1630124984.0, "parent_id": "t1_han9q99", "replies": [{"author": "SuddenProfile", "id": "hanag46", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "pcz1vq", "stickied": false, "body": "Thank you!\n\nAutism precludes just about every form of treatment (enough that I've had two doctors give up), but they say it's also how I survived the experience....", "is_submitter": false, "distinguished": null, "created_utc": 1630125108.0, "parent_id": "t1_hana9ax", "replies": [{"author": "MisanthropicScott", "id": "hanbb3q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "I don't have any professional experience. But, if you'd like to talk about anything, I'd be glad to listen. No pressure.\n\nAs a retired computer programmer, I have two friends with Asperger's (which I know is no longer on the DSM, but is still a good shorthand for that part of their conditions). So, I'm a little familiar with some level autism.\n\nI would suggest continuing to try to find a doctor who will work with you. Even if you have to meet with multiple doctors to find the right one for you, remember that you only need one. Good luck.\n\nFeel free to continue this conversation or not depending on your own comfort level. I'll understand either way. I know communication can be difficult at times. I also don't mind PM if you want.\n\nAgain though, I'm not a professional in any way, just hoping to help if I can.", "is_submitter": false, "distinguished": null, "created_utc": 1630125672.0, "parent_id": "t1_hanag46", "replies": []}]}]}]}]}]}, {"author": "Kelyaan", "id": "hamhgel", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pcz1vq", "stickied": false, "body": "Why not go to r/DebateAChristian ... Seeing as most people here are probably Atheist and more than likely don't want to get into that topic with a random Atheist looking to argue.  \n\n\nIt is never a good sign when someone goes looking for it.", "is_submitter": false, "distinguished": null, "created_utc": 1630109649.0, "parent_id": "t3_pcz1vq", "replies": [{"author": "Alatain", "id": "hamhyux", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "I am looking for an honest discussion and not a debate with someone that has a starting position of assumed antagonism. \n\nThis sub is supposed to be a curated experience of reddit and the place that people can discuss things outside of the context of other subs. We have a fair amount of philosophically-inclined members on here, so I thought it might be worth seeing if anyone was interested. \n\nIf not downvote and move along.", "is_submitter": true, "distinguished": null, "created_utc": 1630109898.0, "parent_id": "t1_hamhgel", "replies": []}]}, {"author": "MisanthropicScott", "id": "hamx3er", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "Do you require that the literalist actually be a believer?\n\nI take a fairly literal reading of the Bible based on best translation(s) available. But, I'm also a gnostic atheist and use that interpretation to argue against the god of the Bible.\n\nDo I qualify? Are there particular verses you'd like to discuss?", "is_submitter": false, "distinguished": null, "created_utc": 1630117478.0, "parent_id": "t3_pcz1vq", "replies": [{"author": "Alatain", "id": "hany32w", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "Given that I am looking for a person who draws their morality from a literalist view of the Bible, I am afraid the conversation would not be particularly helpful. But I am sure you would be off use of anyone actually decides to enter the conversation as a believer.", "is_submitter": true, "distinguished": null, "created_utc": 1630144087.0, "parent_id": "t1_hamx3er", "replies": [{"author": "MisanthropicScott", "id": "haokrrs", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "I'm sure people exist who think they get their morals that way. I've debated some on r/DebateReligion. If I ever meet anyone who truly does, I will run as fast as my old legs can carry me.\n\nIt's also sometimes interesting/scary to discuss morality with ultraorthodox Jews. They don't take a literalist view of the Hebrew Bible because of the Talmud. But, they have a very fixed view indeed. Modern orthodox may be less cast in stone and a bit more progressive. Though, I have actually debated fewer modern orthodox than ultraorthodox Jews. I was raised weakly Jewish myself, so sometimes find it interesting and frustrating to learn of the more deeply religious beliefs that I luckily escaped through the happier accident of my birth in a less religious family.", "is_submitter": false, "distinguished": null, "created_utc": 1630158900.0, "parent_id": "t1_hany32w", "replies": [{"author": "Alatain", "id": "haomrum", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "My interest in this discussion started with an acquaintance of mine answering that he is ok with the idea of a father selling his daughter into slavery since it is sanctioned in the Bible. Basically the extreme view that God is the absolute source of morality, so anything sanctioned by God, to include slavery and genocide, is inherently moral. \n\nI am kind of looking for other literalist views on the topic. It makes internally consistent sense, but leads to what I would consider some pretty horrific morals.", "is_submitter": true, "distinguished": null, "created_utc": 1630159848.0, "parent_id": "t1_haokrrs", "replies": [{"author": "MisanthropicScott", "id": "haoto1x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "Numbers 31 makes some pretty grim reading for anyone who takes the morals of the Bible literally. You might ask your friend their opinion on Moses's actions and commands in that. Note that in addition to the slaughter of prisoners of war, that passage includes the capture of 32,000 virgin sex slaves, which does include underage girls. They are counted as the booty/spoils of war and a tax is paid. I'm not sure what happened to the 32 women/girls that were paid as a tax.", "is_submitter": false, "distinguished": null, "created_utc": 1630162963.0, "parent_id": "t1_haomrum", "replies": []}]}]}]}]}, {"author": "An_Dr01d", "id": "hamhs15", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #66", "submission": "pcz1vq", "stickied": false, "body": "Seeing as how the algorithm that recruits people to this sub often recruits from r/atheism, probably not the best sub to ask this question, but I'm interested in seeing how a Biblical Literalist would respond.", "is_submitter": false, "distinguished": null, "created_utc": 1630109806.0, "parent_id": "t3_pcz1vq", "replies": [{"author": "cocobisoil", "id": "hamtmz9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #87", "submission": "pcz1vq", "stickied": false, "body": "Literally.", "is_submitter": false, "distinguished": null, "created_utc": 1630115695.0, "parent_id": "t1_hamhs15", "replies": []}]}, {"author": "gaoshan", "id": "hamz6zy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #84", "submission": "pcz1vq", "stickied": false, "body": "Doubt you'll find any biblical literalists here.", "is_submitter": false, "distinguished": null, "created_utc": 1630118580.0, "parent_id": "t3_pcz1vq", "replies": []}, {"author": "dashingThroughSnow12", "id": "han0avq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "I would be a Biblical Literalist but I don't like that term. As in I fit the definition to a tea but the word \"literalism\" is a poor choice. 🤷‍♂️ The don't particularly have a better term.", "is_submitter": false, "distinguished": null, "created_utc": 1630119162.0, "parent_id": "t3_pcz1vq", "replies": [{"author": "MisanthropicScott", "id": "hanhoyb", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "I'm not the OP. But, I'm curious.\n\nAre you a believer?\n\nDo you not like the word literalism because of the issues of translation?\n\nDo you have a preferred translation?\n\nI'm a gnostic atheist but also take a fairly literal reading of the Bible. Though, I allow for the 7 days to not be literal. I also confess to not having read the entire book. I've only read the Pentateuch in its entirety. Anything else I've read has been stuff that has come up in debates over the years.\n\nI find it annoying when people try to reinterpret verses so radically that they have virtually no relation to the actual words.\n\nI also tend to find it annoying when people who can't refute a point fall back to criticizing my choice of translation. There are so few verses where I've seen a significantly different meaning from differing translations. It's nearly always different words that mean substantially the same thing.", "is_submitter": false, "distinguished": null, "created_utc": 1630130142.0, "parent_id": "t1_han0avq", "replies": [{"author": "Alatain", "id": "hanyspo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "Translation issues in my view are mainly proof that the Bible is not inerrant. Having read the Hebrew, there are a good few things that are not important, but which are wrong in the KJV and others. One that stands out would be the mentions of unicorns in the Bible. The passages make far more sense when you realize that they just mistranslated the word for \"oryx\" which is a type of wild ox that lived in the area. \n\nIs that ultimately important to the discussion? Well, only if one side is arguing that it is a holy book with no errors.", "is_submitter": true, "distinguished": null, "created_utc": 1630144718.0, "parent_id": "t1_hanhoyb", "replies": [{"author": "MisanthropicScott", "id": "haonyfc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "Oops. I mixed a reply to this in with my other reply. So, I tagged you in that. The unicorn thing is interesting. I hadn't heard that it was a mistranslation before.", "is_submitter": false, "distinguished": null, "created_utc": 1630160388.0, "parent_id": "t1_hanyspo", "replies": []}]}, {"author": "dashingThroughSnow12", "id": "hao7ztz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "> Do you not like the word literalism because of the issues of translation?\n\nIf is because the word literalism is contradicted almost immediately. Here is some definitions\n\n> Biblical literalism refers to the interpretation of Scripture as literal, with the exception of sections of text that are clearly intended to be allegorical, poetic, or figurative.\n\n- https://www.compellingtruth.org/biblical-literalism.html\n\n> a hermeneutic technique that strives to uncover the meaning of the text by taking into account not just the grammatical words, but also the syntactical aspects, the cultural and historical background, and the literary genre. It emphasizes the referential aspect of the words in the text without denying the relevance of literary aspects, genre, or figures of speech within the text (e.g., parable, allegory, simile, or metaphor).\n\n- Wikipedia\n\nAs evident from these two definitions, or any that you find, Biblical Literalism does not mean every word is taken as literal. It's understood a person in the Bible may use a figure of speech, may make a joke, or may tell a story to illustrate a point (ex. Nathan with David in 2nd Samuel 12).\n\nThe trouble with the word is when a lay person hears the term Literalism, they think someone who holds that viewpoint must be taking every word literally with no context on even the surrounding text.\n\n> Do you have a preferred translation?\n\nESV but not the only one I like.\n\nAny of the big name translations are good. They all have dedicated, well-educated and trained professionals that do their best to create faithful and accurate translations.\n\nThere are around 800K words in an English Bible translation and 23K verses. In any of the big name translations, there are zero to two verses typically where the translation makes a difference to the interpretation.\n\nYou say you \"find it annoying when people who can't refute a point fall back to criticizing my choice of translation.\" I do find that annoying too if you use one of the many good translations of the Bible. Bible translators are talented and to attack your choice of Bible to quote attacks those translators.\n\n(There are some bad translations and perversions. The Jehovah's Witnesses' NWT or Brian Simmons's Passion Translation are examples.)", "is_submitter": false, "distinguished": null, "created_utc": 1630151703.0, "parent_id": "t1_hanhoyb", "replies": [{"author": "MisanthropicScott", "id": "haon7ei", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "Extremely well thought out and explained answer. Thank you for that. I had not heard the bit about the unicorn/oryx. I'm well aware of what oryx are and have seen at least 2 species of them in the wild. They're very graceful and beautiful. But, to confuse them with unicorns would be hard as the horns are long and very clearly a pair. \n\nA rhinocerous would make more sense to be called a unicorn. And, given that it is, if I remember correctly, used in at least one strength comparison, that would also make sense.\n\n(Oops. I just noticed that my fallible human brain mixed your reply and /u/Alatain 's reply together in my brain. This first bit is more related to that reply. Sorry to both of you for that.)\n\nThe one case I found where a translation did materially remove on of my objections to a verse in the Bible is that when I first Fisked Genesis 1 (ignoring the literal seven days, but comparing the ordering of events and the nature of the cosmos to actual scientific understanding), the NIV had translated a verse to livestock rather than to something like cattle. The difference is significant because domesticated livestock cannot predate humans. The NRSV was better for that.\n\nBut, the guy I was debating at that time ranted on that I hadn't used KJV.\n\nI actually went to /r/AskAChristian and politely asked for a good Bible translation that would not get that sort of reaction. I got some very polite and respectful answers over there. I was impressed. Even the one who pointed out that I was an atheist asking Christians for the best translation to use in debates against Christians (true) was still polite about it.\n\nI think they got that I wanted a well respected translation that would allow focusing on the issues rather than getting sidetracked by translations. It was quite a nice bunch over there. That's where I heard about the NRSV. ESV was also mentioned as being a very good one.\n\nIn truth though, when I really care about translation of the Hebrew Bible, I go to the Chabad Lubavitcher site. I'm not even sure what translation they use. But, I think that people who speak Hebrew and have studied Torah and Talmud in the original Hebrew throughout history, even when the language was otherwise dead, probably have a pretty good idea of the meaning. The other reason is because, in online debates, I recently learned that the Christian Old Testament is subtly and slightly, but not insignificantly modified from the Hebrew Bible/Tanakh. So, if exact meaning is significant, especially about messianic prophesies, I prefer to go to a religious Jewish site.\n\nHebrew is actually an odd language. Having been mostly dead other than for religious study for many centuries, the language that was revived as the national language of Israel in 1948 is virtually unchanged from Biblical times. They just had to add a ton of words for the great many concepts in the modern world that did not exist more than 2 millennia ago. I'm sure the language has begun evolving again now that it is actually being used in day to day communication.\n\nI never actually learned to speak Hebrew. The conservative temple my parents were members of really only cared if I learned to read well enough to pray. They didn't actually care if I understood what I was saying. Or, perhaps they would have preferred that. But, it wasn't required. So, I had my bar mitzvah can still follow along in temple with the prayers I already mostly know, but can't really read or understand very much. It's more recognition than true reading, which becomes apparent with any prayer that isn't also a song I recognize and mostly remember.", "is_submitter": false, "distinguished": null, "created_utc": 1630160046.0, "parent_id": "t1_hao7ztz", "replies": [{"author": "Alatain", "id": "hap8abe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "I will reply here to keep your comments from being too disjointed. The Hebrew word that was translated into \"unicorn\" is \"רְאֵם\" or \"re'em\". It seems the problem comes from the KJV using a Greek translation to assist with translating the Hebrew and the original Greek translators likely did not know exactly what the older Hebrew text was talking about, so they took creative licence. Most Jewish scholars go with the oryx or the now extinct aurochs. The Hebrew really does not say anything about the number of horns though. \n\nOnly other thing I will say is regarding your statement that the modern Hebrew was mostly unchanged since biblical times. That is not exactly correct. I speak modern Israeli Hebrew and there are quite a few grammatical changes between Biblical and Modern Hebrew. The verb structure, for one has changed a fair amount and can lead to a fair amount of confusion for a modern speaker. It is nowhere near as bad a going from modern English to Old English, but it does take some adjusting to.", "is_submitter": true, "distinguished": null, "created_utc": 1630169401.0, "parent_id": "t1_haon7ei", "replies": [{"author": "MisanthropicScott", "id": "hapb34q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "> The verb structure, for one has changed a fair amount and can lead to a fair amount of confusion for a modern speaker.\n\nInteresting. Was that true of Hebrew in 1948? Or, is this something that evolved since then?", "is_submitter": false, "distinguished": null, "created_utc": 1630170616.0, "parent_id": "t1_hap8abe", "replies": [{"author": "Alatain", "id": "hapeu4z", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "This is not my particular academic area, so please do not take this as from a biblical scholar, but a quick look at Mishnaic Hebrew shows that by the end of that era the verb forms seem to have settled into their mostly modern form (by 400 CE at the latest). \n\nThose changes and some of complexities of Biblical grammar are still being discussed today by scholars, so it is still an active area of discussion. One of my favorite areas that is still a bit contentious involves the very first word of Genesis. In all technicality, the voweling on the very first letter of the word would make it read \"In *a* beginning, God created the heavens and the Earth\"... Now, there are plenty of scholars that argue for an rarely used word form that would make it \"In the beginning\", but I do not believe that the matter is truly settled.", "is_submitter": true, "distinguished": null, "created_utc": 1630172139.0, "parent_id": "t1_hapb34q", "replies": [{"author": "MisanthropicScott", "id": "hapl3ew", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "Wow! I didn't realize Hebrew was still spoken as a common language as recently as 400CE. I somehow always assumed that after the destruction of the temple, we dispersed and stopped speaking Hebrew as a primary language. Thanks for the details.", "is_submitter": false, "distinguished": null, "created_utc": 1630174769.0, "parent_id": "t1_hapeu4z", "replies": [{"author": "Alatain", "id": "happ3j7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "Mishnaic was a spoken language that resulted in quite a bit of religious commentaries and documents. After about 400 CE, it slowly dropped out of favor, but still evolved on into Medieval Hebrew as an academic language. This (and other regional dialects still used for religious purposes) is what Modern Hebrew ended up being based on after the revival.", "is_submitter": true, "distinguished": null, "created_utc": 1630176482.0, "parent_id": "t1_hapl3ew", "replies": []}]}]}]}]}, {"author": "dashingThroughSnow12", "id": "haqzwgv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "> The one case I found where a translation did materially remove on of my objections to a verse in the Bible is that when I first Fisked Genesis 1 (ignoring the literal seven days, but comparing the ordering of events and the nature of the cosmos to actual scientific understanding), the NIV had translated a verse to livestock rather than to something like cattle. The difference is significant because domesticated livestock cannot predate humans. The NRSV was better for that.\n\nI am twenty-nine. If I say \"Forty years ago, my mother had a cousin who became a quadriplegic\", you would not object to my statement. The proper statement would be \"Forty years ago, the girl who later became my mom had a cousin who became a quadriplegic.\"\n\nKJV uses cattle in Genesis. KJV was made in 1611. At the time, \"cattle\" did mean domesticated animals with four legs. The word \"livestock\" was added to the English language in 1687. So it was unavailable for use. The word they are translating is \"behemah\", which normally they translate as \"beasts\" or \"animals\"; however, the next part of the sentence in Genesis has the word \"chaiyat\" which also gets translated as \"beast\" usually. If I had to guess, when you crack open an imaginary 1611 Thesaurus, \"livestock\" is the most sensible word to put in the sentence.\n\nIt think it is fair to use the word \"cattle\" if they are meaning to describe species who later would be cattle. Similar to have I can use the word \"mother\" to describe a person who later will be my mother.\n\n> But, the guy I was debating at that time ranted on that I hadn't used KJV.\n\n> I actually went to r/AskAChristian and politely asked for a good Bible translation that would not get that sort of reaction. I got some very polite and respectful answers over there. I was impressed. Even the one who pointed out that I was an atheist asking Christians for the best translation to use in debates against Christians (true) was still polite about it.\n\nBack in the early 90s, Gail Riplinger wrote _New Age Bible Versions_. She wasn't the only one but she was a key figure in something called the [KJV Only Controversy](https://www.amazon.ca/King-James-Only-Controversy-Translations/dp/0764206052/ref=sr_1_1?dchild=1&keywords=The+King+James+Only+Controversy&qid=1630195375&s=books&sr=1-1). The book I link to is pretty good at describing the movement and as a primer on modern biblical translation/reliability of the text. I digress.  There is a not insignificant amount of people who get aggressive over the translation used. Those people are wrong and I apologize.\n\n> In truth though, when I really care about translation of the Hebrew Bible, I go to the Chabad Lubavitcher site. I'm not even sure what translation they use. But, I think that people who speak Hebrew and have studied Torah and Talmud in the original Hebrew throughout history, even when the language was otherwise dead, probably have a pretty good idea of the meaning. The other reason is because, in online debates, I recently learned that the Christian Old Testament is subtly and slightly, but not insignificantly modified from the Hebrew Bible/Tanakh. So, if exact meaning is significant, especially about messianic prophesies, I prefer to go to a religious Jewish site.\n\nJews and Christians have a disagreement on this topic. Oversimplifying, you can divide Judaism into 2nd temple Judaism, before 2nd temple Judaism, and after 2nd temple Judaism. Since your read the Pentateuch, you'll notice a lot of it is centred around the Jewish state (laws to guide time) and the sacrificial system. The state was dissolved and the 2nd temple was destroyed in 69AD, within a generation of Christ being crucified (hence why I can oversimplify to three phases and not say four.) After the temple was destroyed and the state dissolved, the Jews had to do some things and reinterpret some things because they no longer had a state or sacrifices to comply.\n\nHere is where the disagreement starts.\n\nModern Jews allege that some passages about the Jewish state, Christians interpret as about the Messiah.\n\nChristians allege that in light of Christianity rising, some passages of the Old Testament that were considered messianic by Jews now no longer are. An example of this is that Christians allege that Isaiah 53 was seen as a messianic prophecy before the rise of Christianity but since the recontextualization, Jews now read it as about the Jewish state to come.\n\nChristians do agree that we recontextualize some old testament passages as allusions to Christ. [Jesus did this](https://www.biblegateway.com/passage/?search=Luke+24%3A26-27&version=ESV) and various authors of the New Testament do this; therefore, Christians do. Christians though allege that modern Jews do not hold the same views as 2nd Temple and earlier Jews.\n\n> Hebrew is actually an odd language. Having been mostly dead other than for religious study for many centuries, the language that was revived as the national language of Israel in 1948 is virtually unchanged from Biblical times. They just had to add a ton of words for the great many concepts in the modern world that did not exist more than 2 millennia ago. I'm sure the language has begun evolving again now that it is actually being used in day to day communication.\n\n> I never actually learned to speak Hebrew. The conservative temple my parents were members of really only cared if I learned to read well enough to pray. They didn't actually care if I understood what I was saying. Or, perhaps they would have preferred that. But, it wasn't required. So, I had my bar mitzvah can still follow along in temple with the prayers I already mostly know, but can't really read or understand very much. It's more recognition than true reading, which becomes apparent with any prayer that isn't also a song I recognize and mostly remember.\n\nThat is neat. I do have a lot of little small comments. But I've already written to much. Still have a few life e-mails to send off and my wife is waiting for me on the couch in the next room.", "is_submitter": false, "distinguished": null, "created_utc": 1630198657.0, "parent_id": "t1_haon7ei", "replies": [{"author": "MisanthropicScott", "id": "has372z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": ">> The one case I found where a translation did materially remove on of my objections to a verse in the Bible is that when I first Fisked Genesis 1 (ignoring the literal seven days, but comparing the ordering of events and the nature of the cosmos to actual scientific understanding), the NIV had translated a verse to livestock rather than to something like cattle. The difference is significant because domesticated livestock cannot predate humans. The NRSV was better for that.\n\n> I am twenty-nine. If I say \"Forty years ago, my mother had a cousin who became a quadriplegic\", you would not object to my statement. The proper statement would be \"Forty years ago, the girl who later became my mom had a cousin who became a quadriplegic.\"\n\nI would say that the difference is that your mother is the same person, though with more life experience, after birthing you. Domesticated animals are not genetically the same as their wild predecessors.\n\n> It think it is fair to use the word \"cattle\" if they are meaning to describe species who later would be cattle.\n\nI believe that the wild ancestors of cattle were actually cattle. While it may be more technically correct to say [aurochs](https://en.wikipedia.org/wiki/Aurochs) or bovids, I think if the wikipedia page can and does say that aurochs were wild cattle, I have no grounds to object to saying that cattle predate humans.\n\nIt was only the term livestock that I objected to. Livestock specifically refers to animals on a farm.\n\nSo, when I switched to Fisking Genesis 1 using the NRSV, I removed my objection to the verse about creating cattle before people.\n\n> Similar to have I can use the word \"mother\" to describe a person who later will be my mother.\n\nI guess the distinction I would object to is not to your referring to her as your mother before she is a mother. But, if you specifically said she was a mother before she had birthed any children I would object to that.\n\nRegardless, since I no longer think that the Bible states that livestock predates humans, I removed that particular objection to Genesis 1. I still very strongly believe that Genesis 1, even without the literal 7 days, is massively wrong about both the order of creation and the nature of the universe that was created.\n\nI further believe this is evidence that the Bible was not written by the creator of the universe nor even with such influence. The creator of the universe would have knowledge of the universe that would be more accurate than this, even if it had to be dumbed down for dictation to early iron age shepherds.\n\nIf you're curious, [here is a link to my more recent Fisking of Genesis 1](https://www.reddit.com/r/DebateReligion/comments/if54du/genesis_creation_error/g2lfecz/).\n\n> There is a not insignificant amount of people who get aggressive over the translation used. Those people are wrong and I apologize.\n\nThe good folks on AskAChristian also noted this and also largely agreed that this was wrong to do. They didn't mention the book you referenced. But, most agreed with your take on getting aggressive about the translation.\n\n>> In truth though, when I really care about translation of the Hebrew Bible, I go to the Chabad Lubavitcher site. ... So, if exact meaning is significant, especially about messianic prophesies, I prefer to go to a religious Jewish site.\n\n> Jews and Christians have a disagreement on this topic. Oversimplifying, you can divide Judaism into 2nd temple Judaism, before 2nd temple Judaism, and after 2nd temple Judaism. Since your read the Pentateuch, you'll notice a lot of it is centred around the Jewish state (laws to guide time) and the sacrificial system. The state was dissolved and the 2nd temple was destroyed in 69AD, within a generation of Christ being crucified (hence why I can oversimplify to three phases and not say four.) After the temple was destroyed and the state dissolved, the Jews had to do some things and reinterpret some things because they no longer had a state or sacrifices to comply.\n\nDo you believe they changed the Hebrew text of the Hebrew Bible in response to the loss of the state?\n\nMy limited understanding is that the Dead Sea Scrolls showed that the Torah from that time (ca 200 BCE) is virtually identical to a Torah today.\n\nIs your understanding different?\n\n> Here is where the disagreement starts.\n\n> Modern Jews allege that some passages about the Jewish state, Christians interpret as about the Messiah.\n\nI guess my first questions would be about what I view as probably the two most important messianic prophesies of which I\"m aware. I hear them every time I attend my family's Passover Seders. So, I know them from the Hagaddah rather than from the Tanakh.\n\n1. The messiah will bring world peace. I think this is the most important prophesy of the messiah in the Jewish religion today as I understand it. Do you believe this either is not the case now or was ever not the case?\n\n2. The messiah is always referred to as \"immoshiach ben David\". The messiah is prophesied to be of direct paternal descent from King David. Jesus as the son of God would not meet this requirement. Though, I have heard Christians argue that since Joseph accepted him as his son, if Joseph were descended from David then Jesus could be said to be so as well. But, Christians do seem to place an amazing amount of importance on Jesus as son of God. So, this seems odd to me.\n\n> Christians allege that in light of Christianity rising, some passages of the Old Testament that were considered messianic by Jews now no longer are. An example of this is that Christians allege that Isaiah 53 was seen as a messianic prophecy before the rise of Christianity but since the recontextualization, Jews now read it as about the Jewish state to come.\n\nThis religious Jewish site lists a number of reasons why Jesus could not be the messiah.\n\nhttps://www.aish.com/jw/s/48892792.html\n\nThey do also mention Isaiah 53 and, as you state, that 11 times prior to chapter 53, Isaiah refers to the state of Israel as the suffering servant.\n\nFor me though, the bigger thing is the world peace, regardless of Isaiah 53.\n\n> Christians do agree that we recontextualize some old testament passages as allusions to Christ. Jesus did this and various authors of the New Testament do this; therefore, Christians do. Christians though allege that modern Jews do not hold the same views as 2nd Temple and earlier Jews.\n\nDo you believe there was ever a time when Jews believed that the messiah would not bring world peace?\n\nI keep coming back to this because it is so central to what I always hear about the messiah. It's the whole \"nation shall not lift up sword against nation; neither shall they learn war any more.\"\n\nAnd, two of my biggest problems with Jesus as the messiah are 1) there is nothing I'm aware of in the Jewish religion that says that the messiah will need two lives to accomplish his job and 2) Jesus did not even want to bring peace and said so in no uncertain terms. ([Matt 10:34-36](https://www.biblegateway.com/passage/?search=matt+10%3A34-36&version=ESV))\n\nHe even explicitly used the word sword, going against [Isaiah 2:4](https://www.biblegateway.com/passage/?search=isaiah+2%3A4&version=ESV) very deliberately and explicitly. Far from telling people to beat their swords into plowshares, [he actively tells people to buy a sword, even if they have to sell their cloak to do it](https://www.biblegateway.com/passage/?search=luke+22%3A36&version=ESV), as if war-faring is more important to Jesus than staying warm.\n\nAnd, of course, 2K years after Jesus, we still don't have world peace. I'm not sure what kind of a messiah Jesus might have been. But, I just don't see how anyone can say that he was the Jewish messiah. World peace, if nothing else, is just so central to the Jewish idea of the messiah.\n\n> That is neat. I do have a lot of little small comments. But I've already written to much. Still have a few life e-mails to send off and my wife is waiting for me on the couch in the next room.\n\nDefinitely keep your priorities straight. Replying to me should not be number one on your list.", "is_submitter": false, "distinguished": null, "created_utc": 1630223410.0, "parent_id": "t1_haqzwgv", "replies": [{"author": "dashingThroughSnow12", "id": "hb0usna", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "> I believe that the wild ancestors of cattle were actually cattle. While it may be more technically correct to say aurochs or bovids, I think if the wikipedia page can and does say that aurochs were wild cattle, I have no grounds to object to saying that cattle predate humans.\n\n> It was only the term livestock that I objected to. Livestock specifically refers to animals on a farm.\n\nAurochs entered English in 1755. Bovid 1889. Livestock 1689. KJV 1611.\n\nAgain, I'd be surprised if the early English translations of the Bible like Bishop's or King James had a generic word for the predecessors of cattle. Let alone a word the layperson would understand.\n\nI'm not sure why I keep responding to this cattle-talk🤣We both agree cattle is the wrong word. My only point being that there may not have been a good word.\n\n> I further believe this is evidence that the Bible was not written by the creator of the universe nor even with such influence. The creator of the universe would have knowledge of the universe that would be more accurate than this, even if it had to be dumbed down for dictation to early iron age shepherds.\n\n> Do you believe they changed the Hebrew text of the Hebrew Bible in response to the loss of the state?\n\nNo, only the interpretation or how the interpretation would affect translation.\n\nFrom a modern scholarly prospective, if any party, Jews or Christians or secular scholars, saw another party weighing one manuscript or newer manuscripts disproportionately, the other two parties would keep them honest. I don't think they are operating under different textual basis afaik.\n\n> My limited understanding is that the Dead Sea Scrolls showed that the Torah from that time (ca 200 BCE) is virtually identical to a Torah today.\n\n> Is your understanding different?\n\nThat is my understanding. That the Red Sea scrolls generally showed the tenacity of the text. That over a long period of time, say 200BC to 1000 AD, few textual variants of note snuck in.\n\n> I guess my first questions would be about what I view as probably the two most important messianic prophesies of which I\"m aware.....\n\nTo (1), eschatology is the normal Christian answer to this. There are _five_ major schools of thought. Four or all five would answer that the reign of peace happens at the second coming of Christ. (I'm not sure how amillenialists answer it.)\n\nTo (2), the normal Christians answer is Jesus was the son of Mary who was of the Davidic line and by being the husband of Mary, Joseph would have adopted Jesus and Joseph is of the Davidic line. Christians read Jeremiah 22:30 as cursing Jeconiah to never have a descendant on the throne. By Joseph being the adoptive father of Jesus but not the biological father of Jesus, Christians assert Jesus avoids the curse of Jeconiah, which otherwise is unavoidable for the Messiah.\n\n> Do you believe there was ever a time when Jews believed that the messiah would not bring world peace?\n\nBefore Jesus, no.\n\n> I keep coming back to this because it is so central to what I always hear about the messiah. It's the whole \"nation shall not lift up sword against nation; neither shall they learn war any more.\"\n\nIt's neat you quote that part. I always hear and quote the middle. \"they shall beat their swords into plowshares, and their spears into pruning hooks\".\n\nAs mentioned, Christians usually interpret this about the second coming of Christ.\n\n> He even explicitly used the word sword, going against Isaiah 2:4 very deliberately and explicitly. Far from telling people to beat their swords into plowshares, he actively tells people to buy a sword, even if they have to sell their cloak to do it, as if war-faring is more important to Jesus than staying warm.\n\nThe next verse explains his reasoning.\n\n> For I tell you that this Scripture must be fulfilled in me: ‘And he was numbered with the transgressors.’ For what is written about me has its fulfillment.” And they said, “Look, Lord, here are two swords.” And he said to them, “It is enough.”\n\nAt least from Jesus's prospective, he was fulfilling an  Isaiah prophecy.\n\nGiven the later event, the swords aren't meant for Jesus to go to war with. In verse 49 the disciples ask if now is the time to use them, verse 50 Peter literally swings into action, and verse 51 Jesus rebukes him.\n\n> And, of course, 2K years after Jesus, we still don't have world peace. I'm not sure what kind of a messiah Jesus might have been. But, I just don't see how anyone can say that he was the Jewish messiah. World peace, if nothing else, is just so central to the Jewish idea of the messiah.\n\nChristians have that same concept and it is very strong. In the dark nights or when global news show how crazy the world is, I do remind myself one day that swords will be beaten into plowshares and spears into pruning hooks.\n\n> Definitely keep your priorities straight. Replying to me should not be number one on your list.\n\nThanks mate. My ex (from 2011) is taking me to custody court again. We've been in and out of court for the past 10 years. Stressed about that.\n\nBetween being stressed about court, trying to be a good dad, and trying to be a good husband, I've needed this pleasant conversation without pressure to reply quickly.\n\nThanks.", "is_submitter": false, "distinguished": null, "created_utc": 1630387183.0, "parent_id": "t1_has372z", "replies": [{"author": "MisanthropicScott", "id": "hb1fcbk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "> I'm not sure why I keep responding to this cattle-talk🤣We both agree cattle is the wrong word. My only point being that there may not have been a good word.\n\nThat's fine. But, can we please get back to the entire rest of Genesis 1?\n\n>> Do you believe they changed the Hebrew text of the Hebrew Bible in response to the loss of the state?\n\n> No, only the interpretation or how the interpretation would affect translation.\n\n>> My limited understanding is that the Dead Sea Scrolls showed that the Torah from that time (ca 200 BCE) is virtually identical to a Torah today.\n\n> That is my understanding. That the Red Sea scrolls generally showed the tenacity of the text. That over a long period of time, say 200BC to 1000 AD, few textual variants of note snuck in.\n\nOK. So, [Genesis 1 says what it says and is in the order that it is in.](https://www.reddit.com/r/DebateReligion/comments/if54du/genesis_creation_error/g2lfecz/) -- Link is to my own commentary on the text of Genesis 1.\n\nCan we agree that the order of creation is demonstrably and provably wrong? \n\nCan we further agree that space is not water and that there is not a vault in the sky separating that water from earth?\n\nIf God actually knew what he created, why would he describe the universe in this way? Is this not evidence that Genesis 1 could not have been in any way written with influence from God?\n\n>> I guess my first questions would be about what I view as probably the two most important messianic prophesies of which I\"m aware.....\n\n> To (1), eschatology is the normal Christian answer to this. There are five major schools of thought. Four or all five would answer that the reign of peace happens at the second coming of Christ. (I'm not sure how amillenialists answer it.)\n\nWould you agree that the prophesies of the Hebrew Bible/Tanakh make absolutely no mention of the messiah needing to come back to finish the job?\n\n> To (2), the normal Christians answer is Jesus was the son of Mary who was of the Davidic line and by being the husband of Mary, Joseph would have adopted Jesus and Joseph is of the Davidic line. Christians read Jeremiah 22:30 as cursing Jeconiah to never have a descendant on the throne. By Joseph being the adoptive father of Jesus but not the biological father of Jesus, Christians assert Jesus avoids the curse of Jeconiah, which otherwise is unavoidable for the Messiah.\n\nSo, first I would argue that the Jewish tradition is clear that this descent from David *must* be through the father. Mary's heritage would be irrelevant.\n\nSecond, you've argued both that Jesus could not be king through Joseph and could be king through Joseph. I find these two statements contradictory and see no way to resolve them. Either Jesus is the son of Joseph by adoption and gets the curse of Jeconiah or Jesus avoids the curse by not being the son of Joseph.\n\nEither way, Jesus is not considered to be a viable king of Israel by paternal descent and thus cannot be the messiah (immoshiach ben David).\n\n>> Do you believe there was ever a time when Jews believed that the messiah would not bring world peace?\n\n> Before Jesus, no.\n\nSo, then Jesus was not the prophesied messiah. He did not bring peace. Any attempts to shoe horn him into a position as messiah require rewriting the prophesies after the fact.\n\nOnce the prophesies are rewritten to make Jesus fit, they are no longer [prophesies](https://www.dictionary.com/browse/prophesy). A prophesy must come before the event in order to be a prophesy.\n\n>> I keep coming back to this because it is so central to what I always hear about the messiah. It's the whole \"nation shall not lift up sword against nation; neither shall they learn war any more.\"\n\n> It's neat you quote that part. I always hear and quote the middle. \"they shall beat their swords into plowshares, and their spears into pruning hooks\".\n\nI was trying to keep it short and to the most relevant bit.\n\n> As mentioned, Christians usually interpret this about the second coming of Christ.\n\nI'm aware of that. Though, my limited understanding of Revelation does not sound all that peaceful.\n\nThe more important point is that if this is to be a prophesy, it would mean that the Jews also believed that prior to Jesus.\n\nAs they did not, I find this hard to accept as a prophesy. It is also one that has certainly not come true yet.\n\nIn fact, the result of Jesus having been here once has been more war, death, and killing, especially of God's chosen people.\n\n>> Far from telling people to beat their swords into plowshares, he actively tells people to buy a sword, even if they have to sell their cloak to do it, as if war-faring is more important to Jesus than staying warm.\n\n> The next verse explains his reasoning.\n\n>> For I tell you that this Scripture must be fulfilled in me: ‘And he was numbered with the transgressors.’ For what is written about me has its fulfillment.” And they said, “Look, Lord, here are two swords.” And he said to them, “It is enough.”\n\n> At least from Jesus's prospective, he was fulfilling an Isaiah prophecy.\n\nWhich Isaiah prophesy though? Certainly not Isaiah 2:4.\n\n> Given the later event, the swords aren't meant for Jesus to go to war with. In verse 49 the disciples ask if now is the time to use them, verse 50 Peter literally swings into action, and verse 51 Jesus rebukes him.\n\nYes. But, clearly there was need of swords. This one incedent just wasn't that need. So, I fail to see how this erases Jesus's mandate to have a sword.\n\n>> And, of course, 2K years after Jesus, we still don't have world peace. I'm not sure what kind of a messiah Jesus might have been. But, I just don't see how anyone can say that he was the Jewish messiah. World peace, if nothing else, is just so central to the Jewish idea of the messiah.\n\n> Christians have that same concept and it is very strong. In the dark nights or when global news show how crazy the world is, I do remind myself one day that swords will be beaten into plowshares and spears into pruning hooks.\n\nThen, maybe you should return to Judaism. Since I'm an atheist, I can go against the teachings of Judaism (the religion of my upbringing) here. Were I a Good Jew^(tm), it would be my job to talk you out of being Jewish.\n\nBut, the truth is that if your hope is for swords to be beaten into plowshares and spears into pruning hooks and nuclear weapons into nuclear power plants, the scripture of Judaism is better for that.\n\nJesus said in no uncertain terms that he was not here to bring peace.\n\nIn one of many horrifying passages regarding Jesus (not that there aren't horrifying passages in the Tanakh) Jesus explains his purpose in life.\n\n> [Matt 10:34-36](https://www.biblegateway.com/passage/?search=matt+10%3A34-36&version=ESV): 34 “Do not think that I have come to bring peace to the earth. I have not come to bring peace, but a sword. 35 For I have come to set a man against his father, and a daughter against her mother, and a daughter-in-law against her mother-in-law. 36 And a person's enemies will be those of his own household.\n\nYou've claimed to be a bible literalist. But, there is no way that a literalist interpretation of the above passage can be anything other than horrifying.\n\nEven the interpretations I've heard, where Jesus is merely demands that we love him above all of our family, this passage is pretty grim.\n\nAt the very best of interpretations, Jesus is saying love me and only me. All else is secondary to loving me. He's pretty narcissistic at best.\n\nBut, a literal interpretation makes him a war-monger and actively puts him in opposition to the love of one's own family.\n\n>> Definitely keep your priorities straight. Replying to me should not be number one on your list.\n\n> Thanks mate. My ex (from 2011) is taking me to custody court again. We've been in and out of court for the past 10 years. Stressed about that.\n\nOof. Sorry to hear this has been such a long and drawn out process. It sounds quite painful. I wish you all the best.\n\n> Between being stressed about court, trying to be a good dad, and trying to be a good husband, I've needed this pleasant conversation without pressure to reply quickly.\n\nI'm glad you're finding this pleasant and hope you still are at the end of this.\n\n> Thanks.\n\nThanks to you as well. I'm enjoying the debate. I just hope I haven't crossed any lines in your mind. I am never sure how far I can go.\n\nMany people are unable to separate themselves from their beliefs. I am opposed to the beliefs of the Abrahamic religion but am not opposed to the human beings who hold those beliefs.\n\nIt is my belief that we are a xenophobic and violent species by nature. Ideologies that divide us can cause us to become more so. Sometimes these ideologies are religions. Sometimes they are things like capital C Communism and state atheism. I oppose all such ideologies. I am likely as strongly opposed to state atheism as you are.\n\nBut, when I look at the Abrahamic religion, I mostly see a history of wars and slavery and genocides. And, I do see scriptural justification for these in all sects of the Abrahamic religion (deliberately singular for me).\n\nAnyway, all the best. I hope for a good and fair outcome from your court case and most especially, whatever is best for your children.\n\nGood luck!", "is_submitter": false, "distinguished": null, "created_utc": 1630404309.0, "parent_id": "t1_hb0usna", "replies": []}]}]}]}]}]}]}, {"author": "Alatain", "id": "hanybfe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "Not sure what exactly you mean here, but would be willing to discuss. Do you believe in the Christian God? Is the Bible the unerring word of God in a book form?", "is_submitter": true, "distinguished": null, "created_utc": 1630144288.0, "parent_id": "t1_han0avq", "replies": [{"author": "dashingThroughSnow12", "id": "hao5rsi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "Yes. As said, I am a Biblical Literalist.", "is_submitter": false, "distinguished": null, "created_utc": 1630150182.0, "parent_id": "t1_hanybfe", "replies": [{"author": "Alatain", "id": "hao7w31", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "Do you feel that there is an objective, unchanging moral code and that code is represented in the Bible?", "is_submitter": true, "distinguished": null, "created_utc": 1630151632.0, "parent_id": "t1_hao5rsi", "replies": [{"author": "dashingThroughSnow12", "id": "hao8im9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "Yes.", "is_submitter": false, "distinguished": null, "created_utc": 1630152047.0, "parent_id": "t1_hao7w31", "replies": [{"author": "Alatain", "id": "hao985e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "Are there any concepts that you find to be important morally that are missing from the Bible (perhaps freedom of speech, or some other moral ideal), or conversely, are there any practices condoned in the Bible that you feel are immoral?", "is_submitter": true, "distinguished": null, "created_utc": 1630152499.0, "parent_id": "t1_hao8im9", "replies": [{"author": "dashingThroughSnow12", "id": "haobsyk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "> Are there any concepts that you find to be important morally that are missing from the Bible (perhaps freedom of speech, or some other moral ideal),\n\nThe typical Christian answer is either \"yes\" or \"they can be derived from the Bible\".\n\nTo be honest, I can't answer \"yes\" or \"no\" because I've not thought about this topic. If I say \"yes\", I'd be lying because I'd struggle to find one. If I say \"no\", you could mention some concept I didn't think of.\n\n> are there any practices condoned in the Bible that you feel are immoral?\n\nYes. I'd like to emphasize that there is a difference between condoned _in_ the Bible and condoned _by_ the Bible. For example, Moses in the Bible allows divorce. [Later in the Bible](https://www.biblegateway.com/passage/?search=matthew%2019&version=NIV), Jesus explains to the Pharisees \"Moses permitted you to divorce your wives because your hearts were hard.\" Oversimplifying, Moses knew men would do bad things so he outlined divorce laws to curb that evil and provide some protections for women.\n\nOne thing that made me a Christian is that the Bible deals with reality, how things are on the ground, instead of rambling about utopia. There are some things _in_ the Bible that the Bible recognizes is abhorrent that nonetheless it grapples with or regulates because it acknowledges that in a broken world, some broken things happen.\n\nSo I'd say, yes there are \"practices condoned in the Bible that you feel are immoral\" but no to there are practices condoned by the Bible that I feel are immoral.", "is_submitter": false, "distinguished": null, "created_utc": 1630154045.0, "parent_id": "t1_hao985e", "replies": [{"author": "Alatain", "id": "haodiu9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "The rules for the practice for slavery are given directly to Moses from God in the same exchanges that give us the ten commandments though. How do you differentiate honoring you mother and father and being able to sell your daughter into slavery given that they are both spoken unto Moses at Mt. Sinai? \n\nIs there a way for you to tell what is condoned \"in\" the Bible as opposed to \"by\" the Bible?", "is_submitter": true, "distinguished": null, "created_utc": 1630155044.0, "parent_id": "t1_haobsyk", "replies": [{"author": "dashingThroughSnow12", "id": "haqzw62", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "MisanthropicScott helped clarify what my 9AM brain meant. By \"condoned in\" I meant \"condoned/tolerated\". By \"condoned by\" I mean \"advocated or defended\". My morning mind was foggy.\n\nTo answer your question, if the Bible subverts the thing, it is something that it does not advocate for.\n\nThe section of the Bible you refer to, Exodus 20, starts off with \"I am the Lord your God, who brought you out of the land of Egypt, out of the house of slavery.\" When one reads the previous chapters of Exodus, the time in Egypt is not looked on fondly. There is no positive connotation for calling it a house of slavery.\n\nThe first substantial thing it says in Exodus 20+ about slavery is in Exodus 21, \"When you buy a Hebrew slave, he shall serve six years, and in the seventh he shall go out free, for nothing.\" Skimming Exodus 21, there are about seven references to how a slave can be freed. About five of them being from abuse or neglect.\n\nThe commandment \"Honour your father and mother\" has a comma at the end. After the comma is \"that your days may be long in the land that the Lord your God is giving you.\" Honouring your father and mother is acknowledged as a good thing with good effects. It doesn't start by associating it with a place you only associate bad things to. It doesn't substantially start with a declaration of when you no longer have to do it. Elsewhere in the Bible, [it is the norm that slavery is undermined](https://www.desiringgod.org/articles/how-paul-worked-to-overcome-slavery).\n\nTo beat the dead horse, we're all told to \"honour your father and mother\". We're not all told to sell ourselves into slavery; 1st Corinthians 7:21 says \"Were you a slave when you were called? Do not let it concern you— but if you can gain your freedom, take the opportunity.\" Slavery is not looked at positively in the Bible.", "is_submitter": false, "distinguished": null, "created_utc": 1630198653.0, "parent_id": "t1_haodiu9", "replies": [{"author": "Alatain", "id": "hasq8ne", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "The analysis of the story that you linked is Paul's attempt to free a single slave *who he converted to Christianity*. None of those arguments would work for a non-Christian slave. In fact, it completely ignore's Paul's other statements that slaves are to be loyal and obedient to their masters.\n\nThat in the entire book there is no mention of God (or Jesus) being against slavery shows that it does not hold it to be immoral. There are more explicit rebukes of working on the Sabbath (death penalty), or being a disobedient child (death penalty), than there are for beating your slave and knocking out an eye (no punishment to the slaver; slave goes free). \n\nYou really have to bend over backwards to get anything close to a rebuke of slavery from what is considered a \"perfect\" book. If it were truly an affront to God, a single line added saying \"don't own people\". Could have taken the wind out of so many arguments that people have used to prop up slavery over the years. \n\nJust checking, but are you against owning people in all circumstances, or are there situations that owning a person is moral to you?", "is_submitter": true, "distinguished": null, "created_utc": 1630241706.0, "parent_id": "t1_haqzw62", "replies": []}]}]}, {"author": "MisanthropicScott", "id": "haoqr2u", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "> So I'd say, yes there are \"practices condoned in the Bible that you feel are immoral\" but no to there are practices condoned by the Bible that I feel are immoral.\n\nI'm not really seeing the distinction here. Though, I do see a distinction between condoning and advocating for.\n\n> There are some things in the Bible that the Bible recognizes is abhorrent that nonetheless it grapples with or regulates because it acknowledges that in a broken world, some broken things happen.\n\nThis is where I get very confused. The Hebrew Bible, especially the story of the Exodus, is generally thought to have been written around 500 BCE. The events it portrays are alleged to have happened around 1300 BCE.\n\nIf we ignore for a moment the very real problems that this time difference creates (specifically that there is no reason to think that the Exodus actually happened and lots of reasons to think it didn't) and just focus on the obvious issue of slavery that /u/Alatain raises either of those dates give centuries in which the problem of slavery could have been fixed by an all-powerful god.\n\nAnd yet, slavery continues to be condoned within the New Testament. In fact, there is even an assertion that [all Christians are slaves/bondservants to Jesus.](https://www.biblegateway.com/passage/?search=colossians+4%3A1&version=ESV)\n\nWhy in 5 or 13 centuries could God not do better, making slavery illegal under God's law?\n\nAlso, regarding freedom of speech, an issue raised by /u/Alatain , I would ask if it bothers you that free speech is not merely omitted from the Bible but is actually forbidden in the Bible. Speech is strongly restricted in the Bible right in the Ten Commandments regarding taking the name of the lord in vain. In the New Testament, [blasphemy against the Holy Spirit becomes the worst possible sin](https://www.biblegateway.com/passage/?search=mark+3%3A28-29&version=ESV), the only sin that can never be forgiven. It's worse than murder, rape, or breaking any of the ten commandments. It's worse than any of the seven deadly sins.\n\nWhat is your opinion on this?", "is_submitter": false, "distinguished": null, "created_utc": 1630161666.0, "parent_id": "t1_haobsyk", "replies": [{"author": "dashingThroughSnow12", "id": "haqzwp5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pcz1vq", "stickied": false, "body": "> I'm not really seeing the distinction here. Though, I do see a distinction between condoning and advocating for.\n\nI misspoke. When I say \"condoned in\" I mean \"condoned\". When I say \"condoned by\" I mean \"advocated or defends\". Maybe I should be weary what I write at 9:30 AM on a Saturday morning before staining my deck.\n\n> This is where I get very confused. The Hebrew Bible, especially the story of the Exodus, is generally thought to have been written around 500 BCE. The events it portrays are alleged to have happened around 1300 BCE.\n\n> If we ignore for a moment the very real problems that this time difference creates (specifically that there is no reason to think that the Exodus actually happened and lots of reasons to think it didn't) and just focus on the obvious issue of slavery that /u/Alatain raises either of those dates give centuries in which the problem of slavery could have been fixed by an all-powerful god.\n\nThis is a part of the topic of theodicy. I do take a Calvinist position on the topic of theodicy. If that means anything to you, you know where I am coming from. If it doesn't, there are books written on this topic 😅 but I can try to condense it.\n\n> And yet, slavery continues to be condoned within the New Testament. In fact, there is even an assertion that all Christians are slaves/bondservants to Jesus.\n\nI think the Bible uses that terminology because it was familiar with the audience.\n\nIt is often Paul making these metaphors. There are a quantity of Paul's writings that Christians use to say that Paul is trying to subvert slavery. [If a Christian has a Christian slave, they are to have them as a beloved brother](https://www.desiringgod.org/articles/how-paul-worked-to-overcome-slavery). With the slave/bondservants to Jesus metaphors, it puts us all on level field. It reminds us that before we were slaves to sin and being slaves, could not escape our lot until Christ purchased us.\n\n> Why in 5 or 13 centuries could God not do better, making slavery illegal under God's law?\n\n[Man stealing, which did characterize all of American slavery, was illegal under God's law.](https://www.biblegateway.com/passage/?search=Exodus%2021%3A16&version=ESV) That aside, I feel like writing.\n\nIn our modern age, slavery is unneeded. If someone is in debt, they can declare bankruptcy. If they are hungry, there are food banks and soup kitchens. If someone has no way to cover their other needs, they can access welfare.\n\nWe're able to do this because we have a surplus and modern technology. The government is able to efficiently tax the citizenry with modern technology. Many people have 10-30% of their incomes go to superfluous categories (large disposable incomes). We can calculate interest.\n\nWe never worry about a crop failure. Never worry about a drought. Never worry about hail. The worse a fire or hurricane will do is destroy our insured homes.\n\nMy response for why slavery wasn't made illegal in say the 1st century AD is because the alternative to slavery was not \"not slavery\", it was \"a bunch of people dying\". A person didn't sell themselves into slavery because they thought it was a great idea and that it was moral; they sold themselves into slavery because the alternative was starving to death because the crops failed or being thrown into a debtors' prison to work off the debt.\n\nAs our economies evolved and technology, slavery went from a horrible necessity to just horrible.\n\n> Also, regarding freedom of speech, an issue raised by /u/Alatain , I would ask if it bothers you that free speech is not merely omitted from the Bible but is actually forbidden in the Bible. Speech is strongly restricted in the Bible right in the Ten Commandments regarding taking the name of the lord in vain. In the New Testament, blasphemy against the Holy Spirit becomes the worst possible sin, the only sin that can never be forgiven. It's worse than murder, rape, or breaking any of the ten commandments. It's worse than any of the seven deadly sins.\n\n> What is your opinion on this?\n\nThe Holy Spirit and 3C aren't related to freedom of speech. Especially the former is functional. The Holy Spirit is the one who sanctifies, sanctification means \"the action of causing something to be or seem morally right or acceptable.\" This is why blaspheming the Holy Spirit lands in the unforgivable category. Blaspheming/rejecting the Holy Spirit (calling it the power of demons or Beelzebul in Matthew 12:22-24 and Mark 3:22), rejects the route one is sanctified.\n\nI love bad analogies. Imagine a gorge with a bridge. A person can be slow, fat, clumsy, whatever, but still use the bridge to cross the gorge. If they say they won't take the bridge because it is dangerous, they aren't crossing the gorge. Freedom of speech isn't relevant here; it is an observation that if you reject the bridge you aren't crossing. 3C for a similar reason doesn't tie into freedom of speech but I feel like writing too many words.\n\n\"Freedom of speech\" is a nebulous concept. America is the only country I know of that has an unrestrained, non-scoped concept of \"freedom of speech\".\n\nBoth Canada and the USA originate their concepts of freedom of speech from the _Bill of Rights 1689_, article nine. Here, freedom of speech was for parliament to debate bills without worry of the crown or courts attacking them for it. Over simplifying, the point of freedom of speech in the _Bill of Rights 1689_ is to allow the parliament to correct things the crown or courts are doing. Add one hundred years to that, and the Americans expand the immunity to include individuals. \n\nIf I may armchair professor this, that freedom of speech to criticize the state eventually morphed into a freedom of speech to say anything. A freedom to criticize society. A freedom to protest at or outside a speaker's event. Etcetera.\n\nThis right is useful because the king can be wrong. This right is useful because society can be wrong. Culture can be wrong. A president can overreach. An agency can go beyond its powers to do something. Both the uppercase C Church and lowercase c church can be wrong.\n\nA reason why freedom of speech especially doesn't apply to 3C or Holy Spirit (besides that not actually being relevant as I mention above) is that God doesn't make mistakes and as the potter, he can do what he wants to the clay.", "is_submitter": false, "distinguished": null, "created_utc": 1630198661.0, "parent_id": "t1_haoqr2u", "replies": [{"author": "MisanthropicScott", "id": "hatht2g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pcz1vq", "stickied": false, "body": "Note: some stuff shortened to fit in 10K.\n\n> I misspoke. When I say \"condoned in\" I mean \"condoned\". When I say \"condoned by\" I mean \"advocated or defends\".\n\nNo worries. I sort of figured that out from context and I hope responded mostly that way.\n\n>> either of those dates (500 BCE, 1300 BCE) give centuries in which the problem of slavery could have been fixed by an all-powerful god.\n\n> This is a part of the topic of theodicy. I do take a Calvinist position on the topic of theodicy. If that means anything to you, you know where I am coming from.\n\nSorry. It does not.\n\n>> And yet, slavery continues to be condoned within the New Testament.\n\n> I think the Bible uses that terminology because it was familiar with the audience.\n\nThat may be. But, the New Testament still very much condones slavery and commands slaves to be obedient to their masters.\n\n> [Ephesians 6:5](https://www.biblegateway.com/passage/?search=eph+6%3A5&version=ESV): Bondservants, obey your earthly masters **with fear and trembling**, with a sincere heart, as you would Christ, \n\nThe fear and trembling that I emphasized above indicates that this is very much still real slavery, the same real slavery in which [a master may beat their slaves nearly to death as long as they don't actually die on the spot.](https://www.biblegateway.com/passage/?search=Exodus%2021%3A20-21&version=ESV)\n\n> It is often Paul making these metaphors. There are a quantity of Paul's writings that Christians use to say that Paul is trying to subvert slavery. \n\nBut, why is this so hard to do? Why doesn't God make this easier?\n\n> If a Christian has a Christian slave, they are to have them as a beloved brother. With the slave/bondservants to Jesus metaphors, it puts us all on level field.\n\nNo. Not all of us on a level field. This is more of the same bigotry regarding slavery as is found in the Hebrew Bible. Now, instead of Hebrew slaves being better off than non-Hebrew slaves we simply have replaced this with treating Christian slaves better than non-Christian slaves.\n\nThe fact that the Hebrew Bible is blatantly racist and the Christian Bible blatantly bigoted in this regard is not a positive feature of either.\n\n>> Why in 5 or 13 centuries could God not do better, making slavery illegal under God's law?\n\n> Man stealing, which did characterize all of American slavery, was illegal under God's law.\n\nI'm not sure that passage about man stealing is clear on exactly what this means. On the surface, it sounds good.\n\nBut, there are a number of questions about it.\n\nIf one compares this to horse stealing, capturing a wild/free horse is not stealing. Might man stealing refer only to the taking of someone else's slave?\n\nDoes this apply only to men or to women as well?\n\nDoes this also apply to capturing slaves in battle?\n\nThe 32,000 virgin women and underage girls captured in Numbers 31 and taken as sex slaves would count as \"man stealing\" by my standards. But, it's equally clear that this violated no laws in the Torah.\n\nMight this admonition against man stealing have applied only to Hebrews? What is the loophole by which man stealing under the RPM (rape, pillage, murder) strategy of war was OK? Clearly something is left unsaid here. So, it's not necessarily clear what the most literal meaning of man stealing may have been in this context.\n\n> In our modern age, slavery is unneeded. If someone is in debt, they can declare bankruptcy. If they are hungry, there are food banks and soup kitchens. If someone has no way to cover their other needs, they can access welfare.\n\nWe have indeed created a much better society than either God or Jesus did.\n\n> We're able to do this because we have a surplus and modern technology.\n\nThe wealth of kings like Solomon who was able to afford to keep 700 wives and 300 concubines implies that there was sufficient surplus for this then as well. The difference wasn't the surplus it was the reign of kings who had little or no interest in the survival of their subjects.\n\nThis line of kings was ordained by God.\n\n> The government is able to efficiently tax the citizenry with modern technology.\n\nSurely there were means by which the kings got their wealth from the people then as well. By Jesus' time, we know that the Caesars had taxes (render unto Caesar...). But, I think it's pretty safe to assume that the kings of Israel acquired their wealth by something that could easily qualify as a tax.\n\n> Many people have 10-30% of their incomes go to superfluous categories (large disposable incomes).\n\nMore on the same theme. Kings had wealth by some means.\n\n> We never worry about a crop failure...drought...hail. The worse a fire or hurricane will do is destroy our insured homes.\n\nThis is really far from true even today. It's not even wholly true in the wealthy countries of the world. But, in poor countries, all of these things are very much real problems for a huge percentage of both the world's population and the world's Christian population.\n\n> My response for why slavery wasn't made illegal in say the 1st century AD is because the alternative to slavery was not \"not slavery\"\n\nI don't agree at all.\n\n> it was \"a bunch of people dying\".\n\nThe net amount of food to the tribe and to society is not increased by a person selling themselves into slavery. The work force remains the same. Nothing is improved by this.\n\nSo, why would modern societies be better at setting up social safety nets than God himself.\n\nAre you not just arguing that God's power is really quite limited? God's ability to implement laws that improve society is limited to very slight incremental policies. Nothing truly significant is possible with God.\n\nWhy is that?\n\n> As our economies evolved and technology, slavery went from a horrible necessity to just horrible.\n\nI don't agree that this is about technology. I think it's all about morality. And, God's is questionable here.\n\n>> ...Speech is strongly restricted in the Bible right in the Ten Commandments regarding taking the name of the lord in vain. In the New Testament, blasphemy against the Holy Spirit becomes the worst possible sin, the only sin that can never be forgiven.\n\n>> What is your opinion on this?\n\n> The Holy Spirit and 3C ...\n\nI'm not familiar with this use of 3C. What does it mean?\n\n> aren't related to freedom of speech. Especially the former is functional. The Holy Spirit is the one who sanctifies, sanctification means \"the action of causing something to be or seem morally right or acceptable.\"\n\nOne still ought to be able to speak freely.\n\n> This is why blaspheming the Holy Spirit lands in the unforgivable category. Blaspheming/rejecting the Holy Spirit (calling it the power of demons or Beelzebul in Matthew 12:22-24 and Mark 3:22), rejects the route one is sanctified.\n\nI've heard this before. This is not the definition of blasphemy and goes quite strongly (in my opinion) against a reasonable definition of literalism, including the definitions you gave, which which I agree.\n\nBut, [blasphemy](https://www.dictionary.com/browse/blasphemy) simply does not mean rejection.\n\n> I love bad analogies.\n\nYour analogy is actually quite good. But, I reject your definition of blasphemy.\n\nI would further add that if it were simple rejection, one could repent and accept the Holy Spirit. But, in this passage, there is no possibility of repentance and later acceptance. \n\nImagine someone who loses a child to a long and painful bout of childhood cancer and curses the Holy Spirit for this act of God.\n\nLater, they may come to accept some argument like *mysterious ways* or God needed another angel or some such and repent of their cursing of the Holy Spirit. But, Christianity explicitly says, nope! Too little too late. Burn in the lake of fire.\n\n> \"Freedom of speech\" is a nebulous concept. America is the only country I know of that has an unrestrained, non-scoped concept of \"freedom of speech\".\n\nIt's not unrestrained actually. One cannot endanger people or incite violence, at least not legally. Though this is often called into question.\n\n> This right is useful because the king can be wrong.\n\nI disagree. The right is useful because *one may think the king is wrong* and ought to be able to say so. It's not about who is right or wrong. It's about freedom.\n\nThe bill of rights grants freedoms. The ten commandments takes them away.\n\n> God doesn't make mistakes\n\nEven the Bible states that this is false.\n\n[Gen 6:5-7 (emphasis mine)](https://www.biblegateway.com/passage/?search=Genesis+6%3A5-7&version=ESV): 5 The Lord saw that the wickedness of man was great in the earth, and that every intention of the thoughts of his heart was only evil continually. 6 And **the Lord regretted that he had made man on the earth**, and it grieved him to his heart. 7 So the Lord said, **“I will blot out man whom I have created from the face of the land, man and animals and creeping things and birds of the heavens, for I am sorry that I have made them.”** \n\nThe mistakes here are twofold. First, God has admitted to making mistake number 1, the creation of humanity. I agree that this was a mistake.\n\nMistake number 2 is the punishment of the innocent for the crimes of the guilty. The non-human animals were guilty of nothing. In addition to innocent infants, God drowned kittens and puppies, not even the same species as the offending individuals.\n\nI could never worship a god who would drown kittens and puppies. This is not a just god.\n\n> and as the potter, he can do what he wants to the clay.\n\nMight makes right? No. The potter can do what he wants to the clay because the potter has not made sentient creatures.\n\nAs a parent owes a debt to their children for having brought them forth from the void into a world where suffering is possible, so too God (were he to exist) would owe a debt to his creation to make life as decent as possible and to minimize the suffering of existence.\n\nWe did not ask to be created.", "is_submitter": false, "distinguished": null, "created_utc": 1630254239.0, "parent_id": "t1_haqzwp5", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "Tenacious-Tea", "id": "hapydsn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pcz1vq", "stickied": false, "body": "Biblical literalist is a strange term to me, in that a large portion of the scriptures are intentionally metaphorical. I think I would fit the category of who your are looking for a discussion with though.", "is_submitter": false, "distinguished": null, "created_utc": 1630180643.0, "parent_id": "t3_pcz1vq", "replies": [{"author": "Alatain", "id": "haq9m8l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "I will ask a clarifying question then. Do you hold to a position of biblical inerrancy? Basically, are there things in the Bible that are wrong, specifically from a moral sense?", "is_submitter": true, "distinguished": null, "created_utc": 1630185741.0, "parent_id": "t1_hapydsn", "replies": [{"author": "Tenacious-Tea", "id": "haqdc9o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pcz1vq", "stickied": false, "body": "Yes, I do hold to what would probably be considered inerrancy, self-described by the scriptures as “All Scripture is breathed out by God…”\n\nThere are many many things in the scriptures that are morally, or otherwise wrong.  For example, the king of Israel at the time, David, had sex with one of his soldier’s wife and then had that same soldier intentionally killed by Israel’s enemies in war in order to cover it up.  That is quite morally wrong in many levels, I would say.", "is_submitter": false, "distinguished": null, "created_utc": 1630187488.0, "parent_id": "t1_haq9m8l", "replies": [{"author": "Alatain", "id": "haqdtjq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "What about things that the Bible prescribes as moral law? For instance, in the same instance where Moses is given the 10 commandments, he is also given other rules. For instance, there are prescriptions for how to sell your daughter. Do you feel that it is morally right to sell your daughter based on this?", "is_submitter": true, "distinguished": null, "created_utc": 1630187714.0, "parent_id": "t1_haqdc9o", "replies": [{"author": "Tenacious-Tea", "id": "haqg2y6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pcz1vq", "stickied": false, "body": "Prescription would be the wrong word to describe what you are referring to. Giving conditions or limitations, to protect humanity, to immoral people who do immoral things is not the same as prescribing something.\n\nThe lack of absolute condemnation for this act, in this context, is not a prescription to do it.\n\nFor specific questions you have on topics like this, you would probably be better off searching some easy to find articles at places like gotquestions.com:\n\n[Got Questions? - Slavery](https://www.gotquestions.org/Bible-slavery.html)\n\nThey do a much better job than I ever could at explaining in detail the answers to questions you may have about such specific topics within the scriptures.\n\nDo you have an issue with the following, as it pertains to the law?\n\nMatthew 22:36-40\n“Teacher, which is the great commandment in the Law?” And he said to him, “You shall love the Lord your God with all your heart and with all your soul and with all your mind. This is the great and first commandment. And a second is like it: You shall love your neighbor as yourself. On these two commandments depend all the Law and the Prophets.”", "is_submitter": false, "distinguished": null, "created_utc": 1630188801.0, "parent_id": "t1_haqdtjq", "replies": [{"author": "Alatain", "id": "haqicn0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "I guess that my issue is with the idea that God and the Bible present an objective morality, while that morality seems to change over time and with interpretation. \n\nHow do you know which morals in the Exodus account should be held to and which should not? \"Honor your mother and father\" is in the same period as \"if you sell your daughter, here are the rules you should do it by\". Can you present a methodology for which to obey and which to not? \n\nA side question just to understand where you stand, do you hold to God being all-knowing, all-powerful, and omni-benevolent?", "is_submitter": true, "distinguished": null, "created_utc": 1630189890.0, "parent_id": "t1_haqg2y6", "replies": [{"author": "Tenacious-Tea", "id": "haqj24y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pcz1vq", "stickied": false, "body": "It feels a little like reading a script with your replies.  Almost as if I could have put anything in my reply but your next one would be the same regardless.\n\nYes, God is described as omnipotent, amongst other things, in the scriptures:\n\nJob 42:2 “I know that you can do all things, and that no purpose of yours can be thwarted.”", "is_submitter": false, "distinguished": null, "created_utc": 1630190237.0, "parent_id": "t1_haqicn0", "replies": [{"author": "Alatain", "id": "haqonro", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pcz1vq", "stickied": false, "body": "You focused on my secondary side question instead of my main question of how you can know what laws to accept from the event at Mt. Sinai in which Moses was handed the moral law of God? \n\nYou claim that I am possibly reading off of a script one comment after telling me to read off of your script by providing me a FAQ. I would not have asked to have a discussion with someone who actually believed in Biblical inerrancy if I did not want a discussion. \n\nMy questions come from actually learning the Hebrew well enough to read the source documents and I am wondering how someone with modern morals can accept a document that changes so much over time. The reason I asked about omniscience and omni-benevolence is that a God that was all loving and all knowing would be able to predict that his word as presented would be used to justify slavery over the next few thousand years. All they needed to do was introduce a single line saying \"it is forbidden to sell, purchase or own another human\" and a whole lot of bad shit could have been avoided.", "is_submitter": true, "distinguished": null, "created_utc": 1630192983.0, "parent_id": "t1_haqj24y", "replies": [{"author": "Tenacious-Tea", "id": "haqsok3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pcz1vq", "stickied": false, "body": "I said what I said about reading from a script because your response to my answer completely glossed over anything I said.  I might as well have not said it and then just asked you to state where you planned to go next with whatever point you were waiting to make. It is not much of a discussion if you just completely ignore what I say.\n\nIt is a bit presumptuous to assume that if God had declared outright in the scriptures that slavery should be banned, that this would have made any difference at all.  Part of the whole purpose of the law is to show God’s own character and his expectation for his creation, but another part is to demonstrate exhaustively, throughout the history of Israel, that they were not capable of fulfilling the law.  Israel failed to live up to law in any meaningful way, the majority of the original Hebrew and Aramaic scriptures are spent detailing this failure and its consequences in depth. Jesus, as taught by these same scriptures, portrays living the law perfectly and fulfills the law in every point.\n\nIt may be more of an argument for God’s omniscience that he didn’t state it explicitly, knowing that they would just disobey it all the more, than it is an argument against. Nor is it fair to the topic of slavery to compare the slavery of our current context to that of the societies of the past. It would be silly to suggest that God favors any one of the types of governments or constitutions of today over what his ideal society would be. This is part of the reason that I pointed to the Got Questions article, and the possibility of other articles they have.  The scripture’s teachings around slavery is a topic in and of itself, but if you have already concluded that you believe the scriptures are completely wrong on the topic, it would be hard for me to move forward with your next argument, which is based on that stance, in that I don’t agree with you.", "is_submitter": false, "distinguished": null, "created_utc": 1630194982.0, "parent_id": "t1_haqonro", "replies": []}]}]}]}]}]}]}]}]}, {"author": "roundearthervaxxer", "id": "han77jy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pcz1vq", "stickied": false, "body": "You are brave", "is_submitter": false, "distinguished": null, "created_utc": 1630123093.0, "parent_id": "t3_pcz1vq", "replies": []}]}