{"title": "Sleep Paralysis", "name": "t3_pgf9p9", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pgf9p9/sleep_paralysis/", "selftext": "Hello everyone,\n\nI have experienced sleep paralysis many times throughout my childhood, and it has been critical in shaping my beliefs on religion, the supernatural and my mortality. I’m curious to know if any of you have experienced this and if so, how has it left it’s mark on you? Also what exactly do you think it is and what causes it? \n\nBackground info: I’m in my mid-twenties, male, have Asperger’s syndrome and was raised in a very abusive household in the north eastern region of the US.", "score": 2, "upvote_ratio": 0.62, "permalink": "/r/TheFlyingTree/comments/pgf9p9/sleep_paralysis/", "id": "pgf9p9", "author": "AnachronisticAspie", "link_flair_text": "Discussion", "num_comments": 32, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630579121.0, "comments": [{"author": "usernames_suck_ok", "id": "hbbbd9v", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "pgf9p9", "stickied": false, "body": "My mother has experienced this for years. She feels like she only gets it when she sleeps on her back, so she's scared to sleep on her back.\n\nUm, (this is from a combination of studying psychology in college decades ago and research due to my mother)...my understanding is it's basically something going wrong with your sleep cycle and consciousness. When you sleep, you go through different stages, and in the heavier stages of sleep you actually are not usually able to move and are not usually conscious or aware. But people with sleep paralysis ***are*** conscious/aware in some sense during these stages at times. Basically, everyone experiences \"sleep paralysis,\" but none of us is supposed to know. People who think they're the only ones who experience it just happen to wake up during stages of sleep when we're not supposed to.\n\nMy mother does not follow a normal/set sleep schedule, and it is thought that this and/or sleep apnea can cause this. My mother also has anxiety, and I wonder if this could have anything to do with it because of her brain never fully \"shutting off,\" i.e. is she just always conscious on some level. My brain never shuts off, either, but, as far as I know, I don't experience sleep paralysis in this way (maybe it has not been realized yet).", "is_submitter": false, "distinguished": null, "created_utc": 1630589615.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbbckve", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "Interesting, I do something similar where I only sleep face down; I also had a rather chaotic sleep schedule due to the environment and ASD.", "is_submitter": true, "distinguished": null, "created_utc": 1630590147.0, "parent_id": "t1_hbbbd9v", "replies": []}]}, {"author": "maxinstuff", "id": "hbazis4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #243", "submission": "pgf9p9", "stickied": false, "body": "A few times - more frequent when I was young.\n\nNever hallucinated, just a feeling of being unable to move and falling, as well as the sensation of being unable to breathe (drowning?).\n\nNo idea what causes it, but it was kind of an interesting novelty so I never really minded to be honest.\n\nI am not on the autism spectrum nor did I have a traumatic childhood. No health issues to speak of either.", "is_submitter": false, "distinguished": null, "created_utc": 1630583568.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbazzze", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "Interesting, I felt that as well initially but was then overcome with an intense feeling of dread; there was a figure that I saw as well watching over me while I was in that state.", "is_submitter": true, "distinguished": null, "created_utc": 1630583846.0, "parent_id": "t1_hbazis4", "replies": []}]}, {"author": "BuccaneerRex", "id": "hbb9u5h", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pgf9p9", "stickied": false, "body": "I've had it a few times, but I was lucky enough to already know about it. So all I did was relax and fall back asleep. \n\nSleep paralysis is nothing more than a brain glitch in the control system that prevents you from moving while sleeping. It's sort of the opposite glitch to sleepwalking. \n\nYour brain has systems to prevent your body from moving while you dream. In sleepwalking, these systems fail, and you end up in a non-coherent mobile state while your conscious mind is disconnected from the world around you. You could consider it that your body is awake while your mind is asleep\n\nSleep paralysis is the opposite. The body system stays in place so you can't move, but your brain wakes up more than it is supposed to. You're not paralyzed, you're still dreaming. Your body is asleep, but your mind woke up temporarily.", "is_submitter": false, "distinguished": null, "created_utc": 1630588923.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbbc1eb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "Very interesting, honestly I’ve never actually researched the biological reasons as to why this occurs; as I never wanted to intentionally trigger and experience it again.", "is_submitter": true, "distinguished": null, "created_utc": 1630589910.0, "parent_id": "t1_hbb9u5h", "replies": [{"author": "BuccaneerRex", "id": "hbbe2t0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pgf9p9", "stickied": false, "body": "You'd think that owning a brain would let us figure out how they work easier. Nope. \n\nI'm not one to suggest that having a biological explanation makes the experience any less scary. Even if you know you still have to connect that fact in the moment, which is not easy when you're unable to move or breathe properly and are barely awake in the first place.", "is_submitter": false, "distinguished": null, "created_utc": 1630590810.0, "parent_id": "t1_hbbc1eb", "replies": [{"author": "AnachronisticAspie", "id": "hbbe9n2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "Very true, I’ll keep this in mind in the event it ever occurs again. Hopefully I can keep my shit together and remember that lol.", "is_submitter": true, "distinguished": null, "created_utc": 1630590895.0, "parent_id": "t1_hbbe2t0", "replies": []}]}]}]}, {"author": "HM_mtl", "id": "hbba6yj", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #487", "submission": "pgf9p9", "stickied": false, "body": "I have experienced sleep paralysis over 300times in my life, mostly between 8yo to 35yo. High peak between 8yo and 12yo, an another peak between 18yo and 26yo.", "is_submitter": false, "distinguished": null, "created_utc": 1630589086.0, "parent_id": "t3_pgf9p9", "replies": []}, {"author": "KuriousKhemicals", "id": "hbbj8w9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pgf9p9", "stickied": false, "body": "I've had sleep paralysis on occasion throughout my life. Until I was about 25 it was infrequent and mundane, not frightening or dreamlike, I literally just woke up a few seconds before I was unparalyzed.\n\nUnfortunately when I was 25 I trialed fluoxetine for anxiety and it intensified this sleep issue like a thundercloud into a hurricane. I started having full blown nightmares that I was acting out, from which I would wake into something like a night terror. It wa like aspects of dream state and waking state were mixed together in random ratios, I would be dreaming but not paralyzed or awake and paralyzed or dreaming and then awoken but kind of confused and all of it was terrifying. I got off the medication after 8 total weeks of using it, but ever since then my sleep paralysis episodes have had the frightening and hallucinatory components, and for several years afterward it was much more frequent than my prior baseline. \n\nSince then, every time I've taken fluoxetine even in isolation it triggers sleep paralysis about 1-2 weeks later. Other SSRIs at least in short term doses haven't seemed to have this effect.\n\nI don't think it means anything, it's just the sleep-wake regulation in the brain malfunctioning. \n\nI might have ADHD or be on the autism spectrum, and my parents were pretty unconventional/ accommodating of individual difference so my childhood was rather unusual but in good ways.", "is_submitter": false, "distinguished": null, "created_utc": 1630593025.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbbk3dn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "Interesting, I was actually considering going on SSRI’S  recently to stimulate neurogenesis.", "is_submitter": true, "distinguished": null, "created_utc": 1630593381.0, "parent_id": "t1_hbbj8w9", "replies": [{"author": "KuriousKhemicals", "id": "hbbmbn7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pgf9p9", "stickied": false, "body": "Considering the effect came on around 2 weeks into my treatment, and occurs 1-2 weeks after a single dose, I suspect it's due to the active metabolite of fluoxetine specifically. The relationship between sleep and SSRIs in general is complex - they're known to make sleep stages more difficult to distinguish on an EEG, which doesn't exactly sound like a good thing, but in practice they often improve sleep problems as a secondary effect of treating depression.", "is_submitter": false, "distinguished": null, "created_utc": 1630594331.0, "parent_id": "t1_hbbk3dn", "replies": []}]}]}, {"author": "Akeldama22", "id": "hbb9at8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #423", "submission": "pgf9p9", "stickied": false, "body": "I've never experienced it but I've been studying astral projection/lucid dreaming and sleep paralysis goes hand in hand with that sort of stuff.", "is_submitter": false, "distinguished": null, "created_utc": 1630588673.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbb9n9b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": " Very true, I’ve also been experimenting with lucid dreaming as well recently. Here’s an excellent video talking about supplementation to induce that: [video](https://youtu.be/kiOztE5Y5c8)", "is_submitter": true, "distinguished": null, "created_utc": 1630588837.0, "parent_id": "t1_hbb9at8", "replies": []}, {"author": "HM_mtl", "id": "hbbb9vw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #487", "submission": "pgf9p9", "stickied": false, "body": "If I can warn you... avoid experiencing astral projection.\n\nAbout lucid dreams, I did experienced a lot because when I was dreaming that time, I was able to find out some physic laws do not apply and I was able to \"curve\" the physic laws based on my own wishes. One time, I got tired of have lucid dreams. So after realized that I was dreaming, I though myself \"I just want to wake up.\" Well, I woke up but only realized that state that I was supposely awake, I was in fact dreaming (I got a doubt and I did again questionning the physic laws). I wish to wake up again and now this time, I really woke up.", "is_submitter": false, "distinguished": null, "created_utc": 1630589574.0, "parent_id": "t1_hbb9at8", "replies": [{"author": "AnachronisticAspie", "id": "hbbbuch", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "Oh yes, I definitely am not interested in astral projection; although I do find it fascinating.", "is_submitter": true, "distinguished": null, "created_utc": 1630589824.0, "parent_id": "t1_hbbb9vw", "replies": [{"author": "HM_mtl", "id": "hbbcj2m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #487", "submission": "pgf9p9", "stickied": false, "body": "I am pretty sure I have experienced those before. But I never wanted to. It was just happened. And I am sure that I would have a better life without getting those experiences.", "is_submitter": false, "distinguished": null, "created_utc": 1630590125.0, "parent_id": "t1_hbbbuch", "replies": []}]}, {"author": "Akeldama22", "id": "hbbctw0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #423", "submission": "pgf9p9", "stickied": false, "body": "Why would I avoid astral projection? I've experienced OBE through other means, there's nothing scary about it IMO", "is_submitter": false, "distinguished": null, "created_utc": 1630590259.0, "parent_id": "t1_hbbb9vw", "replies": [{"author": "HM_mtl", "id": "hbbdsq2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #487", "submission": "pgf9p9", "stickied": false, "body": "Astral projection is a kind of out-of-body experience. Itself is not scary but once you experienced is like going deep in a rabbit hole. And, at some point, it could become dangerous for yourself. And when you realize it, it's already too late.", "is_submitter": false, "distinguished": null, "created_utc": 1630590689.0, "parent_id": "t1_hbbctw0", "replies": []}]}]}]}, {"author": "Paul_Thrush", "id": "hbba69j", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "pgf9p9", "stickied": false, "body": "sorry you were raised in an abusive household. I know how bad that can be.\n\nI just looked up sleep paralysis and it doesn't seem that bad. It looks like your brain sometimes doesn't completely make the switch between sleep and awake. I don't understand how it can shape your beliefs on religion, the supernatural, and mortality.", "is_submitter": false, "distinguished": null, "created_utc": 1630589077.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbbbi3z", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "No need to be sorry, it was absolutely hellish at the time but ironically due to my condition I think it may have helped me in the long run. Honestly, the home that I grew up in was atheist in practice; they claimed they were catholic but that was just for appearances. The home itself had a slew of paranormal occurrences during my time growing up and I strongly believe the hateful energy that emanated from my parents during that time was just a breeding ground for evil honestly. Living in that type of environment for over a decade and being on the receiving end of some of their deplorable actions gave me an strong sense of what most would consider good and evil. When I experienced sleep paralysis it truly felt like I was face to face with evil, whether or not that’s true or just some trick played on me biologically speaking I honestly don’t know.", "is_submitter": true, "distinguished": null, "created_utc": 1630589675.0, "parent_id": "t1_hbba69j", "replies": [{"author": "Paul_Thrush", "id": "hbbejee", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "pgf9p9", "stickied": false, "body": "Web MD is a great online resource for medical issues. This [article](https://www.webmd.com/sleep-disorders/sleep-paralysis) on sleep paralysis describes how it's a biological condition that can be treated. There's no need to fear nighttime demons or alien abductors. They're not real.", "is_submitter": false, "distinguished": null, "created_utc": 1630591013.0, "parent_id": "t1_hbbbi3z", "replies": []}]}, {"author": "KuriousKhemicals", "id": "hbbl2wr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pgf9p9", "stickied": false, "body": "My sleep paralysis changed at a specific juncture when I took a specific medication (see my comment). Indeed, if you are just awake but unable to move, it's not that bad - you just wait and try to wiggle your fingers a bit until it breaks. But when it comes with the hallucinations or feelings of terror, it's more like you're dreaming a place that happens to be your real environment. You can't fully understand what's happening because your brain is still working in dream logic, and if you feel frightened you can't control that and rationally evaluate it.", "is_submitter": false, "distinguished": null, "created_utc": 1630593794.0, "parent_id": "t1_hbba69j", "replies": []}]}, {"author": "solongfish99", "id": "hbbdkq4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "pgf9p9", "stickied": false, "body": "Yeah, I had it a handful of times when I was young, and the monster was always a gnomish imp thing. I had it one time more recently, in which the monster was my roommate wearing a paper bag mask on his head. I ended up being able to get out a super high pitch shriek and ended up waking him and myself up lmao. \n\nIt's not left me with any particular religious inclinations.", "is_submitter": false, "distinguished": null, "created_utc": 1630590591.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbbdslc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "Lol yea, experiences tend to vary from person to person.", "is_submitter": true, "distinguished": null, "created_utc": 1630590687.0, "parent_id": "t1_hbbdkq4", "replies": []}]}, {"author": "MatthewPrague", "id": "hbbp2fn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #383", "submission": "pgf9p9", "stickied": false, "body": "I had it once and was so fucking scared. Not being able to move and some demon handing me water. Yeah, but its just in your brain not some kind of \"paranormal activity\"", "is_submitter": false, "distinguished": null, "created_utc": 1630595484.0, "parent_id": "t3_pgf9p9", "replies": []}, {"author": "JivePrintingDotCom", "id": "hbbzioo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgf9p9", "stickied": false, "body": "I believe this type of thing is usually demonic. There isn't a concise introduction to demons, but it would be a good conversation to begin with a trusted minister who can demonstrate scriptural knowledge.", "is_submitter": false, "distinguished": null, "created_utc": 1630599735.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbdklup", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "I do as well, I feel pretty comfortable with where my faith is at the moment; and I have yet to experience one of these events since.", "is_submitter": true, "distinguished": null, "created_utc": 1630623372.0, "parent_id": "t1_hbbzioo", "replies": []}]}, {"author": "wh0-am-l", "id": "hbfiacx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #19", "submission": "pgf9p9", "stickied": false, "body": "Sleep paralysis is caused when your sleep is messed up, where you are awake but your brain thinks you’re sleeping,making you dream. However, due to the fact you are awake, the dreams you see are in your room, which makes things infinitely more terrifying", "is_submitter": false, "distinguished": null, "created_utc": 1630665315.0, "parent_id": "t3_pgf9p9", "replies": []}, {"author": "BobbyCostner", "id": "hbauc95", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #466", "submission": "pgf9p9", "stickied": false, "body": "I haven't but it sounds like a form of seizure.", "is_submitter": false, "distinguished": null, "created_utc": 1630580257.0, "parent_id": "t3_pgf9p9", "replies": [{"author": "AnachronisticAspie", "id": "hbavgit", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #505", "submission": "pgf9p9", "stickied": false, "body": "Possibly, I have Asperger’s and apparently epilepsy is common amongst us.", "is_submitter": true, "distinguished": null, "created_utc": 1630581037.0, "parent_id": "t1_hbauc95", "replies": []}]}, {"author": "RizZy_28", "id": "hbcaq2t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #124", "submission": "pgf9p9", "stickied": false, "body": "Had it happen a few times but not recently, freaked me out at first & then figured out what it was & what was happening & just got used to waiting it out, around the same time I developed a habit of sleeping face down with my arms across my chest, so when I'd eventually move I'd have dead arms for a few minutes till blood finally started circulating again & pins & needles would kick in, fun times.", "is_submitter": false, "distinguished": null, "created_utc": 1630604147.0, "parent_id": "t3_pgf9p9", "replies": []}]}