{"title": "Learning to listen", "name": "t3_pixt4s", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pixt4s/learning_to_listen/", "selftext": "One of the benefits of getting a bit older is you have the opportunity to learn from experience; your own experience, which is the best teacher I think.  Note I say you have “the opportunity” because not everyone actually DOES learn from their experience, and certainly there are some I haven’t.  I guess we all have mistakes we just keep making.\n\nBut one thing I feel like I’ve learned is how to listen.  When I was younger I was good at listening for facts; I’ll chalk that up to 18 years of school.  Them SS I matured I learned to listen past facts and listen to feelings.  Not what a person said, but how they were feeling when they said it.\n\nNow at 50 I’ve found a new thing to listen for; values.  It’s harder to tweak out because people don’t necessarily say explicitly what they value.  But it’s worth trying because our values say so much about who we are and what matters to us.  I’m still learning to do it; got a long way to go yet.  But it’s worth trying I think, as a way to really connect and understand the people you talk to.\n\nJust thought this might be worth a share!", "score": 14, "upvote_ratio": 0.94, "permalink": "/r/TheFlyingTree/comments/pixt4s/learning_to_listen/", "id": "pixt4s", "author": "armyprof", "link_flair_text": "Discussion", "num_comments": 6, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630928543.0, "comments": [{"author": "Chimples10", "id": "hbst84r", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pixt4s", "stickied": false, "body": "Listening with the intent to understand rather than the intent to respond is priceless.", "is_submitter": false, "distinguished": null, "created_utc": 1630930299.0, "parent_id": "t3_pixt4s", "replies": [{"author": "-Nullius_in_verba-", "id": "hbu3tnq", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #212", "submission": "pixt4s", "stickied": false, "body": "It really makes for a much better conversation. And this is also especially important when discussing/debating someone. Actually taking the time to try to understand what the other person is saying is so much more productive, and they don't constantly feel like they have to be on the defensive because you're attacking them.", "is_submitter": false, "distinguished": null, "created_utc": 1630952229.0, "parent_id": "t1_hbst84r", "replies": []}]}, {"author": "MisanthropicScott", "id": "hbt4ujt", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pixt4s", "stickied": false, "body": "That's pretty cool. Not all of us learn that. At 57, I'm not sure I have.\n\nIf you've had a recent birthday (and these reflections sort of sound that way), happy 50th. \n\nAnd, don't think of it as the end of your 40s. Think of it as the start of your sixth decade! (Note, said as I'm feeling the approach of my seventh.)", "is_submitter": false, "distinguished": null, "created_utc": 1630936777.0, "parent_id": "t3_pixt4s", "replies": []}, {"author": "celtic_cuchulainn", "id": "hbt1u5y", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #168", "submission": "pixt4s", "stickied": false, "body": "Thanks for sharing.", "is_submitter": false, "distinguished": null, "created_utc": 1630935247.0, "parent_id": "t3_pixt4s", "replies": []}, {"author": "Alatain", "id": "hbtbnra", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pixt4s", "stickied": false, "body": "In an exercise to listen for values, what would you say your values are? I am interested in simply listening if you are willing to share.", "is_submitter": false, "distinguished": null, "created_utc": 1630939992.0, "parent_id": "t3_pixt4s", "replies": []}, {"author": "Th0masJefferson", "id": "hbvbf84", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #11", "submission": "pixt4s", "stickied": false, "body": "You might enjoy the book *Never Split the Difference: Negotiating as if Your Life Depended on It* by former FBI hostage negotiator Chris Voss. I listened to the audiobook. I recommend the book  because in a negotiation, Voss says, the negotiator's job is to find out what the other party values. The easiest and most worthless accomplishment is to get the other party to \"Yes.\" People will say \"Yes\" to anything just to shut you up. Voss says the goal is to get the other party to \"That's right.\" When the other party feels heard and understood, you're getting somewhere in your negotiation.", "is_submitter": false, "distinguished": null, "created_utc": 1630972315.0, "parent_id": "t3_pixt4s", "replies": []}]}