{"title": "The great inequality will not be poverty", "name": "t3_oo3dz1", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oo3dz1/the_great_inequality_will_not_be_poverty/", "selftext": "It won't be poverty directly. It will be the delta between lifespans. The wealthy are already cracking the code of human life spans. It is done behind closed doors. Could you imagine if the entire world found out that there is some combination of technologies that can increase the human lifespan by 200-300%? It would be chaos and disorder. Those that will live longer will do so in quiet transitions. They will fear the rest of the world finding out.\n\nThe rules have been roughly the same for thousands of years. Everyone expired within a normal distribution. Now we are nearing the age of the outliers.\n\nIs that what we should call them, the Outliers? Those that stay ahead of technology either through cloning, gene modification, bionics, or whatever; the medium matters not. The difference between the \"haves\" and the \"have nots\" will be time. It is easy to gain power, but even easier to lose it. With enough time losing power is improbable. Why take action when you can sit back and wait for your enemies to die of a fleeting old age. Wait long enough and the world will forget that you even existed. Wait even longer and they will worship your return. \n\nWhen the average person in this world realizes that the wealthy cracked the code of human aging...those wealthy people will already be several hundred years old or older, and the average person will not be in a position to do anything about it.", "score": 26, "upvote_ratio": 0.88, "permalink": "/r/TheFlyingTree/comments/oo3dz1/the_great_inequality_will_not_be_poverty/", "id": "oo3dz1", "author": "atlasgaveup", "link_flair_text": "Discussion", "num_comments": 79, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1626792147.0, "comments": [{"author": "Thewalrus515", "id": "h5vwbdj", "score": 15, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "Maybe a super long lifetime would make the rich give a shit about long term consequences.", "is_submitter": false, "distinguished": null, "created_utc": 1626795359.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "Zealousideal_Mix_629", "id": "h5w2624", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oo3dz1", "stickied": false, "body": "Nay, they would grow even more out of touch", "is_submitter": false, "distinguished": null, "created_utc": 1626797782.0, "parent_id": "t1_h5vwbdj", "replies": []}, {"author": "campaigner1147", "id": "h5w8l2v", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo3dz1", "stickied": false, "body": "Wouldn’t that be nice. For anyone and everyone to realize the impact our generation has on future generations. Sigh. Would living a longer life really help people to realize this? I guess when I think about my experience volunteering in hospice care centers and retirement homes, it is not like with old age you automatically become more aware of the environment and your impact but I think indirectly this can happen as I definitely observed that there is an increase in people realizing what matters in life versus what they thought mattered. A focus on accumulating material things and working too much were absolutely some of the main regrets I heard many times.\nEdit to add: although I just realized that a lot of that came from people who were dying not necessarily just because they were old. So maybe that’s something to think about...just growing older and having a longer life wouldn’t have as severe of an impact on one’s mentality as dying or approaching death does. Hmmm...", "is_submitter": false, "distinguished": null, "created_utc": 1626800426.0, "parent_id": "t1_h5vwbdj", "replies": []}, {"author": "atlasgaveup", "id": "h5vwzss", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "In other words, the value of human life is dropping and not increasingreally matter. We are approaching a point where technology and specifically automation and machine learning can help maintain current technology levels with less than 1% of the human population. Experts widely agree that humanity is largely the problem. We are approaching the point where this many humans is not only not needed but a cost burden on progress. \n\nIn other words the value of human life is dropping and not increasing. With a decreasing population, most of the problems will self-correct or be manageable from a technology standpoint.", "is_submitter": true, "distinguished": null, "created_utc": 1626795637.0, "parent_id": "t1_h5vwbdj", "replies": []}]}, {"author": "Rocknocker", "id": "h5wu2qd", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "Seeker #180", "submission": "oo3dz1", "stickied": false, "body": ">The wealthy are already cracking the code of human life spans. It is done behind closed doors. \n\nCitation needed.\n\n\nOr it's unfounded bovine biogenic colluvium.", "is_submitter": false, "distinguished": null, "created_utc": 1626809471.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "atlasgaveup", "id": "h5xbmhk", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "You don't know what you don't know. Are you informed of military secrets? Are you in the loop on valuable financial data? Why would you think that anyone would make this information public? Citations are yesterday's information and yesterday's information does not have value. You must think very highly of your level of information. In reality, you have very little information and data.", "is_submitter": true, "distinguished": null, "created_utc": 1626816973.0, "parent_id": "t1_h5wu2qd", "replies": [{"author": "DDumpTruckK", "id": "h5zax1j", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oo3dz1", "stickied": false, "body": "To be fair though, you made the claim that the code is being cracked so the burden of proof is on you.  Your essentially arguing here that age old: \"You can't prove they're *NOT* cracking the code.\"  But that's not really how it works.  If you want to believe they're cracking the code, you should be requiring evidence for that claim.\n\nI don't really have a horse in this race, but I want to impartially call out bad arguments where they are.  The time to believe something is when you have sufficient evidence to believe it.", "is_submitter": false, "distinguished": null, "created_utc": 1626854924.0, "parent_id": "t1_h5xbmhk", "replies": []}, {"author": "DDumpTruckK", "id": "h5zaxd3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oo3dz1", "stickied": false, "body": "To be fair though, you made the claim that the code is being cracked so the burden of proof is on you.  Your essentially arguing here that age old: \"You can't prove they're *NOT* cracking the code.\"  But that's not really how it works.  If you want to believe they're cracking the code, you should be requiring evidence for that claim.\n\nI don't really have a horse in this race, but I want to impartially call out bad arguments where they are.  The time to believe something is when you have sufficient evidence to believe it.", "is_submitter": false, "distinguished": null, "created_utc": 1626854932.0, "parent_id": "t1_h5xbmhk", "replies": []}, {"author": "dcnairb", "id": "h5y75t9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oo3dz1", "stickied": false, "body": "As do you? You’re completely speculating without any basis in science. Extending the human lifespan by 2-3x would require unbelievable barriers to be overcome. Maybe it’s possible in some far future, but why do you seem so certain it’s happening now?", "is_submitter": false, "distinguished": null, "created_utc": 1626832006.0, "parent_id": "t1_h5xbmhk", "replies": [{"author": "04221970", "id": "h64ce6u", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #110", "submission": "oo3dz1", "stickied": false, "body": "THerefore, this is all speculation without any basis in fact.  I will choose not to believe this as true until I see some evidence.  \nTHat isn't to say it isn't true, just that I can't believe it yet.  Otherwise, I'd have to believe every thing that was ever stated as true without evidence.\n\nI'm tired... I can't do that.  Trump telling me things are true without any evidence just made me skeptical of anyone telling me things without evidence.", "is_submitter": false, "distinguished": null, "created_utc": 1626957684.0, "parent_id": "t1_h5y75t9", "replies": []}]}]}, {"author": "Houdinii1984", "id": "h5xis4k", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #57", "submission": "oo3dz1", "stickied": false, "body": "Here are a couple of articles surrounding current efforts in anti-aging and upcoming drug trials. It's centered around the military, but it's not outside the realm of possibility that it becomes exclusive to a single group:\n\n[https://www.popularmechanics.com/science/health/a36905562/us-military-testing-anti-aging-pill/](https://www.popularmechanics.com/science/health/a36905562/us-military-testing-anti-aging-pill/)\n\n[https://breakingdefense.com/2021/06/socom-to-test-anti-aging-pill-next-year/](https://breakingdefense.com/2021/06/socom-to-test-anti-aging-pill-next-year/)", "is_submitter": false, "distinguished": null, "created_utc": 1626820233.0, "parent_id": "t1_h5wu2qd", "replies": []}]}, {"author": "AndrewIsOnline", "id": "h5w76rq", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "oo3dz1", "stickied": false, "body": "Altered Carbon touches on this.", "is_submitter": false, "distinguished": null, "created_utc": 1626799847.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "MisanthropicScott", "id": "h5vq209", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oo3dz1", "stickied": false, "body": "There's a science fiction book by Heinlein called Methuselah's Children. The mechanism for the increased life expectancy of some in the book is simple breeding of people who had all four grandparents live to 100. So, it wasn't about wealth.\n\nBut otherwise, the book touches on many of the issues you bring up. He called it the \"masquerade\" where people would change identities starting out young and then gradually deliberately aging their appearance over the years until they start a new identity over again.", "is_submitter": false, "distinguished": null, "created_utc": 1626792699.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "Itsbadmmmmkay", "id": "h5wf8bm", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #92", "submission": "oo3dz1", "stickied": false, "body": "Netflix has a show called \"altered carbon\" that looks at this idea.", "is_submitter": false, "distinguished": null, "created_utc": 1626803202.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "DELETED", "id": "h5ws7h2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "oo3dz1", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1626808685.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "atlasgaveup", "id": "h5wsd1p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "Humans are tribal by nature. Kind of like saying without thumbs the problems would not exist.", "is_submitter": true, "distinguished": null, "created_utc": 1626808750.0, "parent_id": "t1_h5ws7h2", "replies": []}]}, {"author": "Btankersly66", "id": "h5w8b63", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "oo3dz1", "stickied": false, "body": "In the words of the immortal Jim Morrison, \"The future is uncertain and the end is always near.\"", "is_submitter": false, "distinguished": null, "created_utc": 1626800313.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "snuffybox", "id": "h5wv9rf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "I duno man, poverty seems like a pretty big inequality rn.. also life extension tech is no where near useable any time soon and probably wont be in our lifetime, medical science is just not there yet. The wealthy are not cracking the code behind closed doors... this kind of research can't be kept secret like that. This post is pretty much just a overdone scifi plot and nothing more.", "is_submitter": false, "distinguished": null, "created_utc": 1626809972.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "atlasgaveup", "id": "h5xb11k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "How do you know where the technology is? Do you think that would feel the desire to share progress with you and provide you with updates?", "is_submitter": true, "distinguished": null, "created_utc": 1626816707.0, "parent_id": "t1_h5wv9rf", "replies": [{"author": "arokace", "id": "h5xeu7h", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "oo3dz1", "stickied": false, "body": "Seeing as you're the one making the argument about such technology existing.  Where's the proof or are you just assuming it is.\n\nAnd they are sort of right about not being able to keep it secret.\n\nAnd is it so hard to believe that scientists would share this information... Oh yea thats the other thing, the rich aren't making this shit.  Its scientists.\n\nAnd we have been learning about how/why humans age.  It is public knowledge.  In my other comment, this is where the anti-aging pills being tested on US forces is coming from.\n\nFrom telomeres on our dna to protein folding, to mitochondria... there's a few and its known...  So guess what the next step is for anyone interested in figuring it out.  Figuring out how to counter these process that happen in our bodies.  Again, where these anti-aging pills are coming from.\n\nhttps://duckduckgo.com/?q=Telomere+shortening+study&atb=v268-1&ia=web\n\n[https://duckduckgo.com/?q=Mitochondrial+dysfunction+and+aging+study&atb=v268-1&ia=web](https://duckduckgo.com/?q=Mitochondrial+dysfunction+and+aging+study&atb=v268-1&ia=web)\n\n[https://duckduckgo.com/?q=Unfolded+protein+response+study&atb=v268-1&ia=web](https://duckduckgo.com/?q=Unfolded+protein+response+study&atb=v268-1&ia=web)\n\nThere's some other ways that causes aging too but not everything is a some conspiracy to get us down.  It will become a product like anything else to buy and sell.", "is_submitter": false, "distinguished": null, "created_utc": 1626818418.0, "parent_id": "t1_h5xb11k", "replies": [{"author": "atlasgaveup", "id": "h5xg1yi", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "This is creative writing on a sub that is largely tongue-in-cheek. The purpose is to get people to think. Whether they think it is outrageous or potentially possible. I reply to some comments to double down if it seems entertaining. \n\nMy point still stands. You don't know what you don't know. You are largely dismissing your own limitations as far as knowledge. No one owes you factual information or data. It can be a personal requirement of yours to vette information but no one is required to provide it. \n\nUnlike you, I don't believe that those in power freely share information because the information has value. Some information has far more value than other information. Information about expanding a person's life span would be closely guarded information. This world cannot support a populace that lives far beyond our natural lifespan. It would be extremely naive to think that people who have information or data regarding this would share it with you are. \n\nA pill that caused immortality would be worth many lifetimes of wealth.\n\nYou and I combined don't have enough wealth to even know whether the pill exists or not. \n\nCommon information or common data has little to no value. Your duckduckgo sources hold little value. \n\nI acknowledge your optimism in humanity and captalism", "is_submitter": true, "distinguished": null, "created_utc": 1626818978.0, "parent_id": "t1_h5xeu7h", "replies": [{"author": "snuffybox", "id": "h5xne9e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "You are really misguided on how science is done. Capitalists are evil, but they aren't supervillains, they can't hide stuff like this. Capitalists cant even keep the next marvel movie from getting leaked. Something like solving ageing requires the combined effort of thousands of scientists over decades of work with many many major groundbreaking discoveries and breakthroughs in our understanding. Science is a collaborative effort of many many people, it's just not possible for something like this to be kept secret. You are honestly just making unfounded conspiracy theories.", "is_submitter": false, "distinguished": null, "created_utc": 1626822406.0, "parent_id": "t1_h5xg1yi", "replies": []}, {"author": "TSM-", "id": "h5xno5t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #39", "submission": "oo3dz1", "stickied": false, "body": "> I don't believe that those in power freely share information because the information has value\n\nAt least right now, researchers careers are driven by their publication count and influence, so I'm not totally sure you are right about that. Some industrial (or military) research is hidden, for sure, but the default at major institutions is to claim credit for any research as loudly and visibly as possible. You can publish a \"we just solved aging\" article without disclosing the exact details behind your discovery.", "is_submitter": false, "distinguished": null, "created_utc": 1626822538.0, "parent_id": "t1_h5xg1yi", "replies": []}, {"author": "arokace", "id": "h604d9z", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "oo3dz1", "stickied": false, "body": "Definitely isn't a creative writing post.  This sub is far from \"tongue-n-cheek\" as you put it.  Yes there are a lot of joke posts and comments but there are also serious ones with debate.  If this was purely a creative writing thing, you'd have prefaced it and probably not saying you believe in it as well.    \n\n\nAnd the argument \"you don't know what you don't know\" is not an argument.  The earth is flat, god(s) are real, the earth is hollow, and Zuckerberg is a lizard man.  You haven't been to space to say for sure it isn't flat.  You haven't been able to disprove god(s).  You haven't dug deep enough to know.  You haven't met Zuckerberg and tried to remove his mask.  Because frankly, you don't know what you don't know so these all must be facts.  \n\n\nLast but not least... My duckduckgo searches hold more value than anything you've posted/said so far.  I'm at least providing references with sources in there.", "is_submitter": false, "distinguished": null, "created_utc": 1626875648.0, "parent_id": "t1_h5xg1yi", "replies": [{"author": "atlasgaveup", "id": "h604mpu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "This sub is absolutely tongue-in-cheek. I stopped reading after that statement lol", "is_submitter": true, "distinguished": null, "created_utc": 1626875772.0, "parent_id": "t1_h604d9z", "replies": []}]}]}]}]}]}, {"author": "Transparency2Thee", "id": "h5wy1bn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #32", "submission": "oo3dz1", "stickied": false, "body": "Unfortunately, I see the future much darker than that. There is a point where the masses will not be needed even as  slaves. It’s already been proven that as machines replace workers, it’s not the workers that benefit from that technology. Sure, some might argue that it enables people to contribute in other ways. That benefit is double-edged. Those jobs that remain require specific skill sets and the positions that become available are not equal to the jobs lost.  Over time, the technological limitations that necessitate human labor and skill will cease to exist. There is no utopia where billions of people live a labor-free life. \n\nIn a few words, the rich have needed the poor to build their castles and fight their wars. Don’t expect benevolence when that need is filled by metal. The length of their lives won’t be their greatest advantage. We’ve already crossed the line where an armed militia will ever truly threaten monarchy again. \n\nAdditionally, a world that is largely uninhabitable saves them the expense of killing off the poor themselves. Climate change isn’t the problem for them that it is for us.", "is_submitter": false, "distinguished": null, "created_utc": 1626811127.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "atlasgaveup", "id": "h5xalbk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "I agree. I like the way that you think.", "is_submitter": true, "distinguished": null, "created_utc": 1626816512.0, "parent_id": "t1_h5wy1bn", "replies": []}]}, {"author": "arokace", "id": "h5xc8rq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "oo3dz1", "stickied": false, "body": "Yup the US military soldiers taking.... sorry testing .... those new anti-aging pills sound really really wealthy.  \n\n\nAnd there has always been a discrepancy between rich/powerful people and poverty.  Rich/powerful people can also just get better medical care in general.  Difference nowadays is there's more and more people getting access to higher end medical care.  \n\n\nAs u/Rocknocker said, where is this coming from.  You can't just say this (well you can, you just did), you need to have some kind of source.", "is_submitter": false, "distinguished": null, "created_utc": 1626817250.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "atlasgaveup", "id": "h5xga2y", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "You were born with every source that you will ever need. All other sources are just supplemental information", "is_submitter": true, "distinguished": null, "created_utc": 1626819082.0, "parent_id": "t1_h5xc8rq", "replies": [{"author": "Rocknocker", "id": "h60041k", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #180", "submission": "oo3dz1", "stickied": false, "body": "In other words: \"I have no idea what I'm saying and I'm not about to even look for corroborating evidence because I know there is none\".", "is_submitter": false, "distinguished": null, "created_utc": 1626873560.0, "parent_id": "t1_h5xga2y", "replies": [{"author": "atlasgaveup", "id": "h600bb9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "We can compare educations if you like? It seems like you are getting far too wrapped up in a tongue-in-cheek creative writing post. You may want to re-evaluate the things that matter to you. If it is a medical condition like Autism then I can certainly understand.", "is_submitter": true, "distinguished": null, "created_utc": 1626873663.0, "parent_id": "t1_h60041k", "replies": [{"author": "Rocknocker", "id": "h601zk4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #180", "submission": "oo3dz1", "stickied": false, "body": "> We can compare educations if you like? \n\nI have 3 advanced STEM degrees and will be completing my DSc in May after 40 years in the global energy industry. You want an educational pissing contest, best tank up, Scooter. \n\n>a tongue-in-cheek \n\nIt only seems that way to you, evidently. To others, myself included, you're already far too entertaining, however unintentional. \n\n>You may want to re-evaluate the things that matter to you\n\nChrist, now it's Internet psychoanalysis? You may want to revaluate what you type and provide evidence for what you claim, not some hoary and vague homilies, handwaving, and ass grabbing. \n\n>condition like Autism\n\nUnlike your medical condition: craniorectal inversion. Self-inflicted and so very detrimental. Shame, I guess, if only someone would give a shit. \n\nAs evidenced by your post history, this is utterly pointless. Don't bother replying, you're tiresome and obviously well out of your league. This dialogue has just become a monologue.", "is_submitter": false, "distinguished": null, "created_utc": 1626874499.0, "parent_id": "t1_h600bb9", "replies": [{"author": "atlasgaveup", "id": "h602axc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "Uh huh. In what? I would be happy to test your knowledge. I can tell by your tone that I find this far more entertaining than you. Ah, let me check your post history now.", "is_submitter": true, "distinguished": null, "created_utc": 1626874653.0, "parent_id": "t1_h601zk4", "replies": []}, {"author": "atlasgaveup", "id": "h602nan", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "No wonder this upsets you so much. You're about expired my friend.", "is_submitter": true, "distinguished": null, "created_utc": 1626874822.0, "parent_id": "t1_h601zk4", "replies": [{"author": "Rocknocker", "id": "h602vm2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #180", "submission": "oo3dz1", "stickied": false, "body": "Das svidonya, sloka.", "is_submitter": false, "distinguished": null, "created_utc": 1626874933.0, "parent_id": "t1_h602nan", "replies": []}]}]}]}]}]}]}, {"author": "jread", "id": "h5vp35u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "But who wants to live for hundreds of years? I sure as hell don’t.", "is_submitter": false, "distinguished": null, "created_utc": 1626792278.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "MisanthropicScott", "id": "h5vpo9k", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oo3dz1", "stickied": false, "body": "Maybe if I could be fairly young feeling and healthy of body and mind it would be nice. But, I'm not sure our species has that long before catastrophic collapse and a huge die off. So, maybe not even if I'm healthy.", "is_submitter": false, "distinguished": null, "created_utc": 1626792533.0, "parent_id": "t1_h5vp35u", "replies": [{"author": "145676337", "id": "h5w6hyr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #116", "submission": "oo3dz1", "stickied": false, "body": "An interesting survey found that most people when asked if they could return to a younger age would go about 20 years younger. Someone who was 80 generally didn't want to be 21 again, they wanted to be 50 or 60. Also, the likelihood that someone would want to be younger again and live longer decreased as people got older.\n\nNot contradicting anything you said, I just found it interesting that \"healthy\" and \"young\" were certainly goals and concepts that varied as people aged.", "is_submitter": false, "distinguished": null, "created_utc": 1626799564.0, "parent_id": "t1_h5vpo9k", "replies": [{"author": "MisanthropicScott", "id": "h5w7b7s", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oo3dz1", "stickied": false, "body": "I agree with that. I'm 57. 20 years younger would be absolutely fine with me. It was before my first knee and back pains. I already had type 1 diabetes (diagnosed late in life at 25). But, all of my best years were after my diagnosis. My late 20s and early 30s were when my wife and I finally had some discretionary income. So, by 37 we were already traveling. It was a good age.\n\nBut, I would also choose, if I could pick and choose from various points in my life, my current lifestyle of being retired and my current home as well.\n\nAnd, I definitely wouldn't want to trade/lose my memories. So, there's that too.", "is_submitter": false, "distinguished": null, "created_utc": 1626799898.0, "parent_id": "t1_h5w6hyr", "replies": [{"author": "Financial-Process-86", "id": "h5wn4zj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #268", "submission": "oo3dz1", "stickied": false, "body": "It's interesting. I never thought about how young doesn't really matter if you're living forever.\n\nAs long as you're healthy that's all that really matters. If your healthy and spry at age 50, then 50 forever is solid too. Technically with the technology you could be 2000 and be healthy and spry AND look young \n\nSo I guess one would need to reconsider the thought of \"immortality\" and the concept of age. As long as I'm healthy, spry, and feel good. Then hell yeah. Sign me up for immortality. You definitely need all three to make it worthwhile.", "is_submitter": false, "distinguished": null, "created_utc": 1626806530.0, "parent_id": "t1_h5w7b7s", "replies": [{"author": "campaigner1147", "id": "h5wwtw1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo3dz1", "stickied": false, "body": "health is wealth", "is_submitter": false, "distinguished": null, "created_utc": 1626810624.0, "parent_id": "t1_h5wn4zj", "replies": []}, {"author": "MisanthropicScott", "id": "h5x9jpj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oo3dz1", "stickied": false, "body": "> So I guess one would need to reconsider the thought of \"immortality\" and the concept of age. As long as I'm healthy, spry, and feel good. Then hell yeah. Sign me up for immortality. You definitely need all three to make it worthwhile.\n\nImmortality is definitely way too long as well as physically impossible. Ignoring the physical impossibility of surviving the heat death of the universe, what would you do with infinite time?\n\nThis is usually my argument with religious folks of why heaven and hell are both equally torture.\n\ninfinite time == infinite boredom == infinite toture\n\nThere's just nothing I want to do *forever*.", "is_submitter": false, "distinguished": null, "created_utc": 1626816044.0, "parent_id": "t1_h5wn4zj", "replies": [{"author": "Financial-Process-86", "id": "h5xb7cs", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #268", "submission": "oo3dz1", "stickied": false, "body": "hmm, I know I wouldn't get bored doing nothing. Breaking personal records, doing whatever I want. Eating 5 star foods, experimenting with an endless number of new foods. Setting up a self-sufficient terrarium. Playing guitar, learning new instruments. And once I've done everything. I don't see myself getting bored, I'm not that old, near 30, but I've noticed that people are very binary with the concept of immortality. They either like it or hate the idea of living forever, :shrug:\n\n&#x200B;\n\nignoring heat death and destruction of the universe of course. Assuming that I have the luxury of having a sufficient planet. Which is also of concern nowadays.\n\n&#x200B;\n\nIf we're doing hypotheticals, and with the way our planet is currently going. Immortality doesn't sound very good. lol.", "is_submitter": false, "distinguished": null, "created_utc": 1626816786.0, "parent_id": "t1_h5x9jpj", "replies": [{"author": "MisanthropicScott", "id": "h5xf55k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oo3dz1", "stickied": false, "body": "Different strokes I guess on boredom. I have a low boredom threshold.\n\nBut, I think we're in strong agreement about the state of the planet.", "is_submitter": false, "distinguished": null, "created_utc": 1626818556.0, "parent_id": "t1_h5xb7cs", "replies": []}]}]}]}, {"author": "Owyn_Merrilin", "id": "h5wyc45", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #259", "submission": "oo3dz1", "stickied": false, "body": "I would think in a hypothetical like this the question is more physical than actually time travel related. If it meant transplanting my current brain into my own body at some point in the past, I don't think I'd take the deal at all, and if I did it'd be to do things like buy bitcoin when it was going for pennies a coin. The times behind me were mostly worse than the present and what seems to be on the horizon, and I think if, say, current me got a chance to go back to high school and get a do-over on everything that follows, what few interpersonal regrets I have now still wouldn't play out the way I'd want them to because I'm not the person I was back then, and the further out I got from that starting point, the more different both I and the situations I found myself in would be.\n\nBut if you could physically change me into a fit 25 year old for all eternity, leaving me otherwise where I am right now? Fuck yeah I'd take that. And I think the answer would be the same no matter how old I got.", "is_submitter": false, "distinguished": null, "created_utc": 1626811252.0, "parent_id": "t1_h5w7b7s", "replies": [{"author": "MisanthropicScott", "id": "h5x9umf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oo3dz1", "stickied": false, "body": "> I would think in a hypothetical like this the question is more physical than actually time travel related.\n\nProbably. But, that does leave us talking about the very real future (or lack thereof) of our species.\n\n> But if you could physically change me into a fit 25 year old for all eternity, leaving me otherwise where I am right now? Fuck yeah I'd take that. And I think the answer would be the same no matter how old I got.\n\nEternity is definitely way too long as well as physically impossible. Ignoring the physical impossibility of surviving the heat death of the universe, what would you do with infinite time?\n\nThis is usually my argument with religious folks of why heaven and hell are both equally torture.\n\ninfinite time == infinite boredom == infinite toture\n\nThere's just nothing I want to do forever.", "is_submitter": false, "distinguished": null, "created_utc": 1626816180.0, "parent_id": "t1_h5wyc45", "replies": [{"author": "Owyn_Merrilin", "id": "h5xl9s5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #259", "submission": "oo3dz1", "stickied": false, "body": "Personally I think that shows a lack of imagination on par with the kind of guy who retires and then immediately gets a new job because he's bored (read: can't fathom how to fill his time without someone telling him what to do with it). It's an infinite universe, there's plenty to do even with infinite time.\n\nEspecially if you take into account that functional immortality doesn't have to mean indestructibility (so you're never so far above modern humans that you have nothing to lose, not is it impossible to die if the eternal boredom really does kick in), but if you do assume that it just opens up even more possibilities. You could literally explore the universe with 1950s tech if it was impossible to die. And you're immortal, so you wouldn't have to. You have infinite time to gather resources and build something better.\n\nAnd even a much weaker form where you're just young and healthy for a hundred years or so and then rapidly kick the bucket beats the hell out of the lingering decline we suffer from now.", "is_submitter": false, "distinguished": null, "created_utc": 1626821404.0, "parent_id": "t1_h5x9umf", "replies": []}]}]}]}]}]}, {"author": "Skastrik", "id": "h5vptsi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "oo3dz1", "stickied": false, "body": "I'd be willing just for the morbid curiosity of seeing how things will play out.", "is_submitter": false, "distinguished": null, "created_utc": 1626792600.0, "parent_id": "t1_h5vp35u", "replies": []}, {"author": "N0rthWind", "id": "h5vx9hz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #74", "submission": "oo3dz1", "stickied": false, "body": "OP is definitely being a little dramatic, but scientific progress focused on expanding the human lifespan is indeed being made. It's important to note that the first priority there is to increase the years spent in good health (aka young) rather than just expand the total duration of life with old age still starting to get real around 65.\n\nPeople in the future could live to see 250, and at 175 look like they're 35 today.", "is_submitter": false, "distinguished": null, "created_utc": 1626795747.0, "parent_id": "t1_h5vp35u", "replies": []}, {"author": "AndrewIsOnline", "id": "h5w7de5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "oo3dz1", "stickied": false, "body": "If I could be immortal I would", "is_submitter": false, "distinguished": null, "created_utc": 1626799924.0, "parent_id": "t1_h5vp35u", "replies": []}, {"author": "QuatroDoesGood", "id": "h5wz7z6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #55", "submission": "oo3dz1", "stickied": false, "body": "Not as bad if all your friends and family do too", "is_submitter": false, "distinguished": null, "created_utc": 1626811627.0, "parent_id": "t1_h5vp35u", "replies": []}]}, {"author": "xXxHelsinginHerraxXx", "id": "h5vrpdv", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #197", "submission": "oo3dz1", "stickied": false, "body": "Who would want such a fate", "is_submitter": false, "distinguished": null, "created_utc": 1626793410.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "haz_mat_", "id": "h5x182n", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "oo3dz1", "stickied": false, "body": "I'm in this camp. I think the whole \"live forever\" idea is a childish fantasy. Do we really want to immortalize the most murderous species this planet has ever seen? \n\nOP, I recommend you watch *Harold and Maude*.", "is_submitter": false, "distinguished": null, "created_utc": 1626812475.0, "parent_id": "t1_h5vrpdv", "replies": [{"author": "arokace", "id": "h5xfos9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "oo3dz1", "stickied": false, "body": "It's already began but not in a conspiracy way like OP is saying.  We already have learned of various methods that cause aging and have started researching how to counter them.  \n\n\nI personally would love to live forever or at the very least a lot longer than we currently live.  There's so much to life, so many things to learn, so many things to be discovered and see.", "is_submitter": false, "distinguished": null, "created_utc": 1626818808.0, "parent_id": "t1_h5x182n", "replies": [{"author": "haz_mat_", "id": "h5xhnvv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "oo3dz1", "stickied": false, "body": "I totally get it. And I think it's not a healthy way to look at life. It just further reinforces a feedback loop of \"consume as much as you can, as fast as you can, for as long as you can\" mentality.\n\nI think the longer you go, the less value your experiences have. Like how a stack of cash doesn't mean much to a billionaire, but has more value to someone struggling to pay rent.\n\nPlus, they might be able to hault biological aging, but the probability of being killed in various accidents will remain non-zero. The desire to control your fate and cheat death will eventually be met by something out of your control. On that line of thinking, eventually people would want to retire and die gracefully. Historically, I also think there would be problems for the king if he refused to yield to his heirs.", "is_submitter": false, "distinguished": null, "created_utc": 1626819715.0, "parent_id": "t1_h5xfos9", "replies": [{"author": "arokace", "id": "h603j96", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "oo3dz1", "stickied": false, "body": ">I totally get it. And I think it's not a healthy way to look at life. It just further reinforces a feedback loop of \"consume as much as you can, as fast as you can, for as long as you can\" mentality.\n\nTotally get it but then backhand with the \"you must be unhealthy\".  Its just merely not how you see life.  I want to see and learn about so many thing.  But with life being so short, it isn't possible.  Some how you see the want for knowledge as a want to consume everything.  It isn't, there are plenty of things I don't care about learning.  Plenty of things I don't care about consuming.  I already try to minimize my consumption too.  \n\n\n>I think the longer you go, the less value your experiences have. \n\nI personally have gained more from experiences as I've aged.  They aren't the same as when I was a child, for sure.  But they have gotten stronger and better over time as I mature and understand things more.  \n\n\nAs for the accident part... well that's mute.  Anti-aging doesn't imply anti-death... implies that when I'm 100 I'll hopefully have the body of a 20 year old still.  Granted I won't, already past 20 and I doubt anti-aging stuff will actually be a thing before I die or if it is I'll be probably to old for it to matter that much.  \n\n\nAnd I should rephrase, I do wish to live forever but more from the standpoint of I want to see what happens to the universe.  Obviously this really isn't possible because of the accident thing you said.  Something will happen.  But 500 years, that's doable, that's what I've thought about as enough time to explorer a lot of the things I want to understand.", "is_submitter": false, "distinguished": null, "created_utc": 1626875250.0, "parent_id": "t1_h5xhnvv", "replies": []}]}]}, {"author": "PersephoneOfTheNight", "id": "h5xnij4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "That's exactly how you're being conditioned to not like it, so the medium classes and the poor will never get the extended lifespan because they'd \"clutter the globe\", the common excuse is carbon footprint BS.\nSo they condition you to have a distaste to the things you are not meant to acquire. Not in a capitalist way such as material goods. But the immaterial ones. Their internal world is a meritocracy.\n\nTheir external world is a extreme capitalist, globalist dystopia.\nFor them, you're the donkey following the visible carrot, which would be material goods, but don't notice the master leading you on that eats better than you and lives longer than you too.", "is_submitter": false, "distinguished": null, "created_utc": 1626822463.0, "parent_id": "t1_h5x182n", "replies": [{"author": "haz_mat_", "id": "h5xsq6h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "oo3dz1", "stickied": false, "body": ">So they condition you to have a distaste to the things you are not meant to acquire.\n\nWe are all doomed to the same fate. Even if they are able to halt biological aging, there would still be a non-zero probability of dying from some accident that cannot be predicted. Time and statistics will eventually dethrone them. Plus, the rich do not live in a vacuum - it does not bode well for the king to refuse yielding power to his heirs.\n\nInstead, I posit that the wealthy are conditioning people to believe that living forever is a valid goal. Sort of as a way to get the masses to identify with them and to accept the pursuit of their goals. Almost like how they've conditioned people to believe the government should allow the rich to do as they please because they believe they will also be rich some day - the \"temporarily embarrassed millionaire\" syndrome that many people succumbed to.\n\nI think it's best to live a full life for the reasons you find valuable to yourself, and then to retire and die gracefully. Living forever and waiting for the unpredictable sounds a lot like purgatory to me.", "is_submitter": false, "distinguished": null, "created_utc": 1626824981.0, "parent_id": "t1_h5xnij4", "replies": []}]}]}, {"author": "Shorts-are-comfy", "id": "h5x4yrv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "If by \"such a fate\" you mean \"living twice or three times as long\", then I'd really love to be subject to such terrible fate.\n\nWho wouldn't want such a fate? Guess we have different views on the topic.", "is_submitter": false, "distinguished": null, "created_utc": 1626814073.0, "parent_id": "t1_h5vrpdv", "replies": [{"author": "arokace", "id": "h5xftuw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "oo3dz1", "stickied": false, "body": "Some people just have darker outlook on life I guess.  I don't know.  I'm personally with you.  There's so much to learn, see, do, experience, etc... To many things to do in one life time, that's for sure.", "is_submitter": false, "distinguished": null, "created_utc": 1626818874.0, "parent_id": "t1_h5x4yrv", "replies": []}]}, {"author": "atlasgaveup", "id": "h5vtijf", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "Evolution has helped us develop ways to cope with a finite life. We are pretty good at trying to convince ourselves that we have a choice in the face of the inevitable. However, that is just childish.\n\nYou cannot pretend to have a choice where no choice actually existed, that is intellectual dishonesty.\n\nIn the face of death, nearly every person would choose life. Studies show that nearly all attempted suicides regretted the decision at the very moment that they crossed the point of no return.", "is_submitter": true, "distinguished": null, "created_utc": 1626794189.0, "parent_id": "t1_h5vrpdv", "replies": []}]}, {"author": "Zealousideal_Mix_629", "id": "h5w23sf", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oo3dz1", "stickied": false, "body": "What makes you think they don't already have it?", "is_submitter": false, "distinguished": null, "created_utc": 1626797756.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "Rocknocker", "id": "h5wtug1", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #180", "submission": "oo3dz1", "stickied": false, "body": "The lack of evidence that they do.", "is_submitter": false, "distinguished": null, "created_utc": 1626809377.0, "parent_id": "t1_h5w23sf", "replies": [{"author": "arokace", "id": "h5xfdew", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "oo3dz1", "stickied": false, "body": "And its already public knowledge on the various ways the body ages, not some wealthy conspiracy..  And have already, publically known, start researching into these ways to counter them.  US military taking anti-aging pills for example.", "is_submitter": false, "distinguished": null, "created_utc": 1626818661.0, "parent_id": "t1_h5wtug1", "replies": [{"author": "Rocknocker", "id": "h5zzwxa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #180", "submission": "oo3dz1", "stickied": false, "body": "As I said. Anecdotes do not equal evidence.", "is_submitter": false, "distinguished": null, "created_utc": 1626873462.0, "parent_id": "t1_h5xfdew", "replies": [{"author": "arokace", "id": "h604gwm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "oo3dz1", "stickied": false, "body": "There's research out there on it.  Not full on clinical trails by any means because we don't know how to reverse the processes we have identified.  What I'm saying is that it isn't some conspiracy that only the rich and wealthy have it.  In fact we don't have it yet but we are learning.\n\nDoes appear the anti-aging pill thing was just a rumor mill.  But us understanding some of the processes that cause aging isn't.  \n\nI agree that OP's assertation on this whole thing is baseless.   Their whole argument that its true is \"you don't know what you don't know\" is ridiculous.", "is_submitter": false, "distinguished": null, "created_utc": 1626875696.0, "parent_id": "t1_h5zzwxa", "replies": []}]}]}]}]}, {"author": "1up_for_life", "id": "h5w3ti3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #277", "submission": "oo3dz1", "stickied": false, "body": "It will always be whatever society values most.", "is_submitter": false, "distinguished": null, "created_utc": 1626798459.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "campaigner1147", "id": "h5w99b7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo3dz1", "stickied": false, "body": "OP I just want to say that I love that you posted this and started a discussion on this topic. I find it fascinating and look forward to seeing more replies and the discussion that ensues. Thanks for sharing. :)", "is_submitter": false, "distinguished": null, "created_utc": 1626800705.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "Bexpert5", "id": "h5wmiu4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #162", "submission": "oo3dz1", "stickied": false, "body": "I'm sorry this is not going to be a contribution to the topic but... Welcome to the Syndicate", "is_submitter": false, "distinguished": null, "created_utc": 1626806269.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "MisterScruffyPoo", "id": "h5wwyw4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "Interesting ideas, but currently it looks like the longest living people are often rural and poor-ish. If it's a medical breakthrough that extends life, most in the western world will have access to it. If it's more like genetic manipulation then sure, but that could very well have negative consequences down the line.\n\nIf it's a democratic decision, my vote is we live pretty well long enough already. Doubling people's lifespans would be disastrous to our planet's resources.", "is_submitter": false, "distinguished": null, "created_utc": 1626810680.0, "parent_id": "t3_oo3dz1", "replies": [{"author": "atlasgaveup", "id": "h5xax42", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo3dz1", "stickied": false, "body": "You don't know what you don't know. You can't say for certain what technology or what advancements are being worked on behind the scenes.", "is_submitter": true, "distinguished": null, "created_utc": 1626816659.0, "parent_id": "t1_h5wwyw4", "replies": [{"author": "MisterScruffyPoo", "id": "h5xk8lg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "Sure. We don't know what we don't know. We are also aware there are people (some of them with lots of money/power) dedicated to finding a \"cure\" for aging. We are talking about what we think is possible/probable. It is also possible that we've already reached the limits of how long humans can live. \n\nI think if it were possible to dramatically extend a human life, it would be difficult to keep secret for long.", "is_submitter": false, "distinguished": null, "created_utc": 1626820914.0, "parent_id": "t1_h5xax42", "replies": []}]}]}, {"author": "Gilgameshbrah", "id": "h5x5air", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "Funny enough in every religion there have been people who were longe lived. Sometimes they reincarnated in other bodies while other times keeping the 'vessel' for hundreds of years.\n\nWould be interesting to see how this will weave itself into new age ideology.\n\nAlso consider the economic benefits of beeing wealthy enough to be able to afford such technology and through that having even more time to amass a fortune. If you think there is a wealth gap now, wait till they live 300 years while 'the peasents' die in their late 70s.\n\nFor now thou, the people who seem to live the longest aren't that rich. A healthy diet and exercise seem to play as much a roll as happiness and a sense of purpose. I read about those people who live to be 120 and most of the times they have jobs they like and an active social life. Not much money involved.", "is_submitter": false, "distinguished": null, "created_utc": 1626814209.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "Alpha-Charlie-Romeo", "id": "h5x6ind", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "oo3dz1", "stickied": false, "body": "Ah who cares.\n\nTake a look as far back as 1000 years ago. Society hasn't changed much at all since then. We're still ruled by a ruling class of people, the wealthy still have advantages over the poor, the ruling class still caters to the wealthy and the poor are still getting stepped on at every turn all in the name of \"We're protecting you\".\n\nIt's been like that for at least 1000 years. I imagine that 1000 years in the future nothing will have changed.", "is_submitter": false, "distinguished": null, "created_utc": 1626814726.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "An_Dr01d", "id": "h5x74bd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #66", "submission": "oo3dz1", "stickied": false, "body": "**Not on my watch.**", "is_submitter": false, "distinguished": null, "created_utc": 1626814983.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "metalhev", "id": "h5x8a5i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "So? Should we stop people from pursing longer lives? That's just murder with extra steps.", "is_submitter": false, "distinguished": null, "created_utc": 1626815489.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "Cheomesh", "id": "h5xcw8s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "oo3dz1", "stickied": false, "body": "Why the hell would I *want* to live double or triple this?  Good heavens.", "is_submitter": false, "distinguished": null, "created_utc": 1626817544.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "theomniexperience", "id": "h5xl4xs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "It isn't poverty but you say only the wealthy can achieve this...\n\nHow is the inequality not about poverty. People will be too poor to achieve what you suggest. \n\nTake a step back and rethink your title and argument.", "is_submitter": false, "distinguished": null, "created_utc": 1626821342.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "Savome", "id": "h5xt9ml", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #115", "submission": "oo3dz1", "stickied": false, "body": "If anyone has read/seen Altered Carbon this is one of the big themes of it. Rich people live forever and continually get richer because they have hundreds of years worth of wealth which grows compounding", "is_submitter": false, "distinguished": null, "created_utc": 1626825246.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "Theo0033", "id": "h5y747y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo3dz1", "stickied": false, "body": "You know, your enemies can die, but they breed and create new enemies...", "is_submitter": false, "distinguished": null, "created_utc": 1626831986.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "laserrobe", "id": "h61rzjn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #69", "submission": "oo3dz1", "stickied": false, "body": "If they haven’t solved the hayflick limit then idk about that much of an increase. I suppose stem cells from fetuses could deal with that thou.", "is_submitter": false, "distinguished": null, "created_utc": 1626900842.0, "parent_id": "t3_oo3dz1", "replies": []}, {"author": "LoreleiOpine", "id": "h5xabuf", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "oo3dz1", "stickied": false, "body": "The wealthy are cracking the code of human life spans? What are you talking about?", "is_submitter": false, "distinguished": null, "created_utc": 1626816394.0, "parent_id": "t3_oo3dz1", "replies": []}]}