{"title": "The wealthiest person that the world will ever know", "name": "t3_ooqnq8", "url": "https://www.reddit.com/r/TheFlyingTree/comments/ooqnq8/the_wealthiest_person_that_the_world_will_ever/", "selftext": "Will be the person that is the first person to put mining machines on asteroids or bodies within our system.\n\nThe next wealthiest person will be the first one to build and operate an orbital manufacturing facility.\n\nThe value in mitigating pollution/environmental concerns and the tax avoidance implications alone are massive. Not to mention the efficiency of manufacturing in clean and low or no gravity environments.", "score": 2, "upvote_ratio": 0.58, "permalink": "/r/TheFlyingTree/comments/ooqnq8/the_wealthiest_person_that_the_world_will_ever/", "id": "ooqnq8", "author": "atlasgaveup", "link_flair_text": "Discussion", "num_comments": 40, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1626876628.0, "comments": [{"author": "metalhev", "id": "h609w00", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ooqnq8", "stickied": false, "body": "Heat dissipation would be a logistical nightmare.", "is_submitter": false, "distinguished": null, "created_utc": 1626878148.0, "parent_id": "t3_ooqnq8", "replies": [{"author": "Golden-Snowflake", "id": "h60clq8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "ooqnq8", "stickied": false, "body": "Nahh, just need a good ole, Black body to dump it into.   \nOr one decent oven, with a hole cut in it.  /s", "is_submitter": false, "distinguished": null, "created_utc": 1626879337.0, "parent_id": "t1_h609w00", "replies": []}, {"author": "gerkletoss", "id": "h62gv3i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "What assumptions are leading you to that conclusion?", "is_submitter": false, "distinguished": null, "created_utc": 1626912586.0, "parent_id": "t1_h609w00", "replies": [{"author": "haz_mat_", "id": "h63ak9n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "ooqnq8", "stickied": false, "body": "Any machinery that produces excess heat can only be sinked through radiation. We typically rely on convection to handle that down here.", "is_submitter": false, "distinguished": null, "created_utc": 1626927974.0, "parent_id": "t1_h62gv3i", "replies": [{"author": "gerkletoss", "id": "h63bxsk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "Well first off that's not necessarily true. For instance, if we're talking about rockets to move asteroids, there are regenerative cooling options where the propellant doubles as a heat sink.\n\nAssuming you're talking about mining equipment though, it's a pretty well-studied problem. Radiators can be much larger and flimsier in microgravity, which is nice. There are also options like going very slowly, which is probably ideal for first generation asteroid harvesting where we're focusing on high-platinum asteroids and returning material to earth without processing it in space. There are also all kinds of neat hypothetical solutions like hoop radiators, open-cycle cooling options using iceteroids, microtube radiators, and curie point liquid droplet radiators.", "is_submitter": false, "distinguished": null, "created_utc": 1626928848.0, "parent_id": "t1_h63ak9n", "replies": [{"author": "haz_mat_", "id": "h63eq2h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "ooqnq8", "stickied": false, "body": "Oh sure, it's not a problem with an absence of solutions. The problem is scalability - hence the logistical problem. Heat dissipation is a challenge on our space station as it is, and that's just a small research platform.", "is_submitter": false, "distinguished": null, "created_utc": 1626930694.0, "parent_id": "t1_h63bxsk", "replies": [{"author": "gerkletoss", "id": "h63f7c9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "Heat dissipation was a problem that needed to be addressed for the ISS. One of the hardest parts of that was that it can't just stop operations if it gets too hot, and it has an extremely narrow acceptable temperature range thanks to human habitation. It still was just a matter of scaling existing solutions and making some small tweaks though. \n\nMining devices don't necessarily need to be large, and they could be attached to an open framework. The problem is extremely different. Mining devices could operate only when on the asteroid's night side, for instance. Keeping people alive inside something makes things \\*way\\* harder.", "is_submitter": false, "distinguished": null, "created_utc": 1626931030.0, "parent_id": "t1_h63eq2h", "replies": [{"author": "haz_mat_", "id": "h63u3kq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "ooqnq8", "stickied": false, "body": "Right - but no one has yet built any oribital industrial-scale facilities for processing raw materials or manufacturing. Smelting and forging in space may be possible, but at what point does it become cheaper? Stuff like that is still decades away, if not longer. \n\nMaybe we're in for a corporate space rush, but without a catalyst I think there's a lot more to it than just the tech side.", "is_submitter": false, "distinguished": null, "created_utc": 1626943566.0, "parent_id": "t1_h63f7c9", "replies": [{"author": "gerkletoss", "id": "h63upni", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "Which is why I said you start with just returning chunks to earth without processing. That's the base of prosperity from which the industry can be developed.", "is_submitter": false, "distinguished": null, "created_utc": 1626944135.0, "parent_id": "t1_h63u3kq", "replies": [{"author": "haz_mat_", "id": "h63vo8g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "ooqnq8", "stickied": false, "body": "Its still moot when its more cost effective to mine it here. Material would need to become much more expensive and launch costs much lower. Which is why i said its going to take decades, aside from any catalyst events. No one is getting rich off this any time soon.", "is_submitter": false, "distinguished": null, "created_utc": 1626945027.0, "parent_id": "t1_h63upni", "replies": [{"author": "gerkletoss", "id": "h63wrtm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "It will soon be more cost effective to mine gold and platinum from asterouds. Certain other elements will follow, and as the industry develops it will become cheaper to mine yet other elements in space as long as that is where they will stay.", "is_submitter": false, "distinguished": null, "created_utc": 1626946037.0, "parent_id": "t1_h63vo8g", "replies": []}]}]}]}]}]}]}]}]}, {"author": "empirebuilder1", "id": "h63lmwz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #219", "submission": "ooqnq8", "stickied": false, "body": "Nah not a nightmare, just a particularly annoying engineering problem. \n\n0g means you can build massive surface area radiators with minimal material. And most mining ops are going to be out farther than Earth where solar heat input will be lower, or just put your station behind the asteroid you're mining for shade.", "is_submitter": false, "distinguished": null, "created_utc": 1626935938.0, "parent_id": "t1_h609w00", "replies": []}]}, {"author": "Zealousideal_Mix_629", "id": "h608ozo", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "ooqnq8", "stickied": false, "body": "Explain your logic? Asteroids are mostly Iron, we have plenty of Iron on earth. It's not a precious metal. How will the company turn a profit with extremely high cost, and low price of the product?", "is_submitter": false, "distinguished": null, "created_utc": 1626877620.0, "parent_id": "t3_ooqnq8", "replies": [{"author": "John__Nash", "id": "h609uqr", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #17", "submission": "ooqnq8", "stickied": false, "body": "Iron, nickel, yes.  But also platinum and gold. Asteroid mining is definitely a thing in humanity's future (assuming we don't kill ourselves first).", "is_submitter": false, "distinguished": null, "created_utc": 1626878133.0, "parent_id": "t1_h608ozo", "replies": [{"author": "Zealousideal_Mix_629", "id": "h60cfnx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "ooqnq8", "stickied": false, "body": "Sure they have some rare metals but how feasible is it as a business? Expects estimates mabey 10 arevwithin a reasonable distance that may be worth mining.", "is_submitter": false, "distinguished": null, "created_utc": 1626879264.0, "parent_id": "t1_h609uqr", "replies": [{"author": "John__Nash", "id": "h60e0r5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #17", "submission": "ooqnq8", "stickied": false, "body": "It's not feasible right now, otherwise someone would be trying to do it. Space flight is currently too expensive and has too high of a failure rate. \n\nIn the future, we could launch autonomous rockets that would attach themselves to asteroids and push them into near-earth orbits. From there mining facilities would process them, extract the valuable components, and ship it down to earth.\n\nNone of this requires great technological leaps, just better efficiency with known capabilities.", "is_submitter": false, "distinguished": null, "created_utc": 1626879947.0, "parent_id": "t1_h60cfnx", "replies": []}, {"author": "gerkletoss", "id": "h62h4du", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "Some of them contain ten times more platinum than has ever been mined by humanity, all at very usable concentrations (platinum ore is usually at quite low concentrations anyway). This is because platinum is a siderophilic element under [Goldschmidt Classification](https://en.wikipedia.org/wiki/Goldschmidt_classification). Siderophilic elements like to bind with iron, and so sunk deep into the Earth's core during planetary formation. Most siderophilic elements currently on the Earth's surface are the result of the [Late Heavy Bombardment](https://en.wikipedia.org/wiki/Late_Heavy_Bombardment). In contrast, lithophilic elements like Uranium are much easier to get from Earth.\n\nAsteroid material sufficiently common on Earth can be used for manufacturing in space without the cost of bringing them up Earth's gravity well, leading to a boom in space exploration and colonization.", "is_submitter": false, "distinguished": null, "created_utc": 1626912716.0, "parent_id": "t1_h60cfnx", "replies": [{"author": "Zealousideal_Mix_629", "id": "h62u132", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "ooqnq8", "stickied": false, "body": "With the law supplied demand as soon as they start pulling it out the price will plummet making it unprofitable.", "is_submitter": false, "distinguished": null, "created_utc": 1626919004.0, "parent_id": "t1_h62h4du", "replies": [{"author": "gerkletoss", "id": "h62x2xg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "The law of supply and demand says the price will go down. It does not say it will instany plummet.", "is_submitter": false, "distinguished": null, "created_utc": 1626920480.0, "parent_id": "t1_h62u132", "replies": []}]}]}]}]}, {"author": "Golden-Snowflake", "id": "h60cg4o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "ooqnq8", "stickied": false, "body": "Imagine, churning out the entire Iron circulating on the earth, in a few hours, in space.   \n\n\nThis is what will happen, given a bit of that exponential curve, folks talk about, once things get rolling...", "is_submitter": false, "distinguished": null, "created_utc": 1626879269.0, "parent_id": "t1_h608ozo", "replies": []}, {"author": "atlasgaveup", "id": "h60d46j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "ooqnq8", "stickied": false, "body": "There are finite resources on this planet and with a population that will double around the year 2070. Iron is not the only resource on the bodies within our system. All elements should be represented. They can take the form of solids or gasses. Convertible energy is also available. \"Mining\" is a generic term used to represent the collection of raw resources including energy. Even if we use your strawman example of iron it is logical to assume that any finite resource that has a high enough demand will have value. The capitalist question is wether it is financially beneficial to mine bodies instead of mining the home planet. With rising concerns over climate change and pollution and the need for housing on available landmasses for population growth with an unknown cap then it is reasonable to say that mining the home planet will become problematic and that other options will be better options. Mining on the home planet requires the destruction of top layer vegetation and disturbance of topsoils in many industries not excluding iron, although some areas are less impacted than others. This has a very real environmental impact. \n\nI guess the question I have for you is in the year 2070 how are 13-15 billion people going to feel about mining in general? What laws will be passed. What kind of demand will there be for finite non-renewable resources. In the year 2150 the population could be 25-30 billion people potentially living on the only planet able to create renewable resources like wood. If iron is plentiful in our own backyard and only one tiny fraction of nearby objects (earth) can grow wood and food then what is the opportunity cost going to be for mining iron on earth?\n\nThat is my rebuttal for your strawman.\n\nThere are plenty of elements that are far rare on earth than iron and potentially unknown elements that may have made their way here from other systems. Mars is probably the largest opportunity for mining. Excavated mines make room for underground colonies that support the mining industry or other activities. Down the road water will be a tremendously sought-after resource considering that taking resources off-planet from the earth will likely be unlawful. Earth cannot be raided to supply resources to off-planet operations. Mars will likely have a tremendous demand for water as will any orbital stations of significant size. \n\nIn less time than many people may appreciate we will need a massive amount of resources to support travel within our system. Someone is going to design and build the equivalent of inner-system trains. Those transportation systems that transport resources, machines, and people across our system using the least amount of energy possible. There will be a Carnegie of the third stage of capitalism and the age of off-planet operations. It is very logical that they could build their wealth with iron alone (just addressing your question).", "is_submitter": true, "distinguished": null, "created_utc": 1626879556.0, "parent_id": "t1_h608ozo", "replies": []}, {"author": "WalkerYYJ", "id": "h61c8tw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ooqnq8", "stickied": false, "body": "Think longer term... The big value here is having access to relitivly high purity materials that are allready out of a major gravity well....\nThose are resources that can be used to build shipyards, stations, probes, drones, solar collectors, Dyson swarms, etc...\n\nThe long term picture here isn't money it's the eventual migration off earth based life moving into the broader solar system and moving us closer to a class 2 civilization...\n\nYes we're probably hundreds to a thousand years away from this(assuming some form of civilization survives that long) , but how many trillions of people could be supported across the whole system (assuming the infustructure and technology existed to support them?) \n\nLike.... A lot.... A lot more than you could ever support on just earth alone....\n\n\nTldr, I don't think it's a question of money in the long run. It's a question of advancing the needle on civilization hard and fast enough to skip over this bullshit shit storm we've managed to work ourselves into...\n\nLet's say you had large scale orbital or moon based refining, and fabrication today (we are a long ways away from this) ... You could start puking out reflectors and solar collectors and send them to approx earth's L1. Arrange them to occlude a few percentage points of earth's received sunlight, and redirect that energy to make more collectors, fuel, accelerate deep space probes, etc...\nThen you could gently tweek energy received by earth for a few hundred years while we start recapturing all the GHGs we've been burning willy nilly for the past few hundred years...", "is_submitter": false, "distinguished": null, "created_utc": 1626894227.0, "parent_id": "t1_h608ozo", "replies": [{"author": "Zealousideal_Mix_629", "id": "h61cuh8", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "ooqnq8", "stickied": false, "body": "And then the colonies will build Mobile Suites and declare their independence from all planetary governments. Yes, I have aslo watched that Science Fiction movie.", "is_submitter": false, "distinguished": null, "created_utc": 1626894479.0, "parent_id": "t1_h61c8tw", "replies": []}]}]}, {"author": "Owyn_Merrilin", "id": "h607jm4", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #259", "submission": "ooqnq8", "stickied": false, "body": "And this is why Musk, Branson, and Bezos are all working on space travel. Mars is just marketing. They want to mine asteroids.", "is_submitter": false, "distinguished": null, "created_utc": 1626877109.0, "parent_id": "t3_ooqnq8", "replies": [{"author": "empirebuilder1", "id": "h63li0f", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #219", "submission": "ooqnq8", "stickied": false, "body": "Mmm yummy unlimited rate earth metals", "is_submitter": false, "distinguished": null, "created_utc": 1626935824.0, "parent_id": "t1_h607jm4", "replies": []}]}, {"author": "ParadoxThief", "id": "h6276go", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ooqnq8", "stickied": false, "body": "ok", "is_submitter": false, "distinguished": null, "created_utc": 1626907766.0, "parent_id": "t3_ooqnq8", "replies": []}, {"author": "SavnetSinn", "id": "h64k0ty", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #73 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "I, too, have listened to Neil deGrasse Tyson.", "is_submitter": false, "distinguished": null, "created_utc": 1626961648.0, "parent_id": "t3_ooqnq8", "replies": [{"author": "atlasgaveup", "id": "h64k3n3", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "ooqnq8", "stickied": false, "body": "I have never listened to him. Cool comment though", "is_submitter": true, "distinguished": null, "created_utc": 1626961687.0, "parent_id": "t1_h64k0ty", "replies": [{"author": "SavnetSinn", "id": "h64t3bz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #73 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "He's been saying the exact same thing you did for a few years now. Here's the first clip I could find in a three-second search, though there are countless more. Time-stamped it for you: [https://youtu.be/XQV7DblvAT0?t=183](https://youtu.be/XQV7DblvAT0?t=183)\n\nI didn't intend to suggest your post isn't the result of original thinking, but your idea is still one that many of us have heard and evaluated already.\n\nMy hopes tack a different course in that I wish we'll have reined in certain excesses of capitalism by the time humans are capable of exploiting extraterrestrial resources (and we really need to or I suspect we won't even make it to the asteroid belt), but if not, your hypothesis is absolutely plausible.", "is_submitter": false, "distinguished": null, "created_utc": 1626965819.0, "parent_id": "t1_h64k3n3", "replies": []}]}]}, {"author": "sparant76", "id": "h60cdsr", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #51", "submission": "ooqnq8", "stickied": false, "body": "Is the person with the kindest heart", "is_submitter": false, "distinguished": null, "created_utc": 1626879242.0, "parent_id": "t3_ooqnq8", "replies": []}, {"author": "oliverjohansson", "id": "h60tt6v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #107", "submission": "ooqnq8", "stickied": false, "body": "I agree on the tax avoidance", "is_submitter": false, "distinguished": null, "created_utc": 1626886565.0, "parent_id": "t3_ooqnq8", "replies": []}, {"author": "Skastrik", "id": "h619ixs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "ooqnq8", "stickied": false, "body": "Pretty sure that profitable orbital mining will pretty much crash the economy of Earth. Mineral scarcity will be pretty much over.", "is_submitter": false, "distinguished": null, "created_utc": 1626893102.0, "parent_id": "t3_ooqnq8", "replies": [{"author": "gerkletoss", "id": "h62i76z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "There are tons of valuable elements that are easier to get on Earth than from asteroids, such as silver and aluminum.", "is_submitter": false, "distinguished": null, "created_utc": 1626913243.0, "parent_id": "t1_h619ixs", "replies": []}]}, {"author": "prajnadhyana", "id": "h621upg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "ooqnq8", "stickied": false, "body": ">Will be the person that is the first person to put mining machines on asteroids or bodies within our system.\n\nI doubt it. The sudden increase in the amount of rare metals on the market would send the prices into the basement.", "is_submitter": false, "distinguished": null, "created_utc": 1626905256.0, "parent_id": "t3_ooqnq8", "replies": [{"author": "gerkletoss", "id": "h62icq7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": "A lot of these elements are used for industrial applications, so the pricing is pretty elastic. This isn't like the old days where gold was solely a status symbol.", "is_submitter": false, "distinguished": null, "created_utc": 1626913316.0, "parent_id": "t1_h621upg", "replies": []}]}, {"author": "gerkletoss", "id": "h62gtd9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "ooqnq8", "stickied": false, "body": ">the person that is the first person to put mining machines on asteroids or bodies within our system.\n\nIt's pretty unlikely that the first person to do this will be the wealthiest person ever. Someone will come along and do it better.", "is_submitter": false, "distinguished": null, "created_utc": 1626912562.0, "parent_id": "t3_ooqnq8", "replies": []}, {"author": "bernpfenn", "id": "h67dcjy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "ooqnq8", "stickied": false, "body": "all this noise about how to bring it back to earth.\nwhat about using it for space stations and bases and more rocket hulls.", "is_submitter": false, "distinguished": null, "created_utc": 1627008212.0, "parent_id": "t3_ooqnq8", "replies": []}]}