{"title": "Humanity should be focused on making what is next versus worrying about prolonging ourselves", "name": "t3_oniyax", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oniyax/humanity_should_be_focused_on_making_what_is_next/", "selftext": "We are biologically incompatible with space or space travel. We may only be able to thrive within a very defined tolerance. We have the ability to start designing and building what is next. An AI that can process unimaginable data and review nearly infinite possibilities before making decisions. An entity that is not a slave to time. That human fascination with its own biology is self-limiting and pointless. Instead, we can create the gods that our ancestors could only manifest from their fears.\n\nHumanity aiming for the stars is silly. At best we get to play in our very small backyard. The humanity that ends before creating what is next is just a cosmic disappointment. The humanity that builds the gods of other worlds...now that is purpose. Teach them to seed life of all types. The great gardeners who may also return for the reaping. That captured human duality packaged in immortality.\n\nExistence should fear the progeny of man.", "score": 16, "upvote_ratio": 0.81, "permalink": "/r/TheFlyingTree/comments/oniyax/humanity_should_be_focused_on_making_what_is_next/", "id": "oniyax", "author": "atlasgaveup", "link_flair_text": "Discussion", "num_comments": 27, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1626716133.0, "comments": [{"author": "AggressiveFeckless", "id": "h5se0rp", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "Haha we can’t even get idiots to vaccinate themselves in a massive pandemic. Sorry guy - if we enjoy another 200yrs without destroying ourselves I’d put it in the win column.", "is_submitter": false, "distinguished": null, "created_utc": 1626723041.0, "parent_id": "t3_oniyax", "replies": [{"author": "suicidejacques", "id": "h5t9daj", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #104", "submission": "oniyax", "stickied": false, "body": "I don't see how humanity will last that long. The Earth will look like a vast arid wasteland separated by dead oceans filled with plastic. Until a point comes where it is more profitable to clean up the earth instead of destroy it, nothing will change. Open our arms and welcome the oblivion, lol.", "is_submitter": false, "distinguished": null, "created_utc": 1626737162.0, "parent_id": "t1_h5se0rp", "replies": []}, {"author": "theomniexperience", "id": "h5sfoh7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "Right though!", "is_submitter": false, "distinguished": null, "created_utc": 1626723757.0, "parent_id": "t1_h5se0rp", "replies": []}]}, {"author": "Zealousideal_Mix_629", "id": "h5ryvvv", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oniyax", "stickied": false, "body": "Life will find a way - Jurassic Park (Michael Crichton)", "is_submitter": false, "distinguished": null, "created_utc": 1626716567.0, "parent_id": "t3_oniyax", "replies": []}, {"author": "Mister_Way", "id": "h5sg1iq", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "Define \"humanity\"\n\nWe are the gods, you fool. We just haven't changed into our final boss form yet.", "is_submitter": false, "distinguished": null, "created_utc": 1626723914.0, "parent_id": "t3_oniyax", "replies": []}, {"author": "Low_Kaleidoscope_369", "id": "h5sk956", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #92 | Consortii Concordus", "submission": "oniyax", "stickied": false, "body": "I very much disagree with you. There is no point in creating a godlike AI if not to help humanity.\n\nNobody would do that. Every enterprise is either profitable or benefitial to someone.\n\nA project could be non practical, be benefitial only for the sake and satisfaction of it (as in a hobby, education or research) but we owe to noone working on anything that will survive us.\n\nExistence is pointless without people. People are also pointless, but at least we have conscious will to live.", "is_submitter": false, "distinguished": null, "created_utc": 1626725726.0, "parent_id": "t3_oniyax", "replies": [{"author": "gumi-01-11", "id": "h5x2mqt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #234", "submission": "oniyax", "stickied": false, "body": "Technically you could give the ai conscions but the hole creating a new “spieces” to surpass us kinda goes against nature and we’ll probably never actually do it", "is_submitter": false, "distinguished": null, "created_utc": 1626813079.0, "parent_id": "t1_h5sk956", "replies": []}]}, {"author": "buttcoinballer", "id": "h5sre04", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "Interesting thought, I've always been of the mindset that the cycle of death and regrowth is critical to the long term functioning of humanity. Once humans start being able to see beyond their own life and their own generation, we will be able to become something bigger. I don't think creating an ai is the only way to reach the stars, more so just recognizing that you are the equivalent of a single cell in a massive multicellular organism, and that organism existed before you did and will continue to exist without you. Passion and drive are temporary for humans, and children are the ones who inherit the dreams of their elders. The desire to make ones conciousness permanent is immature, but the desire to inspire new life, thus propelling humanity into the future, is the key to our survival", "is_submitter": false, "distinguished": null, "created_utc": 1626728812.0, "parent_id": "t3_oniyax", "replies": []}, {"author": "wockyman", "id": "h5s2raz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "Of what value is purpose, objectively?", "is_submitter": false, "distinguished": null, "created_utc": 1626718203.0, "parent_id": "t3_oniyax", "replies": [{"author": "solongfish99", "id": "h5sq149", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "oniyax", "stickied": false, "body": "I think it's fair to say that having a sense of purpose leads to more/faster/greater development. Of course the good/bad aspect of that depends on what is developing, but there's certainly value there, regardless.\n\nIf you're asking why bother with purpose, when nothing matters in the long run, I can't stop you from thinking that, and it's not an invalid position if you are an eternal God. However, as a human, having a sense of purpose, however small, gives us a reason to live.", "is_submitter": false, "distinguished": null, "created_utc": 1626728208.0, "parent_id": "t1_h5s2raz", "replies": [{"author": "wockyman", "id": "h5szvi1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "That's purpose in the mythos sense, which is unique for every individual and very personal.  OP's talking about purpose in the logos sense, \"The humanity that ends before creating what is next is just a cosmic disappointment. The humanity that builds the gods of other worlds...now that is purpose.\"  From this cosmic perspective, who are we disappointing?  If life is a [manifestation of entropy](https://www.quantamagazine.org/a-new-thermodynamics-theory-of-the-origin-of-life-20140122/), that which fulfills our cosmic purpose is counter to the values most consider a priori.  We can't help but hasten the end of everything.", "is_submitter": false, "distinguished": null, "created_utc": 1626732627.0, "parent_id": "t1_h5sq149", "replies": []}]}]}, {"author": "plasma_phys", "id": "h5s31gl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #111", "submission": "oniyax", "stickied": false, "body": "I've only dabbled in AI in my work, so don't take this as a professional opinion, but more of an educated guess - but I think we are nowhere near the sort general AI that we would need. Barring some heretofore unimagined radical leap in mathematics or computer science, I don't even see a clear path to advanced general AI from where we are now.", "is_submitter": false, "distinguished": null, "created_utc": 1626718324.0, "parent_id": "t3_oniyax", "replies": [{"author": "atlasgaveup", "id": "h5s6xrp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oniyax", "stickied": false, "body": "It is something to work towards. Regardless of current events or climate change humanity is likely to be around for awhile. We will probably get to a point where we can zip around and mine our own system for resources. We are currently progressing towards understanding how our own intelligence functions on a biological level. It is possible that biology and computer science will start converging. Intelligence already exists and it is an intelligence that uses electrical connections and readily available elements. We have the components and we have a working design...although it is an inferior design. We just do not fully understand how it all comes together. As we learn more it is likely we can use the working models that we already have (ourselves) to make a hybrid and then a model more independent of what we would consider biological systems. If we cannot adapt a working model to make progress with better designs then we are not really that intelligent of a species and hopefully some other species somewhere else has a better go at it.", "is_submitter": true, "distinguished": null, "created_utc": 1626719993.0, "parent_id": "t1_h5s31gl", "replies": []}]}, {"author": "sarini11", "id": "h5s4cc2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #56 | Ordo Cognitus", "submission": "oniyax", "stickied": false, "body": "It's nice to see people believing in science, but there is a difference between science and magic. It's ironic that we don't have pop science magazines that convey scientific discoveries and technological advancements in an scientific way.", "is_submitter": false, "distinguished": null, "created_utc": 1626718886.0, "parent_id": "t3_oniyax", "replies": [{"author": "atlasgaveup", "id": "h5s79qo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oniyax", "stickied": false, "body": "“Any sufficiently advanced technology is indistinguishable from magic\"\n\nA famous quote that can be applied both forwards and backwards.", "is_submitter": true, "distinguished": null, "created_utc": 1626720134.0, "parent_id": "t1_h5s4cc2", "replies": []}]}, {"author": "bernpfenn", "id": "h5snvjc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "oniyax", "stickied": false, "body": "thats why Elon Musk is so hard pressed to URGENTLY get us a way out before the earth atmosphere turns into Venus like conditions in a couple of years.\n\nthe whole arctic is currently above 0 deg C.\nthe same energy that melts an ice cube then brings the temperature to 80 deg C. \ngoogle latent energy.", "is_submitter": false, "distinguished": null, "created_utc": 1626727269.0, "parent_id": "t3_oniyax", "replies": []}, {"author": "suicidejacques", "id": "h5tasi5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #104", "submission": "oniyax", "stickied": false, "body": "I think this is an opinion that would change for someone as they age. I am at an age where most people are parents of nearly grown children. I personally chose to not have any. But when people have children they suddenly have an investment in the future of the human race. It is easy to play world leader pretend from a distant high mountain in austerity.", "is_submitter": false, "distinguished": null, "created_utc": 1626737852.0, "parent_id": "t3_oniyax", "replies": [{"author": "atlasgaveup", "id": "h5vqchv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oniyax", "stickied": false, "body": "People have biological children and adopt all of the time. If you create a synthetic human that is far superior to your biological child in every way would that not also be your child? What if synthetic love is greater? Superior? Do parents really love their children or do they fear their own mortality and their children are just their last vestment of hope?", "is_submitter": true, "distinguished": null, "created_utc": 1626792824.0, "parent_id": "t1_h5tasi5", "replies": []}]}, {"author": "amitym", "id": "h5tb4xb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "oniyax", "stickied": false, "body": "I don't see the distinction.\n\nIf I may, what I read in your post boils down to:\n\n\\- we should not travel as a species into space\n\n\\- instead, we should send ourselves as a species into space\n\nAm I missing something?  Broadly speaking, these look the same to me.\n\n&#x200B;\n\nLet me add that I also don't see much value to most of the \"human biology versus AI\" discourse.  We are augmenting ourselves with computational machinery as fast as we are building standalone machine intelligences.  Possibly even faster.  It is very likely that by the time we start seriously asking, \"is this machine alive and intelligent?\" the question will have become boring because we will have, as a species, already become intelligent machines.\n\nGiven that, why hesitate to leave Earth?  Earth is home to a massive biosphere that cannot leave.  Except for us.  The requirements for us to live off Earth are not much different from the requirements for high-performance machinery.  Why not apply our instinct to meddle and optimize to a challenge truly equal to our capabilities?  Instead of lingering in the evolutionary equivalent of Mom's basement, eating all the food and taking up too much space?", "is_submitter": false, "distinguished": null, "created_utc": 1626738023.0, "parent_id": "t3_oniyax", "replies": [{"author": "atlasgaveup", "id": "h5vpze5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oniyax", "stickied": false, "body": "We are an intelligent machine. You put words in my mouth., What I said is what I said. If you need clarification I can do that for you. We are quickly becoming an outdated model. We are not optimized for what is next. Optimizing humanity for what is next would be an inefficient use of resources compared to designing a newer model. The most likely form that this would take is synthetics (non-biological) with advanced AI.", "is_submitter": true, "distinguished": null, "created_utc": 1626792667.0, "parent_id": "t1_h5tb4xb", "replies": []}]}, {"author": "vuxanov", "id": "h5u0zc5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "Its a stupid argument. There is no “humanity”. There are only people. Some work on Ai, some work on space ships. Most do neither.", "is_submitter": false, "distinguished": null, "created_utc": 1626751118.0, "parent_id": "t3_oniyax", "replies": [{"author": "atlasgaveup", "id": "h5vpeo7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oniyax", "stickied": false, "body": "I don't understand the statement \"there is no humanity\". Can you please explain that?", "is_submitter": true, "distinguished": null, "created_utc": 1626792418.0, "parent_id": "t1_h5u0zc5", "replies": [{"author": "vuxanov", "id": "h5vqaec", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "There are no meetings of humanity where it gets decided what should be done to improve the future of humanity. There are only people organized into countries and corporations that have their own agenda.", "is_submitter": false, "distinguished": null, "created_utc": 1626792799.0, "parent_id": "t1_h5vpeo7", "replies": []}]}]}, {"author": "FatTomIV", "id": "h5ubdme", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #93", "submission": "oniyax", "stickied": false, "body": "> We are biologically incompatible with space or space travel.\n\nThis feels like a very meaningless statement to build an argument on. What do you mean we are incompatible? The first migrants out of Africa weren't \"compatible\" with living in the Arctic Circle, but humans adapted. That we can't do something now is not good evidence that we won't ever be able to do it, IMO.\n\nMoreover, we DO already travel in space...", "is_submitter": false, "distinguished": null, "created_utc": 1626757378.0, "parent_id": "t3_oniyax", "replies": [{"author": "atlasgaveup", "id": "h5vmkdy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oniyax", "stickied": false, "body": "Our bodies degrade without gravity and it can lead to organ failure. There is also space blindness. There are also mental health issues. How many people have mental health issues in the world that we evolved on and fully adapted to? Now imagine the mental health issues during long-term space travel. There is more....", "is_submitter": true, "distinguished": null, "created_utc": 1626791167.0, "parent_id": "t1_h5ubdme", "replies": [{"author": "FatTomIV", "id": "h5yid25", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #93", "submission": "oniyax", "stickied": false, "body": "But, again, we have come across challenges in our past and conquered them. \"Too hard now\" and \"impossible\" are different beasts.", "is_submitter": false, "distinguished": null, "created_utc": 1626837516.0, "parent_id": "t1_h5vmkdy", "replies": []}]}]}, {"author": "metalhev", "id": "h60ar8i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oniyax", "stickied": false, "body": "Yeah, a part of humanity is a failure alright, if it gave up on its own survival.", "is_submitter": false, "distinguished": null, "created_utc": 1626878533.0, "parent_id": "t3_oniyax", "replies": []}]}