{"title": "Although it’s likely we wouldn’t be able to reverse engineer any very advanced alien technology we discover theres still so much we could learn from it", "name": "t3_pgs1mf", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pgs1mf/although_its_likely_we_wouldnt_be_able_to_reverse/", "selftext": "Contrary to popular belief if we found a crashed alien ship in a cave somewhere we would not be able to reverse engineer it in a week. It would probably take a century just for us to start breaking down some of the simpler things. But there are a few things we could learn from it immediately that would advance our scientific knowledge by centuries if not millennia.\n\n\n•If it’s equipped with some kind of warp drive using exotic matter we learn two things: FTL is possible and exotic matter exists. This knowledge alone would shake up everything we know about science\n\n•If it’s powered by nuclear fusion or some other advanced power source like antimatter we know that energy positive fusion or whatever the power source ends up being is possible \n\n•If it’s made using extremely advanced materials we might not be able to replicate them but we do know that it’s *possible* for such a material to exist\n\n•Confirms that interstellar travel is possible. \n\n•Confirms aliens exist\n\n\nEven though we might not be able to use any of the tech from it just the knowledge that it’s *possible* would change science as we know it.", "score": 15, "upvote_ratio": 0.94, "permalink": "/r/TheFlyingTree/comments/pgs1mf/although_its_likely_we_wouldnt_be_able_to_reverse/", "id": "pgs1mf", "author": "ATR2400", "link_flair_text": "Other", "num_comments": 15, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630621208.0, "comments": [{"author": "Concrete_Grapes", "id": "hbdo30k", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pgs1mf", "stickied": false, "body": "i think you'd underestimate the ability of people to research things that exist. If it exists, its now pretty easy to reverse engineer it--or at least know how to do that. We have electron microscopes, and can actually SEE single atoms and how thy're interacting in materials now. We can see photons ffs. We'd know within weeks the 'how' of any material they made was made. We are also aware of what everything can be made of, it's not like they'd introduce something we didnt know existed, or could exist. Antimatter as well. None of this would currently be a mystery.   \n\n\nThere are a few manufacturing processes that would take some time, to be sure, and arguably, some might not be possible. There are materials that we could force atoms to align themselves into that would be incredible to use as tech--thousands of times stronger or lighter or more powerful that we have--but if it takes a billion kwh'rs per gram to make the shit (like, capturing a fucking sun as a power plant), then we might know HOW, and just literally never be able to. There's some materials like that in science already. They can make a few molecules of it, but it takes WEEKS of effort.   \n\n\nBut it's also quite unlikely that any other civilization has reached that level as well. Life on earth has roots about a quarter the age of the universe. The chances that any life started in the hot, chaotic, super catastrophic universe the billions or years BEFORE our planet that'd be needed to reach the power capability to harvest suns to power their development--is near absolute zero anyway (mostly because if they're that old, their OWN suns died before they could get that developed, they'd have to have reached a NEW sun, BEFORE they developed that--and that really, truly is probably absolute zero).   \n\n\nSo, not gonna worry.   \n\n\nIt could be interesting to find that some nearby star has life, something within 50 light years or something, and they sent out AI satellites millions of years ago to survey our system, and return--if we catch one of those, imagine the explaining we'd have to do. It might be interesting if we actually CAPTURED one--because..   \n\n\nand here's the kicker...   \n\n\nWe can figure out their tech with ease...   \n\n\nbut we will NEVER be able to read their language. We have earth languages that have died and we cant read. even AI is terrible at it. Harrapan, for example.   \n\n\nSo no matter what tech they ever put on there, even if they wrote out the EXACT method to open a wormhole to their world with the power required to power a 100 watt light, we'd NEVER know how to do it. We're terrible with language.", "is_submitter": false, "distinguished": null, "created_utc": 1630625005.0, "parent_id": "t3_pgs1mf", "replies": [{"author": "plasma_phys", "id": "hbdrds5", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #111", "submission": "pgs1mf", "stickied": false, "body": "Agree 100% with this. As Wittgenstein said, \"If a lion could speak, we would not be able to understand him.\" Stanislaw Lem's *His Master's Voice* is a realistic take on what happens after Earth receives an apparent signal from an extraterrestrial intelligence, and well worth a read for anyone interested in first contact as a subject for science fiction.", "is_submitter": false, "distinguished": null, "created_utc": 1630626596.0, "parent_id": "t1_hbdo30k", "replies": []}, {"author": "ATR2400", "id": "hbdow5r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "pgs1mf", "stickied": false, "body": "It’s all hypothetical. In a realistic scenario I’d agree with you that real aliens are probably only marginally better or worse than us technologically. Life, especially intelligent like takes billions of years to evolve. It took billions for the sun to emerge, and a while more for the earth, then a little more for the first cells and then a few billion years for us to reach humanity. I’d say it’s possible that humanity and the other intelligent species that are out there are among the first in the universe. And the others are probably about the same as us, give or take a century or two. The universe is only 13 billion years old out of a lifespan of more than trillions of years. We’re essentially right at the beginning at the universe relative to its expected lifespan. It’s possible that life just hasn’t had time to evolve en masse yet and Earth is part of the beginning of a new golden age for life in the universe. \n\nIf my comment is locked reply to yourself and lll check it", "is_submitter": true, "distinguished": null, "created_utc": 1630625399.0, "parent_id": "t1_hbdo30k", "replies": []}, {"author": "zebediah49", "id": "hbej0b7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #131", "submission": "pgs1mf", "stickied": false, "body": "> \n> \n> but we will NEVER be able to read their language. We have earth languages that have died and we cant read. even AI is terrible at it. Harrapan, for example.\n> \n> So no matter what tech they ever put on there, even if they wrote out the EXACT method to open a wormhole to their world with the power required to power a 100 watt light, we'd NEVER know how to do it. We're terrible with language.\n\nIt's less that we're bad at language, and more that language has an infinite space of things it *could* represent.  If you never have anything linking a section of language text to some meaning, you can't do much to decipher it.\n\nSo it really depends on how much alien language is available to work with.  Find a picture book for kids, and you've got a decent start.  Similarly, a set of flatpack furniture instructions (the kind that's half picture half text) would do well as well.  Or a math textbook.  Basically anything where we can work out the meaning from context, and then use that to back out an approximate expectation of what the written language corresponds to.  Then you can use that to start filling in parts of other texts, and iteratively refine your understanding of that language.\n\n---\n\nJust contrast that Indus Script example with a single modern academic paper.  Instead of \"short groups, rarely more than 30 characters\", we have \"pages of contiguous text\".  But it's also interspersed with figures, titles, captions, axes, etc., with a ton of repetition around the important parts.  That would be *much* easier to extract meaning from.", "is_submitter": false, "distinguished": null, "created_utc": 1630639766.0, "parent_id": "t1_hbdo30k", "replies": []}, {"author": "gerkletoss", "id": "hbfbkit", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "pgs1mf", "stickied": false, "body": "I don't think it's impossible to create a rosetta stone for an alien civilization. Extremely difficult, sure, but if the will is the I'm sure it could be done.", "is_submitter": false, "distinguished": null, "created_utc": 1630659746.0, "parent_id": "t1_hbdo30k", "replies": []}]}, {"author": "Alatain", "id": "hbdlop2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pgs1mf", "stickied": false, "body": "A minor correction, we already know that \"energy positive fusion\" is possible. We have also already produced it. It is just in an inconvenient form (stars and hydrogen bombs). We can harvest sources like that for energy just fine. Drop a bomb into a large water source and harvest the heat and you can generate positive gains from a fusion bomb. Ride the blast and you can get to around 4-5% of light speed.", "is_submitter": false, "distinguished": null, "created_utc": 1630623873.0, "parent_id": "t3_pgs1mf", "replies": [{"author": "jixxor", "id": "hbdwilm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #288", "submission": "pgs1mf", "stickied": false, "body": ">Ride the blast\n\n*Quake III arena flashbacks intensify*", "is_submitter": false, "distinguished": null, "created_utc": 1630629033.0, "parent_id": "t1_hbdlop2", "replies": []}, {"author": "SuperfluousApathy", "id": "hberm0n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #492", "submission": "pgs1mf", "stickied": false, "body": "We are getting pretty damn close at breaking even with some fusion reactors tho. I think we are gonna see it in a generation. Idk if we will see it functioning as a long term power source anytime soon tho. Lots of weird hoops to get over. Like hydrogen pellet delivery.", "is_submitter": false, "distinguished": null, "created_utc": 1630644550.0, "parent_id": "t1_hbdlop2", "replies": []}]}, {"author": "Muroid", "id": "hbdix5v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "pgs1mf", "stickied": false, "body": "How quickly and how much we could learn from any hypothetical alien ship depends entirely on the ship. There’s literally no timeline for how long it would take to reverse engineer it because there’s no precedent for finding one and we have no idea what one would look like if we did.\n\nMaybe it’s something so simple in its operation that we could do it comparatively quickly. Maybe it has an on-board matter replication machine, instructions for how to build and operate all of its technology using easy-to-follow instructional videos and we could be cranking out alien tech ourselves within the week.\n\nMaybe it operates in a way that we will fundamentally never be able to understand or utilizes resources that we cannot acquire or synthesize for ourselves on Earth and we’ll never be able to reverse engineer it.\n\nHeck, maybe it’s a complete and total black box whose physical presence gives absolutely no indication to us of how it is constructed, how it operates or even really what it is.", "is_submitter": false, "distinguished": null, "created_utc": 1630622593.0, "parent_id": "t3_pgs1mf", "replies": [{"author": "ATR2400", "id": "hbdm2c7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "pgs1mf", "stickied": false, "body": "If it utilizes resources we can’t get on earth it doesn’t mean we’ll never be able to get them. We’ll just have to get on their level and go *beyond* earth for answers. That might mean though that by the time we can reverse engineer it we won’t need to. After all it’s possible for it to exist and I don’t believe in magic. We just need to find the right conditions. But then again those conditions might take 3000 years to find and we’ll have something better by then\n\nBut you’re right it could also just be a black box or a gift ship that contains tons of knowledge. Like the OP version of Voyager but with FTL and way more stuff\n\nIf you can’t reply here reply to yourself and I’ll check it", "is_submitter": true, "distinguished": null, "created_utc": 1630624047.0, "parent_id": "t1_hbdix5v", "replies": []}]}, {"author": "Cynn13", "id": "hbdt5an", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #123 | Ordo Cognitus", "submission": "pgs1mf", "stickied": false, "body": "The best part of that ship being found would be the passion for space travel existing again. After the moon landing people just kinda... Stopped caring about space.", "is_submitter": false, "distinguished": null, "created_utc": 1630627440.0, "parent_id": "t3_pgs1mf", "replies": [{"author": "ATR2400", "id": "hbdxl6d", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "pgs1mf", "stickied": false, "body": "Yep. Humanity really just kinda gave up on space after the moon landing. We stopped dreaming. Our next step should have been working on getting men on Mars with the rovers being a *preparatory* operation for the bigger picture and to augment our manned exploration, not the entire thing. Instead we grew stagnant and found ourselves comfortable with just launching a few probes into the void every few years and some dinky satellites into orbit. I don’t mean to insult all the scientists who worked hard on these projects of course, they’re still marvels of engineering. But we could have been so much *more*", "is_submitter": true, "distinguished": null, "created_utc": 1630629535.0, "parent_id": "t1_hbdt5an", "replies": []}]}, {"author": "naivenb1305", "id": "hbemu70", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgs1mf", "stickied": false, "body": "I agree. But a ship usually doesn't contain the most advanced tech. We would only be stumbling across a snippet of the possibilities of alien tech. \n\nUsing FTL travel without having fully reverse engineered the ship might be futile. What's to say that the alien civ might be hostile to having its tech stolen. I think the core of the alien civ would be much more sophisticated still, and could win in a duel.", "is_submitter": false, "distinguished": null, "created_utc": 1630641770.0, "parent_id": "t3_pgs1mf", "replies": [{"author": "ATR2400", "id": "hben3fo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "pgs1mf", "stickied": false, "body": "I think any reasonably alien civilization would understand that if you send your tech to the homeworld of an intelligent species and take many centuries to recover it and put no warnings then its kind of their fault, not ours", "is_submitter": true, "distinguished": null, "created_utc": 1630641909.0, "parent_id": "t1_hbemu70", "replies": [{"author": "naivenb1305", "id": "hbeotgw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgs1mf", "stickied": false, "body": "You are correct, but what if they set up warnings in case of intelligent life finding a crashed ship. They could use images of life forms being hurt and an X over a drawing of their ship.", "is_submitter": false, "distinguished": null, "created_utc": 1630642880.0, "parent_id": "t1_hben3fo", "replies": []}]}]}]}