{"title": "What are your thoughts on alternatives to traditional biochemistry?", "name": "t3_p1m0im", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p1m0im/what_are_your_thoughts_on_alternatives_to/", "selftext": "You all seem like smart people so I figured if anyone would be up for a discussion about this it’d be you. We all know that life on earth is carbon based and that we need water to survive. Pretty simple, right? But what if that isn’t the only way for life to exist. There are alternatives to the traditional biochemistry we know.\n\nThe most popular is of course using silicon in place of carbon. There are some problems of course. Silicon isn’t quite as good as good as carbon but still it can’t be ruled out as a basis for at least microbial life. Life tends to find a way and who’s to say that if carbon isn’t an option that the next best thing will have to do?\n\nThere are also alternative solvents. Water is our main solvent. It’s what we drink to you know… not die. The big two alternatives to water I’ve seen are ammonia and methane. Methane is more well known thanks to Titan popularizing the idea of methane drinking microbes. Ammonia isn’t quite as popular but I find it really really cool. Ammonia is a very common molecule just like H2O and is quite similar to water fundamentally. It even has a similar structure. Ammonia’s capabilities as a solvent give water a run for its money as well. It has its problems of course but once again life finds a way and in  the absence of water ammonia might just be good enough. \n\nThe biggest problem with ammonia and methane are that they don’t like to be liquid at Earth temperature and pressures. For an ammonia or methane hydrosphere to exist the planet would either need to be really cold or have high pressure. This could have an interesting effect on possible life. \n\n\nMy opinion would have to be the fairly boring one that alternatives to life as we know it are very cool. I have a soft spot for ammonia based life and play as an ammonia based species in a geopolitical space roleplay. Whether or not ammonia and silicon could support intelligent life is a whole other question but I could definitely see microscopic lifeforms making it work.", "score": 3, "upvote_ratio": 0.64, "permalink": "/r/TheFlyingTree/comments/p1m0im/what_are_your_thoughts_on_alternatives_to/", "id": "p1m0im", "author": "ATR2400", "link_flair_text": "Discussion", "num_comments": 18, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628588940.0, "comments": [{"author": "FnchWzrd314", "id": "h8ebsc0", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "p1m0im", "stickied": false, "body": "I remember hearing about a theoretical plastic based biosphere. It was on a planet that had an atmosphere that was similar to earth, but with chlorine in the place of argon. All the trees formed plastic trunks, and all the lakes were acidic. It was kinda cool, actually, until you realise that life at our level of society would be impossible, because burning plastic is not a great idea.", "is_submitter": false, "distinguished": null, "created_utc": 1628594277.0, "parent_id": "t3_p1m0im", "replies": [{"author": "gerkletoss", "id": "h8g4ex1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "p1m0im", "stickied": false, "body": ">because burning plastic is not a great idea.\n\nI suspect life on such a planet would have no more trouble with that than we have with burning wood.\n\nMy bigger concern (aside from \"how the hell is there this much molecular chlorine?\") would be the difficulty of cycling carbon tetrachloride back into arganisms.", "is_submitter": false, "distinguished": null, "created_utc": 1628624229.0, "parent_id": "t1_h8ebsc0", "replies": [{"author": "FnchWzrd314", "id": "h8gkikm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "p1m0im", "stickied": false, "body": "Hold on, I'll need to find the planet again", "is_submitter": false, "distinguished": null, "created_utc": 1628631178.0, "parent_id": "t1_h8g4ex1", "replies": []}]}]}, {"author": "ms0124", "id": "h8ecfma", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #76", "submission": "p1m0im", "stickied": false, "body": "Interesting thoughts on how life could be different outside of Earth.\n\nLike you said silicon based life forms seems like an obvious alternative since it is structurally similar to carbon. Carbon generally has stronger bonds than silicon, but you can still make long chains with it. \n\nI think that nitrogen could also serve as a potential backbone for life. While it isn't as similar to carbon as silicon is, it can still make bonds and form long chains. This form of life would look completely different from anything we have ever seen before.\n\nAlso, I believe I read something a few years back about a bacteria that doesn't survive off of water. But it does need arsenic to survive. I think it was one of those extreme bacteria that can survive super hot and super cold conditions.", "is_submitter": false, "distinguished": null, "created_utc": 1628594741.0, "parent_id": "t3_p1m0im", "replies": [{"author": "Paul_Thrush", "id": "h8er6ra", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p1m0im", "stickied": false, "body": "[Nasa reveals bacteria that can live on arsenic instead of phosphorus](https://www.nationalgeographic.com/science/article/mono-lake-bacteria-build-their-dna-using-arsenic-and-no-this-isnt-about-aliens)", "is_submitter": false, "distinguished": null, "created_utc": 1628603230.0, "parent_id": "t1_h8ecfma", "replies": [{"author": "ms0124", "id": "h8ere2z", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #76", "submission": "p1m0im", "stickied": false, "body": "Yes, this!! Thanks!", "is_submitter": false, "distinguished": null, "created_utc": 1628603328.0, "parent_id": "t1_h8er6ra", "replies": []}]}, {"author": "ATR2400", "id": "h8fv4pu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "p1m0im", "stickied": false, "body": "You’re right. There has definitely been some talk about using arsenic instead of phosphorus. Very interesting indeed. It has its problems compared to phosphorus but it just might get the job done", "is_submitter": true, "distinguished": null, "created_utc": 1628620296.0, "parent_id": "t1_h8ecfma", "replies": []}, {"author": "gerkletoss", "id": "h8g4x5q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "p1m0im", "stickied": false, "body": "The trouble with molecules with lots of nitrogen is that they tend to like to stop being like that and turn into gaseous nitrogen instead.", "is_submitter": false, "distinguished": null, "created_utc": 1628624449.0, "parent_id": "t1_h8ecfma", "replies": []}]}, {"author": "H0bg0blin0verl0rd", "id": "h8elfdr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1m0im", "stickied": false, "body": "Ok, so I don't have the intellectual chops or the background to really keep up with you guys in a discussion on the subject, but I do find it super interesting!\n\n[This](https://youtu.be/egzZv8tqT_k) was my introduction to the subject, if you haven't checked it out I highly recommend it!", "is_submitter": false, "distinguished": null, "created_utc": 1628600300.0, "parent_id": "t3_p1m0im", "replies": []}, {"author": "THF-Killingpro", "id": "h8ew9vv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1m0im", "stickied": false, "body": "Interesting idea, but the different types won't be able to life together, or I think so...\n\nBut would be fun to see what we could produce/find", "is_submitter": false, "distinguished": null, "created_utc": 1628605566.0, "parent_id": "t3_p1m0im", "replies": [{"author": "ATR2400", "id": "h8fvbhw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "p1m0im", "stickied": false, "body": "Most likely they will not be able to live together because the conditions to support each type are radically different", "is_submitter": true, "distinguished": null, "created_utc": 1628620373.0, "parent_id": "t1_h8ew9vv", "replies": []}]}, {"author": "smbell", "id": "h8fwa2q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #158", "submission": "p1m0im", "stickied": false, "body": "This is of course completely guessing, speculative, and only my layman opinion so...\n\nI suspect there is a some variation in the composition of life form at the very small level. Bacteria kind of things. I think life is actually fairly prevalent and will pop up all over the place at that level.\n\nI don't think we'll find much in the way of large complex life that is not carbon based. Large complex life needs a lot of energy to be added to the system all the time. That kind of energy supply is unlikely (I think) to be found in an environment that is not similar to ours.\n\nAlso the raw amount of various chemicals would tend to favor carbon based systems.", "is_submitter": false, "distinguished": null, "created_utc": 1628620771.0, "parent_id": "t3_p1m0im", "replies": [{"author": "gerkletoss", "id": "h8g5hn2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "p1m0im", "stickied": false, "body": ">Also the raw amount of various chemicals would tend to favor carbon based systems.\n\nYes, many alternative biochemistry proposals ignore the relative abundances of various elements in the universe. Still, even using the same elements as life on Eath, there are other ways to put together genetic molecules and structural/functional molecules.", "is_submitter": false, "distinguished": null, "created_utc": 1628624693.0, "parent_id": "t1_h8fwa2q", "replies": []}]}, {"author": "gerkletoss", "id": "h8g41ex", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "p1m0im", "stickied": false, "body": "I think most media depictions of alternative biochemistry are hot garbage. Sure, silicon-based life could exist, but it's not going to be crystalline any more than a human is and there would be no overlap between them and humans in terms of survivable temperature. \n\nAs for carbon-based life, there are tons of potential alternatives to the sets of molecules used by organisms on Earth. Stuff could simply have its chirality switched, at the simple end.\n\nOrion's arm does a good job with this.", "is_submitter": false, "distinguished": null, "created_utc": 1628624070.0, "parent_id": "t3_p1m0im", "replies": [{"author": "ATR2400", "id": "h8g4bcg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "p1m0im", "stickied": false, "body": "Why do all depictions of silicon based life end up being crystaline? Sure silicon is kinda rocky but humans are carbon based and we’re not all rocky or dusty.", "is_submitter": true, "distinguished": null, "created_utc": 1628624187.0, "parent_id": "t1_h8g41ex", "replies": [{"author": "gerkletoss", "id": "h8g5p15", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "p1m0im", "stickied": false, "body": "Especially when there's a soft silicone spatula right there in the kitchen of the person drawing the silicon-based aliens.", "is_submitter": false, "distinguished": null, "created_utc": 1628624780.0, "parent_id": "t1_h8g4bcg", "replies": []}]}]}, {"author": "DoglessDyslexic", "id": "h8ghhzi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p1m0im", "stickied": false, "body": "If you want a rather bizarre take on theoretical life, read Dr. Robert Forward's \"Dragon's Egg\".  Life on a neutron star.", "is_submitter": false, "distinguished": null, "created_utc": 1628629846.0, "parent_id": "t3_p1m0im", "replies": []}, {"author": "arokace", "id": "h8ho1xf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p1m0im", "stickied": false, "body": "Haven't we discovered other forms already.  Like I thought I remember reading about a sulphor based life form.", "is_submitter": false, "distinguished": null, "created_utc": 1628650277.0, "parent_id": "t3_p1m0im", "replies": []}]}