{"title": "Does anyone else like to think about hypothetical and unlikely scenarios for both the real world and fictional worlds and try to imagine how the people would react?", "name": "t3_pd7qsi", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pd7qsi/does_anyone_else_like_to_think_about_hypothetical/", "selftext": "I’ve always been very interested in the reactions of people to unusual scenarios. I like to think about how different people, nations, groups, etc would react to things both realistic and unrealistic, ranging from small scale to universal, from mundane to physics breaking. I do this for both the real world and fictional universes. \n\nFor example: \n\nWhat if a time traveller appeared to Neville Chamberlain before appeasement started  and was successfully able to prove that they’re a time traveller and benevolent. And then began explaining everything that will happen. Europe plunged into darkness, millions of deaths, the fall of the struggle of the RAF against the Luftwaffe. Would that change his mind? Would he attempt to stop the Germans instead of appeasing them?\n\nFor a fictional and less depressing scenario. what if the Imperium of Man from WH40k discovered a fully functional uncorrupted complete STC on Terra containing a perfect archive of all human knowledge? Would it reverse the stagnation? Could there possibly be something to help heal the emperor in there? STCs are basically godly artifacts in the 40k universe. Mars would probably soil themselves.\n\nFor a more silly hypothetical scenario: What if a Multiversal human power suddenly showed up in the fallout universe with far superior technology to anything the factions can muster and just began terraforming the place back to normal. They have like a cure to ghoulism and the FEV and have made it their task to fix humanity’s fuck up on this world. They are powerful enough to absolutely crush any opposition and are very technocratic and utilitarian. Their technology is too advanced to reverse engineer. On one hand they’re making a better world but their methods are questionable. How would the people and factions of that universe react? Who knows. Not me\n\nFor another real world scenario: What if an FTL civilization showed up to Earth and magically deleted climate change and cleaned up radioactive areas like Chernobyl. And then another twist: they’re humans. Genetically engineered to perfection but otherwise normal humans. When asked about why they’re exactly the same despite the massive improbability their only response is “we’re just as surprised as you are.” This civilization would be from the Triangulum Galaxy and it’s residents are all immortals who have been around for way too long and they’re lost their sense of formality so they show Up to diplomatic meetings with world leaders like “Yo what’s up? Why’d we solve climate change? Idk man I just kinda wanted to see what would happen and you know we couldn’t let our fellow human bois suffer like that.”", "score": 5, "upvote_ratio": 0.78, "permalink": "/r/TheFlyingTree/comments/pd7qsi/does_anyone_else_like_to_think_about_hypothetical/", "id": "pd7qsi", "author": "ATR2400", "link_flair_text": "Discussion", "num_comments": 5, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630148177.0, "comments": [{"author": "obiwanlenobi", "id": "haoy1rg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pd7qsi", "stickied": false, "body": "Yes, although I mostly only do it for real life. For example, when I see a host or comedian say something, I imagine how to audience would react if they changed the diction or syntax.", "is_submitter": false, "distinguished": null, "created_utc": 1630164903.0, "parent_id": "t3_pd7qsi", "replies": []}, {"author": "Tsarmani", "id": "haoaf26", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #297", "submission": "pd7qsi", "stickied": false, "body": "I like the fallout one. Having picked up fo76 a couple months ago to play with friends, even I would be angered if all the hard work I put in was reversed. But the entire fall out world would most likely also hate the changes that come along. Power dynamics and governments are starting to form, science is evolving, nature is healing, but humans are still twisted. \n\nIf the world was restored back before the bombs dropped, lots of learning and organization will be forgotten...\n\nI just realized I don’t want to write an essay so, yeah, I just think we would revert back to an adolescent species and will continue to kill our selves. Very fun hypotheticals, thank you.", "is_submitter": false, "distinguished": null, "created_utc": 1630153217.0, "parent_id": "t3_pd7qsi", "replies": [{"author": "ATR2400", "id": "hapq0mz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "pd7qsi", "stickied": false, "body": "Thanks for responding! Weekends aren’t exactly the best time to make text posts since everyone is occupied with the images so I’m glad I got any comments at all", "is_submitter": true, "distinguished": null, "created_utc": 1630176883.0, "parent_id": "t1_haoaf26", "replies": []}]}, {"author": "Zabawa13", "id": "hapb9is", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #229 | Classis Veritatus", "submission": "pd7qsi", "stickied": false, "body": "I usually imagine scenarios in the future conversations with my friends and family, because I know them well and can predict what they're about to say so I'm in control of the conversation. Not only that, it also allows me to have great roasts and comebacks that perfectly fit into the situation", "is_submitter": false, "distinguished": null, "created_utc": 1630170694.0, "parent_id": "t3_pd7qsi", "replies": []}, {"author": "QueenOfNights", "id": "hapzzka", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #144", "submission": "pd7qsi", "stickied": false, "body": "I like thinking up very intricate and deep ones. However I also enjoy thinking up conversations with others, even everyday ones about mundane things. It helps me map things out and try figure out how people will react.", "is_submitter": false, "distinguished": null, "created_utc": 1630181370.0, "parent_id": "t3_pd7qsi", "replies": []}]}