{"title": "Have you ever been part of a subreddit or other online group that eventually ended up dying? Here’s one fun story and another really sad one.", "name": "t3_p6olul", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p6olul/have_you_ever_been_part_of_a_subreddit_or_other/", "selftext": "I remember a subreddit of mine from the old days. The point? What typeface is better? Bold or Italics. It was a small group of people fighting in a trebuchet memes style manner to establish the superiority of their faction. Bold is gold. Forever and always, the other two mods are gone now. Last posts from a year ago. \n\nThere is another group. A roleplaying group of sorts. A much larger one. Of over a hundred people. It was once prosperous but even by the time I joined it was already in decline but I didn’t notice. Activity was gradually decreasing. I would eventually become part of the leadership mostly because no one else was volunteering anymore. And I remain to this day a kind of a dead kingdom. And it hurts. For years it was my home. And I couldn’t do anything to stop its fall. It weighs heavily on my consciousness and I feel a great deal of personal responsibility. Like if I just tried harder or if I was *better* it could have been avoided. Friends faded away. I think it might have actually given me depression or something. I’ve had stress dreams about it and sometimes I almost cry. I can barley stand to go back there now. I go back as often as I need to and no more. It hurts too much.\n\nI’ve always gotten too easily attached even to the stupidest things. I’ve suffered greatly mentally over trivial nonsense.", "score": 19, "upvote_ratio": 0.92, "permalink": "/r/TheFlyingTree/comments/p6olul/have_you_ever_been_part_of_a_subreddit_or_other/", "id": "p6olul", "author": "ATR2400", "link_flair_text": "Discussion", "num_comments": 33, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629283232.0, "comments": [{"author": "r_kay", "id": "h9ebg9m", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #56", "submission": "p6olul", "stickied": false, "body": "r/Blackatheism\n\nBeing black & an atheist provides a unique set of issues because of religion's prevalence in the black community, and this was a place to discuss that.\n\nThere were as many posts there from people with no perspective of \"why does this exist?\" as there are here of \"what is this place?\" And the discussion dwindled to nothing...", "is_submitter": false, "distinguished": null, "created_utc": 1629285778.0, "parent_id": "t3_p6olul", "replies": [{"author": "Cheomesh", "id": "h9f2hoa", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6olul", "stickied": false, "body": "Oddly enough I'd have expected that to be more durable *because* religion seems to be a bigger identity element with that demographic (sort of like subs / forums for former Mormons and the like).  As a white Atheist I never feel like I have anything to really say on the subject - there simply are no gods, and that's that.  My Catholic upbringing never plays into it, and I don't care what any members of my family think about anything.", "is_submitter": false, "distinguished": null, "created_utc": 1629300332.0, "parent_id": "t1_h9ebg9m", "replies": []}, {"author": "PM-ME-YOUR-HANDBRA", "id": "h9eeobd", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #15", "submission": "p6olul", "stickied": false, "body": "It really feels like the \"golden days\" of having *a subreddit for everything* have gone away, now that the majority of the userbase either treats reddit like other social media or is an ad bot.", "is_submitter": false, "distinguished": null, "created_utc": 1629288047.0, "parent_id": "t1_h9ebg9m", "replies": [{"author": "Cheomesh", "id": "h9f09wg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6olul", "stickied": false, "body": "Everything gravitates to the center of mass.", "is_submitter": false, "distinguished": null, "created_utc": 1629299332.0, "parent_id": "t1_h9eeobd", "replies": []}]}]}, {"author": "Skastrik", "id": "h9ee9n9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "p6olul", "stickied": false, "body": "I played EVE online for 12 years pretty much straight. And on and off for 2 years after a slight break. \n\nDuring that time there were many groups I saw and participated in that rose up and then peaked and faded away. A bunch of people that stopped playing or stopped using that character and made a new one to do other stuff. For most they just grew up and life happened.\n\nI remember the last time I logged in there were way, way more people offline in my friends list than online. And the groups I used to run with were gone for the most part.\n\nThat game has pretty much turned over an entire generation I think by now. There aren't many left that started in the beta playing.", "is_submitter": false, "distinguished": null, "created_utc": 1629287772.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "celtic_cuchulainn", "id": "h9f0ymg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #168", "submission": "p6olul", "stickied": false, "body": "I feel like the culling idea will keep this sub going and I’m going to reflect on that.", "is_submitter": false, "distinguished": null, "created_utc": 1629299643.0, "parent_id": "t3_p6olul", "replies": [{"author": "agaminon22", "id": "h9g1hal", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #174", "submission": "p6olul", "stickied": false, "body": "As someone that was on a sub that had this exact same modus operandi, what is really going to save it is the fact that it is non-personal. There's a rule about that", "is_submitter": false, "distinguished": null, "created_utc": 1629315910.0, "parent_id": "t1_h9f0ymg", "replies": []}]}, {"author": "SilverDem0n", "id": "h9ebu3j", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #105", "submission": "p6olul", "stickied": false, "body": "I was in a bunch of online communities that were lost like tears in the rain, or like a fart through fishnet stockings, when Silicon Valley firms could not see a path to profit.\n\nGeoCities - Area51, ResearchTriangle, and ParisCafe.\n\nYahoo Chat - Books&Lit, TriviaQuiz, and ArtChat.\n\nICQ - all of the countless, enumerated people I knew only by their serial number but nevertheless knew intimately.\n\nI made some close connections at a significant time of my life. And I will never meet them again, as we knew each other through the identities we had created for ourselves rather than the names the real-worlders has assigned.\n\nTo others, it may have been adolescent ephemera. But to me it really meant something.", "is_submitter": false, "distinguished": null, "created_utc": 1629286063.0, "parent_id": "t3_p6olul", "replies": [{"author": "Cheomesh", "id": "h9f163u", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6olul", "stickied": false, "body": "I hear that.  Though honestly, I think I was always more genuinely myself online than a crafted persona - was never good at that kind of thing.  But yeah, made some friends back in the day online more easily than in person and unfortunately life shakeup lead to me losing contact with basically all of them.  That said I guess none of us ever really knew each other.", "is_submitter": false, "distinguished": null, "created_utc": 1629299739.0, "parent_id": "t1_h9ebu3j", "replies": []}, {"author": "freyalorelei", "id": "h9f8j16", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #97", "submission": "p6olul", "stickied": false, "body": "If you've been online long enough, you'll see communities rise, thrive, and die. I was on LiveJournal for a decade, and made lifelong friends there. I have friends I made on Xena Palace Chat back in 1998--people I knew as avatars on a screen and traveled across country to meet in real life. The communities have not existed for years, but the friendships remain.", "is_submitter": false, "distinguished": null, "created_utc": 1629303033.0, "parent_id": "t1_h9ebu3j", "replies": [{"author": "TatianaAlena", "id": "h9ggiaj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #11", "submission": "p6olul", "stickied": false, "body": "Seconded about LJ.", "is_submitter": false, "distinguished": null, "created_utc": 1629322688.0, "parent_id": "t1_h9f8j16", "replies": []}]}, {"author": "Karyo_Ten", "id": "h9eu5fx", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p6olul", "stickied": false, "body": "ICQ and MSN Messenger, oh wow that brings back memories.\n\nThat does remind me of this awesome (and crazy long) essay of the war between ICQ and MSN: https://www.nplusonemag.com/issue-19/essays/chat-wars/", "is_submitter": false, "distinguished": null, "created_utc": 1629296478.0, "parent_id": "t1_h9ebu3j", "replies": []}]}, {"author": "freddyPowell", "id": "h9ejsdk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #52", "submission": "p6olul", "stickied": false, "body": "r/constantscript was a project to create a logography in the style of the latin alphabet (a logography is a writing system where each character is a word, like in chinese). The one mod who was running the project for about a week's break because of family issues, and when they came back the sub was dead, which was really sad, because up to that point the sub had been really productive.", "is_submitter": false, "distinguished": null, "created_utc": 1629291211.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "PalatableNourishment", "id": "h9ekxqn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "p6olul", "stickied": false, "body": "Just recently I was in one that I liked a lot. It was 52 weeks of cooking a vegan dish. Each week was a different theme. Everyone would post their interpretation of the theme. It was a spin off of a different sub, but this one was for plant-based food. It started off strong, we got about 10 weeks in. The comments were really positive and folks were getting inspiration for new recipes. But then with more people came some trolls commenting that the food looked gross (common in vegan subs unfortunately). I was added as a mod because I was relatively active and was able to remove the negative comments quickly. But then when the new year started, the main mod decided to “restart” the challenge from week 1 again. I think it demoralized a lot of people and it very quickly died out. Too bad really.", "is_submitter": false, "distinguished": null, "created_utc": 1629291857.0, "parent_id": "t3_p6olul", "replies": [{"author": "BasilDream", "id": "h9eo6dg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #163 | Classis Veritatus", "submission": "p6olul", "stickied": false, "body": "Well that sucks because I would love this.", "is_submitter": false, "distinguished": null, "created_utc": 1629293567.0, "parent_id": "t1_h9ekxqn", "replies": [{"author": "PalatableNourishment", "id": "h9eov3g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "p6olul", "stickied": false, "body": "I have half a mind to try and restart it in January 2022! I’m still technically a mod after all", "is_submitter": false, "distinguished": null, "created_utc": 1629293913.0, "parent_id": "t1_h9eo6dg", "replies": [{"author": "BasilDream", "id": "h9evmap", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #163 | Classis Veritatus", "submission": "p6olul", "stickied": false, "body": "Good idea!", "is_submitter": false, "distinguished": null, "created_utc": 1629297175.0, "parent_id": "t1_h9eov3g", "replies": []}]}]}, {"author": "Cheomesh", "id": "h9f27nx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6olul", "stickied": false, "body": "Flipside - I used to hang out on The Primal Blueprint, which is basically a modified Paleo diet forum.  Was a pretty nice place for a while but the guy who ran it (Mark Sisson) evidently didn't bother tasking anyone with actual moderation, so it slowly became a dump.  Between periodic, coordinated brigading (pretty much all from the 30BAD guys) and generic spam bots, it became unusable.  Interestingly, the worst came right around the time our bigger-named regulars were sort of starting to question the fundamentals a bit closer...", "is_submitter": false, "distinguished": null, "created_utc": 1629300208.0, "parent_id": "t1_h9ekxqn", "replies": [{"author": "PalatableNourishment", "id": "h9f46ns", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "p6olul", "stickied": false, "body": "Haha, I had to look up what 30BAD was. Looks like it’s raw vegans, Freelee the Banana girl style? Based on the bits of info I’ve seen about her, I don’t think she’s a force for good in this world. I just don’t get why anyone would spend time brigading subs like that especially when it’s just about food. (Although veganism itself isn’t really all about food but people including some vegans seem to forget that sometimes.) It’s a sad waste of time in my opinion.", "is_submitter": false, "distinguished": null, "created_utc": 1629301109.0, "parent_id": "t1_h9f27nx", "replies": [{"author": "Cheomesh", "id": "h9fev2y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6olul", "stickied": false, "body": "Yeah, back then it was run by some guy who went by \"Durian Rider\".  Very aggressive fruitarian type.  It's not the diet I have issues with, it's that while our members were kind of snobby, theirs were *mean*.\n\nI don't think he's affiliated with 30BAD anymore, since I do recall he and Freelee split some years ago now.", "is_submitter": false, "distinguished": null, "created_utc": 1629305816.0, "parent_id": "t1_h9f46ns", "replies": []}]}]}]}, {"author": "Espumma", "id": "h9fh0lq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #12", "submission": "p6olul", "stickied": false, "body": "I'm currently in a sub that's dying. It's similar to this: a single guy/mod/bot is adding random people from all over the place. But the bot died and the mod is inactive and now we're all just wondering what to do with the space. It's like sitting in a movie theater waiting for the credits to finish but they never do.", "is_submitter": false, "distinguished": null, "created_utc": 1629306771.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "Gundamu0079", "id": "h9ead7t", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #257", "submission": "p6olul", "stickied": false, "body": "Oof", "is_submitter": false, "distinguished": null, "created_utc": 1629284958.0, "parent_id": "t3_p6olul", "replies": [{"author": "ATR2400", "id": "h9eadvi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "p6olul", "stickied": false, "body": "Yep. Fortunately I’ve developed an unbeatable coping method. Bottle it up and compress it like mad", "is_submitter": true, "distinguished": null, "created_utc": 1629284972.0, "parent_id": "t1_h9ead7t", "replies": []}]}, {"author": "NotSkyve", "id": "h9eb39w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #17", "submission": "p6olul", "stickied": false, "body": "I used to be very active on the German WoW forums 14 years ago. The offtopic crew made forums (iirc there were two, by different and I believe especially differently aged crews).\nIt was essentially the people I more or less talked to the most back then, but I stopped talking to them and visiting those forums back in 2010 iirc.\n\nI do still have contact with one guy and we occasionally see each other since by now we live in the same city.", "is_submitter": false, "distinguished": null, "created_utc": 1629285510.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "keyless-hieroglyphs", "id": "h9ecazh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #149", "submission": "p6olul", "stickied": false, "body": "The places grew on me more than I thought and I felt a surprising loss. I have had homecoming dreams, but it was just a dream, I think...\n\nMost ships went down after losing to the whirlpool of newer media, or so it is thought. A few have sailed on, planks less and less tread, waiting to be unraveled in a digital tempest. There were always an amount of special people, special interests, and craziness, now crystallized.", "is_submitter": false, "distinguished": null, "created_utc": 1629286409.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "WikiContributor83", "id": "h9f09xz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #120", "submission": "p6olul", "stickied": false, "body": "I joined a Cyberpunk RED Discord trying to look for a game. The server was a West Marches style game set after RED’s timeline but before Cyberpunk 2077.\n\nThere were inherent issues with this idea: For one thing a West Marches is inherently exploratory from what I understand, and adventure cannot happen in town whereas in Cyberpunk ALL the adventure happened in town. Second, lorewise it was clear the creator of the server clearly just played 2077 and included way more of that than any of the lore bits from RED. \n\nDespite that I was looking forward to playing. But I couldn’t right away. The guy who created the server and others had no idea how to game master, least of all RED (which has very cluttered layout). So I agreed to be a GM/Moderator until they got stuff together. \n\nI ran a few modestly successful sessions and the creator ran part of a premade module. But then things got ugly quick. One of the people GMing was a bit of a nervous fellow and the creator and one other player began chastising him over how he ran his game and also something about his mental illness. This lead to him panicking and leaving the server (while removing stuff on our Roll20, effectively nuking our Cyberpunk tokens and maps at the time). After calming down and taking his meds the GM wanted to rejoin the server since he liked the community that was growing. The creator refused, thinking *he* was the asshole. \n\nWe ended up getting a mediator for this whole drama and resolved to include the GM back into the server but not as a GM, which he was fine with but it was clear the damage was done and he left not long after, the fun had been taken out for him.\n\nI eventually had another spat with the Creator about what game mechanics to include from Cyberpunk 2020 and he insisted including them without consulting the other mods and GMs under the pretense of it should be the players choice, which I called him out on privately. By this point I knew he was a budding authoritarian, tautological dickhead and made clear I would oppose him if I thought he was wrong. \n\nHe called it edgy bullshit at the time but what I said apparently made an impression on him because the next day he made me server owner. While shocked, I immediately began implementing the lore changes I had always want (with mod approval, I’d look real silly if I went back on the whole democracy thing). I also tried running a game or two.\n\nHowever things fell apart. The issues I brought up in the beginning began to surface. The West Marches play style was not designed for an explored modern landscape like Night City and we also didn’t have enough willing GMs.\n\nNot to mention I never wanted to GM, nevermind run an entire server, so the little time I spent was to try and automate the “gigs” players could try (that’s another thing, adventures and gigs were GM posted/driven, not player driven like they’re supposed to. In West Marches games players say they want to explore an activity in a certain place so the GM crafts up an adventure there and  along the way). \n\nI posted a table for people to roll up their own gigs....and that was it. The server died. No one messaged, I didn’t message. The entire server stopped talking. Everyone was still there, but no one was engaged enough to make the first move with anyone. I’m still in it, I can still see how still everything is, like seeing so many people in a room not saying anything. \n\nTl;dr: I joined a Cyberpunk West Marches game where the creator turned out to be a jerk who ruined our morale before throwing me the keys. I then inadvertently let the server die in limbo.", "is_submitter": false, "distinguished": null, "created_utc": 1629299332.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "Cheomesh", "id": "h9f0skt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6olul", "stickied": false, "body": "Several, though most I guess I stopped using before \"the end\".\n\nI still remember the online forum that got me into using the Internet as something other than just a place to read stuff and look at pictures (over a 56k dial up modem...) - it was the \"Sunflowers\" forum for the game Anno 1602.  Long gone now.  I think that was circa 1999?\n\nI used to be more of an \"online group junkie\" years back as a disaffected teenager, and it does still kinda come and go, but I shook the habit over time I guess.", "is_submitter": false, "distinguished": null, "created_utc": 1629299568.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "noodlefrits", "id": "h9h44ne", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #1", "submission": "p6olul", "stickied": false, "body": "I was in an Arma unit for quite some time. It was fun for a while, but no one wanted to program missions so everyone got bored and kinda drifted away.\n\nI miss my days in Legion XIII", "is_submitter": false, "distinguished": null, "created_utc": 1629333748.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "145676337", "id": "h9l2s4j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #116", "submission": "p6olul", "stickied": false, "body": "It's the things we mourn that show what we really care about. I'm not saying that you specifically cared about bold or italics but that those connections you made were the important things to you.\n\nI think we all have that in one way or another. A friend that moved away, a relative that died, a pet that had to be put down, a sport we can no longer play.\n\nConnections to others aren't trivial, they're the most important thing in our lives and it's great you're able to connect in one way or another. Hopefully you have some connections like that still, even if they're different than your fallen comrades in the bold army.", "is_submitter": false, "distinguished": null, "created_utc": 1629409202.0, "parent_id": "t3_p6olul", "replies": [{"author": "ATR2400", "id": "h9laifo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "p6olul", "stickied": false, "body": "Indeed it was never really about bold or italics. We just picked a random topic for us to fight about pointlessly. The subreddit name had the word pointless in it. It was always about the good times. We switched sides occasionally. Sometimes I was bold, sometimes italic. And other times the bringer of the apocalypse ***Bold Italic***", "is_submitter": true, "distinguished": null, "created_utc": 1629412541.0, "parent_id": "t1_h9l2s4j", "replies": []}]}, {"author": "FirstUser", "id": "h9mw32d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #127", "submission": "p6olul", "stickied": false, "body": "In my early Internet days, when the web was incredibly slow and frustrating, I was a big Usenet addict.\n\nThough not completely dead, today Usenet is just a shadow of its former self; and that's sad, because it's one area of the Internet that's no-one's property, and where you'd find *true* freedom of speech (even though that too can bring problems).", "is_submitter": false, "distinguished": null, "created_utc": 1629444251.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "Kelyaan", "id": "h9f3ct2", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p6olul", "stickied": false, "body": "I'm in Discord roleplay groups - They die real quick.", "is_submitter": false, "distinguished": null, "created_utc": 1629300720.0, "parent_id": "t3_p6olul", "replies": []}, {"author": "Pwngulator", "id": "h9fai85", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "p6olul", "stickied": false, "body": "So many pre-Reddit forums, now lost to the wind...\n\nY'all remember \"signatures\"? Those were fun.", "is_submitter": false, "distinguished": null, "created_utc": 1629303907.0, "parent_id": "t3_p6olul", "replies": []}]}