{"title": "What is the difference between having intrusive thoughts and just having a normal functioning brain?", "name": "t3_pi74el", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pi74el/what_is_the_difference_between_having_intrusive/", "selftext": "I often fail to understand what specifically constitutes an intrusive thought, and why they are considered a symptom of mental illness.\n\nMost people do not have direct control over their thoughts, right? It's like a stream that you cannot just stop and fine-tune. You may be able to broadly guide the stream one way or another but you don't have the ability to filter out certain items however you want. The thoughts will come either way.\n\nAnd it's perfectly normal and natural to have dark thoughts in addition to happier thoughts throughout your day. The thoughts come back up and go away. Then come back up later. You don't know when, you're just along for the ride.\n\nSo then, having repetitive, unwanted dark thoughts should just be a normal aspect of being a human being. Right? It's not something we can get rid of without removing brain parts, so it's something we have to live with and accept.\n\nSo why does every authority talk about intrusive thoughts like they mean you have a disorder? What am I missing?", "score": 7, "upvote_ratio": 0.82, "permalink": "/r/TheFlyingTree/comments/pi74el/what_is_the_difference_between_having_intrusive/", "id": "pi74el", "author": "banana_kiwi", "link_flair_text": "Question", "num_comments": 15, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630819447.0, "comments": [{"author": "PreOpTransCentaur", "id": "hbo0zvw", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #221", "submission": "pi74el", "stickied": false, "body": "Normal thought: \"These stairs are steeper than I remember.\"\n\nIntrusive thought: \"Bet I could throw the guy ahead of me right over the railing before anyone could stop me.\"", "is_submitter": false, "distinguished": null, "created_utc": 1630831375.0, "parent_id": "t3_pi74el", "replies": [{"author": "banana_kiwi", "id": "hbp4f9i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "pi74el", "stickied": false, "body": "Similar to l'appel du vide\n\nBut is there anything inherently abnormal about those kinds of thoughts, as long as they aren't followed through?", "is_submitter": true, "distinguished": null, "created_utc": 1630856434.0, "parent_id": "t1_hbo0zvw", "replies": [{"author": "the_Phloop", "id": "hbpch2l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #640", "submission": "pi74el", "stickied": false, "body": "Nope. Part of the human experience.\n\nThe _not acting on it_ part is what makes us human. If you see a piece of pizza face down on the sidewalk, you might decide \"I feel like eating pizza\", but not _that_ pizza. A dog has no such compunction.\n\nMy wife often jokes about how she intellectually knows the stovetop is hot, but she has to wrestle with her lizard brain to touch it to see _how_ hot it is.", "is_submitter": false, "distinguished": null, "created_utc": 1630859978.0, "parent_id": "t1_hbp4f9i", "replies": []}]}]}, {"author": "Cargobiker530", "id": "hbo1qu9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #615", "submission": "pi74el", "stickied": false, "body": "Everybody has a Shitty Committee in their head sometimes. Do your best to ignore them.", "is_submitter": false, "distinguished": null, "created_utc": 1630832058.0, "parent_id": "t3_pi74el", "replies": []}, {"author": "claimstoknowpeople", "id": "hboai0o", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #104", "submission": "pi74el", "stickied": false, "body": "Everyone has negative thoughts sometimes but not everyone is so filled with negative thoughts that going outside and meeting people is overwhelming", "is_submitter": false, "distinguished": null, "created_utc": 1630839838.0, "parent_id": "t3_pi74el", "replies": []}, {"author": "cubicghost", "id": "hboijhh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #617", "submission": "pi74el", "stickied": false, "body": "Most people do have direct control, they just don't have mastery over their own thoughts. Like random ideas, thoughts, and decisions or impulses will occur. Dark thoughts are pretty normal too, and it's the person who has them who decides if they are dark or not. Us humans are primal creatures and thinking some things, as long as not acted upon, isn't necessary bad.\n\nIntrusive thoughts are something else. They are a thought that is often occupied by a trigger action and/or cause distress. Thinking something unpleasant than saying something to clear your mind, like interrupting your own thought by going, \"meow!\". Having a nervous or anxious reaction to a thought. Flinging a hand up in defence to some thought. Or even having a pain reaction upon thinking of something.\n\nThe thought is not wanted, it isn't brought to, and it doesn't have a logical reason for happening. Sure you can trace the logic as to why that thought at that time sometimes (not always at all), but the point of the thought is often not there itself.\n\nThe trick to getting rid of intrusive thoughts is to not think of them, to gain control over your own brain and for you to be the one who controls yourself. This can often be accomplished with age, meditation, and practising ego control. I found Carl Yung's brand of philosophy helped me out greatly.\n\nRandom thoughts are not intrusive btw, we are humans and have a wonderful and awesome imagination.", "is_submitter": false, "distinguished": null, "created_utc": 1630845664.0, "parent_id": "t3_pi74el", "replies": []}, {"author": "prajnadhyana", "id": "hbnn4d7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pi74el", "stickied": false, "body": ">Most people do not have direct control over their thoughts, right?\n\nUhm, sorry my friend but that's not right. \n\nIn fact, none of what you said there is.", "is_submitter": false, "distinguished": null, "created_utc": 1630820055.0, "parent_id": "t3_pi74el", "replies": [{"author": "banana_kiwi", "id": "hbnnr9j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "pi74el", "stickied": false, "body": "Can you elaborate?\n\nAre you implying that you can will yourself to stop thinking about something whenever you want?", "is_submitter": true, "distinguished": null, "created_utc": 1630820508.0, "parent_id": "t1_hbnn4d7", "replies": [{"author": "prajnadhyana", "id": "hbnot69", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pi74el", "stickied": false, "body": "Absolutely. Many, many people can. That's why the things you describe are considered mental illness.\n\nIn fact I can stop myself from thinking about anything *at all* whenever I want to, although that is a much less common ability which I've trained myself to do.", "is_submitter": false, "distinguished": null, "created_utc": 1630821275.0, "parent_id": "t1_hbnnr9j", "replies": []}]}]}, {"author": "SybariteAussie", "id": "hbnwpku", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pi74el", "stickied": false, "body": "The term dark thoughts is somewhat obscure. The closest I can relate to as intrusive thoughts, being consumed with ardour when in a relationship & struggle to get her out of my head. A gentler & more pleasant form of this is when I realise I am obsessed with a fictional character in a book.", "is_submitter": false, "distinguished": null, "created_utc": 1630827647.0, "parent_id": "t3_pi74el", "replies": []}, {"author": "trailrunner68", "id": "hbomn9d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #504", "submission": "pi74el", "stickied": false, "body": "If your thoughts drive you to do something that is destructive, a waste of time, or both-you’re doing it wrong.  You’re purpose is to live and thrive.", "is_submitter": false, "distinguished": null, "created_utc": 1630848060.0, "parent_id": "t3_pi74el", "replies": []}, {"author": "Niskanen204", "id": "hbpq5dr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "pi74el", "stickied": false, "body": "In my experience there are two aspects to this issue of intrusive thoughts:\n\n* They are symptomatic of something unresolved in your life\n* A practice of 'mindfulness' can mitigate their impact to an astounding degree\n\n> Most people do not have direct control over their thoughts, right?\n\nMost people? Definitely. However, I firmly believe that a dedicated mindfulness practice can give you a surprising about of agency and ability in this regard.\n\n> It's like a stream that you cannot just stop and fine-tune.\n\nThe difference is that intrusive thoughts can feel like being ripped away in torrential flood, whereas a mindfulness practice feels like being in a creek where the water parts easily, almost unnoticeably around your legs.\n\n> What am I missing?\n\nThoughts and impressions will always pop up out of nowhere, but you have an impressive ability - with hard practice - to recognize, assess, discard, and not be ruled by them.\n\nIf you're finding that you cannot sit down and focus on something for an hour or two without having all sorts of negative emotions and memories bubble up to distract you, you could probably benefit from something like a practice of self-directed cognitive behavioural therapy and/or mindfulness meditation.", "is_submitter": false, "distinguished": null, "created_utc": 1630866029.0, "parent_id": "t3_pi74el", "replies": [{"author": "banana_kiwi", "id": "hbpras3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "pi74el", "stickied": false, "body": "Mindfulness and various therapy techniques are not new to me. I actually think have achieved remarkable awareness of my thoughts, but that does not allow me control over them. In fact, much of the time I wish I could be *less* aware of my thoughts. Often times, it feels like just acknowledging intrusive thoughts gives them more merit.\n\nBut I'm not really looking for advice, I'm just trying to understand what a neurotypical person's relationship with their own thoughts is like.\n\nSo far, I've gotten a lot of contradictory answers.", "is_submitter": true, "distinguished": null, "created_utc": 1630866545.0, "parent_id": "t1_hbpq5dr", "replies": [{"author": "Niskanen204", "id": "hbrd5jf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "pi74el", "stickied": false, "body": "Yeah, I hope I wasn't coming across as too didactic in my post. \n\nHonestly, I'm surprised you are still encountering intrusive thoughts. My mind in recent years has been very calm on account of these methods; if I have a worrisome or anxious thought I am fairly well able to evaluate it and discard to the extent that I have largely forgotten what intrusive thoughts felt like as a younger adult when all sorts of financial and relationship concerns would rule my day.", "is_submitter": false, "distinguished": null, "created_utc": 1630893896.0, "parent_id": "t1_hbpras3", "replies": [{"author": "banana_kiwi", "id": "hbrj89k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "pi74el", "stickied": false, "body": "No worries. I enjoyed hearing what you had to say, and I'm glad that you're doing well nowadays.\n\nI think beyond mindfulness, it just takes a bit more for me. Usually, that means retracing my steps and modifying my behavior such that the thought might be less likely to come up - and if it does, I actively distract myself by engaging in some other behavior. I reckon if I can't modify my brain's code, I might as well try reverse-engineering it or altering the context in which it runs.\n\nI am a younger adult myself, and perhaps when my brain is fully developed I will have an easier time reigning in my thoughts without resorting to external workarounds.\n\nThe good news is that I haven't had intrusive thoughts that were particularly dark in a while, and that probably has more to do with my mood than anything. The bad news is that they will probably just darken again whenever my next depressive episode comes around... But I'll try not to worry because that will just make it worse.", "is_submitter": true, "distinguished": null, "created_utc": 1630896957.0, "parent_id": "t1_hbrd5jf", "replies": []}]}]}]}]}