{"title": "a different class of levels in ones personality", "name": "t3_pcgdcr", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pcgdcr/a_different_class_of_levels_in_ones_personality/", "selftext": "there is this Tibetan noble eightfold path:\nit's vertical. from the bottom up.\n\nphysics survival and repair, health\n\nemotions polar distinctions good bad\n\nlearning experience memory\n\nsocial role dominance and dominated\n\nsensuality it feels right\n\nyour logic and reasoning\n\nyour belief\n\ndeath experience\n\nthese 8 steps build on each last level. depending on traumas of past moments and experiences In life we rise to the level of comfort if allowed.\nwe are not arlware of the upper levels until experienced somehow.\n\neach level can be called or focussed on with a drug.\n\n1 opiates  turn off the pain and consciousness\n2 alcohol loudmouth and crybaby\n3 coffein nicotine amphetamine etc\n4 sex and Viagra \n5 marihuana and mdma \n6 magic mushrooms \n7 lsd and mescaline \n8 ayahuasca\n\nremember this hierarchy next time you are on the higher levels.\n\ncomments appreciated", "score": 3, "upvote_ratio": 0.81, "permalink": "/r/TheFlyingTree/comments/pcgdcr/a_different_class_of_levels_in_ones_personality/", "id": "pcgdcr", "author": "bernpfenn", "link_flair_text": "Idea", "num_comments": 21, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630039503.0, "comments": [{"author": "-Nullius_in_verba-", "id": "hairofb", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #212", "submission": "pcgdcr", "stickied": false, "body": "I'm always really skeptical of philosophies like these. Why would human psychology be so simple and be built in a hierarchy like this? It is far too simplistic, there's a reason psychology is not straight forward and simple, which is because neither is the human mind. \n\nPhilosophies like this strike me as very early attempts to understand the human mind, but they have been surpassed by modern science and psychology. Just like medieval standards of medicine have been far surpassed by our modern standards.", "is_submitter": false, "distinguished": null, "created_utc": 1630041076.0, "parent_id": "t3_pcgdcr", "replies": [{"author": "pine_ary", "id": "hakokly", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "pcgdcr", "stickied": false, "body": "It doesn‘t have to be exactly like this. Clearly this is either meant as a model or spiritual guidance.", "is_submitter": false, "distinguished": null, "created_utc": 1630081684.0, "parent_id": "t1_hairofb", "replies": [{"author": "-Nullius_in_verba-", "id": "halsxbc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #212", "submission": "pcgdcr", "stickied": false, "body": "I guess, but it does claim to explain the mind, and in a far too simplistic way.", "is_submitter": false, "distinguished": null, "created_utc": 1630098258.0, "parent_id": "t1_hakokly", "replies": []}]}, {"author": "freddyPowell", "id": "hal3x0w", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #52", "submission": "pcgdcr", "stickied": false, "body": "I agree. While I hope for an elegant understanding of the human mind, psychology isn't close to it, if such an understanding can be reached. Lists of descriptions like this never seem to cover a complete human experience, and never tackle the idea that they might be incomplete. It really annoys the mathematician in me.", "is_submitter": false, "distinguished": null, "created_utc": 1630087814.0, "parent_id": "t1_hairofb", "replies": [{"author": "banana_kiwi", "id": "hanl7ct", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "pcgdcr", "stickied": false, "body": "Like most academically-oriented people today I am a monist in that I view the mind and the brain as fundamentally the same thing.\n\nHowever, humans are not capable of understanding and processing the vast number of miniscule and complex processes going on in our brain at any given moment and this is why we construct a model of it - the mind - to study and understand.\n\nCounterintuitively, we can gain more understanding about ourselves by creating a more abstract model of ourselves.\n\nThere are still plenty of other people who really do study just the physical brain but we call them neuroscientists and lock them away where they can't bother us.\n\nI dislike the fact that you said these theories never tackle the idea that they might be incomplete. That is a given with any science. Our understanding of physics is incomplete. Our understanding of any branch of biology is incomplete. So our understanding of psychology is most certainly incomplete; how could it ever be complete? If an observer is looking at *any* psychological theory and thinking it explains the whole story 100% of the time, they are the one who needs to reevaluate.", "is_submitter": false, "distinguished": null, "created_utc": 1630132854.0, "parent_id": "t1_hal3x0w", "replies": [{"author": "freddyPowell", "id": "hauxep9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #52", "submission": "pcgdcr", "stickied": false, "body": "I'm not sure I agree. These personality typologies always try to sort everyone into one of their slots, without trying to demonstrate that there may be people who fit into none of them.", "is_submitter": false, "distinguished": null, "created_utc": 1630276347.0, "parent_id": "t1_hanl7ct", "replies": [{"author": "banana_kiwi", "id": "hauz791", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "pcgdcr", "stickied": false, "body": "Modern psychology recognizes this. We're actually trying really hard to get rid of typing systems like MBTI\n\nThe preferred personality metric that we have now is the Big Five, which is empirically backed. Through a ton of factor analysis and lexical research analyzing how humans think about personality, five main traits emerged when all the numbers were crunched\n\nHowever, a Big Five test doesn't sort people into groups, it just scores them on 5 continuous axes\n\nAnd just intuitively, this is a better model to me because there are an infinite number of possible personality types", "is_submitter": false, "distinguished": null, "created_utc": 1630277163.0, "parent_id": "t1_hauxep9", "replies": [{"author": "freddyPowell", "id": "haxoor7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #52", "submission": "pcgdcr", "stickied": false, "body": "Brilliant. I believe that it is good that typing systems are removed in favour of other systems. I'm sorry if it seemed like I thought that these were backed by psychology and was therefore raging against that science as a whole. I was really trying to express my quite specific form of distaste for these tests, coming from a more mathematical background.", "is_submitter": false, "distinguished": null, "created_utc": 1630335326.0, "parent_id": "t1_hauz791", "replies": []}]}]}]}]}, {"author": "bernpfenn", "id": "haiv3yx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "pcgdcr", "stickied": false, "body": "anything complex has easy beginnings. that is how we understand...if you matrix the 8 levels with 8 incremental tones or colors and assign the rainbowcolors and black and white to the 8 levels, it creates 64 elements with incrementing tones. DNA has 64 codons, the Chinese I ching has 64 character archetypes. DNA has 20 Amino acids plus three stops, two are grouped. 22 is the great arkana of the tarot. there are many many more funky parallels in past texts.\n\nour brain for sure works with the same patterns and non distracted people in the past tell us things that science still can't explain.\n\n\nso which is THE classification, the latest and greatest in personality identification?", "is_submitter": true, "distinguished": null, "created_utc": 1630043278.0, "parent_id": "t1_hairofb", "replies": [{"author": "-Nullius_in_verba-", "id": "haji6nm", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #212", "submission": "pcgdcr", "stickied": false, "body": "Numerology is meaningless. There's absolutely no basis in science for that. When you compare two things you can always find some numerical coincidences by pulling up some arbitrarily chosen features. 20 amino acids and two are grouped, why would you add those two numbers? It's completely arbitrary. Humans have four limbs and I'm able to count to four, adds up to eight - meaning I'm a spider. It's ridiculous!\n\n>non distracted people in the past tell us things that science still can't explain.\n\nI'm guessing you're referring to miracles and other spiritual stuff. If a miracle seems too good to be true and defies science, it probably didn't happen. Being passed down through a religion or tradition also doesn't help. We now have such a good understanding of how the world works on the normal everyday scale that if a phenomenon defies physics of the everyday level, then it almost certainly didn't happen. Of course there are still gaps in science, most notably on the cosmological and quantum scales, but those scales don't influence the everyday scale in such a way as to make many miracles possible. Turning water to wine, for example. We have such a good understanding of physics that we can safely say that this didn't happen.\n\nI'm not saying the scientific theories we have now are the be all end all of all explanations. But they're certainly the best available right now, and are utterly unrivalled in their predictive and explanatory powers.", "is_submitter": false, "distinguished": null, "created_utc": 1630062022.0, "parent_id": "t1_haiv3yx", "replies": [{"author": "Cognizant_Psyche", "id": "hajspbj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pcgdcr", "stickied": false, "body": "> Numerology is meaningless.\n\nGood old Apophenia and Pareidolia, misleading people since… well forever really.", "is_submitter": false, "distinguished": null, "created_utc": 1630068253.0, "parent_id": "t1_haji6nm", "replies": []}]}, {"author": "banana_kiwi", "id": "hanlw26", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "pcgdcr", "stickied": false, "body": "You're trying to apply phenomenon we see in the physical world to non-physical ideas like personality\n\nYou've got to understand that personality is not something that exists objectively. It's just a model of understanding that humans use to describe our own behavior\n\nThere's way too much funky business going on in the brain to think that things are gonna split nearly into categories and manifest as personality traits that we are familiar with and have used to describe ourselves\n\nI'm fine with using a model but I want to clear out this idea that brains can be classified neatly into this box or that", "is_submitter": false, "distinguished": null, "created_utc": 1630133400.0, "parent_id": "t1_haiv3yx", "replies": []}]}]}, {"author": "SybariteAussie", "id": "haixsq9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pcgdcr", "stickied": false, "body": "The stoned ape theory is plausible. Magic mushrooms grew in mammoth dung. There’s people that collect coprolites. Fossilised poo. *hah* In Greek mythology, ambrosia and nectar were types of magic mushrooms. According to Robert Graves in his book The Greek myths. Sounds legit.", "is_submitter": false, "distinguished": null, "created_utc": 1630045267.0, "parent_id": "t3_pcgdcr", "replies": []}, {"author": "unicornprincess420", "id": "haj3tm8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #41", "submission": "pcgdcr", "stickied": false, "body": "That's not at all how the noble eightfold path works, or not how I've understood it at least. I'm a tibetan buddhist, and the eightfold path is meant to be followed to break out from samsara, the cycle of life and death. The path lets you choose the right actions: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right meditation consciousness, anove death and all worldly.\n\nedit: also drugs are total no-go in buddhism and you cannot experience the so-called 'higher levels' with drugs. it just means your bottom of right view and intention are alrrady wrong and you are not on the actual path.", "is_submitter": false, "distinguished": null, "created_utc": 1630050180.0, "parent_id": "t3_pcgdcr", "replies": [{"author": "bernpfenn", "id": "halak9m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "pcgdcr", "stickied": false, "body": "I didn't imply drugs are the only way to investigate the inner worlds. they are tools like meditation and years of solitude. westerners can't do that and I believe all religions are founded by spiritial encounters and experiences however obtained.", "is_submitter": true, "distinguished": null, "created_utc": 1630090563.0, "parent_id": "t1_haj3tm8", "replies": [{"author": "bernpfenn", "id": "halaua5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "pcgdcr", "stickied": false, "body": "meditate on any drug and see what happens.\nseriously, why does Buddhism doesn't use drugs?", "is_submitter": true, "distinguished": null, "created_utc": 1630090680.0, "parent_id": "t1_halak9m", "replies": [{"author": "unicornprincess420", "id": "hannntp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #41", "submission": "pcgdcr", "stickied": false, "body": "If you take the Buddhist vows then staying away from mind-altering drugs is one of the vows. Any drug is mind-altering and therefore will not, in reality, get you any closer to enlightenment (or whatever higher levels you wish) as they are not true. You have not really gotten any insight, because you have gotten the wrong insight due to drugs. Buddhism and drugs do not go together, that's just it. \n\nHowever, if you are talking about spirituality in general then be my guest ayahuasca has played a big role in spirituality for a long time, the same with smoking weed and mushrooms or acid. \n\nTrust me - you do not need any drug to meditate, the answers are in your mind already, you simply have to find them. So, let's just not talk about Tibetan Buddhism in the sense of drugs. Reading the teachings of Buddha and meditating on them is the same as taking acid - it just takes practice, resilience, patience, and true dedication.", "is_submitter": false, "distinguished": null, "created_utc": 1630134859.0, "parent_id": "t1_halaua5", "replies": [{"author": "bernpfenn", "id": "hap0llx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "pcgdcr", "stickied": false, "body": "thank you for this thought provoking reply. i knew I would run Into trouble matching drugs and the eight levels. \n\nthere is a split between 4 and 5.\nthe lower drugs are dangerous and decrease in addictivity by level. the upper four are giving liberating experiences if your mind is clear and conflict free.\n\nno drug is a problem solver.  all are showing different reactions of our \"stable mind\". \n\nwe are pattern dependent beings. we look for structure. we want to see order. we meditate for peace of mind.\n\nonce we are ego free, the universe is awsome, giving and receiving.\n\nlove peace abundance and independence to you", "is_submitter": true, "distinguished": null, "created_utc": 1630166021.0, "parent_id": "t1_hannntp", "replies": []}]}]}]}]}, {"author": "SybariteAussie", "id": "haixefs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pcgdcr", "stickied": false, "body": "Am reluctant to attempt 8, perhaps 7s have a cumulative effect? Am too old to be keen to be on turbo for 24 hours. MDMA deserves its own spot. It also opens doors of perception. That Huxley described so well, about LSD. Does the new businessman’s trip that’s over & done, within a hour belong in 7 or 8? I forget what it’s called? Made from acacia bark I hear. Joe Rogan talks about it often.", "is_submitter": false, "distinguished": null, "created_utc": 1630044965.0, "parent_id": "t3_pcgdcr", "replies": [{"author": "bernpfenn", "id": "haj0gss", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "pcgdcr", "stickied": false, "body": "right. let me add that to sensuality", "is_submitter": true, "distinguished": null, "created_utc": 1630047388.0, "parent_id": "t1_haixefs", "replies": []}]}, {"author": "ollyender", "id": "hajqxkg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #271", "submission": "pcgdcr", "stickied": false, "body": "Sometimes we try too hard to understand simple things. I remember one time I was staring at my hand. A point on my hand. I couldn't fathom how I could move that sole point. Then I just moved my hand.", "is_submitter": false, "distinguished": null, "created_utc": 1630067326.0, "parent_id": "t3_pcgdcr", "replies": []}]}