{"title": "Sleep paralysis and hallucinations", "name": "t3_pit23q", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pit23q/sleep_paralysis_and_hallucinations/", "selftext": "How many of you have experienced hallucinations whilst waking or falling asleep (hypnagogic, hypnopompic), experienced sleep paralysis, or experienced the terrifying combination of the two?\n\nI'm prone to the hallucinations which are normally very benign and simple: every few months I will hallucinate \"ghosts\" in my room (simple human bodies) sitting on a chair, walking across the room, etc. These are usually peaceful occurrences because the ghosts don't pay attention to me, aren't aware of me, and I can move away and close my eyes and go to sleep.\n\nHowever, twice now I've had the combination of sleep paralysis and a hallucination. On both occasions, these are terrifying. Five years ago, I woke up on my back, in the dark, unable to move, and with a demon snarling down at me. The face is still vivid in my memory because it was truly haunting. I couldn't move, couldn't scream, couldn't shut my eyes or do anything for the entire experience. I was unable to sleep without a light on for some time after that.\n\nTonight, I woke up paralysed and there was a man stood above my bed. He repeatedly stabbed me whilst I laid there unable to move. I could feel the \"holes\" and drag of his knife through my body, so I was surprised when the experience ended and that I was completely OK because it felt so real - the paralysis suddenly broke which caused the hallucination to disappear the moment I looked away.\n\nI speak freely about these experiences in real life because I find it absolutely fascinating how fucked up the brain can be, however normally I freak out others who've never experienced anything like this. Figured I'd pop this up as a discussion here and invite you all to maybe share your hallucination and paralysis, or any other funky brain-sleep experiences here, for us all to marvel at how complex and weird the brain is.", "score": 6, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/pit23q/sleep_paralysis_and_hallucinations/", "id": "pit23q", "author": "bethcano", "link_flair_text": "Discussion", "num_comments": 25, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630905898.0, "comments": [{"author": "solongfish99", "id": "hbrzuoz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "pit23q", "stickied": false, "body": "There was [another post](https://www.reddit.com/r/TheFlyingTree/comments/pgf9p9/sleep_paralysis/?utm_source=share&utm_medium=web2x&context=3) about this rather recently, you might find some of those comments relevant.", "is_submitter": false, "distinguished": null, "created_utc": 1630906585.0, "parent_id": "t3_pit23q", "replies": [{"author": "bethcano", "id": "hbs74d0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "Thank you for sharing this with me! I missed that one.", "is_submitter": true, "distinguished": null, "created_utc": 1630911820.0, "parent_id": "t1_hbrzuoz", "replies": []}]}, {"author": "naivenb1305", "id": "hbs5w84", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pit23q", "stickied": false, "body": "I never have hallucinations w/ it, and I've only had paralysis once before.", "is_submitter": false, "distinguished": null, "created_utc": 1630910875.0, "parent_id": "t3_pit23q", "replies": [{"author": "bethcano", "id": "hbs8bd6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "How did you find the paralysis? I know a lot of folks find that horrible on its own.", "is_submitter": true, "distinguished": null, "created_utc": 1630912781.0, "parent_id": "t1_hbs5w84", "replies": [{"author": "naivenb1305", "id": "hbtce6h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pit23q", "stickied": false, "body": "I had it once when I was sleeping on a couch. It was too narrow; and it was scary.", "is_submitter": false, "distinguished": null, "created_utc": 1630940324.0, "parent_id": "t1_hbs8bd6", "replies": []}]}]}, {"author": "ARtEmiS_Oo", "id": "hbs6rg8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "pit23q", "stickied": false, "body": "I’ve had sleep paralysis once. It was not fun but I broke it and never had it since.", "is_submitter": false, "distinguished": null, "created_utc": 1630911538.0, "parent_id": "t3_pit23q", "replies": [{"author": "bethcano", "id": "hbs8g1w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "Glad to hear you were able to break it! Did you actively break it yourself or did the brain glitch suddenly just resolve itself?", "is_submitter": true, "distinguished": null, "created_utc": 1630912881.0, "parent_id": "t1_hbs6rg8", "replies": [{"author": "ARtEmiS_Oo", "id": "hbs8sq6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "pit23q", "stickied": false, "body": "It was an active thing I think. I remember realizing I can’t move then noticed something resembling a silent hill nurse by my side and proceeded to shit myself, then sort of realized that I can’t just lay there like a vegetable and watch so I forced myself to move. Nothing happened ofc so I pushed harder. It felt like the biggest effort I’ve ever done in my life and it’s still true to this day. Straining, I managed to break it and almost jumped out of bed because of the percieved momentum. Took me a few minuted for my breath to normalize after that.", "is_submitter": false, "distinguished": null, "created_utc": 1630913165.0, "parent_id": "t1_hbs8g1w", "replies": []}]}]}, {"author": "NootSouls", "id": "hbsbja1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #540", "submission": "pit23q", "stickied": false, "body": "When I was a kid, I got some minor hallucinations and insomnia after watching some good horror movies. Probably just anxious and scared.", "is_submitter": false, "distinguished": null, "created_utc": 1630915476.0, "parent_id": "t3_pit23q", "replies": [{"author": "bethcano", "id": "hbsfzli", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "That's understandable. I remember watching a scary TV show with my cousin and experiencing similar.", "is_submitter": true, "distinguished": null, "created_utc": 1630919460.0, "parent_id": "t1_hbsbja1", "replies": []}]}, {"author": "FreeBiskit", "id": "hbskqf3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "pit23q", "stickied": false, "body": "I’ve had both before on multiple occasions but never really daily. It’s feeling a sense of impending doom while someone in a dark hood stares me down. I always seem to squeak out a croaky “away, away!” during these sleep paralysis events which never last more than probably a few seconds.\n\nI kinda like it though, it’s like being in a real life horror film.", "is_submitter": false, "distinguished": null, "created_utc": 1630923726.0, "parent_id": "t3_pit23q", "replies": [{"author": "bethcano", "id": "hbsldgz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "That's one optimistic spin on the experience! I can't tell whether I called out loud last night begging the hallucination to stop stabbing me and let me live; if I did, I pity any of my neighbours who may have heard that!", "is_submitter": true, "distinguished": null, "created_utc": 1630924295.0, "parent_id": "t1_hbskqf3", "replies": []}]}, {"author": "Alatain", "id": "hbssv08", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pit23q", "stickied": false, "body": "I had a bout of sleep paralysis that was occasional for a few years. I slowly learned lucid dreaming and how to induce and understand the sleep paralytic state in order to combat it. It took a while and a lot of experimentation, but I am now much better at sleeping and can force a lucid dream now and again as a bonus.", "is_submitter": false, "distinguished": null, "created_utc": 1630930055.0, "parent_id": "t3_pit23q", "replies": []}, {"author": "rafael54321r", "id": "hbt36zx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #611", "submission": "pit23q", "stickied": false, "body": "Do you have social anxiety?", "is_submitter": false, "distinguished": null, "created_utc": 1630935948.0, "parent_id": "t3_pit23q", "replies": [{"author": "bethcano", "id": "hbt865w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "Nope! I'm actually an extrovert.", "is_submitter": true, "distinguished": null, "created_utc": 1630938383.0, "parent_id": "t1_hbt36zx", "replies": [{"author": "rafael54321r", "id": "hbt8xdy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #611", "submission": "pit23q", "stickied": false, "body": "Social anxiety ≠ extro/introversion.", "is_submitter": false, "distinguished": null, "created_utc": 1630938740.0, "parent_id": "t1_hbt865w", "replies": [{"author": "bethcano", "id": "hbta864", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "Well there's my new knowledge of the day! Either way, I do not have social anxiety. If you're hypothesising around the potential psychology of my disturbed sleep, extreme stress likely partly explains the paralysis and terrifying hallucinations.", "is_submitter": true, "distinguished": null, "created_utc": 1630939341.0, "parent_id": "t1_hbt8xdy", "replies": [{"author": "rafael54321r", "id": "hbtav3d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #611", "submission": "pit23q", "stickied": false, "body": "Yes and anxiety causes stress in short or long term, social anxiety is a possibility, but other general anxiety disorders are too like depression.\n\nOr just Burnout syndrome.", "is_submitter": false, "distinguished": null, "created_utc": 1630939631.0, "parent_id": "t1_hbta864", "replies": [{"author": "bethcano", "id": "hbtb85f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "I am more than happy to admit my current night demons originate from the stress of my masters thesis.\n\nInterestingly though, I can't find a cause of the other hallucinations - the benign ones. Those are a lot more random in occurrence. I've had them when I've been completely relaxed. The human brain is fascinating", "is_submitter": true, "distinguished": null, "created_utc": 1630939795.0, "parent_id": "t1_hbtav3d", "replies": [{"author": "rafael54321r", "id": "hbtd5mm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #611", "submission": "pit23q", "stickied": false, "body": "Well, even if you are relaxed your subconscious couldn't be", "is_submitter": false, "distinguished": null, "created_utc": 1630940662.0, "parent_id": "t1_hbtb85f", "replies": []}]}]}]}]}]}]}, {"author": "HM_mtl", "id": "hbta6rs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #487", "submission": "pit23q", "stickied": false, "body": "What if I am telling you... when you are experiencing sleep paralysis, you don't actually having hallucinations but everything you see and hear are real?\n\nOh, I want to add, I experienced a lot of sleep paralysis from 8yo to 35yo. That includes lucid dreams and cataplexy.", "is_submitter": false, "distinguished": null, "created_utc": 1630939323.0, "parent_id": "t3_pit23q", "replies": [{"author": "bethcano", "id": "hbtagsp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "pit23q", "stickied": false, "body": "Then I would have multiple stab wounds in me today based on last night.", "is_submitter": true, "distinguished": null, "created_utc": 1630939451.0, "parent_id": "t1_hbta6rs", "replies": []}]}, {"author": "BuccaneerRex", "id": "hbtk0rn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pit23q", "stickied": false, "body": "We think of the mind as a unified whole, because to do otherwise undermines the illusion of self we create. \n\nBut when we look deeper at the brain and its processes, while the mechanics themselves are still a bit mysterious, we can 'black box' various functions and map things out.\n\nI've read a lot about neuroscience, and I suspect that dreaming and sleep and other body functions related to them are glitchy as fuck, and that has led to quite a lot of our mythology.\n\nWe had a conversation about this the other day somewhere in the tree. The recap of my comment then was that there are systems in the brain that prevent you from moving while you dream, and that sleep paralysis is when part of your brain wakes up while that system is still turned on. Hallucinations during this are because you actually are still asleep. \n\nAs I understand it, sleep itself is needed in vertebrates because of the blood-brain barrier. The brain is protected from anything that might be in the blood by a filter that allows only certain things through. As the brain works though, waste products build up and these are not allowed through either. During sleep, pores open in the barrier and the brain can flush and refresh and repair. Different levels of sleep represent different stages in this repair process. Dreaming appears to be what the brain does while the different parts are disconnected for service. \n\nI've heard hypotheses that dreams represent the brain strengthening various neural correlates as a sort of 'training' function. Memories appear to be stored in the structure of the neural connections in various parts of the brain. The more you use a 'memory', the stronger those connections become and thus the more likely that 'memory' is to be included in the current conscious processing. So it's not really that you had a dream where you were naked on the pitcher's mound at Yankee Stadium. It's that your brain was fiddling around with various memories, sensoria, and concepts, and your bored conscious mind tried to create a coherent narrative around them.", "is_submitter": false, "distinguished": null, "created_utc": 1630943647.0, "parent_id": "t3_pit23q", "replies": []}, {"author": "SuperfluousApathy", "id": "hbw1qxm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #492", "submission": "pit23q", "stickied": false, "body": "I've had both.\n\nFirst time I was a young teen. Trapped in a room so big you couldn't see the ceiling or walls with a marble floor. Actual mountains of books stretching into the horizon in all directions. Shadow people chased me around and held me down. Couldn't move or breathe. Thought they poisoned me or something. Realized it was a dream and I immediately woke up with sleep paralysis. Struggled till I finally woke up drenched in sweat.\n\nFucking literature demons almost got me bros.", "is_submitter": false, "distinguished": null, "created_utc": 1630985574.0, "parent_id": "t3_pit23q", "replies": []}, {"author": "8445_H87252d8zXp", "id": "hbw7dsc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #620", "submission": "pit23q", "stickied": false, "body": "That happened to me when I was younger a couple times. The scariest was the \"sleep demon\" one. Imagine a pitch-black slenderman with red eyes roaming around your room, opening things soundlessly, then looks right at you and starts trudging toward you, its body parts bending and twitching. I just had to watch it; I couldn't move. Then it leaned over my bed and got really close to my face, making a sort if silent groan in the back if it's throat, even though it didn't have a mouth or anything. And then... and then... Mom opened the door to get something from my room! Totally anticlimactic. \n\nIt was actually kind of funny because I told my friends about it, and they were pretty into the occult, so they got so excited that I was \"visited by a demon\", and told me I should communicate with it or something dumb 😂😂😂. The poor things could not understand why I was not thrilled by the alledged visitaion. Good thing I googled what it actually was before I died from terror! I thought the demon was going to kill me!", "is_submitter": false, "distinguished": null, "created_utc": 1630988826.0, "parent_id": "t3_pit23q", "replies": []}]}