{"title": "Information on Developmental Trauma Disorder and C-PTSD. I feel like childhood trauma is the cause of much of society's ills. What do you think?", "name": "t3_p4fr5l", "url": "https://www.apa.org/monitor/2021/07/ce-corner-developmental-trauma", "selftext": "", "score": 6, "upvote_ratio": 0.81, "permalink": "/r/TheFlyingTree/comments/p4fr5l/information_on_developmental_trauma_disorder_and/", "id": "p4fr5l", "author": "boringlesbian", "link_flair_text": "Discussion", "num_comments": 25, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628973859.0, "comments": [{"author": "PenguinInDistress", "id": "h8yuehn", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #156", "submission": "p4fr5l", "stickied": false, "body": "The sad thing is, neglected and abused childern who have trauma do not get help for it. Their parents just don't care. \n\nIt comes to a point that you, as an individual, have to be a brave person and seek help for your issues as an adult. \n\nUnfortunately, the term generational curse is a thing. The cycle will repeat itself unless you get therapy.", "is_submitter": false, "distinguished": null, "created_utc": 1628982821.0, "parent_id": "t3_p4fr5l", "replies": [{"author": "U_L_Uus", "id": "h8yxu07", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #119 | Classis Veritatus", "submission": "p4fr5l", "stickied": false, "body": "I remember that book by the unfortunately infamous psychologist Wilhelm Reich called The Sexual Revolution, where he stated that the traditional family was made in such a way that it perpetuated itself over time in cycles of abuse from the parent to the child (and from one spouse to another). Really makes you wonder if the problems mankind has as a collective currently aren't but some kind of a twisted heritage from ages past, which we are getting rid off gradually but a little step at a time", "is_submitter": false, "distinguished": null, "created_utc": 1628984545.0, "parent_id": "t1_h8yuehn", "replies": [{"author": "HolisticHolograms", "id": "h90erlp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p4fr5l", "stickied": false, "body": "Collective unconscious. Thanks a lot, Nero and Constantine.", "is_submitter": false, "distinguished": null, "created_utc": 1629017271.0, "parent_id": "t1_h8yxu07", "replies": []}]}]}, {"author": "CactiIlluminati", "id": "h8yl0uf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #175", "submission": "p4fr5l", "stickied": false, "body": "That and heart disease. I think we have a load of people in charge with bad heart health. There's been correlation between bad heart health and arguing in couples, so it stands to reason it should be the same for those in power.", "is_submitter": false, "distinguished": null, "created_utc": 1628978245.0, "parent_id": "t3_p4fr5l", "replies": []}, {"author": "suicidejacques", "id": "h8ysl9j", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #104", "submission": "p4fr5l", "stickied": false, "body": "There have definitely been studies on childhood trauma and a host of issues that come later in life. It doesn't even have to be major trauma. There was at least one study that showed divorce at certain ages and other stressors can have a negative effect on both mental and physical health later in life. \n\nI will go back and find it, but there was a recently released study on ADHD and an increased likelihood for physical ailments. There is definitely a large link between mental and physical conditions that I think will become clearer with more studies.\n\nEdit: \n\nhttps://news.ki.se/adult-adhd-is-linked-to-numerous-physical-conditions\n\nIt was surprising to me that alcohol related liver disease was the most highly connected disease. As a person diagnosed with ADHD late in life and a several year stretch of difficulty with alcohol, I could see the correlation personally.", "is_submitter": false, "distinguished": null, "created_utc": 1628981922.0, "parent_id": "t3_p4fr5l", "replies": [{"author": "boringlesbian", "id": "h8yxyo1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "p4fr5l", "stickied": false, "body": "Thanks for the link. It was very interesting. Self medicating is definitely a problem with many psychiatric disorders. I can see where alcohol could make someone with ADHD feel better. I had a friend who was diagnosed with Bipolar Disorder and when he was in his mania phase, he loved it and didn't drink but when he came down from that, he immediately would binge drink.\n\nI think researchers are circling closer and closer to how our minds and bodies work together and effect each other. The gut biome/mood connection is very interesting.", "is_submitter": true, "distinguished": null, "created_utc": 1628984612.0, "parent_id": "t1_h8ysl9j", "replies": []}]}, {"author": "horse_loose_hospital", "id": "h8z2sam", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #128", "submission": "p4fr5l", "stickied": false, "body": "I think the more we learn about the links between genetics & endocrinology - assuming we don't self-genocide via politics or wholesale ecological collapse first - in the future there will be various therapies to combat damage that was done in our brains before we were even born. The whole idea of \"inherited trauma\" sounds like some sort of eyeroll-worthy snowflake woo-woo bs until you look into the crazy amount of studies & evidence for its existence. Stress hormones are no joke, to the point they can alter bits of our DNA...which seems nuts! It certainly explains a whoooole lot about many traits & issues we humans have that are super counterproductive, yet persist under the heading of \"human nature\".\n\nI think the whole \"childhood trauma\" argument lines up perfectly with those findings as well. If you've got a good bit of inherited trauma to begin with then add a shitty/abusive/neglectful childhood on top of it...yikes. Y'know how people always try to say dumb shit like \"oh boohoo everyone's childhood was \"*traumatic*\", I got spanked but *I* turned out fine\" (*citation needed*) or whatnot...well maybe their childhood did kinda suck, but maybe also their grandparents weren't slaves/in Auschwitz/on the Trail of Tears/in the Cultural Revolution/in the famine in Bangladesh/colonized by wankers (that one's for you, Scotland!) & etc.\n\nOf even more importance tho, imo, is...& I realize this may make me sound like a dick but we're talking science so sociology counts...I think as the older generation dies off, & everyone left has lived the majority if not all of their lives with the whole of the world's collected knowledge at their fingertips, *hopefully* the closed-mindedness of society will lessen, significantly. Already there have been, in just the last 20 or so years most of the world's been online, such exponential growth & acceptance of so many formerly taboo or eyeroll-worthy subjects. I'm an Xer but I have nothing but great excitement for that switch to occur. (Yeah I know there's plenty of closed-minded Xers but there's so far fewer of us than Boomers or Millenials, & let's be honest, our opinions have never mattered lol) I don't expect it to be an instantaneous utopia or anything but I *do* think that happening, coupled with both learning more about & learning how to combat things like inherited trauma is probably the biggest chance for us to take an evolutionary quantam leap in acceptance & understanding the human condition. \n\n(I don't know WHY my posts have become so obnoxiously long all of a sudden...apparently I have a lot to say for whatever reason & no one but poor redditors to barf it at lol sorry! :/ )", "is_submitter": false, "distinguished": null, "created_utc": 1628987062.0, "parent_id": "t3_p4fr5l", "replies": [{"author": "boringlesbian", "id": "h8z5l7n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "p4fr5l", "stickied": false, "body": "I'm also GenX and I love how, generally, I see a trend towards wanting to get therapy and work on being better people in the younger generations. Besides the whole \"world is ending\" thing, I'm actually pretty hopeful for the psychology of future generations.\n\nGenerational trauma is fascinating and I truly believe it factors in to a lot of how some people are more resilient and yet fragile at the same time.", "is_submitter": true, "distinguished": null, "created_utc": 1628988497.0, "parent_id": "t1_h8z2sam", "replies": []}]}, {"author": "ennovyelechim", "id": "h90kt9l", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "p4fr5l", "stickied": false, "body": "I'm not shy about saying this I have c-ptsd. It took me 30 years to get the diagnosis even then a Dr just said of course you're struggling you have c-ptsd like I knew. I had no idea. It was only because I was on a medication that was totally wrong I saw a consultant psychiatrist who filled me in on my condition. It helps to understand why I am who I am, how my triggers work so I can minimise their impact.\n\nI won't bore you about how I got it I'll just say many horrible things happened from the age of 3 onwards. I cope I have to but what is awful is when people dismiss it because I wasn't in the military. If you live through life threatening events over and over it will make an impact. The other downside is people assuming I'm a ticking time bomb. I'm not, I don't ever raise my voice in anger I am not and never have been violent in anyway, the violence I suffered makes it abhorrent to me.  I'm hoping the wider population will begin to understand the difference between combat PTSD  and C-PTSD its not the same and the stereotyping that Hollywood perpetuates needs to stop. In my circle we are more likely to be hiding at home than going postal with a machine gun but the media only ever shows this perspective. Its time to turn a page on this and stop this at the source in childhood before the damage is done.", "is_submitter": false, "distinguished": null, "created_utc": 1629022645.0, "parent_id": "t3_p4fr5l", "replies": [{"author": "boringlesbian", "id": "h91cdjx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "p4fr5l", "stickied": false, "body": "Have you watched [\"Anne with an E\"](http://www.greenheartguidance.com/blog/anne-with-an-e-and-c-ptsd)? It does a great job of showing what c-ptsd feels like.", "is_submitter": true, "distinguished": null, "created_utc": 1629039452.0, "parent_id": "t1_h90kt9l", "replies": [{"author": "ennovyelechim", "id": "h91cg50", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "p4fr5l", "stickied": false, "body": "No but I'll definitely look it up.", "is_submitter": false, "distinguished": null, "created_utc": 1629039484.0, "parent_id": "t1_h91cdjx", "replies": []}]}]}, {"author": "therapythrowaway1205", "id": "h8ygcyd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "p4fr5l", "stickied": false, "body": "Partially. I think it also stems from nature. Some people are simply born evil, and that small amount of evil people pray on the rest and then those who are hurt become disfigured and destroy what they touch and the cycle continues.\n\nBut if we could hone in on those truly evil people. That would be a good start.", "is_submitter": false, "distinguished": null, "created_utc": 1628976055.0, "parent_id": "t3_p4fr5l", "replies": [{"author": "boringlesbian", "id": "h8yhp0s", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "p4fr5l", "stickied": false, "body": "I agree that some people are just born without the ability to empathize and who enjoy sadistic power over others, but I think that we as a society need to do more about preventing those who aren't born that way from turning into those types of people. [The percentage of people in prison who admit to experiening childhood trauma is high.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3386595/) I don't think most of them were born \"evil\".", "is_submitter": true, "distinguished": null, "created_utc": 1628976670.0, "parent_id": "t1_h8ygcyd", "replies": [{"author": "therapythrowaway1205", "id": "h8yjy3o", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "p4fr5l", "stickied": false, "body": "Oh I agree. Problem is if it is to that level how much of that has been absorbed into the personality and how much effort is the individual in question willing to work on themselves. Some are simply unable to if the trauma has been so bad.\n\nI’m all for rehabilitation for criminals I just don’t think in practice it will always work, especially depending on the person in question and the willingness of the person. Which depending on the diagnosis may be predisposed to being resistant to treatment and you can’t force someone to change psychologically without dipping into abuse yourself.\n\nHopefully that makes sense. But I do fundamentally agree. It’s hard to undo damage though once it has been done and it’s be better to catch it prior to the person acting out in an antisocial behavior.", "is_submitter": false, "distinguished": null, "created_utc": 1628977737.0, "parent_id": "t1_h8yhp0s", "replies": [{"author": "boringlesbian", "id": "h8yl30e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "p4fr5l", "stickied": false, "body": "Rehabilitation is possible if the person is willing, but what I am talking about it catching it earlier. California, a couple of years ago, decided to start screening kids early for trauma. The [ACE scale](https://www.cdc.gov/violenceprevention/aces/index.html), although I think it is somewhat flawed, should help identify kids that need help dealing with trauma and possibly prevent that child from turning to crime, violence, suicide, or self medicating.", "is_submitter": true, "distinguished": null, "created_utc": 1628978275.0, "parent_id": "t1_h8yjy3o", "replies": [{"author": "therapythrowaway1205", "id": "h8ym2v4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "p4fr5l", "stickied": false, "body": "I’ve seen the ace scale before, I don’t think it’s too bad and would catch extreme cases. I mean honestly that’s the best bet though, catching it early and getting them appropriate help but usually they need approval from parents unless it becomes a cps issue which they don’t always catch it as abusers can be very good at putting on a front for short duration of time. \n\nNeeds more funding. Human services are over worked under paid and particularly prone to burn out. I was going to go into that career path but the early burn out with low pay was a turn off. I’m an introvert more so then most I would’ve been fucked without being much help to anyone.", "is_submitter": false, "distinguished": null, "created_utc": 1628978742.0, "parent_id": "t1_h8yl30e", "replies": [{"author": "boringlesbian", "id": "h8yniay", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "p4fr5l", "stickied": false, "body": "Human service does have a lot of problems. My theory, having dealt extensively with people who work for HS, is that so many people drawn to helping children were abused themselves and want to prevent that from happening to others. This is noble, but some of them have never done the work on themselves enough to handle the stress of it. We need better funding and better training of everyone trying to help children.", "is_submitter": true, "distinguished": null, "created_utc": 1628979439.0, "parent_id": "t1_h8ym2v4", "replies": [{"author": "therapythrowaway1205", "id": "h8ynmfb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "p4fr5l", "stickied": false, "body": "That I agree with for sure. Problem is getting the funding in the first place.", "is_submitter": false, "distinguished": null, "created_utc": 1628979495.0, "parent_id": "t1_h8yniay", "replies": [{"author": "boringlesbian", "id": "h8ynrii", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "p4fr5l", "stickied": false, "body": "How about we divert some from the military? They really have a lot.", "is_submitter": true, "distinguished": null, "created_utc": 1628979562.0, "parent_id": "t1_h8ynmfb", "replies": [{"author": "therapythrowaway1205", "id": "h8yo6vv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "p4fr5l", "stickied": false, "body": "That, or include incentives for big businesses to pour money in or also cut the salaries of literally anyone in government. Honestly just do all three lmao", "is_submitter": false, "distinguished": null, "created_utc": 1628979770.0, "parent_id": "t1_h8ynrii", "replies": [{"author": "Cheomesh", "id": "h90lk25", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p4fr5l", "stickied": false, "body": "Gov salaries are not great.", "is_submitter": false, "distinguished": null, "created_utc": 1629023295.0, "parent_id": "t1_h8yo6vv", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "Cheomesh", "id": "h90l3h3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p4fr5l", "stickied": false, "body": "Nah we're just shit in general.", "is_submitter": false, "distinguished": null, "created_utc": 1629022889.0, "parent_id": "t3_p4fr5l", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h8ypf7p", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p4fr5l", "stickied": false, "body": ">What do you think?\n\nNo, people lack of willingness to pull on their boot straps, and blaming others for their problems is.", "is_submitter": false, "distinguished": null, "created_utc": 1628980376.0, "parent_id": "t3_p4fr5l", "replies": []}, {"author": "SybariteAussie", "id": "h9ad70a", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p4fr5l", "stickied": false, "body": "Media & society have coddled our minds with fantasy and strive to blur reality. As we are more educated than our ancestors we behave as taught. We are more self aware. The downside of this is we can be overwhelmed by emotions. In WW1 the officers & educated were far more likely to suffer shell shock than, the can barely read working class. Atrocities have been ever present. Many cultures in cold climates ate their children during harsh winters. During famines in Britain. The peasants with insufficient food to get through winter. Would meet by the cliffs. Sing some hymns, hold hands & jump off. We all have electricity, hot & cold water in our houses. We all have at least one toilet,fridge,washing machine,microwave,tv & access to the internet. The largest source of information that the world has ever known. The selection of food available at the supermarket never ceases to amaze me! You can buy a chicken that’s already cooked at the supermarket now. I always overcook chicken when I try to. When I grew up everyone would get a thrashing at home. Some more than others. We were also belted,caned or just thumped,slapped or backhanded at school by teachers. Violence was common. Teachers would saunter around with long fearsome leather belts hanging over their shoulders and used them enthusiastically. Usually you were thrashed in front of the class or entire school. In Britain there was a 3 course meal for everyone at lunch. Some children were not guaranteed a breakfast or dinner at home.", "is_submitter": false, "distinguished": null, "created_utc": 1629207011.0, "parent_id": "t3_p4fr5l", "replies": []}]}