{"title": "Top 5 Regrets of the Dying", "name": "t3_oo6w35", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oo6w35/top_5_regrets_of_the_dying/", "selftext": "Another post on here had me reminiscing about the years I spent volunteering at hospice centers and taking care of the elderly. That lead me to look up this list again and read it. Whenever I’m feeling “off” in my life or misaligned, I like to sit with myself and usually a journal and go through where my priorities are/where I am inappropriately spending my most valuable resources: time and energy. Usually calling to mind this list and other things that I think truly matter to me now and will ALSO truly matter to me on my deathbed, helps me repriortize where I am spending my time and energy. \n\n\n1. I wish I’d had the courage to live a life true to myself, not the life others expected of me.\n\n2. I wish I hadn’t worked so hard.\n\n3. I wish I’d had the courage to express my feelings.\n\n4. I wish I had stayed in touch with my friends.\n\n5. I wish that I had let myself be happier.\n\n\nWhat do you think of this list? What does it make you think about? How does it make you feel? Is there anything you are surprised to see? Anything you would add?\n\nTwo things are coming up for me right now: \n\n1) I haven’t looked into if these are regrets of the dying universally or just regionally which leads me to wonder if the “working so hard” regret is more prevalent in America/western culture where IMO we as a society over emphasize the importance of careers and often explicitly and implicitly promote the message that happiness equals success determined by the amount of one’s material prosperity. Not to mention the damage that can occur from people defining themselves and their self-worth by their careers. \n\n2) In regards to the last one… Why do we not allow ourselves to be happier? Do we self sabotage a lot? Is it because we focus too much on the past and are depressed and we focus too much on the future and are anxious?What else gets in the way? What do we do to not allow ourselves to be happy?\n\nEdit to add source: \nhttps://www.forbes.com/sites/kathycaprino/2019/12/13/the-top-regrets-of-the-dying-and-what-we-need-to-learn-from-them/?sh=5deb0cdb7ce7", "score": 29, "upvote_ratio": 0.97, "permalink": "/r/TheFlyingTree/comments/oo6w35/top_5_regrets_of_the_dying/", "id": "oo6w35", "author": "campaigner1147", "link_flair_text": "Discussion", "num_comments": 40, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1626802542.0, "comments": [{"author": "shig23", "id": "h5wuhf3", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "oo6w35", "stickied": false, "body": "I wonder how much age affects those priorities. I lost someone who was relatively young, who regretted not accomplishing more with their life.", "is_submitter": false, "distinguished": null, "created_utc": 1626809641.0, "parent_id": "t3_oo6w35", "replies": [{"author": "campaigner1147", "id": "h5wwia9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "I am so sincerely sorry for your loss. That's a very good point. I think this is probably referring more to people who died in old age. That absolutely makes sense that someone younger would have different regrets... I imagine it would be specifically around not getting the chance to experience a variety of things perhaps mostly have to do with life's big milestones (graduating, getting married, accomplishing some dream ect.)  Would you be open to sharing anything more about what your loved one regretted not being to do/have? As horrible as death is, when I experience a loss the very minimum I feel I can do is try not to take my life and the whole experience of living for granted.  Of course if you don't want to share anymore, that's 100% okay. Thanks for your reply.", "is_submitter": true, "distinguished": null, "created_utc": 1626810493.0, "parent_id": "t1_h5wuhf3", "replies": []}]}, {"author": "BuccaneerRex", "id": "h5wxsco", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "oo6w35", "stickied": false, "body": "Surprised the number one regret isn't 'dying'.", "is_submitter": false, "distinguished": null, "created_utc": 1626811021.0, "parent_id": "t3_oo6w35", "replies": [{"author": "campaigner1147", "id": "h5x19hr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "Your comment made me quite literally laugh out loud whether that was your intent or not, thank you. \n\nUpon reflecting on your comment I thought about how I always interpreted “regret” as having to do with the past and when I looked up the exact definitions confirmed it: \n“To feel sad, repentant, or disappointed over something that has happened or been done especially a loss or missed opportunity.”\n\nSo considering that fact, I guess no one alive can actually regret dying since the act of death is going to happen in your future. I also feel like most regrets that I can think of have to do with things that are in a person’s control. Like you regret not asking that person on a date or going to your son’s soccer game or taking that trip. I’m trying to think if there are any instances where people would use the word “regret” for something they don’t have control over…? Like I don’t think I know of anyone who would say I regret that I got cancer or I regret a hurricane hit my home, ya know?", "is_submitter": true, "distinguished": null, "created_utc": 1626812493.0, "parent_id": "t1_h5wxsco", "replies": [{"author": "BuccaneerRex", "id": "h5xmq1r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "oo6w35", "stickied": false, "body": "To borrow a quote from a song, 'Something's wrong when you regret/things that haven't happened yet.'\n\nTo borrow a quote from a TV show: My only regret is that I have boneitis. \\*dies\\*\n\nNot remaining alive seems like a fairly large opportunity to miss. Worth regretting, if you ask me.\n\nI'd like to gain immortality through not dying.", "is_submitter": false, "distinguished": null, "created_utc": 1626822088.0, "parent_id": "t1_h5x19hr", "replies": []}]}]}, {"author": "FreyjaSunshine", "id": "h5xtr63", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "oo6w35", "stickied": false, "body": "I am a survivor of an abusive marriage that went on way too long.  I very much regret not being able to escape sooner, however, the person I am today is the result of all of those experiences.  \n\nWhen I broke free ten years ago, I started living life much differently, embracing points 1, 3 and 5.  Regarding work, I love what I do, but I no longer allow myself to be in situations where I feel I am being taken advantage of.  When that happened at the start of the pandemic, I found a better work situation.  I still work hard, but it's on my terms.  \n\nI don't have huge numbers of friends, but I make an effort to see them and do things with them.  I also dropped a few friends.  I'd rather have a few good friends than many iffy friends.  \n\nI think these are all valid points, and something to reflect on from time to time.  \n\nI don't think we *let* ourselves be happy, we *make* our own happiness.  That's the biggest lesson I learned from my marriage:  my happiness is up to me to create, protect, and enjoy.", "is_submitter": false, "distinguished": null, "created_utc": 1626825485.0, "parent_id": "t3_oo6w35", "replies": [{"author": "campaigner1147", "id": "h5y6lu6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "I am so sorry that you were mistreated that way. No one deserves that. I'm glad you got out. There is a lot of wisdom in your post. I completely agree that I would not be who I am if it weren't for the experiences, even the horrible traumas that I've lived. That's amazing that you learned the secret to making your own happiness... I've been on that journey for about 2 years now. And YES to having quality friends over quantity. high fives all around!", "is_submitter": true, "distinguished": null, "created_utc": 1626831745.0, "parent_id": "t1_h5xtr63", "replies": []}]}, {"author": "Btankersly66", "id": "h5wkk0f", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "oo6w35", "stickied": false, "body": "People ask me, 'If you could change one thing in your past that would change everything now what would it be?' My answer is always, 'Nothing.'\n\nThere is no way I can imagine that changing anything in my past would have caused a different outcome in my present. All I am is alive. And being alive doesn't nessesarily fill me with any profound sense of meaning or purpose. Because any measure of value, I could personally use to determine whether my state of being alive is better than being dead, can't be demonstrated. It seems like being alive is better than being dead but I'll never truly know.", "is_submitter": false, "distinguished": null, "created_utc": 1626805438.0, "parent_id": "t3_oo6w35", "replies": [{"author": "haz_mat_", "id": "h5x4v6y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "oo6w35", "stickied": false, "body": "Bingo. You would not be who you are today if you changed any of your past. All your experiences, successes, and mistakes have formed you into who you are.\n\nI've seen both sides of the spectrum - seniors with lots of regrets and others without. It's usually the ones with regrets who fear death, while the others are able to embrace their life by accepting death.", "is_submitter": false, "distinguished": null, "created_utc": 1626814031.0, "parent_id": "t1_h5wkk0f", "replies": []}, {"author": "theomniexperience", "id": "h5xlfi2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo6w35", "stickied": false, "body": "This.\n\nLiving in regret is living in the past. We only have the here and now. The more you can value this the more you will truly live.", "is_submitter": false, "distinguished": null, "created_utc": 1626821479.0, "parent_id": "t1_h5wkk0f", "replies": []}, {"author": "risisas", "id": "h5xu1o1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #280", "submission": "oo6w35", "stickied": false, "body": "Yes", "is_submitter": false, "distinguished": null, "created_utc": 1626825626.0, "parent_id": "t1_h5wkk0f", "replies": []}, {"author": "risisas", "id": "h5xu1ok", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #280", "submission": "oo6w35", "stickied": false, "body": "Yes", "is_submitter": false, "distinguished": null, "created_utc": 1626825626.0, "parent_id": "t1_h5wkk0f", "replies": []}, {"author": "campaigner1147", "id": "h5xx4u0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "I see what you are saying and I'm wondering if you are saying it in a sort of opposition to the point I was making or if you are just adding to the discussion...? Because I think that the point you made can coexist with what I said, can it now? I like to use this list to better my life in the present. I agree that the philosophy of having no regrets and simply accepting the way things are exactly the way they are in your life in the here and now is a very beneficial way to live and can lead to a lot of contentment. We can do that, we can live with that philosophy and we can also learn from other people (especially those who have lived longer than us) how to live our lives to the fullest potential in the here and now. \n\nI know that I cannot avoid all mistakes in life--or rather I cannot avoid making choices that may have unpleasant or uncomfortable outcomes--but I would rather make educated and informed choices to the best of my ability then to live completely ignorant and chose blindly, ya know? So I value and appreciate this insight and advice from people who have reached the end of their lives and the wisdom that they can impart on how I chose to live my life in the current moment. Even if I still choose to live with no regrets. ;)", "is_submitter": true, "distinguished": null, "created_utc": 1626827139.0, "parent_id": "t1_h5wkk0f", "replies": []}]}, {"author": "Niskanen204", "id": "h5woxwt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "oo6w35", "stickied": false, "body": "> I wish I’d had the courage to live a life true to myself, not the life others expected of me.\n\nThis one is tricky in a certain context, because often what we think we want (e.g. freedom, no ties/commitments) could very well end up being a major regret when older.\n\n> I wish I hadn’t worked so hard.\n\nYeah, a no brainer - the only thing I want to work hard at are my own projects.\n\n> I wish I’d had the courage to express my feelings.\n\nI don't see this being an issue nowadays - everyone in my life seems too comfortable generating a spectacle over the most minor thing.\n\n> I wish I had stayed in touch with my friends.\n\nYeah, 100%. No contest.\n\n> I wish that I had let myself be happier.\n\nI mean, are people really out there consciously preventing themselves from being happy? I'm not sure what this sentiment means. Is this perhaps a Christian thing? Seems more like, \"I wish I knew how to have made myself happier\" better fits.", "is_submitter": false, "distinguished": null, "created_utc": 1626807297.0, "parent_id": "t3_oo6w35", "replies": []}, {"author": "REZJAM_Eric", "id": "h5x1nk2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #109", "submission": "oo6w35", "stickied": false, "body": "I'm (hopefully) nowhere near my death bed, but I've already come to terms that I will have regrets. I've also come to terms that I will be okay that I have regrets. I make mistakes because I'm stupid or have incomplete information, but I do the best I can. And the decisions I've made and will make in the future that cause me \"not to be happy\" are generally for the greater good (aka for the people I love).\n\nI've made several \"unhappy\" decisions to keep my dad happy, and these are decisions I'd make again knowing what I know now. We live in a society and our decisions impact others. Some of the happiest people I've met are the most selfish and not to be melodramatic, they leave a \"trail of destruction\" behind them. Good for them, bad for those around them. Sometimes your happiness comes at the expense of those around you.", "is_submitter": false, "distinguished": null, "created_utc": 1626812662.0, "parent_id": "t3_oo6w35", "replies": []}, {"author": "floofandmemes", "id": "h5x5zg4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "oo6w35", "stickied": false, "body": "It makes sense tbh. Often, people are too focused either living in the past of pursuing the future to try and appreciate what's in the moment, which is really the part of your life you can generally affect.", "is_submitter": false, "distinguished": null, "created_utc": 1626814501.0, "parent_id": "t3_oo6w35", "replies": [{"author": "campaigner1147", "id": "h5xbg8x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "Yes! Life is found in the present moment!", "is_submitter": true, "distinguished": null, "created_utc": 1626816895.0, "parent_id": "t1_h5x5zg4", "replies": []}]}, {"author": "metalhev", "id": "h5x8wlk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo6w35", "stickied": false, "body": "0. I wish I had punched my boss a couple thousand more times", "is_submitter": false, "distinguished": null, "created_utc": 1626815765.0, "parent_id": "t3_oo6w35", "replies": [{"author": "HecknChonker", "id": "h5xpub3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #137", "submission": "oo6w35", "stickied": false, "body": "This implies you have punched him some number of times already.", "is_submitter": false, "distinguished": null, "created_utc": 1626823578.0, "parent_id": "t1_h5x8wlk", "replies": [{"author": "metalhev", "id": "h5zj8zx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo6w35", "stickied": false, "body": "In my heart, I punch him everyday", "is_submitter": false, "distinguished": null, "created_utc": 1626862392.0, "parent_id": "t1_h5xpub3", "replies": []}]}, {"author": "campaigner1147", "id": "h5xbh07", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "😂😂", "is_submitter": true, "distinguished": null, "created_utc": 1626816905.0, "parent_id": "t1_h5x8wlk", "replies": []}]}, {"author": "LoreleiOpine", "id": "h5xc4hv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "oo6w35", "stickied": false, "body": "Cite your source.", "is_submitter": false, "distinguished": null, "created_utc": 1626817196.0, "parent_id": "t3_oo6w35", "replies": [{"author": "campaigner1147", "id": "h5xv68n", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "Done ✔️", "is_submitter": true, "distinguished": null, "created_utc": 1626826179.0, "parent_id": "t1_h5xc4hv", "replies": []}]}, {"author": "atlasgaveup", "id": "h5xel8c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oo6w35", "stickied": false, "body": "You are the driver in your car of life. The destination and how you arrive there is your choice.", "is_submitter": false, "distinguished": null, "created_utc": 1626818304.0, "parent_id": "t3_oo6w35", "replies": [{"author": "145676337", "id": "h5xlu0h", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #116", "submission": "oo6w35", "stickied": false, "body": "Until some other driver hits the side of your car and then as you get back on the road more dinged up someone else swerves from the other direction and totals your car in a head on collision.\n\nThere is so much we control but also so much we don't.", "is_submitter": false, "distinguished": null, "created_utc": 1626821669.0, "parent_id": "t1_h5xel8c", "replies": []}]}, {"author": "Happy_INTP", "id": "h5y0wu9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #69", "submission": "oo6w35", "stickied": false, "body": "The key to not having regrets is to live in gratitude now.  The first step towards happiness is accepting reality not wishing it were different.  :)\n\nEdit: Oh yeah, now say Ommmmm.....   :D", "is_submitter": false, "distinguished": null, "created_utc": 1626829015.0, "parent_id": "t3_oo6w35", "replies": []}, {"author": "human_shadow", "id": "h5y5l5g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #3", "submission": "oo6w35", "stickied": false, "body": "Remember to live while dying.", "is_submitter": false, "distinguished": null, "created_utc": 1626831272.0, "parent_id": "t3_oo6w35", "replies": [{"author": "campaigner1147", "id": "h5y76w7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "True! Very true. Do you ever think about the fact that ever since we started life we are dying? I mean we only have a finite number of days of existence, like a bowl full of beads and each day that passes is another bead taken out of the bowl. Each minute that passes we are all taking a step closer towards death...\n\njeesh sounds so morbid when I write it out but I think about it a lot.\n\nedit to add: and to clarify, when I think about it, it is not in a depressing way but like a wake up call of TRUTH that is often forgotten, reminding me to cherish each and every moment that we have with our loved ones and the things on this beautiful planet that we personally treasure.", "is_submitter": true, "distinguished": null, "created_utc": 1626832021.0, "parent_id": "t1_h5y5l5g", "replies": [{"author": "human_shadow", "id": "h5yciui", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #3", "submission": "oo6w35", "stickied": false, "body": "Since I was a wee one. A family member died when I was young. Some thought they were being helpful by saying the family member was 'sleeping'.\n\nI remember being adamant about they were not sleeping.\n\nWhen I was a small child, I thought of life as a large body of water, the ocean. \n\nI used to think each life was one droplet of water from the ocean that would briefly be a single droplet before falling back into the ocean. I remember saying that they were a drop of water that went back to the ocean. Lol\n\nSomeday, I'll go back to the ocean too.", "is_submitter": false, "distinguished": null, "created_utc": 1626834583.0, "parent_id": "t1_h5y76w7", "replies": [{"author": "campaigner1147", "id": "h5yph8n", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "This is so poetic and beautiful it actually brought tears to my eyes. I love that imagery of the ocean as I think of loved ones I have lost and as I think about my own death. Also, I'm amazed to find someone that isn't weirded out or creeped out by my thinking. Feels good. Sometimes people tell me \"I think too much.\" Thanks for being you and sharing your thoughts.", "is_submitter": true, "distinguished": null, "created_utc": 1626841176.0, "parent_id": "t1_h5yciui", "replies": []}]}]}]}, {"author": "French-Potatoes", "id": "h5zjo59", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #77 | Classis Veritatus", "submission": "oo6w35", "stickied": false, "body": "Hmm I feel like it’s very helpful to reflect back once in a while and ask “What would I regret if I were to die right now?” Sorry if this was mentioned somewhere and I didn’t see lol", "is_submitter": false, "distinguished": null, "created_utc": 1626862756.0, "parent_id": "t3_oo6w35", "replies": []}, {"author": "TotallySpaghettironi", "id": "h604luq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #235", "submission": "oo6w35", "stickied": false, "body": "I'm not necessarily sure how 1 should come true... There's different parts to myself, and some of those I don't actually want to express", "is_submitter": false, "distinguished": null, "created_utc": 1626875760.0, "parent_id": "t3_oo6w35", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h62ul8x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oo6w35", "stickied": false, "body": "I knew quite a few older people who all told me the same thing they said \"don't get old.\"  I took that to heart especially since it came from more than one of them. So I try to live every week/month like it's my last.  Take that vacation, buy the guitar, you know don't put it off.", "is_submitter": false, "distinguished": null, "created_utc": 1626919273.0, "parent_id": "t3_oo6w35", "replies": [{"author": "campaigner1147", "id": "h637g5n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "I love that. So true! Meaningful words because I just came back from surfing and even though I had a million more work things to do, the to do list will always be there and I truly believe the fullest of living is doing the things that make me feel the most alive, so i just abandoned ship and went. Surfed the sunset. Zero regrets. Thanks for the reminder!", "is_submitter": true, "distinguished": null, "created_utc": 1626926054.0, "parent_id": "t1_h62ul8x", "replies": []}]}, {"author": "bernpfenn", "id": "h5xft8v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "oo6w35", "stickied": false, "body": "distractions from perceiving the now.", "is_submitter": false, "distinguished": null, "created_utc": 1626818866.0, "parent_id": "t3_oo6w35", "replies": [{"author": "campaigner1147", "id": "h5xv5dc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "Do you think this list is a distraction from perceiving the now? Or a regret you would add would be distractions from perceiving the now?", "is_submitter": true, "distinguished": null, "created_utc": 1626826167.0, "parent_id": "t1_h5xft8v", "replies": [{"author": "bernpfenn", "id": "h5y3sm8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "oo6w35", "stickied": false, "body": "is was my answer to why we are not happier.", "is_submitter": false, "distinguished": null, "created_utc": 1626830420.0, "parent_id": "t1_h5xv5dc", "replies": [{"author": "campaigner1147", "id": "h5y8ajx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #115", "submission": "oo6w35", "stickied": false, "body": "gotcha", "is_submitter": true, "distinguished": null, "created_utc": 1626832545.0, "parent_id": "t1_h5y3sm8", "replies": []}]}]}]}, {"author": "DrEvyl666", "id": "h6056oh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #153", "submission": "oo6w35", "stickied": false, "body": "> I wish I’d had the courage to live a life true to myself, not the life others expected of me.\n\nI feel like I have done this.  I have never really given a crap about what others expect of me.\n\n\n>I wish I hadn’t worked so hard.\n\nI'm pretty lazy, and only work hard on stuff I really enjoy... so I don't feel I will have this regret.\n\n>I wish I’d had the courage to express my feelings.\n\nNot something I have an issue with.. Personally I wish I had expressed my feelings LESS in some situations.  LOL\n\n> I wish I had stayed in touch with my friends.\n\nYeah, I can relate with this one.  I am terrible at keeping in touch with people so now my circle of close friends is pretty small.  Only a couple of them live within 1000 miles of me.\n\n>I wish that I had let myself be happier.\n\nI think I have done okay on this one... but I always believe that if I'm totally happy with everything I'm not working on improving hard enough.", "is_submitter": false, "distinguished": null, "created_utc": 1626876029.0, "parent_id": "t3_oo6w35", "replies": []}, {"author": "ciaomoose", "id": "h608dsi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oo6w35", "stickied": false, "body": "\\#1 requires a shoutout to my fellow LGBT folks. The struggle is real. \n\nI wouldn’t say I regret much of what I actually had the power to change in my life, but there were certainly some unfortunate events out of my control that I could’ve done without.", "is_submitter": false, "distinguished": null, "created_utc": 1626877480.0, "parent_id": "t3_oo6w35", "replies": []}]}