{"title": "So... who wants to take over the world?", "name": "t3_pe1t5x", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pe1t5x/so_who_wants_to_take_over_the_world/", "selftext": "Obviously, we have all been selected to join here due to our supreme intellects - any time this happens, there must be a greater cause (trust me, I saw it in a movie).\n\nSo, seen as we will inevitably end up controlling the world one day, that will give us the power to change anything we don't like about it and reform society into a system that's more beneficial to everyone.\n\nSince that's a pretty big task, I figure we should probably start planning now. Therefor, my question to you, fellow intellects, is this: If you had unlimited power (within reason), how would you reorganise our world?", "score": 16, "upvote_ratio": 0.94, "permalink": "/r/TheFlyingTree/comments/pe1t5x/so_who_wants_to_take_over_the_world/", "id": "pe1t5x", "author": "Combustible_Lemons64", "link_flair_text": "Discussion", "num_comments": 52, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630264993.0, "comments": [{"author": "Btankersly66", "id": "hauasuv", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "pe1t5x", "stickied": false, "body": "No more kidney stones.", "is_submitter": false, "distinguished": null, "created_utc": 1630266391.0, "parent_id": "t3_pe1t5x", "replies": [{"author": "Alirezahjt", "id": "haug4j1", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "pe1t5x", "stickied": false, "body": "After passing a 5mm one a few months ago, I totally agree.", "is_submitter": false, "distinguished": null, "created_utc": 1630268667.0, "parent_id": "t1_hauasuv", "replies": [{"author": "Btankersly66", "id": "haveaf9", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "pe1t5x", "stickied": false, "body": "9mm", "is_submitter": false, "distinguished": null, "created_utc": 1630284489.0, "parent_id": "t1_haug4j1", "replies": [{"author": "Alirezahjt", "id": "hawdi8x", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "pe1t5x", "stickied": false, "body": "I cannot even imagine what you've gone through.", "is_submitter": false, "distinguished": null, "created_utc": 1630304186.0, "parent_id": "t1_haveaf9", "replies": []}]}]}]}, {"author": "Cognizant_Psyche", "id": "haubnp2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pe1t5x", "stickied": false, "body": "No thanks.  It’s too much work and I’m too lazy.  Not nearly enough incentive or reward for the effort running a global civilization.  Power and control really don’t have any appeal to me so I’d instead use that power to discreetly set up a self sustaining compound somewhere remote and then relinquish control to the shadow organizations.\n\nThere is no way to unit the globe under one ideology and banner, save for some plot like posited in the Watchmen (novel) of an external threat.  And even that is a temporary measure as eventually we’ll start fighting amongst ourselves.", "is_submitter": false, "distinguished": null, "created_utc": 1630266753.0, "parent_id": "t3_pe1t5x", "replies": [{"author": "SeizureHamster", "id": "havujnw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #206", "submission": "pe1t5x", "stickied": false, "body": "Same!", "is_submitter": false, "distinguished": null, "created_utc": 1630292527.0, "parent_id": "t1_haubnp2", "replies": []}]}, {"author": "Itsbadmmmmkay", "id": "haujqlf", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #92", "submission": "pe1t5x", "stickied": false, "body": "The same thing we do every day, Pinkie...", "is_submitter": false, "distinguished": null, "created_utc": 1630270232.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "FreyjaSunshine", "id": "hauj7xu", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "pe1t5x", "stickied": false, "body": "I'd get rid of religion.  That would solve a lot of problems right there.", "is_submitter": false, "distinguished": null, "created_utc": 1630270009.0, "parent_id": "t3_pe1t5x", "replies": [{"author": "Virtual_Pasts", "id": "haukyr1", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #264", "submission": "pe1t5x", "stickied": false, "body": "I'll enjoy rebelling against you, then, fellow Seeker.", "is_submitter": false, "distinguished": null, "created_utc": 1630270768.0, "parent_id": "t1_hauj7xu", "replies": [{"author": "FreyjaSunshine", "id": "havgvqj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "pe1t5x", "stickied": false, "body": "I'm not in charge yet, so you may continue your delusional approach to life.  \n\nI would kindly ask that you refrain from imposing your beliefs, customs, and traditions on those who choose not to follow your leaders.  \n\nIf you haven't objectively looked at what your religion teaches, and the effect that it has on both believers and non-believers, I encourage you to do so.", "is_submitter": false, "distinguished": null, "created_utc": 1630285738.0, "parent_id": "t1_haukyr1", "replies": [{"author": "Virtual_Pasts", "id": "havhqlg", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #264", "submission": "pe1t5x", "stickied": false, "body": "Thanks for your permission, but I really don't need it. I'll practice my faith and you're free to think whatever you want about that. What I believe isn't anyone's business but mine and it isn't something I freely share for a number of reasons. My religious beliefs have no evangelism or anything attached, and there are no issues with non-believers. There also aren't any leaders to follow, so there's that.\n\nI have spent quite a lot of time studying religion academically, though it isn't my research focus at all.   I appreciate your concern, though. A healthy love of learning, a passion for research, and education are all really important virtues to me. If you consider that delusional, then I bet there isn't any meaningful conversation to be had between us. I can only hope that you never get any real power over others and if you do I can help prevent you from harming people and controlling them and what they can and cannot think.", "is_submitter": false, "distinguished": null, "created_utc": 1630286160.0, "parent_id": "t1_havgvqj", "replies": [{"author": "FreyjaSunshine", "id": "havj1um", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "pe1t5x", "stickied": false, "body": "No need to worry, I absolutely do not want any power over others.  \n\nWhat I object to is those who think they have a right to determine what other people do with their bodies, who they have sex with (I will never understand religions' preoccupation with sex), the homophobia, the racism, and all of the baggage that accompanies most religions.  \n\nYour love of learning, research and education seem diametrically opposed to the whole \"faith\" part of religions, and of course, are not delusional.  What I consider delusional is the belief that a magical supernatural dude knows everything and loves you, but works in mysterious ways and is cool with suffering (and misogyny, racism, homophobia, etc).\n\nYou do you.  Just don't make me do it.", "is_submitter": false, "distinguished": null, "created_utc": 1630286804.0, "parent_id": "t1_havhqlg", "replies": [{"author": "Virtual_Pasts", "id": "havjvyr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #264", "submission": "pe1t5x", "stickied": false, "body": "I think we'd get along well, then. I'm strongly opposed to prejudice and bigotry, especially against marginalized groups. I'm queer myself.", "is_submitter": false, "distinguished": null, "created_utc": 1630287219.0, "parent_id": "t1_havj1um", "replies": [{"author": "FreyjaSunshine", "id": "havkm0r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "pe1t5x", "stickied": false, "body": "We probably would.  :)\n\nI'm cis-het, but a mama bear ally to the people in my life who are not.", "is_submitter": false, "distinguished": null, "created_utc": 1630287576.0, "parent_id": "t1_havjvyr", "replies": [{"author": "Virtual_Pasts", "id": "havl4gq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #264", "submission": "pe1t5x", "stickied": false, "body": "Well, thanks for being an ally! I really appreciate allies. Sorry for spraying my delusions everywhere or whatever. I'm just a supporter of freedom of thought and academic discourse over authoritarian dogma and what you said concerned me.", "is_submitter": false, "distinguished": null, "created_utc": 1630287831.0, "parent_id": "t1_havkm0r", "replies": [{"author": "FreyjaSunshine", "id": "havl8e7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "pe1t5x", "stickied": false, "body": "But...but... religions are authoritarian dogma.  It's what they do best.", "is_submitter": false, "distinguished": null, "created_utc": 1630287884.0, "parent_id": "t1_havl4gq", "replies": [{"author": "Virtual_Pasts", "id": "havlfbk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #264", "submission": "pe1t5x", "stickied": false, "body": "I don't like it when *anyone* does it.", "is_submitter": false, "distinguished": null, "created_utc": 1630287980.0, "parent_id": "t1_havl8e7", "replies": []}]}]}]}]}]}]}]}]}, {"author": "mikczas", "id": "haum6yo", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #146", "submission": "pe1t5x", "stickied": false, "body": "I agree. The religion was always about power and enslaving peoples minds. Also about money.", "is_submitter": false, "distinguished": null, "created_utc": 1630271309.0, "parent_id": "t1_hauj7xu", "replies": []}, {"author": "patricktoba", "id": "havc62r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #39", "submission": "pe1t5x", "stickied": false, "body": "I don't think banning freedom of religion is the right answer either though. The one thing that has never been tried is the mass rejection and discouragement of toxic and potentially dangerous belief systems though. Perhaps it's one of things we just need to bully people over. Ridicule goes a long way and it avoids fascism.", "is_submitter": false, "distinguished": null, "created_utc": 1630283458.0, "parent_id": "t1_hauj7xu", "replies": [{"author": "FreyjaSunshine", "id": "havgajp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "pe1t5x", "stickied": false, "body": "It's not likely that I'll be taking over the world any time soon, so the mass delusions that are religions will continue unabated.\n\nI like the ridicule idea, though.", "is_submitter": false, "distinguished": null, "created_utc": 1630285457.0, "parent_id": "t1_havc62r", "replies": []}]}]}, {"author": "mikczas", "id": "haugf4f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #146", "submission": "pe1t5x", "stickied": false, "body": "Decentralization.", "is_submitter": false, "distinguished": null, "created_utc": 1630268795.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "boringlesbian", "id": "hauxqaf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "pe1t5x", "stickied": false, "body": "Kindness would be a prerequisite for positions of power.", "is_submitter": false, "distinguished": null, "created_utc": 1630276490.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "LoreleiOpine", "id": "hauyt4m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "pe1t5x", "stickied": false, "body": "I'm smart enough to relinquish unlimited power. Think about it.", "is_submitter": false, "distinguished": null, "created_utc": 1630276980.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Spratwombat", "id": "hav0pqe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #277", "submission": "pe1t5x", "stickied": false, "body": "Surely we can make an AI that accurately predicts probability of tyranny", "is_submitter": false, "distinguished": null, "created_utc": 1630277870.0, "parent_id": "t3_pe1t5x", "replies": [{"author": "gumi-01-11", "id": "havccsj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #234", "submission": "pe1t5x", "stickied": false, "body": "Roko’s basilisk\n\nFair warning if you’re prone to existential crisis this might not be the thing for you.\n\n[Kyle hill video](https://youtu.be/ut-zGHLAVLI)\n\n[article](https://wiki.lesswrong.com/wiki/Roko%27s_basilisk)", "is_submitter": false, "distinguished": null, "created_utc": 1630283550.0, "parent_id": "t1_hav0pqe", "replies": [{"author": "Spratwombat", "id": "havcla3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #277", "submission": "pe1t5x", "stickied": false, "body": "I’ve seen it but I guess I didn’t think of it in that way, to be more specific I guess can we create something truly objective?", "is_submitter": false, "distinguished": null, "created_utc": 1630283668.0, "parent_id": "t1_havccsj", "replies": []}]}]}, {"author": "roundearthervaxxer", "id": "havl0go", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pe1t5x", "stickied": false, "body": "If we could take over Facebook and destroy it, I would be satisfied", "is_submitter": false, "distinguished": null, "created_utc": 1630287775.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Concrete_Grapes", "id": "havtzk1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pe1t5x", "stickied": false, "body": "Reorganize the economy and tax system to reflect taxation based on percentage of revenue earned. Obviously, as ruler of the world with near unlimited power, there's now no longer tax shelters. In doing this, it would lower the taxes that working people pay, and account for an overall raise in their take home pay. Instead of corporations paying 6% of the taxes, they'd be paying 49%--representative of the actual profits they earn.   \n\n\nCapital gains would be wholly eliminated as a separate class of taxable income--the rise in value of any real properties or securities that are not your primary residence, would count as income. People earing 140% of the average income in their local area (designated as anywhere within 150 air miles of the largest population center and following where applicable geographic boundries + or - 20 miles), or less would be exempt. This would encourage SMALL businesses and smaller income earners to generate value in their local economies, and not hoard the wealth.   \n\n\nWith life expectancy estimated to be around 80 in a developed nation  (RIP the US--only country moving backwards that's not actively occupied by an enemy), and that your 'working age' doesn't REALLY start until the ages of 26, subtract THAT from 80 to get 54. That's now the new tax on any wealth you own (outside of it simply making an income, WEALTH) over 5 million dollars--comes out to about 1.5%. Yes, that means if you did NOTHING with the wealth you inherit that it would be taxed to under 5 million before you die, and that's fine with me.   \n\n\nInheritance tax would come back with a goddamned FORCE. everything over 5 million is outright forfeit. Gone. Sold and auctioned off. There would be ONE exemption, for the primary residence being inherited--what ever the value of that is, wouldn't count to the 5 million. Enjoy that 25m dollar home you bastards.   \n\n\nExtend universal healthcare to the world. screen, test, and pay for health workers educations. Go into it with the understanding that over half will probably quit, but that's OK. Make sure these people enter their careers WITHOUT debt, so that they can focus on their passions. Leave the hospitals and their employers private where applicable, and the health care system itself government run. IT would create a natural give-and-take, and prevent the government from fucking up SO MUCH SHIT--the VA medical system in the US is shown as a terrible example, but it owns the hospitals AND provides the insurance. No, bad. Leave the capitalist pressure from the employment of healthcare professionals intact, and make it compete against the governments fucking stupidity. Shit'd get better.    \n\n\nUse the majority of the tax money collected, to build a sustainable network of roads, energy infrastructure, and clean water systems world wide. Provide the basis for economic development should someone CHOOSE to move into it. Stop denying places aid because of the color of people's skin, their local lack of education, etc. Build it, and they will come. Stop fucking ignoring Africa, ya dickheads, and get over there and DO SOMETHING.   \n\n\nEnd--in totality--religious tax exemptions of ALL kinds. Churches take up valuable commercial and residential space. Let them stay if they're wanted, and EARN it. Let them be turned into a walmart otherwise. fuck 'em. Exemptions to this would be buildings of historical AND cultural value. If it receives that designation, it doesnt waive the taxes, but when it's repossessed it will now be mothballed and regular  services will be banned on the site.   \n\n\nWithin reason, give a UBI--this should be based on the taxes levied on resource extraction, government leases of lands for exploration, etc. The model for this is the Alaska PFD (minus the fuckery republicans are pulling with it there), and Norway's sovereign wealth fund. Dividends and income would be paid as a percentage of the profit it earns. It would be barred from taking an ownership stake in ANY company, unless that company declared bankruptcy, in which case it takes whole ownership, and gives emplyees an option to buy out the entire thing, OR auctions everything off piecemeal--and the company that lost it doesn't get ANY of their debt obligations forgiven when it happens. Sink or swim bitches, no more bailouts motherfucker! If it made Mitt Romeny rich, let the government compete doing it. Win Win.   \n\n\nAbolish r1-zoning in cities. Fuck you (yes, i own, yes, fuck me too--it needs done god damnit). Stop creating food deserts, and create zoning laws that create and encourage small market, local economies again. Make it HARD for walmart to fucking fit in the space, let alone be wanted.   \n\n\nIncrease building codes and standards to astronomical levels of energy efficiency, and limit maximum housing size based on the local power grid's percentage of green and renewable energy output, so that at 0% the MAX size for a new home is now the HALF national AVERAGE size, and at 100% renewable, is 4xs national average square feet. Exemptions to the size are only allowed if they install devices (solar or wind) to offset the power usage of their home, with 100% offgrid ability allowing 200% the size of the average home (in the US this would mean 4600sf total). This would hopefully be enough of a difference that local builders would pressure local power companies to build renewables into their grid, but allow some wiggle room for home owners who cant control something like that. It would quickly change how people voted, for sure. As the average went up, max size would increase--hey, rich motherfucker, want a bigger house? Get that grid upgraded.   \n\n\nOh, and everyone over 15 can vote nation wide. everyone 12 an over for anything state wide, and any child over 7 attending a public school can vote on ANY funding issue that includes their local schools (bonds, board, regulations, etc). Get represented, lil bros. Watch how fast they stop fuckin with school budgets. Any child that attends school of any age, can vote in anything considered a 'advisory vote.' Kids know more than you think, and dont go with their parents ideas as often as you think either--or else there'd be no need for discipline.    \n\n\nEnd 'right to work' laws. Nuff said there. They get a union in? Join it or starve, fuck off scab.   \n\n\nAlso, there is no longer 'part time' work, as far as using the term for employers to dodge the requirement to provide benefits. Work a SINGLE hour, then it's over. Give them that pension offer biiiiiitch. Exemptions to this are employers with LESS THAN 10 employees. Since there's now universal medical, this shouldnt be an excessive cost for anyone anyway.   \n\n\nunpaid internships, or any other form of labor that's unpaid, is now banned. If you expect work--pay for work. All it does is perpetuate a racist system, and frankly, i'm sick of that shit.   \n\n\nAlso, with unlimited power, make George finish the fucking song of fire and ice.   \n\n\nLast bit is the most important, as any Robert Jordan fan can attest to.", "is_submitter": false, "distinguished": null, "created_utc": 1630292236.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "SybariteAussie", "id": "hawddje", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pe1t5x", "stickied": false, "body": "My main source of discontent is the way media is utilised. Stories launched before elections or withheld that affect outcomes should face more scrutiny than stewards that investigate jockeys. Sometimes bribes are paid & the horse that should have won gets boxed in etc. I don’t consume any domestic media at all. My comments are from a Aussie perspective. Not American, most Aussies are not very interested in politics. I became a citizen last year. Am yet to register to vote, unsure if I will? Lots of turn over in leadership in Australia recently. Am no longer certain if the politicians are in charge or if they must bend the knee to the media cartel or face replacement?", "is_submitter": false, "distinguished": null, "created_utc": 1630304083.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "obiwanlenobi", "id": "havh5u4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pe1t5x", "stickied": false, "body": "I would redirect a lot of funding to trying to get colonies on other planets and moons, eventually allowing us to go to other systems. This way if, say, Earth gets destroyed, there's a backup. Although many have proposed the same idea, I would give them the funding so that it would genuinely happen.", "is_submitter": false, "distinguished": null, "created_utc": 1630285875.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Least_Land", "id": "havroep", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "pe1t5x", "stickied": false, "body": "With that much power, I’d do what everyone else with that much power does… get off this rock.", "is_submitter": false, "distinguished": null, "created_utc": 1630291053.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "developedby", "id": "havsazt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #71 | Consortii Concordus", "submission": "pe1t5x", "stickied": false, "body": "> unlimited\n\n> within reason\n\nwell which one is it?  \nam i able to provide the basic needs for everyone alive?", "is_submitter": false, "distinguished": null, "created_utc": 1630291372.0, "parent_id": "t3_pe1t5x", "replies": [{"author": "Combustible_Lemons64", "id": "hawi4cj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #317", "submission": "pe1t5x", "stickied": false, "body": "Anything as long as it does not violate the laws of physics and has a plausible path to being achieved - if the worlds resources allow for it, that includes providing basic needs for everyone alive.", "is_submitter": true, "distinguished": null, "created_utc": 1630307882.0, "parent_id": "t1_havsazt", "replies": []}]}, {"author": "SilverWolf5476", "id": "hawemv1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #337", "submission": "pe1t5x", "stickied": false, "body": "The major issue when it comes to “controlling the world” is that you can’t change the people in it. \n\nNo matter what each persona will always exist.\nEg: lazy people, cheats, hard workers, intellectuals, those unfortunate enough to be on the lower end of the iq scale, etc. \n\nSo the only way to “fix” the world is to remove the humans from it. \n\nGood thought experiment though!", "is_submitter": false, "distinguished": null, "created_utc": 1630305066.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Golden-Snowflake", "id": "haweppy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pe1t5x", "stickied": false, "body": "I Vote for the Soylent machine to take over the world.   \n\n\nSoylent Machine 2024!", "is_submitter": false, "distinguished": null, "created_utc": 1630305130.0, "parent_id": "t3_pe1t5x", "replies": [{"author": "Golden-Snowflake", "id": "hawf0gp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pe1t5x", "stickied": false, "body": "Honestly though, I wrote an explanation on here once, what I would do with a billion dollars.\n\nSame premise.\n\nstart from the foundation, and solve the problems there, and the rest moves forward.Fix housing and food issues, and you solve a lot of problems for the people within that system.\n\nBuild a massive self sustaining housing complex, something Massive, no single family per house situation, no, something close to a super structure, and around it, farming.\n\nAllow families within this system to purchase at cost, and sell the excess, to increase the growth of the interior system.\n\nconstantly increase the size and scale, of the housing, and farming, until you can start a new entire system somewhere else, repeat.\n\nIt is not the top of a pyramid that holds it together, it is the bottom.  \n\n\nControl the housing, control the world. \n\n[https://www.reddit.com/r/INTP/comments/oomkvc/a\\_call\\_to\\_all\\_intps/h60hb5l?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/INTP/comments/oomkvc/a_call_to_all_intps/h60hb5l?utm_source=share&utm_medium=web2x&context=3)", "is_submitter": false, "distinguished": null, "created_utc": 1630305362.0, "parent_id": "t1_haweppy", "replies": []}]}, {"author": "doegred", "id": "hawht20", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #191", "submission": "pe1t5x", "stickied": false, "body": "Well, (ideally, when I'm feeling optimistic towards humanity) I tend towards anarchism, so no thanks...", "is_submitter": false, "distinguished": null, "created_utc": 1630307621.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Nonensbu", "id": "hax2hxk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #260", "submission": "pe1t5x", "stickied": false, "body": "This question...\n\nIs a vibe.", "is_submitter": false, "distinguished": null, "created_utc": 1630324248.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "prajnadhyana", "id": "haxecl5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pe1t5x", "stickied": false, "body": "I would retroactively delete the Human race.", "is_submitter": false, "distinguished": null, "created_utc": 1630330727.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Quartersharp", "id": "haxnrsk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #366", "submission": "pe1t5x", "stickied": false, "body": "Reminds me of when Frodo offered Galadriel the Ring and she got all scary. “Instead of a Dark Lord, you would have a queen, not dark but beautiful and terrible as the dawn! Tempestuous as the sea, and stronger than the foundations of the earth! All shall love me and despair!” We’d all like to think WE would be the one to do good; not to turn into Sauron with unlimited power. Sauron probably thought so too.", "is_submitter": false, "distinguished": null, "created_utc": 1630334933.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "ollyender", "id": "hayl4y7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #271", "submission": "pe1t5x", "stickied": false, "body": "I am universally acknowledged as both humanity's treasure and its overlord. I am the pinnacle of every company, organization, and government. I am at peace with everyone, and they with me. Then I fuck off and live as I please. Alternatively, I would try to help humanity; then recognize that I'm not intelligent enough to do that so I would gather together the people that are capable and make them come up with ideas. I feel like if in this scenario I'm able to get all the organizations and governments to work together then we just win.", "is_submitter": false, "distinguished": null, "created_utc": 1630348844.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "CactiIlluminati", "id": "hb07m27", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #175", "submission": "pe1t5x", "stickied": false, "body": "I used to think if you threw money at a problem it would go away. Like if drugs were legal , drug dealers would be good guys, but this is bullshit.   \nI do think though people can be primed to make good choices from receiving good education, so I'd start there.", "is_submitter": false, "distinguished": null, "created_utc": 1630374621.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Ghoststorme", "id": "hb19ox2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #326", "submission": "pe1t5x", "stickied": false, "body": "Objective: To do things that are beneficial for society as a whole.\n\nMethod: Media must be more unbiased and fair. Minorities should have as big media presence as non-minorities. We subconsciously change how people think by promoting equality until ‘the greater good’ is everyone's aim as well.\n\nAllow religion. Religion isn't the problem. It can't be. It's too multivalent and has always been manipulated by people for their own ends. So instead condemn hate and unfairness.", "is_submitter": false, "distinguished": null, "created_utc": 1630399332.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "--anonymousperson--", "id": "hb1ja43", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #384", "submission": "pe1t5x", "stickied": false, "body": "I'll most likely do an oopsie and blow it up when I'm angry lol", "is_submitter": false, "distinguished": null, "created_utc": 1630407356.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Catesa", "id": "hb5q3af", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #427", "submission": "pe1t5x", "stickied": false, "body": "Different tax system you pay taxes and vote on necessary projects. If you do not vote your government will decide for you.", "is_submitter": false, "distinguished": null, "created_utc": 1630478776.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "nocturnal-nugget", "id": "hb6nmxa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #353", "submission": "pe1t5x", "stickied": false, "body": "Well I would certainly make stronger laws on animal abuse since hearing that makes my day a bit worse. \n\nReplace death row and life sentences with an experiment group. Instead of execution or sitting around in a cell all day wasting resources just let them be used for approved medical experiments for helping to further our medical technology. Would need to strike a balance between how likely the experiment is to succeed,how valuable the experiment is and the amount of subjects we have available.\n\nPut some more work toward freezing people for a while since I would like to see how the world progresses over time.\n\nFree taco Tuesday every other week in the capital but the number is limited and it’s first come first serve only 1 per person.\n\nMight be getting a little close to the unrealistic to effectively do line here but ban certain religions or certain sects that have within the past hundred or so years been problematic and have incompatible practiced values. Would be difficult though as religion is not easy to stamp out.\n\nWell that’s all I’ve come up with in about 5 minutes while I’m waiting for some food to arrive.\n\nFinal note I would try to make everywhere a first world place for the purpose of advancing technology because that’s fun. Oh and I’m a dictator I don’t want anyone coming and messing up what I’ve got going in a few years and thanks to my attempts to be a fairly nice dictator I probably won’t be very hated by the not religious crowd", "is_submitter": false, "distinguished": null, "created_utc": 1630502780.0, "parent_id": "t3_pe1t5x", "replies": []}, {"author": "Stand_kicker", "id": "hauhzr0", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "pe1t5x", "stickied": false, "body": "Oh I don't think reddit would like my answer.", "is_submitter": false, "distinguished": null, "created_utc": 1630269476.0, "parent_id": "t3_pe1t5x", "replies": [{"author": "Spratwombat", "id": "hav0s6x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #277", "submission": "pe1t5x", "stickied": false, "body": "Say itt", "is_submitter": false, "distinguished": null, "created_utc": 1630277903.0, "parent_id": "t1_hauhzr0", "replies": []}]}]}