{"title": "Found a wallet, got a glimpse into someone's life..", "name": "t3_pji28q", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pji28q/found_a_wallet_got_a_glimpse_into_someones_life/", "selftext": "The circumstances and chances i would find this thing is truly off the charts small. I was driving down the interstate, as one does, at 75mph, out in rural nowhere, chatting to my passenger. When, out of the corner of my eye i see something on the side of the interstate that clicks in my brain--'wallet' It was standing up on its edges, and i SLAM on the brakes and pull over, and wait for THE car go go past me, and back up a few hundred feet to this thing i THINK is a wallet.   \n\n\nIt was.   \n\n\nWhen i get home i become determined to find him. I cant pronounce his name. He is, as far as i can discern, from India. He's newly married. He works in IT--his work ID is in there, his store memberships are in there, his health insurance, more than a half dozen credit cards--some clearly very high end. His' wife's ID, from a club they're both in.   \n\n\nHe seems like a man with all of his ducks in a row. His shit together. There's no phone numbers, and everything in the wallet with a number that might have his is closed today. So i google him.   \n\n\nThe results were awe inspiring. He's 28, hes FUCKING BRILLIANT. His education is second to none. I cant find a phone number. Damn. Nothing. I can see he bought a house on google--this shit's creepy. He paid 950k for it. It's gorgeous.   \n\n\nI googled his wife, and it was a little easier to find something on her. I called her University. They called her for me, and put me on the line with her, they were still on the road, but now 100 miles away. They had pulled over to worry about the wallet. That i found that thing AT ALL, let alone within an hour and a half of him losing it, is wild. They almost turned around, but it was pretty late.   \n\n\nI can only imagine what kind of worrying and talk they were having when her phone rings, and it's her fucking university, that she graduated from 3 years ago. Like--what? And then someone asks about the wallet they're talking about. I imagine it was surreal. When we were connected, she was stunned. They both sound like sweet people. That they live in a big city and make a LOT of money was pretty obvious when she started talking about mailing services--where i live, there's a really shitty post office. The kind where it's so old and so forgotten, that maybe the woman working there only keeps the job because of a glitch in the system hasnt close the office yet. They still use the paper sliding graphite paper thing if you try to pay with a credit card. I shit you not.   \n\n\nAnyway, gonna send it to them, no biggy.   \n\n\nBut man, seeing that young man, and how WELL he's put together his life, and his wife, and how astoundingly well she's done as well...   \n\n\nMade me realize they're going to make more in an single year than i'll make my entire life... and ... it's a little strange. I'm happy--but, wow, i sure didnt do the right things in life.   \n\n\nAnyway. Peak into someone's life multiple income brackets above mine was weird.", "score": 30, "upvote_ratio": 0.93, "permalink": "/r/TheFlyingTree/comments/pji28q/found_a_wallet_got_a_glimpse_into_someones_life/", "id": "pji28q", "author": "Concrete_Grapes", "link_flair_text": "Fascinating", "num_comments": 17, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630998838.0, "comments": [{"author": "ShaBa42", "id": "hbwmgya", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pji28q", "stickied": false, "body": "Everybody give me your wallet. Just a glimpse.", "is_submitter": false, "distinguished": null, "created_utc": 1630999567.0, "parent_id": "t3_pji28q", "replies": [{"author": "LadyGuitar2021", "id": "hbworkl", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #23", "submission": "pji28q", "stickied": false, "body": "Just the card numbers.", "is_submitter": false, "distinguished": null, "created_utc": 1631001548.0, "parent_id": "t1_hbwmgya", "replies": []}, {"author": "CemeteryWind213", "id": "hbwszuk", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #175 | Classis Veritatus", "submission": "pji28q", "stickied": false, "body": "[Wallet Inspector](https://www.youtube.com/watch?v=X6zsxsC6iZw).", "is_submitter": false, "distinguished": null, "created_utc": 1631005328.0, "parent_id": "t1_hbwmgya", "replies": []}]}, {"author": "urkillinmebuster", "id": "hbwp95x", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pji28q", "stickied": false, "body": "Do you like writing? I liked your prose. It was a very descriptive story that created vivid pictures in my mind of each scene. Thanks for sharing and thanks for being a good person. There’s so many that would instead do something nefarious with all of that info.", "is_submitter": false, "distinguished": null, "created_utc": 1631001977.0, "parent_id": "t3_pji28q", "replies": [{"author": "Concrete_Grapes", "id": "hbwq1p2", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pji28q", "stickied": false, "body": "I do a little, but my spelling and grammar are horrific.   \n\n\nI was told in college by several professors that I should really make an effort to become a writer. One philosophy professor (who was a writer himself) said that the paper I wrote for his class was 'the best paper' he'd ever read. He asked to keep a copy. I was confused (it was about children's rights, of all things, in a logic class). I was told by my English lit professor to try to reach out to publishers with some of the reviews i wrote for weekly assignments. She was serious, but I wasn't.   \n\n\nthe only time i took it serious was for a mmorpg i play, and the company had a short story contest, and i wrote one and won it. I won it so well they asked to publish it in their new-hire manuals, and it would become 'mandatory reading' for people coming in, as the sort of story that gives the feelings that they want players to have ... which means, a thousand people or so out there have been forced to read one of my short stories for work, lol.   \n\n\nI should make more of an effort maybe. It seems a recurring theme in my life.", "is_submitter": true, "distinguished": null, "created_utc": 1631002687.0, "parent_id": "t1_hbwp95x", "replies": [{"author": "abraham1inco1n", "id": "hbxesiy", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "pji28q", "stickied": false, "body": "That was awesome! Maybe don't beat yourself up about it, but also try when you can?", "is_submitter": false, "distinguished": null, "created_utc": 1631020675.0, "parent_id": "t1_hbwq1p2", "replies": []}, {"author": "urkillinmebuster", "id": "hbwqppk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pji28q", "stickied": false, "body": "Your style reminds me of E.B. White. He could make the most minute details of something that would perhaps be uninteresting otherwise, and make it pop out of the page. You could smell the wood, the seasons. Just this short recanting you did here really was wonderful. Most would say, found a wallet, some rich Indian dude, sent it back. You gave it life. I’m not surprised in the least you’ve been told to pursue writing.", "is_submitter": false, "distinguished": null, "created_utc": 1631003275.0, "parent_id": "t1_hbwq1p2", "replies": []}, {"author": "1sb3rg", "id": "hbwzkde", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #2", "submission": "pji28q", "stickied": false, "body": "That's sick. did you practice a lot of is it something that just comes to you naturally?", "is_submitter": false, "distinguished": null, "created_utc": 1631011054.0, "parent_id": "t1_hbwq1p2", "replies": []}, {"author": "John__Nash", "id": "hbx2wxn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #17", "submission": "pji28q", "stickied": false, "body": "Jesus. The universe has been trying to tell you something for quite a while now.", "is_submitter": false, "distinguished": null, "created_utc": 1631013563.0, "parent_id": "t1_hbwq1p2", "replies": []}]}]}, {"author": "LooseDoctor", "id": "hbwnbdy", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #292", "submission": "pji28q", "stickied": false, "body": "I’ve only been on the lost end of a lost wallet but I’ve always been ask lucky as that guy as to have someone either find me or turn it in where I lost it. You’re good people.", "is_submitter": false, "distinguished": null, "created_utc": 1631000291.0, "parent_id": "t3_pji28q", "replies": []}, {"author": "nmingott", "id": "hbwmefq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #160", "submission": "pji28q", "stickied": false, "body": "nice story :)", "is_submitter": false, "distinguished": null, "created_utc": 1630999508.0, "parent_id": "t3_pji28q", "replies": []}, {"author": "hdeanzer", "id": "hbww0hp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #178", "submission": "pji28q", "stickied": false, "body": "You got a glimpse, that can always be weird.", "is_submitter": false, "distinguished": null, "created_utc": 1631008051.0, "parent_id": "t3_pji28q", "replies": []}, {"author": "oceanofflavor", "id": "hbx1711", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #190", "submission": "pji28q", "stickied": false, "body": "Well damn, that was interesting. Just a thought, and ignore if you don't believe in this sort of stuff, but maybe it was sort of like YOU were the one meant to stumble upon this wallet. Someone else could have easily spotted it before you or it could have gotten run over to the point where it was no longer a salvageable wallet. Maybe the purpose of getting a glimpse into this man's life was to put your own into perspective. Like others have commented, I think you have a real gift for writing. I don't know how old you are or what you do for a living or if you even want to pursue being a writer (even as a hobby), but it was a great experience stumbling upon this random post in this random sub that I randomly got invited to join. You should really give writing a try, honestly. Anyway, thanks for sharing the story!", "is_submitter": false, "distinguished": null, "created_utc": 1631012313.0, "parent_id": "t3_pji28q", "replies": []}, {"author": "Test_Trick", "id": "hbx6g3r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pji28q", "stickied": false, "body": "Universities just... do that?\n\nThat has to be a violation of some sort", "is_submitter": false, "distinguished": null, "created_utc": 1631015934.0, "parent_id": "t3_pji28q", "replies": []}, {"author": "clovepod", "id": "hbx92ct", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "pji28q", "stickied": false, "body": "How in the heck did the wallet fly out of - I assume - a moving car, not to be noticed by the wallet owner for an hour or so? \n\nBtw, your grammar is fine and spellcheck exists. Don’t let either of those things stop you from writing.", "is_submitter": false, "distinguished": null, "created_utc": 1631017549.0, "parent_id": "t3_pji28q", "replies": [{"author": "Meshuggah333", "id": "hbxet7r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #95", "submission": "pji28q", "stickied": false, "body": "That's quite suspicious, I agree. I'd like to know the backstory to this, we'd likely never know.", "is_submitter": false, "distinguished": null, "created_utc": 1631020685.0, "parent_id": "t1_hbx92ct", "replies": []}]}, {"author": "erudaru", "id": "hbxisgy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pji28q", "stickied": false, "body": "This reminds me of when I moved into an apartment where the previous owners left all their stuff and died. Like, ALL their stuff. Whenever we were bored me and my flat mate would go through the endless traces those people left behind.\n\nThe wife kept all letters she ever received, including love letters from other men. We were probably the only people who knew some of their darkest secrets.", "is_submitter": false, "distinguished": null, "created_utc": 1631022625.0, "parent_id": "t3_pji28q", "replies": []}]}