{"title": "I'm no good at living.", "name": "t3_p4ju4m", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p4ju4m/im_no_good_at_living/", "selftext": "Long post incoming, i'm sure.   \n\n\nI have Schizoid Personality disorder. It's a bitch of a thing. Imagine NOT being depressed, but living a life as if you were. Imagine living life as someone with crippling social anxiety that makes you lock yourself away and not go out, but you DONT have that. Imagine having ADHD--the energy to do something, but you cant maintain your concentration well enough to actually get to it, even minutes later. Imagine, everyone in your life for decades, thinking you were autistic because you're mostly non-verbal, but it's by choice, or you hate being touched, but it's not overstimulation, you just hate people thinking you care and dont want to pretend you do.   \n\n\nThat's kinda what it's like. It's a pain in the ass.   \n\n\nIt makes me terrible at living. Everyone in my life knows a fake me. I put on an act, nearly 100% of the time, a conscious effort to formulate some sort of personality that may appease them long enough to pass through some task. It's exhausting. I have to PRETEND to get mad. I have to PRETEND to feel joy. There's a constant running internal dialogue in my head at all times in social events, or work. I NEVER--ever, 'live in the moment.' It's as if i'm 3rd person playing a character, that's myself, through life, all the goddamned time.   \n\n\nBeing alone, never lasts long enough. I'm addicted to solitude. I cant get enough of it. I used to go WEEKS without seeing some one when i was homeless, by choice. I have no idea at all what being 'lonely' feels like. I struggle to even guess. I dont miss people when they leave. I dont miss my own partner and children when they're gone for weeks on trips. I can go ALL DAY and not think about them.   \n\n\nI struggle to get jobs, I'm older, and i cant make myself mask-up through an interview. I'm flat, come across 'dead inside' or 'scary' ... i've been called Eeyore, Statue boy, 'the most blah person ever' (thanks mom).   \n\n\nAn hour ago, I went outside to start to try to motivate myself to do some woodworking. My partner has me signed up to open some sort of booth at a craft fair for what i make--shelves (those 6 sided things she loves and I cant fathom why), keepsake and jewelry boxes, coasters, cutting boards, tables, that sort of stuff. I'm actually pretty damn good at it.   \n\n\nExcept without her here i dont have any drive to do it. I stood there and looked at the saw, and the hardwoods that need milled into strips for coasters, and i couldnt MAKE myself care. I just dont care. I dont have a passion for this, it doesnt MATTER that i'm good at it. I dont give a flying fuck. If she never asked me to go back out into that shop, i'd never make another thing out of wood in my life and not even CARE i left it behind.   \n\n\nI'm bad at living. I'm just terrible at it. No therapy, no drug, no 'try harder' will ever change it.   \n\n\nIf you have a passion for ANYTHING in life, cherish that shit. Cherish it for people like me who cant fucking have it.   \n\n\nGood day.", "score": 18, "upvote_ratio": 0.91, "permalink": "/r/TheFlyingTree/comments/p4ju4m/im_no_good_at_living/", "id": "p4ju4m", "author": "Concrete_Grapes", "link_flair_text": "Other", "num_comments": 15, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628988856.0, "comments": [{"author": "celtic_cuchulainn", "id": "h8zyaxp", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #168", "submission": "p4ju4m", "stickied": false, "body": "Hey man, I’m gonna say some stuff and it may or may not resonate; all I ask is you read it without judgment. I also have schizoid tendencies, different ones, but I feel a lot of what you described, especially the first paragraph.\n\nAt some point along my journey, I came to realize that being schizo is like your mind having one foot on Earth and one foot somewhere else, basically all of the time. It makes it incredibly difficult to relate to basically anyone or anything.\n\nOn the other hand, doing this provides you incredible insights, analysis, and skills. You’re good at something you barely care about and I bet you didn’t have to practice much either.\n\nMy take is that you aren’t objectively shitty at life; you’ve got a caring partner, kids, skills…you’re doing alright at least from the outside.\n\nI would consider the idea that instead of the source of your discontent being a lack of interest in living; it’s a deep, very deep, fear of living and diving in fully. Having ‘one foot always outside of the water’ makes that unconscious fear go away and that’s super comforting despite kinda hating it on the surface.\n\nIt’s kinda like in the movie Soul; that one character that just doesn’t want to incarnate on Earth.\n\nI agree with you, nothing external (drugs, therapy, motivational speaker) will fix this for you. It sucks, but you gotta do it yourself because you’re the only person that really gets you. And if you’re older, you’re probably set in a lot of poor habits that will take time to break.\n\nGood luck on your path and give your partner some love. She sounds like an amazing supportive partner (I got one too and I try my best to make her life good).", "is_submitter": false, "distinguished": null, "created_utc": 1629004334.0, "parent_id": "t3_p4ju4m", "replies": [{"author": "Concrete_Grapes", "id": "h900d5h", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "p4ju4m", "stickied": false, "body": " *it’s a deep, very deep, fear of living and diving in fully.*  \n\n\nMaybe. I dont know i could discount it. I dont feel it like fear though.   \n\n\nI think i get what you're trying to say. It's not fear. It's this other thing--its not disinterest, and maybe not even inability, its... god there's just no words or series of words for this.   \n\n\nIf i have to think of this, what happens is what you describe--the insights and analysis thing. When i go to TRY to do a thing like a normal person, it's as if everyone else is mostly just THERE, they're first person IN IT. There's a ton of things they're not thinking about. They dont have to think about it.   \n\n\nThat moment never comes for me, i'm like, third-person. Thinking, inspecting, analyzing. I can sit there at a gathering with my partner and be with their friends in the yard, while the kids run around and play, and i'm not THERE. I'm thinking about all sorts of things. I think about the grass, i think about the wind, the trees, i think about the placement of things, the tones in people's voices, the clothes they chose to wear, think think think--i cant NOT do that. Im not in the moment, i'm ... i'm observing the moment, but also tying a hundred other strings around it from the past, present, or just thoughts.   \n\n\nI think it's not fear, but it's somehow the inability to let go of that mode of thought. To NOT hyper analyze EXISTING. It's somehow, not fear, but a real inability to understand how to exist the OTHER way, the immediate present sort of existing.   \n\n\nIDK how to break that barrier, or what's in the way of that ability. That's how i'd explain it though.", "is_submitter": true, "distinguished": null, "created_utc": 1629005723.0, "parent_id": "t1_h8zyaxp", "replies": [{"author": "celtic_cuchulainn", "id": "h904foa", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #168", "submission": "p4ju4m", "stickied": false, "body": "Maybe fear isn’t the right word, not inability but it’s something like that eh. It’s almost like you can’t help but feel/act a certain way and are kinda jealous of people that seemingly can shut off their analytical minds and just flow.\n\nSome topics that might interest you if you’ve never heard them before: derealization, depersonalization, existential ocd.\n\nIt isn’t wise to assume you know how other people think or feel. For one thing, it’s possible they go through the exact things you’re going through, but at some point in their lives adopted better thinking patterns (cognitive behavioural therapy can help identify triggers/patterns) to avoid thought loops, getting lost in one’s head, meandering thoughts, etc.\n\nAlso what’s normal? “Comparison is the thieve of joy”. For all you know, people are faking it just as much as you are, but are maybe more okay with it or just better at it.\n\nWhat helped me get through some real deep shit was the Socratic paradox (“I know that I don’t know”). Essentially we don’t really know what’s going on or why anything is happening; at best we know how things happen (science).\n\nSo you could sit there and envy that simple farmer for how much you think they enjoy say just mowing the lawn, but truthfully, you don’t know that they aren’t suffering the same way, but just figured out better coping mechanisms.\n\nI used to be obsessed with seeking the truth. I would hyper analyze situations, create links (often when there was none) and even full blown stories to help explain to me what’s going on or why. I still do it sometimes, but it’s pretty mild now.\n\nI really would watch the movie Soul (Disney +); it’s a fun kids movie too so they can join.\n\nI think you don’t want to earnestly try ‘living like the other side’ because it’s scary and it’s way more comfortable and interesting being in your own head. But something prompted you to write this post.", "is_submitter": false, "distinguished": null, "created_utc": 1629008742.0, "parent_id": "t1_h900d5h", "replies": []}]}]}, {"author": "SuddenProfile", "id": "h8z96k5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "p4ju4m", "stickied": false, "body": "Sorry to hear that. I'm autistic and definitely relate to some of the starting paragraphs. MDD makes some of the latter familiar as well.\n\nI know you're not autistic, but you may find some solidarity or useful advice in r/autism.", "is_submitter": false, "distinguished": null, "created_utc": 1628990307.0, "parent_id": "t3_p4ju4m", "replies": []}, {"author": "PenguinInDistress", "id": "h8zecsi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #156", "submission": "p4ju4m", "stickied": false, "body": "I can relate with some of my episodes being like that. \n\nWhen the passion dies, it's so fucking hard to get it back. I've been able to get it back, and it's here but not strong by any means. \n\nIt's a fleeting emotion that lasts for only seconds. Like a sweet rush of pure joy. \n\nIt comes though. It's only for a moment, but it comes. \n\nWhen's the last time you did something that you like? Something that maybe pushes you? \n\nHow would you feel about a hike in the mountains or a day riding roller coasters? Your body needs a jolt if you get what I mean.", "is_submitter": false, "distinguished": null, "created_utc": 1628992921.0, "parent_id": "t3_p4ju4m", "replies": [{"author": "Concrete_Grapes", "id": "h8zggp5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "p4ju4m", "stickied": false, "body": "I dont have the jolts.   \n\n\nIt's hard to describe. Like, a day riding roller coasters would probably be interesting, but i cant imagine a feeling coming out of it. If i didn't do it WITH someone, and have to pretend, i'd probably spend most of the time analyzing what everyone around me was feeling, and wondering why i dont feel that. It's not depression, it's not like i wouldnt want to, it's just that if i did, it wouldn't sink in. Same with a hike, or getting in touch with nature, I have no super positive or negative feelings about that one way or another. Ya know, some people feel as if there's some magical thing to a sunset, or a waterfall, or--they FEEL a way, awe, joy, amazed, etc. I'll stand there and think \"Thats cool. Kinda loud. Wonder what type of rocks those are.\" But not the emotions.   \n\n\nI'm the person, if you've ever met one, that has a face that lacks expression. The 'you alright?\" question always flies at me. I'm fine. Me looking dead inside is my happy face. It's also my sad face. It's also my dead inside face.   \n\n\nIf i knew how to 'jolt' myself into connecting to emotions, or even myself, i would give it a shot. It's just not a thing that works. Like, the birth of the first child, i was in the room--but, the joy of birth, the first cry, none of that made me feel any emotion. People were happy, people were crying. Everyone around me was in the moment, and feeling, and i stood there watching, and thinking about the beautiful woman that just gave birth, and thinking to myself \"Hey, she did that and only said 'ow' twice. What a trooper.\" That was it. That was my major take away.   \n\n\nI'm terrible at living, because I just ... there's a disconnect. I've never fallen in love. I dont hate strongly. I dont ...   \n\n\nIt's like you're a sailboat, out on the open ocean. People out there are riding waves, going though storms, fighting, passionate about their destination, or getting to the next port. Me? I'm in a calm sea, with no wind, floating there... listening to the radio of all the other boats going through the waves, but not seeing any.   \n\n\nThe disconnect is SO strong, i dont even have a hobby i enjoy. Or a passion. I dont game. I dont read (much). I dont watch TV, and unless it's a kids movie they made me watch, i have not watched a movie, by myself, for 20+ years. There's no desire to either. I have TRIED, and i cant even get through 10 minutes of a show without walking off or shutting it off.", "is_submitter": true, "distinguished": null, "created_utc": 1628994020.0, "parent_id": "t1_h8zecsi", "replies": [{"author": "S_thyrsoidea", "id": "h8zq0jr", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "p4ju4m", "stickied": false, "body": "This is fascinating.  You're describing yourself as not experiencing *feelings,* but what really stands out to me in your account, is your lack of experiencing *pleasure*.  It sounds like you don't *enjoy* things, very much, or really at all?\n\nAlso, for all your description of not experiencing feelings, this entire account certainly reads very strongly of one feeling: frustration.  You make it very clear that you find your condition unpleasant and wish it were otherwise.  (Were you aware of experiencing frustration?)  Do you generally experience negative feelings?", "is_submitter": false, "distinguished": null, "created_utc": 1628999214.0, "parent_id": "t1_h8zggp5", "replies": []}]}]}, {"author": "clovepod", "id": "h8ztrbu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "p4ju4m", "stickied": false, "body": "it's really remarkable that you have a partner and had children. i spent a little time reading r/Schizoid at one point so i've at least heard of this, but i think it's not commonly known about. \n\nis your partner aware?", "is_submitter": false, "distinguished": null, "created_utc": 1629001445.0, "parent_id": "t3_p4ju4m", "replies": [{"author": "Concrete_Grapes", "id": "h8zz4gd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "p4ju4m", "stickied": false, "body": "Somewhat. I've tried to tell her. It's an odd relationship, and she insists that i must not REALLY be like this, or lack these feelings. She does sometimes get tremendously frustrated with me. She's tired of me 'staring at the wall'--and so forced me to get a hobby. I had no interest at all in any hobbies so she picked wood working. Over the last 6 months i learned it and got good at it, but if she's not here, i'll never touch it again.   \n\n\nIt's frustrating to her because i dont have friends, and she feels guilty that she DOES. She tries to make her friends my friends, but ... its not working. I'm kind, i'm easy going, but i also dont talk, i dont really have any sort of ... relatable life drama. It's hard.", "is_submitter": true, "distinguished": null, "created_utc": 1629004879.0, "parent_id": "t1_h8ztrbu", "replies": [{"author": "clovepod", "id": "h9012bj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "p4ju4m", "stickied": false, "body": "It sounds like she’s not getting it. Is she aware that you have a diagnosis as schizoid (or if not a formal diagnosis, a very obvious and strong indication that you have this condition)? \n\nThanks for sharing what you’ve put here. It sucks you have to live with this.", "is_submitter": false, "distinguished": null, "created_utc": 1629006222.0, "parent_id": "t1_h8zz4gd", "replies": []}]}]}, {"author": "Traditional_Meat1299", "id": "h8zwf0j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seer", "submission": "p4ju4m", "stickied": false, "body": "Thank you for the insight. Also bless you.", "is_submitter": false, "distinguished": null, "created_utc": 1629003097.0, "parent_id": "t3_p4ju4m", "replies": []}, {"author": "ganznormal", "id": "h90ecgp", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #139", "submission": "p4ju4m", "stickied": false, "body": "Thank you for sharing all this. \n\nMy dad has schizoid tendencies (as far as I can tell) and my mom is similarly oblivious as your spouse seems to be. The marriage seems to work for them, it's just that us kids never had an emotionally or even mentally \"present\" dad and that's a pity.\n\nI also work as a therapist and one of my clients was extremly schizoid when she started with me. A lot of what you described regarding over analysing / thinking all the time and being in a constant state of observation could be something she'd say to describe herself.\n\nI'm curious, though, when you said no therapy will ever change that, are you speaking out of experience?", "is_submitter": false, "distinguished": null, "created_utc": 1629016890.0, "parent_id": "t3_p4ju4m", "replies": [{"author": "Concrete_Grapes", "id": "h90ii0g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "p4ju4m", "stickied": false, "body": "Not out of experience. Out of reading a little bit of the literature for it. That, and some of the facebook groups, or even here, no one with it i've ever talked to, and none of the very limited research seems to indicate that there's a 'cure' or even very efficacious treatment for us. The best we seem to manage is mask-up a little better.   \n\n\nEven reading the reports of how therapists themselves report treating people with SPD--they tend to get frustrated and dismissive because things DONT work--how do you make some one change, when they dont CARE if they change or not. Apparently it's terribly normal for SPD patients to drop out of treatment after therapists lose interest. Therapists love a sort of feedback, positive or negative, to feel that they're making an impact, or progress, or developing something to help a client, but a person with SPD really isnt that bothered by their condition to begin with, and IF they make it to treatment, therapists lack of progress will cause them to back off and focus on someone more interesting--ya know? Or, the shizoid will notice the frustration and mask-up to pretend they're better just to get out of situation (tbh, i'd do that last one). At least, i remember reading something like that.   \n\n\nA diagnosis is as far as i needed to get, it was a \"Oh, shit, that explains everything then, doesnt it.\" sort of lightbulb moment. The rest is anecdotal and what i can read in the few research and reports in can dig up.   \n\n\nYou think i would see a result with it? What sort of treatment would it look like?", "is_submitter": true, "distinguished": null, "created_utc": 1629020651.0, "parent_id": "t1_h90ecgp", "replies": [{"author": "Vercouine", "id": "h90sx6u", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #125", "submission": "p4ju4m", "stickied": false, "body": "Being schizoid myself and under treatment (therapy and medicine), it helps. It doesn't do everything, but it helps. The hard part is to find a psychiatrist (and a medicine) that fit you well.\n\nA thing that helped : stop pretending, at least for the close people. They won't understand, but it will relieve yourself. I also found out that having a few hobbies (or too many) is good, as I can suddenly say : I'm in the mood to work wood or paint or play with clay or whatever and do it. \n\nI don't have a passion for one thing. I can start a new thing and be good at it in a little amount of time and it sucks. No challenge, no try harder, I'm good at it that's all and that's annoying. I'm often annoyed. But when I'm in the mood to do something, I do it. That's my way to cope with it.", "is_submitter": false, "distinguished": null, "created_utc": 1629028994.0, "parent_id": "t1_h90ii0g", "replies": []}, {"author": "ganznormal", "id": "h91fbg1", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #139", "submission": "p4ju4m", "stickied": false, "body": "> You think i would see a result with it? What sort of treatment would it look like?\n\nYes I do. I work with Gestalt therapy. My understanding and therapeutic technique is very close to this: https://www.researchgate.net/publication/237813509_Psychotherapy_of_Schizoid_Process\n\nSome factors that might make this therapy \"work\":\n\n- It takes a loooong time and we were and are both willing and able to keep on working. \n\nShe was one of my first clients in 2015 and is still paying my (then beginner's) fee. I have a private praxis with enough clients with a standard fee by now that I can afford to provide intense therapy (sometimes twice a week) with her even though she pays little.\n\nAnd I never \"needed\" for her to get better quickly. I always felt like this will take time, and it does, and that's ok. \n\n- I like working with her. She's one of the smartest people I've ever met so even if she \"stays in her head\" the whole session it is still interesting to me. I have never felt bored or understimulated with her, hence my patience. In fact, she herself pointed me to the article above as this is just what she does: researching, reading, connecting, thinking.\n\n- Gestalt therapy has roots in anarchism. At least where I live those roots are still palpable. So GT doesn't try to \"fix\" clients and make them useful members of society ASAP, ready to work, be in relationships, be \"normal\". \n\nInstead it tries to deeply empathize with the client's reality, working with a \"paradoxical theory of change\": only if we fully accept how things are, do we have any chance of changing them.\n\nIn conclusion: I don't think you'll see any results in therapy approaches that want to change you (quickly). Best those could do is teach you to mask better, but you already seem to be pretty good at that.\n\nIf therapy had any chance to yield results with you, you'd need someone who is willing and eager to go the long route with you. Not be threatened by mistrust and slow progress. Understands that they really don't understand you, and is cool with that. Ideally someone who is willing to grow with you.\n\nI admit it might be hard finding someone like that, especially if you live in a place where therapy is expected not to last too long and therapists feel the need to see results early and consistently", "is_submitter": false, "distinguished": null, "created_utc": 1629040757.0, "parent_id": "t1_h90ii0g", "replies": []}]}]}]}