{"title": "What do you all think of polyamory?", "name": "t3_pi6cal", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pi6cal/what_do_you_all_think_of_polyamory/", "selftext": "And are we as a human race really supposed to be with just one person or multiple people over time? Is society really doing the right thing by putting us into marriages and monogamous relationships? What would suddenly happen if more people break these rules and stop conforming to society?", "score": 16, "upvote_ratio": 0.91, "permalink": "/r/TheFlyingTree/comments/pi6cal/what_do_you_all_think_of_polyamory/", "id": "pi6cal", "author": "ConsiderGrave", "link_flair_text": "Discussion", "num_comments": 48, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630815786.0, "comments": [{"author": "yrogerg123", "id": "hbnj9g4", "score": 23, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "pi6cal", "stickied": false, "body": "It's for some people, definitely not for me, but what consenting adults do is none of my business.", "is_submitter": false, "distinguished": null, "created_utc": 1630817327.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "paralea01", "id": "hbnktdt", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "Seeker #299", "submission": "pi6cal", "stickied": false, "body": "Some humans can deal with the logistics of it.   Other's can't. \n\nI personally couldn't, I don't have enough emotional energy to spend it on more than one romantic partner.   \n\nBut to those who do,  live your life and be happy.", "is_submitter": false, "distinguished": null, "created_utc": 1630818398.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "John__Nash", "id": "hbniyeq", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #17", "submission": "pi6cal", "stickied": false, "body": "In my experience, people just don't work that way. We are jealous and possessive creatures when it comes to love (and a lot of other things but that's beside the point).\n\nIf it works for you, then great. I just hope nobody is getting hurt.", "is_submitter": false, "distinguished": null, "created_utc": 1630817121.0, "parent_id": "t3_pi6cal", "replies": [{"author": "FalconRelevant", "id": "hbogci2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "pi6cal", "stickied": false, "body": "I think the only way it can work with people like me when everyone in a group is with everyone inside it, like a fully connected graph.", "is_submitter": false, "distinguished": null, "created_utc": 1630844228.0, "parent_id": "t1_hbniyeq", "replies": [{"author": "rafael54321r", "id": "hboo6ss", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #611", "submission": "pi6cal", "stickied": false, "body": "Hmm", "is_submitter": false, "distinguished": null, "created_utc": 1630848899.0, "parent_id": "t1_hbogci2", "replies": []}, {"author": "ProjectTermina", "id": "hbppkwd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #609", "submission": "pi6cal", "stickied": false, "body": "i definitely prefer that setup. my concern would be that the graph would inevitably have weighted edges.", "is_submitter": false, "distinguished": null, "created_utc": 1630865774.0, "parent_id": "t1_hbogci2", "replies": []}]}]}, {"author": "usernames_suck_ok", "id": "hbnjpn8", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "pi6cal", "stickied": false, "body": "I don't think this is strictly about society. I don't think polyamory in the sense most people think of it is for most people, i.e. a person actively being in multiple romantic relationships at the same time with everyone involved knowing it. I've heard/read it said that men are not biologically made for monogamy, and I can probably see that being true...but that doesn't mean that they're made for--or want to have--multiple ***romantic relationships*** at once. Frankly, I think men just want to fuck different people, and that's different.\n\nI believe there's variety among us as to what's right for us, and, as I mentioned on another sub recently that was discussing \"giving up\" on dating/relationships, I think what's right for a lot of different people is already starting to be the norm. In the US, anyhow. What I see that being is a lot of people simply deciding they don't want to formally date/be in relationships or to get married for a variety of differing reasons, and that their \"relationships\" with people will be more about sexual satisfaction or not wanting to be alone as opposed to love and more traditional ideals/values like raising a family. I think true relationships and marriage are heading towards being essentially uncommon, not to say that's going to be the case 10 years from now...but eventually, with it being more and more so with each passing year.\n\nPersonally, I'm not happy about it. It has nothing to do with conforming to society. I, personally, would love to find one person--the ***right*** person--to be in a good relationship with and get married. But I also admit to something that I don't think a lot of people do, and that I think is a big part of the reason why we're moving away from relationships and marriage--I don't want to put the necessary effort, nor the necessary risk, in to find that person/relationship (and note: for me, it's the effort/risk to ***find***\\--for others, it's that...and for some, it's the effort to make relationships they find work). Part of it is I don't think everything I'd have to do--which is more than what the average person has to do--is worth it or would ***ultimately*** be worth it. I think this is where a lot of people are, or somewhere in the neighborhood. But I don't think most people are in the polyamory neighborhood, nor do they want to be.", "is_submitter": false, "distinguished": null, "created_utc": 1630817632.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "clovepod", "id": "hbnlmfe", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "pi6cal", "stickied": false, "body": "i know a stable poly triad, have been together for decades. the two younger spouses also had side-people pre-covid. it all seems to work great for them. \n\ni've known a few other examples over the years with open marriages and relationships between long-term partners. I'm more than willing to believe that humans are too varied for there to really be one way that works for everyone. \n\ni will say that i only know of one possible trio (it's a co-worker, and if they are a trio she's not out about that at work, just that she and her husband and her best friend have been living together for decades) where a child is involved. I do think that, whatever the configuration, any kids need to feel safe and stable.", "is_submitter": false, "distinguished": null, "created_utc": 1630818971.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Goudevis", "id": "hbnljkg", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #345", "submission": "pi6cal", "stickied": false, "body": "I think it definitly depends on who you are and what situation you're in. Apart from that, a lot of people could stand to think more deeply about what they want in there relationship instead of just following conventions. So many relationships break down because of cheating and I doubt all those who cheat want to hurt their partners in that way or want to leave the relationship, but maybe they are just missing something/need more. If you can solve that with open communication, that seems better to me.\n\nThere is also something very freeing in realising everyone is their own person with their own needs and working on letting go of jealousy. It is a very unpleasant feeling and often unneccesary if you are in a stable and open relationship. You can also learn to let go of a lot of your jealousy.  \nA lot of jealousy we have is cultural. We grow these expectations about our partners from our suroundings and the media. You have to be everthing for your partner, fill every need, and they have to do that for you. But that does not seem feasible to me. You need multiple people in your life and it can be very rewarding to built deep relationships with others. You need that community. Polyamory could be a part of that I think, depending on your situation.", "is_submitter": false, "distinguished": null, "created_utc": 1630818914.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "qwerty0981234", "id": "hbo9dea", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #7", "submission": "pi6cal", "stickied": false, "body": "The whole man and husband goes back to our roots of that to increase the chance of our survival. A woman cannot safely hunt for food while pregnant so monogamy is the way for survival. That’s why it’s in our roots and why it’s normal. \n\nHowever I have read articles about how having only one lifetime partner also isn’t our thing. And that’s also why it’s very common to divorce or cheat. I think polyamory can be risky not only due to STDs but also emotional stress and jealousy. I prefer mono but that does make it a lot harder to find the right partner.", "is_submitter": false, "distinguished": null, "created_utc": 1630838892.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "prajnadhyana", "id": "hbniya9", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pi6cal", "stickied": false, "body": "From a strictly biological point of view monogamy isn't natural. It's a social convention we've invented to make society function more smoothly on a large scale. Even then, a large percentage of the population isn't monogamous, even if they pretend to be.", "is_submitter": false, "distinguished": null, "created_utc": 1630817119.0, "parent_id": "t3_pi6cal", "replies": [{"author": "rondonjon", "id": "hbnm6qm", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #348", "submission": "pi6cal", "stickied": false, "body": "Of course monogamy is natural. There are other animals that engage in monogamy. There are biological benefits of one sort of the other to any marriage/mating system.\n\nBut I agree that our mode of monogamy is sustained through cultural and behavioral forces and it certainly has many outliers such as serial monogamists and cheating and consented polyamory. I think the tendency towards monogamy is a byproduct of modern society.  IIRC, when you look at most societies that have been documented since the birth of sociology and anthropology you will see that pure monogamy is not the dominant system. None of our other primate relatives is monogamist either. So culture certainly has a defining role.", "is_submitter": false, "distinguished": null, "created_utc": 1630819379.0, "parent_id": "t1_hbniya9", "replies": [{"author": "prajnadhyana", "id": "hbnmtx6", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pi6cal", "stickied": false, "body": "When I said monogamy isn't natural I was thinking more about humans specifically and not animals in general. I should have been more clear, sorry.", "is_submitter": false, "distinguished": null, "created_utc": 1630819844.0, "parent_id": "t1_hbnm6qm", "replies": [{"author": "rondonjon", "id": "hbnodc0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #348", "submission": "pi6cal", "stickied": false, "body": "I gotcha. Sorry, I just tend to think of natural as very specific in meaning. Unnatural has bad connotations and has been used to denigrate all kinds of human behavior.", "is_submitter": false, "distinguished": null, "created_utc": 1630820954.0, "parent_id": "t1_hbnmtx6", "replies": []}]}, {"author": "KuriousKhemicals", "id": "hbnp3cf", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pi6cal", "stickied": false, "body": "I think this is (and several people in this comment section are) glossing over the difference between sexual monogamy and romantic/social monogamy. Polyamory is multiple *developed relationships* at the same time. Cheating (without consent) or having an open relationship (with consent) is a totally different proposition and one that happens among a significant portion of the population no matter what is acknowledged publicly. Nearly all species show some degree of sexual nonmonogamy when paternity studies are done, but many species of mammals and birds do show pair-bonding and maintain nesting and repeated sexual relations with a single member of the opposite sex for an extended period of time.\n\nSexual nonmonogamy I think would be easy to integrate into the expected structure of society, and has been tacitly accepted in various subcultures throughout history. And it can be convincingly argued to be \"natural.\" I think that's much less clear for true polyamory.", "is_submitter": false, "distinguished": null, "created_utc": 1630821490.0, "parent_id": "t1_hbnm6qm", "replies": [{"author": "rondonjon", "id": "hbnpryf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #348", "submission": "pi6cal", "stickied": false, "body": "That’s a good point about polyamory and the difference between sex and romance. I guess polyamory really is a human social construct, if one considers romance a uniquely human invention. I would still hesitate to call it unnatural, just because the word has a negative and derogatory undertone when used in describing human behavior.", "is_submitter": false, "distinguished": null, "created_utc": 1630822006.0, "parent_id": "t1_hbnp3cf", "replies": []}]}]}, {"author": "G-LAZARUS", "id": "hbof2v7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #601", "submission": "pi6cal", "stickied": false, "body": "From a purely biological standpoint monogamy makes a lot of sense. The pair bonding and the devotion of resources towards the resultant offspring creates better chance for of success and those offspring being able to procreate. Love and the dedication accompanying it is evolutionary beneficial in ensuring the direction resources flow. Of course there is also a benefit to spreading seed as wide as possible and that has advantages but also the disadvantages of less focused nourishment. Both are natural, and both are evolutionary strategies", "is_submitter": false, "distinguished": null, "created_utc": 1630843355.0, "parent_id": "t1_hbniya9", "replies": []}]}, {"author": "yoyojanna", "id": "hbnucy4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #612", "submission": "pi6cal", "stickied": false, "body": "Yeah I mean.... Many animals seem to be monogamous by simply nature? Clearly humans aren't monogamous by nature, so I don't see anything wromg with polyamory. \nIt definetly isn't for me or other peopme but that's mainly because I have personal abandonment issues and stuff that would make polyamory overly complicated and just a bad experience for me, but that just personal choice and maybe one day I'll able to fix that.\n\nOn the other hand I do think our legal systems are lacking in our understanding of what a \"family\" is and I really think it should be a priority to change the legal status of different family structures different to the traditional ones.", "is_submitter": false, "distinguished": null, "created_utc": 1630825683.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "SybariteAussie", "id": "hbnvi4h", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pi6cal", "stickied": false, "body": "Marriage & romance have become monetised by advertising and media to fiscally exploit us. Few marriages last anymore, why do we pretend that they do? Have we all become superficial, self absorbed & delusional? Wealthy people having harems seems likely in the future. So much superfluous $ spent on weddings to invite & impress lots of people that you don’t really like on a relationship that will likely end. Success statistics drop with each successive marriage. Most likely upper echelon men will have multiple wives. The logistics for a lady to have a stable of men seems to make this less likely to happen. Unless we all just become like hamsters", "is_submitter": false, "distinguished": null, "created_utc": 1630826627.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Weak_Astronomer2107", "id": "hbnwfzq", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #569", "submission": "pi6cal", "stickied": false, "body": "A simple yet profound realization came to me as an adult. I spent so much time naively thinking of how things “should” be. The issue with this preoccupation is my lack of experience. Many men and women have navigated the boundaries of monogamous and non-monogamous relationships over, literally, thousands of years. The common denominator has led to what we have now. The cumulative experience of all peoples over multiple cultures has led to a predominantly monotonous world. That isn’t a mistake.", "is_submitter": false, "distinguished": null, "created_utc": 1630827417.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "oliverjohansson", "id": "hbnvtlz", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #107", "submission": "pi6cal", "stickied": false, "body": "Humans are classified as repeatedly monogamous, which means we have an exclusive partner for a period of time sufficient to grow a child.\n\nThe whole life monogamy is a concept that became dominant when we transitioned from hunting gathering to farming but wasn’t taken seriously in terms of sexual contacts more for inheritance. The lifespan has more than doubled since, the sexual initiation age also comes later and parenthood is also delayed since… \n\nIf we wildly accepted polyamory two things may happen: \n1. Attractive ppl will have multiple partners and unattractive unwanted celibate to a scale that hardly ever existed before. And it only existed cause young men had high mortality, often forcefully taken to wars\n2. Society may collapse from that if sexually excluded ppl will have to pay taxes for attractive ppl’s patchwork kids", "is_submitter": false, "distinguished": null, "created_utc": 1630826893.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "DDumpTruckK", "id": "hbnjznc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "pi6cal", "stickied": false, "body": "Well currently I'm pretty contentedly nonamorous, so obviously my position is that everyone should be whatever amory they and their partner are cool with.  I don't generally have much of a desire to pursue an amorous relationship and I'm not going to just because society seem to think I should.  That wouldn't really be fair to my theoretical partner anyway.\n\nI have a friend who swallowed the 'settle down, start a family' pill that society wants us to take.  He's got a lot of anxiety because he's not currently fulfilling what he's been told he's supposed to do.\n\nNothing bad will happen if people exercise freedom over their relationships.  Nothing except for maybe all the people who feel like they don't fit into society's expectations might have a little less anxiety to deal with.", "is_submitter": false, "distinguished": null, "created_utc": 1630817826.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Valuable-Peace8307", "id": "hbnndo0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "pi6cal", "stickied": false, "body": "I don’t know, I don’t get it. I knew someone who was the girlfriend of a married man and they all seemed fine with it. And when he died she was heartbroken. I wondered how his wife took his death. And I couldn’t help but wonder how they dealt with that loss.", "is_submitter": false, "distinguished": null, "created_utc": 1630820238.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "KuriousKhemicals", "id": "hbnnrf3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pi6cal", "stickied": false, "body": "I think it's fine, some people find it suits them better and as long as everyone communicates, cool. But it sounds like a lot of work, and intimate relationships must be really important to you to devote all the time and energy it takes to sustain and coordinate more than one of them. And I think many if not most humans have an innate tendency toward pair bonding that makes it hard to feel such feelings for more than one person at once. \n\nI could imagine a society where serial monogamy was more expected and lifelong marriage was not - where people made commitments for shorter periods of time, maybe legal associations in renewing 5 or 10 year terms for co-parenting people for example - but I don't think there will ever be a large percentage of people who truly want to maintain multiple romantic relationships at the same time.", "is_submitter": false, "distinguished": null, "created_utc": 1630820511.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "datsLex", "id": "hbno4ll", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #587", "submission": "pi6cal", "stickied": false, "body": "Love, relationships, and marriage are social constructs weve created out of our need for security, companionship, and survival. The majority of us find it easiest to have one person for many years at a time that we can channel our emotions and energy into and be devoted to. It helps us progress our life and careers and keeps us stable. One person we can be the most comfortable with and depend on. ESPECIALLY if a couple has kids.\n\nWhen you split that energy onto multiple people it seemingly becomes quantity over quality. But i can only speak for me and other monoganous ones.", "is_submitter": false, "distinguished": null, "created_utc": 1630820775.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "amymonae", "id": "hbnwl5k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #325", "submission": "pi6cal", "stickied": false, "body": "I once was really into reading a lot of books about the theoretical background of polyamory. I wasn’t convinced by those that it’s doable, but I followed it up with reading in polyamory forums about families and real throuples etc. writing about their daily life and struggles. If all people involved are good at communicating, time management and child rearing, I think I’d prefer it to a monogamous society. Often the downside is that only one person in an existing couple wants to try polyamory or make the other person be into that as well - that won’t fly.", "is_submitter": false, "distinguished": null, "created_utc": 1630827540.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "DragonSkllzz", "id": "hbo1v6b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #314", "submission": "pi6cal", "stickied": false, "body": "Imo it's fine as long as all involved people are alright with it. Proper communication is really important and nobody should feel forced to put up with it for whatever reason.\n\nWould be nice for those in poly relationships if everyone else could be a lot less judgy about it though.\n\nPersonally I don't want to be with anyone, let alone multiple people, but if others want to and it works for them that's great.", "is_submitter": false, "distinguished": null, "created_utc": 1630832168.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "LukeM1066", "id": "hbo7wqx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #240", "submission": "pi6cal", "stickied": false, "body": "Man I gotta find at least one girl before I start thinking about others", "is_submitter": false, "distinguished": null, "created_utc": 1630837615.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "hboe68y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pi6cal", "stickied": false, "body": "The fact the  Monogamy is found in multiple cultures that were separated for extended periods of time shows that it is a good working system.", "is_submitter": false, "distinguished": null, "created_utc": 1630842706.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Aunty_Polly420", "id": "hboag83", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #133", "submission": "pi6cal", "stickied": false, "body": "I think its really taboo because from a evolutionary standpoint, the more partners you have the more likely you are to catch something and then spread it, which is not beneficial for society if everyone dying from std's because of lack of modern medicine. Now ofc when people cringe at the thought, theyre not thinking this deeply, you're usually reacting based on how jealous that would make you if you knew your partner was happily screwing someone else. Where the jealousy comes from, is to do with the fear of spreading disease encoded in us as jealousy. Obviously that's not the only reason, there's also the fact that humans don't leave the nest untill they are fully adults and as a result our species has strong family bonds and it takes A LOT of effort and rescource to raise a child. So if your mans is running around not providing and just spreading his seed, this is not ideal for raising your kid, so jealousy comes out. \n\n\nNow in modern society, we have modern medicine and most ppl don't want to have kids early so you yeah go ahead and *safely* fuck as many people as you like with *consent* and lots of communication. \n\n\nA lot of questions about relationships, sexual orientation, regular human behaviours can all be explained with evolutionary psychology! \n\nMe personally, i quite like monogamy, i can barely keep track of one partner and make sure everything is covered and all good. Kudos to those out there who can manage multiple AND a main relationship!", "is_submitter": false, "distinguished": null, "created_utc": 1630839798.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Cynical_Doggie", "id": "hbo1blp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #605", "submission": "pi6cal", "stickied": false, "body": "That's how you get swinger orgies.", "is_submitter": false, "distinguished": null, "created_utc": 1630831676.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Skastrik", "id": "hbo8mh4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "pi6cal", "stickied": false, "body": "Jealousy is an emotion that kinda rules out any notion of polyamory being a stable condition for many people. \n\nI think it varies from person to person and from situation to situation. Plus gender is going to play a big role whether it fits or not.", "is_submitter": false, "distinguished": null, "created_utc": 1630838240.0, "parent_id": "t3_pi6cal", "replies": [{"author": "FalconRelevant", "id": "hboh9ah", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "pi6cal", "stickied": false, "body": "Sexuality plays the primary role, not gender.", "is_submitter": false, "distinguished": null, "created_utc": 1630844838.0, "parent_id": "t1_hbo8mh4", "replies": []}]}, {"author": "robbdire", "id": "hboa2cm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #112", "submission": "pi6cal", "stickied": false, "body": "Known many polycules, it's fine, but not for everyone.\n\nInformed consent, clear communication and it works. But from what I see about humanity, neither of those are found in abundance.\n\nNot everyone can get what they need in a relationship from just one person, not everyone can give what a person needs. If it works for a group of people, good for them. Those polycules I know are loving, caring, and just awesome people overall.", "is_submitter": false, "distinguished": null, "created_utc": 1630839477.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "jumpinjahosafa", "id": "hbodjwq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #218", "submission": "pi6cal", "stickied": false, "body": "I think it should be less of a stigma", "is_submitter": false, "distinguished": null, "created_utc": 1630842262.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "FalconRelevant", "id": "hboh3z6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "pi6cal", "stickied": false, "body": "It's different for different people, some people are the kind to have forever-and-ever relationships (whether with one person or multiple at the same time), while some people are the kind who can barely stay with one person for more than a night, and most are somewhere in between.", "is_submitter": false, "distinguished": null, "created_utc": 1630844739.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "HumanoidDespair", "id": "hbohe9e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #565", "submission": "pi6cal", "stickied": false, "body": "It’s difficult to find one compatible partner for me, but two who are also compatible with each other? The odds are certainly against it, but why not? As a concept, I have nothing against polyamory.", "is_submitter": false, "distinguished": null, "created_utc": 1630844930.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Lillithxxxx", "id": "hboih87", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #621", "submission": "pi6cal", "stickied": false, "body": "I am ambi-amorous. I was in open relationships and fwbs most of my life. Just recently found “the one” (not to say he’s the only “the one”) and he is super monogamous so I’m doing that now. No regrets either way. I have low jealousy radar and I don’t understand the monogamous concept of “if your partner sleeps with someone else they don’t love you anymore”", "is_submitter": false, "distinguished": null, "created_utc": 1630845625.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "SirDeep", "id": "hboiqzb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #554", "submission": "pi6cal", "stickied": false, "body": "Polyamory, where you date multiple people at the same time, isn't for me. \n\nNon-monogamy, where you date one person but can have sex with other people, is. Think swinging", "is_submitter": false, "distinguished": null, "created_utc": 1630845794.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Prior_Technology_868", "id": "hbono5i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "pi6cal", "stickied": false, "body": "Polyamory came naturally to tropic populations during the ice age where living conditions were relatively easy, food was abundant, and one man could handle taking care of multiple wives and children. It was usually one man with multiple women as a single guy can impregnate multiple women at a time. Children were raised communally in this environment. \n\nBut up north where it was a lot colder, monogamy was almost forced upon people as the environment was scarce of resources (youd mostly have to hunt, fish, or trap for food, fruit and vegetation usually doesnt grow when its all snowy). One man could feed and protect one pregnant woman, or they could both care for one or two children. \n\nIn the monogamous system the man and woman would have to select their partner carefully lest they choose an inadequate partner who can barely pull their own weight. This is called the slow life strategy, or K selectivity. \n\nThe polyamorous system did not require such careful decisions and was therefore a fast life strategy, or r selectivity.", "is_submitter": false, "distinguished": null, "created_utc": 1630848618.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "LoreleiOpine", "id": "hbopdu6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "pi6cal", "stickied": false, "body": "> And are we as a human race really supposed to be with just one person or multiple people over time? \n\nSupposed by who? \n\n> Is society really doing the right thing by putting us into marriages and monogamous relationships?\n\nHumans are a naturally monogamous and slightly polygamous species. Evolution by natural selection made our psychology.\n\n> What would suddenly happen if more people break these rules and stop conforming to society?\n\nWhat a vague question! It's not about rules. It's about nature. People aren't *pretending* to like marriage. A good marriage is typically the most fulfilling thing in a human's life.", "is_submitter": false, "distinguished": null, "created_utc": 1630849527.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "RiderHood", "id": "hbovlel", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "pi6cal", "stickied": false, "body": "I think monogamy is a social construct but still has a beneficial purpose of creating stability and longevity in societies. I believe at an individual level, men tend towards polygamy and polyamory, while women tend towards wanting the most-fit partner, and would often be willing to share a partner if it wasn’t so stigmatized.", "is_submitter": false, "distinguished": null, "created_utc": 1630852478.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Kelyaan", "id": "hboy21l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pi6cal", "stickied": false, "body": "As someone who has done Poly - It's fine as long as the people are capable of handling the logistics of it. A lot of Poly folk do it and they forget the most important aspect and treat it like having separate relations.", "is_submitter": false, "distinguished": null, "created_utc": 1630853582.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "WikiContributor83", "id": "hbpm7sd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #120", "submission": "pi6cal", "stickied": false, "body": "Certainly something people do and do sustainably, but I feel polyamorists (or at least the random one I met on an anime Internet forum several years ago when discussing a hurt/comfort fic) have illusions as to why it’s such an overwhelming minority. Sure, everyone knows that it requires a lot of scheduling and communication, but seem to think once those issues are out of the way it’s something everyone can do, and don’t factoring in personality issues that are hard to screen for like jealousy and libido.", "is_submitter": false, "distinguished": null, "created_utc": 1630864274.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "_night_cat", "id": "hbpzfem", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #520", "submission": "pi6cal", "stickied": false, "body": "From my experiences, it’s not for everyone. Some people are wired for poly and some aren’t. Worth trying though. Marriage until death isn’t the way to go either. Over time people change. Sometimes they grow closer together and sometimes they grow in completely different directions. Or one grows and the other doesn’t. Marriage should be something you renew periodically or let it expire.", "is_submitter": false, "distinguished": null, "created_utc": 1630870193.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "Concrete_Grapes", "id": "hbq8ej0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pi6cal", "stickied": false, "body": "I think that to have a successful poly relationship to work, it's just as forced, and contrived, and derived from societal expectations (although a smaller one, the niche of the groups interested in it), as monogamy is.   \n\n\nHumans are animals. Flat out. So, often what we think of as the 'right' way or even the 'wrong' way to have relationships is something we're trying to impose over the way that we've evolved, in order to allow ourselves to fit into the broader spectrum of our social group, or society. Thinking poly is the 'preferred' way to exist is just as much a lie, as thinking monogamy is--and anyone who's in a relationship with a person who prefers one over the other, trying to convince their partner who isnt--is trying to manipulate for personal advantage (its not abuse, always). That advantage may not be sexual, or financial at all--just, 'i prefer to live with the IMIAGE of this sort of relationship because it's easier/better to talk about at work' or something.   \n\n\nAs animals, we're serial monogamists. That's the evolutionary pressure, and general direction our species has taken.   \n\n\nAn odd way to think about this as confirmation, we have twice as many female ancestors as we do male ancestors--as humans. Serial monogamy gets that done. It doesnt even have to BE poly--two at the same time. Cheaters are inclined to stop having sex with their partners, in totality, in the period in which they cheat, and then resume later if it's stopped. they didnt do it simultaneously (unless pushed with a partner who didnt know), they do it in series, even if it's very brief series. A military spouse may only cheat for the 6 weeks their partner is in field training, and NEVER when they're around. Thats serial. I know an open poly relationship isnt cheating--and isnt directly comparable, but it's JUST as much as a forced and contrived sort of state as monogamy. If it wasnt, deep levels of communication, rules, and trust in those relationships wouldn't be required.   \n\n\nThe natural state, for the human animal, of both sexes, is serial monogamy.  \n\n\nThat's what i think.", "is_submitter": false, "distinguished": null, "created_utc": 1630874182.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "TatianaAlena", "id": "hbr1bjr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #11", "submission": "pi6cal", "stickied": false, "body": "Not my thing. I got burned by it. Never again.", "is_submitter": false, "distinguished": null, "created_utc": 1630888063.0, "parent_id": "t3_pi6cal", "replies": []}, {"author": "helloreddit321567", "id": "hbsac0c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #247", "submission": "pi6cal", "stickied": false, "body": "In my opinion when you are romantically involved with multiple people you are committed to none. So I see polyamory as a way for people with commitment issues to meet their romantical needs without having to feel too trapped.\n\nI don't think that the need for monogamous relationship will disappear from society. On the other hand, if some people don't want monogamy, it's better for everyone if they are upfront about it. You will always have a mix of both in societies. But I think that it would be better explained from a psychological point of view than a sociological one.", "is_submitter": false, "distinguished": null, "created_utc": 1630914443.0, "parent_id": "t3_pi6cal", "replies": []}]}