{"title": "Any FFXIV Fans Here?", "name": "t3_pg8wrq", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pg8wrq/any_ffxiv_fans_here/", "selftext": "Recently getting back in to the game hard-core. I work weird night time hours, so I don't really have a lot of people to play with. Also, if you do play, are there any changes to the game you're excited or unhappy about? Personally, I'm pumped for Endwalker, so my inner edgy hot topic kid can have a scythe.", "score": 1, "upvote_ratio": 0.6, "permalink": "/r/TheFlyingTree/comments/pg8wrq/any_ffxiv_fans_here/", "id": "pg8wrq", "author": "Corvidtv", "link_flair_text": "Discussion", "num_comments": 5, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630550273.0, "comments": [{"author": "crazymoefaux", "id": "hba8u9e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #482", "submission": "pg8wrq", "stickied": false, "body": "Ya know, I just started playing the free trial a couple weeks ago.  And I've said elsewhere, it's the very best FF game/story I've played in a while.  I've got a couple lv50 characters already, Ninja and White mage, and I'm really enjoying playing both.  But now I'm hitting a lot of the limitations of F2P, and I really don't want to spend money on a subscription, so I dunno how much deeper I can go.\n\nI used to play FFXI way too much, but that was 15+ years ago.  Lemme tell you, playing MMOs on dialup sucked.  I played WHM main back then, but even with shitty ping, I was one of the best on our server.  Had some of the best WHM gear, too, like a Noble's Tunic.\n\nPlaying in dungeons, I kinda like playing healer again.  Last few MMOs I've played, PSO2 and GW2, were so anti-trinity, no pure healer classes, it just gets bland.  Didn't like PSO2NGS at all.", "is_submitter": false, "distinguished": null, "created_utc": 1630562399.0, "parent_id": "t3_pg8wrq", "replies": [{"author": "Corvidtv", "id": "hbae3wp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #330", "submission": "pg8wrq", "stickied": false, "body": "It's totally worth paying for the sub, but even if you don't there's a metric shitload of content in the 50-60 range. I kinda gave up on pso2 pretty quickly, though to be fair I was heavy in to BDO when I tried it,  so I might have been biased", "is_submitter": true, "distinguished": null, "created_utc": 1630566462.0, "parent_id": "t1_hba8u9e", "replies": []}]}, {"author": "Kelyaan", "id": "hb9qn7t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pg8wrq", "stickied": false, "body": "A lot of people are getting into it, it's the current MMO fad, I won't ever play it again as I don't have the lodestone app meaning my account is basically dead. I played wow for 16 years and I'm waiting for New world to come out.", "is_submitter": false, "distinguished": null, "created_utc": 1630551592.0, "parent_id": "t3_pg8wrq", "replies": [{"author": "Corvidtv", "id": "hb9ts25", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #330", "submission": "pg8wrq", "stickied": false, "body": "I'm gonna be honest, I've no idea what the lodestone app is good for. I was hard-core in to wow since TBC, but I kinda got tired of it around WoD. Final Fantasy has always been my \"vacation game\" that I just logged in to and screw around. But I rebuilt my PC, picked it back up, and haven't booted another game since.", "is_submitter": true, "distinguished": null, "created_utc": 1630553231.0, "parent_id": "t1_hb9qn7t", "replies": [{"author": "Kelyaan", "id": "hb9usd8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pg8wrq", "stickied": false, "body": "Back in the day it was used to send your login code, you needed it to play the game.  \n\n\nI cannot remove it without the email I received 8 years ago with the removal code. Nor can I redownload the app as the email from 8 years ago also had the installation code.", "is_submitter": false, "distinguished": null, "created_utc": 1630553769.0, "parent_id": "t1_hb9ts25", "replies": []}]}]}]}