{"title": "Random Questions I had at some point", "name": "t3_p9u398", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p9u398/random_questions_i_had_at_some_point/", "selftext": "What Makes Someone \"Fashionably Late\", Do They Have To Look Fabulous While Being Late or Do They Just Have To Be Late And Be Confident About it?  \n\n\nCan a Person With \"Infinite strength\" ever hold back? Even if you try to use a fraction of your strength infinity/n is still infinity  \n\n\nalso What determines stereotypes? if say I convince enough of a musical theater kids to liking ... idk tap dancing does there become a stereotype of \"most tap dancers are theater kids\"", "score": 3, "upvote_ratio": 0.72, "permalink": "/r/TheFlyingTree/comments/p9u398/random_questions_i_had_at_some_point/", "id": "p9u398", "author": "CrossLight96", "link_flair_text": "Question", "num_comments": 12, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629700290.0, "comments": [{"author": "DoglessDyslexic", "id": "ha07um0", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p9u398", "stickied": false, "body": "> What Makes Someone \"Fashionably Late\", Do They Have To Look Fabulous While Being Late or Do They Just Have To Be Late And Be Confident About it?\n\nFrom the [urban dictionary](https://www.urbandictionary.com/define.php?term=Fashionably%20Late) I think this is as good a definition as any:\n\n*The refined art of being just late enough (5 minutes or so) to give the impression that you are a busy, popular person that was held up with other business.*\n\n> Can a Person With \"Infinite strength\" ever hold back? Even if you try to use a fraction of your strength infinity/n is still infinity\n\nYou and Zeno would have fun with fractions.  The part you're missing is that a discrete quantity of strength (say 50 Newtons) is also a fraction of that strength, just with a distinct value.\n\n> also What determines stereotypes?\n\nEssentially that the generalization in question is widely held.  So if one person believes that all gay men speak with a lisp that's just a weird bias/bad generalization, but if a lot of people think gay men speak with a lisp it becomes a stereotype.  It's worth noting that stereotypes are generally a good example of confirmation bias.  The fact that many/most gay men do not speak with a lisp often doesn't register because the people holding the stereotype never realize they are gay (because they don't speak with a lisp after all) and only see cases that confirm their bias.", "is_submitter": false, "distinguished": null, "created_utc": 1629702359.0, "parent_id": "t3_p9u398", "replies": [{"author": "CrossLight96", "id": "ha0b7d4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #217", "submission": "p9u398", "stickied": false, "body": ">and only see cases that confirm their bias.\n\nso basically there is a wide held random belief and since people actively look out for confirmation when they meet members of that group they ignore the discrediting parts  \nalso who is Zeno?", "is_submitter": true, "distinguished": null, "created_utc": 1629705253.0, "parent_id": "t1_ha07um0", "replies": [{"author": "DoglessDyslexic", "id": "ha0duu7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p9u398", "stickied": false, "body": "Zeno was a Greek philosopher, probably most well known for his [dichotomy paradox](https://en.wikipedia.org/wiki/Zeno%27s_paradoxes#Dichotomy_paradox) which is often a source of [amusement](https://www.smbc-comics.com/comic/zeno) (sometimes more than once [in the same comic](https://www.smbc-comics.com/comic/2012-10-09), thanks SMBC).", "is_submitter": false, "distinguished": null, "created_utc": 1629707606.0, "parent_id": "t1_ha0b7d4", "replies": [{"author": "CrossLight96", "id": "ha0egte", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #217", "submission": "p9u398", "stickied": false, "body": "ohhh so basically since you can divide indefinitely if you always only do half of a thing you can never fully do it, but that's assuming you do it half, then that half's half right? but if you do 50% then the other 50% of the whole thing don't you complete it? that sounds more like an insane excuse to procrastinate than a paradox imo :P (said the boy sarcastically)", "is_submitter": true, "distinguished": null, "created_utc": 1629708152.0, "parent_id": "t1_ha0duu7", "replies": [{"author": "DoglessDyslexic", "id": "ha0eowz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p9u398", "stickied": false, "body": "Pretty much.  It's sort of an opposite paradox from the one you suggested (that a fraction of infinity is still infinite).  While your fractions all approach infinity, Zeno's fractions shrink towards zero.  I figure you'd cancel each other out.", "is_submitter": false, "distinguished": null, "created_utc": 1629708357.0, "parent_id": "t1_ha0egte", "replies": [{"author": "CrossLight96", "id": "ha0h1oc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #217", "submission": "p9u398", "stickied": false, "body": "oh that makes sense never thought my yin would be a Greek philosopher, always thought my negative would be like a literate tumblr user or something. just learned a cool thing :D thank you", "is_submitter": true, "distinguished": null, "created_utc": 1629710475.0, "parent_id": "t1_ha0eowz", "replies": []}]}]}]}]}, {"author": "epicgabe01", "id": "ha3kq3f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #108", "submission": "p9u398", "stickied": false, "body": "I also think stereotypes are the result of a lack of exposure, and can be fixed quite easily of you manage to just break through whatever mental barrier someone has fortifying that stereotype. The problem is more changing society's outlook on a thing and less changing sn individual's outlook on a thing.", "is_submitter": false, "distinguished": null, "created_utc": 1629763292.0, "parent_id": "t1_ha07um0", "replies": []}]}, {"author": "OccamsRazorstrop", "id": "ha0zj59", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #180", "submission": "p9u398", "stickied": false, "body": "Random questions can be answered with random answers, so:\n\n* I like cats better than dogs.\n* The gorilla costume was too hot.\n* Gravel is uncomfortable.", "is_submitter": false, "distinguished": null, "created_utc": 1629723400.0, "parent_id": "t3_p9u398", "replies": [{"author": "CrossLight96", "id": "ha15mxh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #217", "submission": "p9u398", "stickied": false, "body": "I do agree peanut butter tastes way too oily by itself and you are 100% correct about the snakes but I don't really think clay is edible... unless you have lynks disease", "is_submitter": true, "distinguished": null, "created_utc": 1629726452.0, "parent_id": "t1_ha0zj59", "replies": []}]}, {"author": "Happy_INTP", "id": "ha1bmah", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #69", "submission": "p9u398", "stickied": false, "body": ">Can a Person With \"Infinite strength\" ever hold back? Even if you try to use a fraction of your strength infinity\n\nEven though your power goes to 8000+ you can still dial it down to 42.  :D", "is_submitter": false, "distinguished": null, "created_utc": 1629729179.0, "parent_id": "t3_p9u398", "replies": []}, {"author": "SeizureHamster", "id": "ha1g10x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #206", "submission": "p9u398", "stickied": false, "body": "Highly reccomend “modern manners” by PJ O Roarke. Is satire but it also explains most of these “rules”", "is_submitter": false, "distinguished": null, "created_utc": 1629731078.0, "parent_id": "t3_p9u398", "replies": []}, {"author": "BuccaneerRex", "id": "ha1rg1k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p9u398", "stickied": false, "body": "Being fashionably late is a euphemism for people not caring if you're there on time, or being unwilling to give you shit about it. \n\n>Infinite strength \n\nERROR. \n\n>What determines stereotypes?\n\nStereotypes are mental shortcuts. the short answer is that they allow us to quickly determine possible behaviors of others based on superficial identity characteristics.\n\nThe long answer is that stereotypes are a sort of mental short hand that allows us to bypass our inherent social network limitations aka the Dunbar number. We evolved such that our minds can only really handle up to around 150-200 individuals. Other people just get shoeboxed and/or ignored. Stereotypes are the shoeboxes. You pick some superficial category, and then shuffle through the traits that people who share that category might also share. All of this is done subconsciously. Let's take a non-offensive stereotype of 'shop clerk'. You would expect politeness, knowledge about their store, openness and assistance, etc. You do not know if that person HAS any of those traits, but you feel confident you can expect them as behaviors from the person given the label. Individuals become collections of quick categories purely for the ease of modeling. \n\nThe problem, of course, is that no label can ever encompass the fulness of a person. This also plays into a serious logical fallacy known as attribution error. Continuing with the shopkeeper, if you walk into a store and see the clerk standing behind the counter screaming an obscenity and jumping up and down, your first instinct is likely to be 'wow, an angry person'. You attribute the behavior of others to traits, and properties that person has. In contrast, you know that you're jumping up and down and swearing because you just dropped a heavy box on your foot and have broken your toe. Your behavior is explained (to you) by your history, not your traits. The fallacy is in forgetting that other people have their own internal histories explaining their behaviors, and to quick-sort them into buckets based on superficial categories and expectations is to introduce crap data into your models, which will lead you to making bad decisions about your interactions with them.\n\nTl;DR stereotypes are quick-filters to put people into behavior model buckets. They suck because they're not actually good at doing that.", "is_submitter": false, "distinguished": null, "created_utc": 1629735854.0, "parent_id": "t3_p9u398", "replies": []}]}