{"title": "How do you exercise personal agility?", "name": "t3_oybz3s", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oybz3s/how_do_you_exercise_personal_agility/", "selftext": "I have been trying to be productive for the past years. I learned a lot of principles like time-boxing, scheduling and creating necessary but small and manageable pressure.\n\nBut in the pandemic, those concepts fell apart. There's always something that foils my planned tasks. Be it quarantining due to a scare or my own mental breakdowns.\n\nThis issue made me think of solutions. First, I thought of a concept in software development, Agile. It's basically a framework that aims to deal with these volatile world in the context of software development or project management. The word itself connotes fast solutions to a rapid world.\n\nI thought of incorporating parts of it in personal improvement or in my own projects. I don't know how to quite yet. But yeah...\n\nHow about ya'll? Has the concept of agility ever crossed your mind? How do you exercise it?", "score": 1, "upvote_ratio": 0.67, "permalink": "/r/TheFlyingTree/comments/oybz3s/how_do_you_exercise_personal_agility/", "id": "oybz3s", "author": "dannramm", "link_flair_text": "Discussion", "num_comments": 20, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628145887.0, "comments": [{"author": "BuccaneerRex", "id": "h7u4nkg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "oybz3s", "stickied": false, "body": "I thought you were asking about dancing at my desk or secret martial arts I do when nobody's looking.", "is_submitter": false, "distinguished": null, "created_utc": 1628187118.0, "parent_id": "t3_oybz3s", "replies": [{"author": "dannramm", "id": "h7vg8xw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": "I mean that sounds fun too 😂 Maybe even more than what I intended hahahahah", "is_submitter": true, "distinguished": null, "created_utc": 1628207670.0, "parent_id": "t1_h7u4nkg", "replies": []}]}, {"author": "Kweldulf", "id": "h7t1sse", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "oybz3s", "stickied": false, "body": "To start of Agile sucks. It does work as intended in a very limited amount of cases and needs to be very properly managed to yield any kind of improvement over other styles (e.g. waterfall) while also having a bunch of unnecessary overheads. Corporations bought into Agile and started forcing it some years ago due to it being a buzzword with little actual value. Also Agile is meant for small teams, not sure how it would work on an individual.\n\nAs to dealing with the general pandemic mehness and all its effects I found that the only thing that works is deepening the isolation. Pandemic caused all the regular things which would make us loose focus to strengthen. No coworkers to judge you over spending half a day watching you tube. Noone really to compare your efficiency to - in case you find it as a motivating factor, I always did. \n\nSo when I work I remove everything else. Phone shut down, scripts to block social media etc, everything. There is me and the task. And since I make myself unable to do anything else my choice is to be bored or do the task.", "is_submitter": false, "distinguished": null, "created_utc": 1628172321.0, "parent_id": "t3_oybz3s", "replies": [{"author": "NotSkyve", "id": "h7uqvao", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #17", "submission": "oybz3s", "stickied": false, "body": "Personal Kanban is a thing and can work to great success. Just because some orgs have butchered what agility means or have commitment issues because it's a lot of change for a big corporation and a lot of potential loss of power for individuals that need to buy in, doesn't mean that agility is as bad as you make it out to be.\n\nIt is though when companies like McKinsey state that an \"Agile Transformation Office\" is a must considering that immediately bastardizes the entire idea.\n\nBut anyway, as for personal productivity: I don't think there is one size fits all. Some people need accountabilibuddies or the right social context to work, others need isolation. You certainly should try out different things to figure out what works for you. Mixing it up occasionally probably won't hurt either. There's lots of resources out there, like the pomodoro technique and what not. There's also a lot of YouTube channels and podcasts dedicated to it. Just don't go down the rabbit hole where you keep looking for the right technique and procrastinate doing something that way. The best way to get something done is to start doing. You can always look up how to do it better after.", "is_submitter": false, "distinguished": null, "created_utc": 1628196194.0, "parent_id": "t1_h7t1sse", "replies": [{"author": "dannramm", "id": "h7vdqqg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": ">Personal Kanban is a thing and can work to great success\n\nYeah, I think I'll use Kanban instead. I feel like Agile is a bit more specific and really tailored to a team delivering a product. \n\n&#x200B;\n\n>But anyway, as for personal productivity: I don't think there is one size fits all. \n\nYeah, totally. I get that. I've been experimenting a lot actually last school year from project management to note-taking. It's fun getting to experiment and seeing what works and doesn't work with my situation and context. Like a personal scientist. \n\nI have watched these YouTube videos too. And I have implemented some of those tips. I even had promising results at the start. Though again, it was because I can fairly control my environment at the onset of the pandemic. Right now, it's a bit unpredictable and uncertain which makes me look for something else tailored to that unpredictability and uncertainty.\n\n&#x200B;\n\n>Just don't go down the rabbit hole where you keep looking for the right technique and procrastinate doing something that way. \n\nThankfully, I haven't gotten into that rabbit hole yet 😂 I just kinda wing it last school year. It was fun as hell hahahaha", "is_submitter": true, "distinguished": null, "created_utc": 1628206428.0, "parent_id": "t1_h7uqvao", "replies": []}]}, {"author": "dannramm", "id": "h7t8wgq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": "Yeah... I'm not really looking for one-to-one replication of Agile. I guess, I'm looking for inspiration not just in Agile but agile-like methods and somehow implement some to my workflow?\n\nThe ultimate goal is to respond gracefully to unpredictable and uncertain circumstances. I just saw Agile as something that does that albeit in the context of software development.\n\n&#x200B;\n\n>Corporations bought into Agile and started forcing it some years ago due to it being a buzzword with little actual value\n\nBut it's cool to see Agile in the perspective from, I assume, someone who actually has been there. Never knew about this.\n\nAs for the isolation thing, I think I have no problem with getting the tasks done if I actually allot the time for it. I usually lock myself in my room and announce to the people in my house that I'll be working. I'm off of socials too so I never had that distraction problem.\n\nIt's really about unfortunate circumstances that I did not foresee, whether external source or internal source (like idk maybe a breakdown or something 😂). The times that I allot tasks to are usually scrapped due to these situations.\n\nAnd I was thinking I had to have some sort of framework on how to respond to these situations quickly and gracefully if that makes sense.", "is_submitter": true, "distinguished": null, "created_utc": 1628174104.0, "parent_id": "t1_h7t1sse", "replies": []}]}, {"author": "PalatableNourishment", "id": "h7tjnzd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "oybz3s", "stickied": false, "body": "Yes, I have to be agile a lot for my work because I juggle many projects.\n\nBasically I just have lots of lists. A list of projects, their status, what the next steps are, deadlines, etc. At the end of every week, I make a rough schedule of what I’m going to do each day of next week, with a more detailed plan for Monday. At the end of each day I reevaluate if I should change anything for the next day. I have to keep in mind what I can reasonably do in a day. Each morning I make a detailed list of the tasks I should complete and I cross them off as I do them (makes me feel satisfied).  My project list is digital, but my daily lists are in a day planner book.\n\nIn my experience, agility is just chaos if there is no organization and record keeping.\n\nI can’t speak to the pandemic because my work is so agile that we almost instantly pivoted to projects that were pandemic-related, meaning I still had to go to work every day. Other projects went on hiatus but all my lists meant I knew exactly where to pick them up again.", "is_submitter": false, "distinguished": null, "created_utc": 1628178524.0, "parent_id": "t3_oybz3s", "replies": [{"author": "dannramm", "id": "h7vel93", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": "Interesting... so you've been doing this agile workflow pre-pandemic? Is there like a transition period from not using that workflow to eventually implementing it? How was the transition? \n\nThe workflow you describe sounds a lot like Agile too in such a way that it's iterative. That you don't just schedule it on one go and hope you follow the plan. \n\nAlso, I'm interested in what your work is. If it's okay to share 😂", "is_submitter": true, "distinguished": null, "created_utc": 1628206848.0, "parent_id": "t1_h7tjnzd", "replies": [{"author": "PalatableNourishment", "id": "h7vx8ya", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "oybz3s", "stickied": false, "body": "Yeah, this is the way I’ve worked since undergrad. There was a year where I was taking an extra class both terms and when it came time for exams I had to figure out how to study for 6 final exams that were all in a single week on top of term papers! \n\nI wouldn’t say there was a transition really, I just had to start doing it and it was so useful for me that I never stopped.\n\nI manage an analytical chemistry lab at a university. But “manage” makes it sound more hands-off than it is - I do a lot of the actual lab work too.", "is_submitter": false, "distinguished": null, "created_utc": 1628216035.0, "parent_id": "t1_h7vel93", "replies": []}]}]}, {"author": "Niskanen204", "id": "h7umacf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "oybz3s", "stickied": false, "body": "It may not be a good approach to adopt agile wholesale to your personal life because let's face it - some goals/projects may be more 'waterfall' in character.\n\nThat being said, I like to employ some ideas, namely that the of minimum viable product, and breaking work down into pseudo user stories. Helps me get going fast, lays out a schedule, and lets me reach a early goal quickly. I also find a weekly 'retro' helps keep me on track for short-term goals.", "is_submitter": false, "distinguished": null, "created_utc": 1628194295.0, "parent_id": "t3_oybz3s", "replies": [{"author": "dannramm", "id": "h7vg3t4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": ">...because let's face it - some goals/projects may be more 'waterfall' in character.\n\nFunny you should say that 😂 I had to make this documentary and I kinda tried a pseudo-agile approach to it and I think I kinda failed? Maybe because, like you said, it's more like \"waterfall\" where the next phase highly depends on the last (e.g. the editing depends on the script). \n\nBut I don't know. The reason I tried that approach is because I wasn't able to finish the deliverables in the set time even if I'm being productive. Sometimes, things throw a wrench into my schedule. And so, I'm trying to look for flexible workflows and thus, that brought me to thinking of agile. \n\n&#x200B;\n\n>That being said, I like to employ some ideas, namely that the of minimum viable product, and breaking work down into pseudo user stories.\n\nThat's also one of the challenge: how I would translate these to my own projects. Like what does a minimum viable product of a documentary looks like for example. \n\nBut yeah, thanks for the tips! I'm learning a lot from ya'll. Might try those sometime if I figure out how to tailor it to my needs.", "is_submitter": true, "distinguished": null, "created_utc": 1628207602.0, "parent_id": "t1_h7umacf", "replies": [{"author": "Niskanen204", "id": "h7vj0zn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "oybz3s", "stickied": false, "body": "Not knowing anything about doc making, it really could be about tackling multiple MVPs in waterfall sequence - so like getting a minimum script out, then shooting a minimum amount of footage, minimum amount of editing, etc. Then perhaps it would be possible to iterate on writing/filming/editing/soundtrack (i.e. the entire deliverable of a film) for any elements that are weak or missing, etc.", "is_submitter": false, "distinguished": null, "created_utc": 1628209046.0, "parent_id": "t1_h7vg3t4", "replies": []}]}]}, {"author": "pine_ary", "id": "h7s5ijc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "oybz3s", "stickied": false, "body": "Honestly I think this kind of self-optimization is a load of bs. Not everything has to be efficient and productive.", "is_submitter": false, "distinguished": null, "created_utc": 1628151003.0, "parent_id": "t3_oybz3s", "replies": [{"author": "dannramm", "id": "h7sckl7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": "While I see where you're coming from, I still find value in being efficient. \n\nI'm a fairly ambitious person and so, I try to increase my chances in doing the things I set out to do. The way that I see it is I'm full of \"bugs\" in my programming and so, I try to correct it one by one so I can fulfill the \"requirements\" I try to set.\n\nI guess, it's more of a personal value/preference thing. I know that this is a mindset that not everyone wants. Some would rather go with the flow and I respect that hehe", "is_submitter": true, "distinguished": null, "created_utc": 1628157083.0, "parent_id": "t1_h7s5ijc", "replies": []}]}, {"author": "Parking_Pineapple440", "id": "h7skkvd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #224", "submission": "oybz3s", "stickied": false, "body": "This is something I need to give more thought to as I’m about to fall into my last year of college and I’ll be applying to PhD programs at the same time 💀", "is_submitter": false, "distinguished": null, "created_utc": 1628163141.0, "parent_id": "t3_oybz3s", "replies": [{"author": "dannramm", "id": "h7spps1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": "Riiight? It's hard to just recover gracefully from whatever setbacks.\n\nI'm about to enter college actually and em scared honestly which is what prompted me to ask the question.\n\nSo cool to hear you applying for PhD programs. I imagine it must be taxing to be in your position rn\n\nBut hey, good luck to us 🥂😭", "is_submitter": true, "distinguished": null, "created_utc": 1628166320.0, "parent_id": "t1_h7skkvd", "replies": [{"author": "Parking_Pineapple440", "id": "h7spzdi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #224", "submission": "oybz3s", "stickied": false, "body": "When do you go to college? Good luck! Hopefully it is a good experience!\n\nAnd yeah it is freaking me out because I could very well get rejected everywhere and be scrambling to figure something out 💀", "is_submitter": false, "distinguished": null, "created_utc": 1628166472.0, "parent_id": "t1_h7spps1", "replies": [{"author": "dannramm", "id": "h7ssn8q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": "Thankfully, I have ample time to prepare. First term starts in October. Thanks!\n\n&#x200B;\n\n>...I could very well get rejected everywhere and be scrambling to figure something out\n\nYeah, that is really anxiety-inducing tbh. Also felt that during the enrollment season. Hopefully things get better on your end 😊\n\nWhat programs will you be applying in? Interested in knowing hahaha", "is_submitter": true, "distinguished": null, "created_utc": 1628167913.0, "parent_id": "t1_h7spzdi", "replies": [{"author": "Parking_Pineapple440", "id": "h7sykf3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #224", "submission": "oybz3s", "stickied": false, "body": "Very nice. Yeah you’ve still got like two months. I go back next week. \n\nI’m applying to applied mathematics, stats, bio stats… mostly stats.", "is_submitter": false, "distinguished": null, "created_utc": 1628170834.0, "parent_id": "t1_h7ssn8q", "replies": [{"author": "dannramm", "id": "h7t9gzv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #78", "submission": "oybz3s", "stickied": false, "body": ">applied mathematics, stats, bio stats… mostly stats \n\nOoooo sounds interesting. I'd take stats too if computer science is not an option tbh 😂I just love data and how it reveals some useful information.\n\nAnyway, good luck! 😞✊", "is_submitter": true, "distinguished": null, "created_utc": 1628174316.0, "parent_id": "t1_h7sykf3", "replies": []}]}]}]}]}]}]}