{"title": "The Pro-Life position almost always comes across as completely lacking empathy to me", "name": "t3_p8v9gt", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p8v9gt/the_prolife_position_almost_always_comes_across/", "selftext": "In addition to showing no respect or empathy for the mother, I find the majority of pro-life positions also don't care about the baby's life either.  The majority of pro-life positions seem to care only that that baby is delivered, and afterword they don't care what happens to it.\n\nSo obviously there's no empathy for the mother coming from a group of people who are trying to governmentally force her to bare her child.  What's worse is the immediate abandonment of any support for the life of the child who they're forcing into existence.\n\nIf a druggy mother accidentally has a child, the pro-life position would be that she should bring that child to term.  But that's where the pro-life position stops thinking about everything and goes on about their day, never concerning themselves with what kind of shitty experience their political preferences just forced onto someone.  Said child will grow up without any support from the people who forced it into existence.  It will grow up with a drug addicted mother.  It will grow up with a higher chance of being addicted to drugs itself.  It will grow up in a crap neighborhood with a crap school and crap parents lowering its potential for escape. It will have a hard life that will be statistically more inclined towards miserable failure.\n\nIf you're pro-life and you're not at all interested in supporting the lives you are forcing into this world then you need to have a long hard think about your positions and whether or not they really adhere to your morality.  How come *every time* I ask a pro-lifer if they're willing to pay an extra tax to support the children who are being born at a disadvantage, or worse born and abandoned, that pro-lifer says 'no, it's not my problem?'  Is it because the pro-life position actually isn't one of empathy but rather one of self serving virtue signaling?", "score": 26, "upvote_ratio": 0.84, "permalink": "/r/TheFlyingTree/comments/p8v9gt/the_prolife_position_almost_always_comes_across/", "id": "p8v9gt", "author": "DDumpTruckK", "link_flair_text": "Discussion", "num_comments": 180, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629565951.0, "comments": [{"author": "stupidmoth_", "id": "h9th9bp", "score": 19, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p8v9gt", "stickied": false, "body": "as a male outside perspective I think \"pro-life\" is actually just \"anti-rights\" because they always argue how you're killing a baby and such but it's just a cluster of cells with no actual conciousness that's not even alive (in the period abortion is possible) and when faced with arguments and such they often trap themselves in \"I don't care if the mother dies the baby has to live\" so they just want the baby to be born but don't care about them after that and uhhhhh yeah not a fan of that kinda thinking", "is_submitter": false, "distinguished": null, "created_utc": 1629571603.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "TesseractToo", "id": "h9w1vqo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p8v9gt", "stickied": false, "body": "Abortion is possible for the whole term. (Not pro life, just it bears pointing out.)   \n\n\nAlso having an unwanted pregnancy where it WILL kill you is a fucking nightmare scenario, made worse if the guy is starting to have Edwardian-era \"she died because she lived the baby\" fantasies at the situation and starts trying to do shit like legally force the birth even though it might kill you. Fuck guys like that. I don't know what women do in these fucking draconian forced birth societies.", "is_submitter": false, "distinguished": null, "created_utc": 1629622387.0, "parent_id": "t1_h9th9bp", "replies": [{"author": "SeizureHamster", "id": "h9wwp7b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #206", "submission": "p8v9gt", "stickied": false, "body": "A lot of the time they have abortions. They’re just sketchy back alley abortions that kill people.", "is_submitter": false, "distinguished": null, "created_utc": 1629643236.0, "parent_id": "t1_h9w1vqo", "replies": []}]}, {"author": "QueenOfNights", "id": "h9w3g8r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #144", "submission": "p8v9gt", "stickied": false, "body": "People seem to believe that clump of cells is human and has a soul, so to them it is more than cells. But at the same times the woman is lesser and not seen as significant enough.", "is_submitter": false, "distinguished": null, "created_utc": 1629623797.0, "parent_id": "t1_h9th9bp", "replies": [{"author": "obiwanlenobi", "id": "haqs2ud", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "p8v9gt", "stickied": false, "body": "What I've seen from people on the pro-life side is that they put a lot of value into life and living; they see life as more valuable than the well-being of the mother and the child. It really is the difference in values that fuels this debate.\n\nAlthough I wouldn't consider myself pro-life (I don't really have a strong opinion on the issue because I've heard good and bad arguments from both sides), I have heard some false things about people on the pro-life side. I live in a place with a lot of people who are pro-life, so I know what their motivation is for their beliefs. I can tell you with quite a lot of certainty that they're not trying to control women, that's not their goal, their goal is to preserve life, as that's what they value.", "is_submitter": false, "distinguished": null, "created_utc": 1630194680.0, "parent_id": "t1_h9w3g8r", "replies": []}]}]}, {"author": "horse_loose_hospital", "id": "h9tj11p", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seeker #128", "submission": "p8v9gt", "stickied": false, "body": "The pro-life argument has almost nothing to do with \"life\". It's about A) the obvious, maintaining control over women. As we're biologically designed to bring forth life, & as keeping us relegated to that function whether we wish for it or not, men have gained & retained their monopoly on power for millenia. There is no meritorious reason why men are the leaders, the inventors, the gender who has controlled & steered human history pretty much since civilization began. The only reason is because as females we have to be taken out of the ruling & decision-making process, sometimes for long periods, as our bodies go through the biological process of creating life...whether we wish for it or not. \n\nAnd 2) It's *seems* to be an awfully \"good\" position to take, on its face, yeah? \"Wanting *babies* to not be *murdered*, how can anyone look at that & not think what a good person I am!\" , right? But y'see that's just it; it IS awfully good, & easy, to have strong feelings about a thing that at this point takes nothing from you. It's not a big sacrifice, to SAY WORDS, & even to maybe make *yourself* feel better by looking down at those slutty women. But once the actual child is *here*...well then it's just somehow not as much fun. NOW it has *needs*. NOW it has to eat, & have somewhere to live, & have clean clothes, & GAH why is this woman coming to ME with her HAND OUT!?! She should have kept her legs together, damn slutty woman. Well it's not *my* problem, so I'm just not gonna worry about it.\n\nSo, yeah.", "is_submitter": false, "distinguished": null, "created_utc": 1629572423.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "pine_ary", "id": "h9us09g", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "p8v9gt", "stickied": false, "body": "Another angle is economical/racial. They want to produce as many babies as possible to build their society on. They want manpower to fight in wars, outbreed other ethnicities, and to work the economy. The anti-abortion stance is more profitable, because more population means more economic growth. Which is part of the reason they have a seemingly endless amount of shady funding. The economy depends on the unpaid work of childbearing and -raising.", "is_submitter": false, "distinguished": null, "created_utc": 1629593908.0, "parent_id": "t1_h9tj11p", "replies": [{"author": "floofandmemes", "id": "h9v23f2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "That's an interesting take you have there considering most abortions happen in minority communities.", "is_submitter": false, "distinguished": null, "created_utc": 1629598852.0, "parent_id": "t1_h9us09g", "replies": [{"author": "AndrewIsOnline", "id": "h9vdezy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p8v9gt", "stickied": false, "body": "Are you suggesting it is correlation or causation", "is_submitter": false, "distinguished": null, "created_utc": 1629604744.0, "parent_id": "t1_h9v23f2", "replies": [{"author": "floofandmemes", "id": "h9vdpn0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "Neither, I'm saying the statement is non-sequitur with reality.", "is_submitter": false, "distinguished": null, "created_utc": 1629604906.0, "parent_id": "t1_h9vdezy", "replies": [{"author": "AndrewIsOnline", "id": "h9vr7lv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p8v9gt", "stickied": false, "body": "What makes the take interesting then, can you elaborate on your previous comment", "is_submitter": false, "distinguished": null, "created_utc": 1629613605.0, "parent_id": "t1_h9vdpn0", "replies": [{"author": "floofandmemes", "id": "h9wjb9p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "\"Interesting\" in this case was a nice way of saying \"unfathomably stupid.\"", "is_submitter": false, "distinguished": null, "created_utc": 1629636313.0, "parent_id": "t1_h9vr7lv", "replies": [{"author": "AndrewIsOnline", "id": "h9wr97d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p8v9gt", "stickied": false, "body": "What makes it unfathomably stupid?", "is_submitter": false, "distinguished": null, "created_utc": 1629640659.0, "parent_id": "t1_h9wjb9p", "replies": [{"author": "floofandmemes", "id": "h9wrs60", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "See my comment above the previous one.", "is_submitter": false, "distinguished": null, "created_utc": 1629640920.0, "parent_id": "t1_h9wr97d", "replies": [{"author": "AndrewIsOnline", "id": "h9xf2s7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p8v9gt", "stickied": false, "body": "I saw it. \n\nYou still haven’t actually spelled out the lightly racist thing You were originally implying.", "is_submitter": false, "distinguished": null, "created_utc": 1629651250.0, "parent_id": "t1_h9wrs60", "replies": []}]}]}]}]}]}]}, {"author": "DDumpTruckK", "id": "h9vqc0o", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "[Nope.](https://www.guttmacher.org/report/characteristics-us-abortion-patients-2014)  [Have two even.](https://givingcompass.org/article/the-demographic-breakdown-of-women-who-are-getting-abortions/)\n\n\"No racial or ethnic group made up the majority of abortion patients: Thirty-nine percent were white, 28% were black, 25% were Hispanic, 6% were Asian or Pacific Islander, and 3% were of some other race or ethnicity.\"", "is_submitter": true, "distinguished": null, "created_utc": 1629612956.0, "parent_id": "t1_h9v23f2", "replies": [{"author": "floofandmemes", "id": "h9wje8e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "70% of America is white dude, those are very disproportionate.", "is_submitter": false, "distinguished": null, "created_utc": 1629636364.0, "parent_id": "t1_h9vqc0o", "replies": [{"author": "DDumpTruckK", "id": "h9xf7cl", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "That's weird, because what you said didn't mention per capita at all, but all the sudden you want to bring it up.\n\nYou wanna talk about per capita?  Ok.  Per capita who is more likely to be born into poverty?  A white person or a black person?", "is_submitter": true, "distinguished": null, "created_utc": 1629651303.0, "parent_id": "t1_h9wje8e", "replies": []}]}, {"author": "Least_Land", "id": "ha3h1x3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "p8v9gt", "stickied": false, "body": "That doesn’t account for forced sterilizations some claim still take place.", "is_submitter": false, "distinguished": null, "created_utc": 1629761573.0, "parent_id": "t1_h9vqc0o", "replies": []}]}, {"author": "Least_Land", "id": "ha3gvan", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "p8v9gt", "stickied": false, "body": "They do… that’s Eugenics via abortion though. If you practice eugenics, what moral scruples could you have in the first place to argue against abortion? \n\nBut arguing against it anyway adds shame, which makes people even more dysfunctional.", "is_submitter": false, "distinguished": null, "created_utc": 1629761486.0, "parent_id": "t1_h9v23f2", "replies": []}]}]}, {"author": "floofandmemes", "id": "h9v1yzv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "There's no split between the sexes on being pro-life or pro-choice according to pew. That first statement I see all the time, but it's nothing but a conspiracy theory with the same level of truth as saying \"The COVID-19 vaccines are fake/modify DNA/are genocide/some other bad thing someone on telegram said.\"\n\nPro life groups to do not benefit from being against abortion.\n\nIt irritates me to no end to see such baseless accusations instead of any legitimate attempt at discussion.", "is_submitter": false, "distinguished": null, "created_utc": 1629598793.0, "parent_id": "t1_h9tj11p", "replies": []}, {"author": "ARtEmiS_Oo", "id": "h9vsaec", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "So I agree with 2. \n\nYour fist point though…Positions of power always, and I mean always come by merit(there might be cases where it’s someone else’s merit - nepotism, but it’s still merit) \nGeting power is hard, it’s insanely hard. It takes discipline and sacrifices. Not everyone can do it and when you’re competing with the best, even fewer make it. It takes great risk taking that not many are willing to take.\n\nYou puting it as “bad men oppress women” sounds ignorant as fuck. You literaly live in the most unlike that time in history. You can be whatever you want, you can do whaever you want, you can say whatever you want.\n\nAlso the is no monopoly on power…power is a concept, it can’t be monopolized.", "is_submitter": false, "distinguished": null, "created_utc": 1629614421.0, "parent_id": "t1_h9tj11p", "replies": []}, {"author": "ResidentIdaKozuke", "id": "h9xbodf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #198", "submission": "p8v9gt", "stickied": false, "body": "I do believe that point A is real, and that it has very real effects on those who sadly have to deal with it, but I don’t think it’s intentionally meant to be that. When I say this, I don’t mean to say it as a “noooo you can’t hate them!!” you absolutely can, as I do. But I could never see them even when combining their shared brain cell being capable of visualising such big picture perspectives of these problems.\n\nI think these people are simply religious/raised in a situation similar to religion. Of course, not all religious people are that drastically stupid, but the majority of pro-life supporters are simply those who believe that the conception of life is a holy process that shouldn’t be interrupted. I think that would explain why they don’t give any fucks about the well-being of the children or their mothers after birth. To them, it’s a greater compassion,it’s a greater good to the bad of a child’s or a mother’s death. Why? Because heaven! Because god said so! Because my father taught me so! So on and so fourth. \n\nThe biggest problem facing many political stances that seem like no-brainers is the fact that many people don’t actively go by a sense of grounded morality. Many have their holy (be them religious or not) value statements ingrained in their psychology since childhood, and simply feel compelled to obey. That isn’t to say they are not at fault, but more to explain such a weird situation. It’s literally a matter of human rights, for human rights or against. Hoe people can be so openly against, I can only grasp in theory.", "is_submitter": false, "distinguished": null, "created_utc": 1629649803.0, "parent_id": "t1_h9tj11p", "replies": []}]}, {"author": "usernames_suck_ok", "id": "h9tl4wh", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "p8v9gt", "stickied": false, "body": "As someone who used to be pro-life, the thing I find the most interesting about those people, relating to one thing you said, is how most of them are the same people who care absolutely nothing about people who are already physically on earth. A lot of them are the same people who are anti-vax, anti-mask and anti-equality. And they are always against governmental programs that are developed to help people who are struggling or discriminated against until they can find a way to use them to their benefit, and they argue they are \"fiscally conservative\" when it comes to dishing out money to help people who are not them, even during a pandemic. They are those people who equate \"the dangers\" of not opening schools and businesses during a pandemic to the danger of hundreds of thousands of people dying unnecessarily, and their preference is for hundreds of thousands of people to die than to not physically be in schools and businesses because of the economy/money. \n\nLike, what really makes them care so much more about an unborn child than they do about everyone else? Just feeling like they're losing precious control in some way, i.e. the ability to control women/women's bodies? It's an especially interesting question when you look at all the white male politicians who are on about abortion. Highly suspicious. \n\nPeople are saying it's not about empathy, but the one thing I would say is most people who are pro-life regularly display a lack of empathy, and much more, towards people.", "is_submitter": false, "distinguished": null, "created_utc": 1629573403.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "solongfish99", "id": "h9x4vbh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "p8v9gt", "stickied": false, "body": "Would you mind saying a bit more about why you were pro life, and what convinced you to change your position?", "is_submitter": false, "distinguished": null, "created_utc": 1629646919.0, "parent_id": "t1_h9tl4wh", "replies": []}, {"author": "Least_Land", "id": "ha3hgu5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "p8v9gt", "stickied": false, "body": "I was, too, at one point. But I’m a big fat hypocrite, because I had one anyway. Actually, I was so terrified of it being on my medical record I gave myself an herbal-induced abortion with a combination of rue and tansy. That’s some nasty stuff.", "is_submitter": false, "distinguished": null, "created_utc": 1629761765.0, "parent_id": "t1_h9tl4wh", "replies": []}]}, {"author": "CamelBorn", "id": "h9tlpug", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #186", "submission": "p8v9gt", "stickied": false, "body": "I faced that situation. I kept the baby. Its not easy either way and its more about them than you. They get to feel better than someone else, that they are superior. They dont actually care too much. “I would never do that” or -grasps pearls- “did you have a baby as a teenager?” Shameful look. \n\nI didnt do it for religious reasons, not religious. Stubborn, I guess. Tried to do the right thing as I saw it. \n\nThe thing is, just because a person doesnt have a child doesnt mean they were never pregnant or had an abortion. Its hidden so it can be ignored. If known at all. They dont ask the room if anyone had an abortion. So ‘bad’ for abortion and ‘worse’ for teen mother. Punishment.\n\nIt should never be about forcing someone to be a parent. Its horrific. Parents need support at the best of times, in difficult and not perfect situations, far out, what the hell?!", "is_submitter": false, "distinguished": null, "created_utc": 1629573676.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9tn0r9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">Parents need support at the best of times, in difficult and not perfect situations, far out, what the hell?!\n\nYeah I just don't think pro-lifers have really thought it out beyond \"Dead baby = bad.\"   They'd literally be forcing a child to have a parent that didn't want them.  For whatever reason the parent didn't want them, that's just not a great foundation for a family.\n\nIt takes a community to raise a child and pro-lifers don't seem to want to be a part of that community.  Now if every pro-lifer was volunteering to help take care of all the children they're forcing into existence I wouldn't mind as much.", "is_submitter": true, "distinguished": null, "created_utc": 1629574286.0, "parent_id": "t1_h9tlpug", "replies": [{"author": "Chepi_ChepChep", "id": "h9u34cr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "p8v9gt", "stickied": false, "body": ">  They'd literally be forcing a child to have a parent that didn't want them.  For whatever reason the parent didn't want them, that's just not a great foundation for a family.\n\nwith that argument...\n\nshould parents be allowed to kill a 2 year old because they dont want the child anymore?\n\n&#x200B;\n\nas soon as you consider the embryo/baby a human being, human rights apply, no? it does not matter if the parents want the child or not. \n\nthe first question that should be answered by anyone talking about this topic is...  \n\n\nat what point do you believe the baby to be a human?\n\n  \ni think we would have a lot more productive conversations, once we know where people stand on that topic.", "is_submitter": false, "distinguished": null, "created_utc": 1629581737.0, "parent_id": "t1_h9tn0r9", "replies": [{"author": "DDumpTruckK", "id": "h9u3uvy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">should parents be allowed to kill a 2 year old because they dont want the child anymore?\n\nWe're no longer talking about an abortion with this example and is therefor not relevant.  A 2 year old isn't parasitically attached to another person.\n\n>as soon as you consider the embryo/baby a human being, human rights apply, no? it does not matter if the parents want the child or not.\n\nYes, and you're forgetting the mother's rights.  When TWO people's rights conflict with each other we enter a different discussion.\n\n>at what point do you believe the baby to be a human?\n\nVery wrong.  This is the biggest and dumbest red herring to exist in the history of the abortion discussion and it's repeated *everywhere* by people who have no clue.  The discussion is about who's bodily autonomy do we protect, the mother's or the child's?  It doesn't matter about what we consider to be 'a human'.  A 'human' is a categorical term that isn't really very well defined or usefull.", "is_submitter": true, "distinguished": null, "created_utc": 1629582078.0, "parent_id": "t1_h9u34cr", "replies": [{"author": "Chepi_ChepChep", "id": "h9vxjo4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "p8v9gt", "stickied": false, "body": "&#x200B;\n\n>We're no longer talking about an abortion with this example and is therefor not relevant.  A 2 year old isn't parasitically attached to another person.\n\nbut we are talking about the parents not wanting the child and a 2 year old without someone to take care of them will die rather quickly. you made a bad argument that wont convince anyone not already on your side\n\n&#x200B;\n\n>Yes, and you're forgetting the mother's rights.  When TWO people's rights conflict with each other we enter a different discussion.\n\nno, i am not forgetting the mothers rights. you first have to have the discussion about when the embryo is a human, before you even get to the question of whos rights are more important. simple example\n\nif the embryo is not a human until week 30, not allowing abortions up until week 30 would be obviously stupid, for you would not kill a human being.\n\n>\\>at what point do you believe the baby to be a human?  \n>  \n>Very wrong.  This is the biggest and dumbest red herring to exist in the history of the abortion discussion and it's repeated everywhere by people who have no clue.  The discussion is about who's bodily autonomy do we protect, the mother's or the child's?  It doesn't matter about what we consider to be 'a human'.  A 'human' is a categorical term that isn't really very well defined or usefull.\n\nthat is to be the most idiotic take ive ever seen. sorry, but to dismiss the key question about abortion, be it legally, medically or morally as a \"red herring\"?\n\nits by far not bodily autonomy that is to addressed first but the question of if we are actively killing a human being or not. \n\nfor if its not a human being, we dont have to give it any rights. an abortion would be basically the same as cutting of a tumor. a medical procedure without further implications.\n\nbut as soon as we give the embryo the title \"human\", the right to live, we venture in to territory, where it will become very difficult to justify abortion. for it is not bodily autonomy of the women against the child, but the right to live and the doctor to end said live against bodily autonomy of the mother for a certain time.\n\nand there, it would be very similar to one simesic twin wanting to be rid of the other. a doctor killing one in favor of the other without a pressing medical need would commit a murder.\n\nso you basically have to establish that the embryo is not a human yet to avoid all that.", "is_submitter": false, "distinguished": null, "created_utc": 1629618655.0, "parent_id": "t1_h9u3uvy", "replies": [{"author": "DDumpTruckK", "id": "h9vzijh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">but we are talking about the parents not wanting the child and a 2 year old without someone to take care of them will die rather quickly. you made a bad argument that wont convince anyone not already on your side\n\nNo.  We're talking about a mother who has a parasite living on her body and whether or not she should remove it.  My position of empathy towards the child isn't the reason I justify the abortion of the child.  I'm not using the empathy argument to justify abortion.  I'm using the empathy argument to point out that the pro-life decision doesn't seem to have any empathy.\n\nMy argument to justify abortions is one of personal bodily autonomy.\n\n>no, i am not forgetting the mothers rights. you first have to have the discussion about when the embryo is a human, before you even get to the question of whos rights are more important. simple example\r  \n\r\n\nExcept you really don't though.  We can have this whole discussion without using the word human being.  At least on my end. You see the word 'human being' doesn't actually mean anything.  It's just the taxonomy that biologists use to refer to our species.  Taxonomy isn't *fact.*  I don't care if the baby is human and I don't care if the mother is human.  The 'humanity' of people is entirely irrelevant.\n\n>if the embryo is not a human until week 30, not allowing abortions up until week 30 would be obviously stupid, for you would not kill a human being.\n\nAgain, humanity doesn't factor into it.  I'd rather not kill anything if it can be avoided.  Yet sometimes there's a case where *not* killing something would cause far more suffering than killing it would.  But to reiterate, 'humanity' isn't a factor in it at all.  'Humanity' isn't a real fact.  It's a category, and like all categories, it's only well defined to a certain purpose and even then leaves a lot to be desired.  We can have this whole conversation without ever mentioning the word 'human'.\n\n>that is to be the most idiotic take ive ever seen. sorry, but to dismiss the key question about abortion, be it legally, medically or morally as a \"red herring\"?\n\nI'm sorry, but there's wool over your eyes.  You've been duped.  The question of humanity absolutely *is* a red herring.  Do you know what a red herring is?  I shouldn't use these debate terms as much as I do, people get really hostile when you accidentally flex vocabulary on them.\n\n>its by far not bodily autonomy that is to addressed first but the question of if we are actively killing a human being or not.\n\nWell maybe you care about it being 'human'.  But I don't care one iota if it's human or not.  It could be an alien in the mother's womb and my position wouldn't change.  The issue of 'humanity' is a non-issue for any serious pro-choice defender.\n\n>for if its not a human being, we dont have to give it any rights.\n\nWhat world to you live in!?  We give non-human animals rights.  What would happen if I went and tortured a dog?  What would happen if I pit fight dogs?  You're so wrapped up on this human thing you can't even see the reality of the world around you.\n\n>but as soon as we give the embryo the title \"human\", the right to live, we venture in to territory, where it will become very difficult to justify abortion.\n\nAgain, maybe for you, but labeling something as 'human' (which by the way, you'll struggle to find a consistent definition even across a single culture) means nothing to me.  Humans kill humans all the time.  This is actually silly.\n\n>for it is not bodily autonomy of the women against the child, but the right to live and the doctor to end said live against bodily autonomy of the mother for a certain time.\n\nUh...maybe it's your grammar or sentence construction here, but it sounds a lot like what you're saying is \"It's not bodily autonomy, it's bodily autonomy!\"\n\n>so you basically have to establish that the embryo is not a human yet to avoid all that.\n\nLol.  No I don't.  Humans kill humans legally all the time.  Ever hear of 'self defense'? How about 'war'? How many drone strikes did Obama and Trump order?  How many people did US soldiers kill?  How many civilians?\n\nWhat the 'human' problem is actually about, is about you avoiding the question entirely to pretend like there's some kind of 'natural law' in which it's 'objectively wrong' to kill a human or something.  Sorry bud, no such thing exists.  It was all fairy tales you believed.", "is_submitter": true, "distinguished": null, "created_utc": 1629620331.0, "parent_id": "t1_h9vxjo4", "replies": [{"author": "Chepi_ChepChep", "id": "h9wzwfw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "p8v9gt", "stickied": false, "body": "\n>No.  We're talking about a mother who has a parasite living on her body and whether or not she should remove it.\n\nan embryo is, scientifically speaking, not a parasite and you wont win any favors of calling them that. its unnecessarily demonizing and... honestly... very off putting.\n\n>My position of empathy towards the child isn't the reason I justify the abortion of the child. \n\nit is rather difficult to see empathy with someone that has to demonize a child/embryo by calling it a parasite...\n\nbut i do agree that a lot of the pro-livers in the us dont seem to be very empathetic to people at all. it looks more like they want control over women then anything else.\n\n>Except you really don't though.  We can have this whole discussion without using the word human being.\n\nno we cant, because the human being is the crux of the issue. the very central question. be it legally or morally. either it is a human being we are talking about. then it has the same protections under the human rights and constitutions etc. pp. then anyone else. or it has not.\n\n>At least on my end. You see the word 'human being' doesn't actually mean anything.   \n>  \n>It's just the taxonomy that biologists use to refer to our species.  Taxonomy isn't fact.  I don't care if the baby is human and I don't care if the mother is human.  The 'humanity' of people is entirely irrelevant.\n>if the embryo is not a human until week 30, not allowing abortions up until week 30 would be obviously stupid, for you would not kill a human being.  \n>  \n>Again, humanity doesn't factor into it.  I'd rather not kill anything if it can be avoided.  Yet sometimes there's a case where not killing something would cause far more suffering than killing it would.  But to reiterate, 'humanity' isn't a factor in it at all.  'Humanity' isn't a real fact.  It's a category, and like all categories, it's only well defined to a certain purpose and even then leaves a lot to be desired.  We can have this whole conversation without ever mentioning the word 'human'.  \n>  \n\ni'm sorry. i thought we are arguing at least on the basis of human rights. if that is not the case, i dont think any further discussion will be possible, for any argument that ignores human rights is one i wont consider. i seriously hope i am misunderstanding you here, that you misspoke or just got lost in your argument. but the humanity of people  is extremely important for any legal or moral question.\n\n\"Human rights are rights inherent to all human beings,\"   \n\nto dismiss that... to dismiss human rights. sorry, no.\n\n>I'm sorry, but there's wool over your eyes.  You've been duped.  The question of humanity absolutely is a red herring.  Do you know what a red herring is?  I shouldn't use these debate terms as much as I do, people get really hostile when you accidentally flex vocabulary on them.  \n>  \n\ni know what a red herring is and i assure you. the question of the embryos status as a human or not is an extremely important one. for it decides if human rights apply... or not.\n\n>its by far not bodily autonomy that is to addressed first but the question of if we are actively killing a human being or not.  \n>  \n>Well maybe you care about it being 'human'.  But I don't care one iota if it's human or not.  It could be an alien in the mother's womb and my position wouldn't change.  The issue of 'humanity' is a non-issue for any serious pro-choice defender.  \n>  \n\ndude... you are not aiding the pro-choice side a bid by declaring that... sorry, i just want to scream.. that they dont fucking care about human rights?!\nlike.. are you.. really.. really certain that his is the argument you want to make?! \n\n>for if its not a human being, we dont have to give it any rights.  \n>  \n>What world to you live in!?  We give non-human animals rights.  What would happen if I went and tortured a dog?  What would happen if I pit fight dogs?  You're so wrapped up on this human thing you can't even see the reality of the world around you.  \n>  \n\nsorry, i of course meant \"human rights\"\nthe legal and moral status of a human being is extremely different then the one of an animal. in my country, if you kill a dog, its damage of property and animal cruelty. typically a fine, at best a 3 year sentence if you do it especially cruel. murdering a human is a life sentence.\n\n>  \n>Again, maybe for you, but labeling something as 'human' (which by the way, you'll struggle to find a consistent definition even across a single culture) means nothing to me.  Humans kill humans all the time.  This is actually silly.  \n>  \nkilling humans is generally illigal and i hope you agree... for good reason. dismissing that as silly is again.. are you sure you want to make that argument?\n\ni am not against abortion (within reason) but you are not doing pro-life any favors with that argument at all. seriously. never use that argument with pro-lifers. it will only strengthen their cause.\n\n>for it is not bodily autonomy of the women against the child, but the right to live and the doctor to end said live against bodily autonomy of the mother for a certain time.  \n>  \n>Uh...maybe it's your grammar or sentence construction here, but it sounds a lot like what you're saying is \"It's not bodily autonomy, it's bodily autonomy!\"  \n>  \nsorry, english is not my first language.\n\nchilds rights to consider: right to live\n\nwomen rights to consider: right to bodily autonomy\n\nthing to consider especially: wich rights will be infringed upon if we do something vs. wich rights will be infringed upon if we dont do anything/let nature run its course.\n\nwhy is the last part important?\nexample:\n\nactively throwing someone down a cliff is murder. not preventing someone from falling down a cliff is at best failure to provide assistance.\n\nso even if the rights of two human beings would be of equal importance, not interfering vs. interfering is massively favored towards not interfering.\n\n>What the 'human' problem is actually about, is about you avoiding the question entirely to pretend like there's some kind of 'natural law' in which it's 'objectively wrong' to kill a human or something.  Sorry bud, no such thing exists.  It was all fairy tales you believed.\n\ni dont think i can add any words to this. it speaks for it self and dismantles your whole argument. your whole argument relies on dismissing the very core concept of human rights.", "is_submitter": false, "distinguished": null, "created_utc": 1629644682.0, "parent_id": "t1_h9vzijh", "replies": [{"author": "DDumpTruckK", "id": "h9xgvlj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">your whole argument relies on dismissing the very core concept of human rights.\n\nDude, you don't even have a clue.  Human rights?  And from what source do these rights come from?  God I take it?  There's no such thing as 'human rights'.  The rights a person has depends entirely upon the rights that the government protects.  You can appeal to 'human rights' all you want, but that phrase is just a subjective wish and ultimately means nothing.  A person in Africa doesn't have the 'human rights' you seem to think that all humans have.  You're revealing how incredibly priviledged your upbringing was that you've never even thought about rights in any depth.\n\nBecause the irony here is we could have had this conversation already.  I don't refuse that we can call a fetus a human.  I never refused it.  You could have gone on with your discussion, but instead you decided to focus on nothing but 'what is a human'.  You've been had, my friend.  You've bought into a red herring and you're can't even see the forest for the trees.", "is_submitter": true, "distinguished": null, "created_utc": 1629652013.0, "parent_id": "t1_h9wzwfw", "replies": [{"author": "Chepi_ChepChep", "id": "h9xnr6h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "p8v9gt", "stickied": false, "body": "[https://www.un.org/en/about-us/universal-declaration-of-human-rights](https://www.un.org/en/about-us/universal-declaration-of-human-rights)\n\never heard of them?", "is_submitter": false, "distinguished": null, "created_utc": 1629654952.0, "parent_id": "t1_h9xgvlj", "replies": [{"author": "DDumpTruckK", "id": "h9xpaqy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "This is impressively naïve.  So people in Africa are having these rights violated.  Who do we contact to get justice?  Who protects these human rights?  Why isn't the UN dishing out hot plates of justice?", "is_submitter": true, "distinguished": null, "created_utc": 1629655624.0, "parent_id": "t1_h9xnr6h", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "BrynneRaine", "id": "h9txrec", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #13", "submission": "p8v9gt", "stickied": false, "body": "Trying not to talk about religion in this group.  Probly can’t hardly comment this is a tricky subject.", "is_submitter": false, "distinguished": null, "created_utc": 1629579247.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9ty2rh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Forget the group, I'll have a civil discussion with you about your religious views if you want.  I take it your religious principals don't allow abortion?  Could you perhaps elaborate on where and why your religion has taken a stance against abortion?", "is_submitter": true, "distinguished": null, "created_utc": 1629579393.0, "parent_id": "t1_h9txrec", "replies": [{"author": "BrynneRaine", "id": "h9u1nap", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Druid #13", "submission": "p8v9gt", "stickied": false, "body": "No, I don’t think I will.  I’m a Druid and I want to stay here.  This is really a long discussion topic and probably very few people have probably convinced each other to switch sides on it.\n\nIn some ways it is as simple as this, religion out of it: it is a human life and abortion ends it.\n\nBut of course it is more complicated than that.  Should it be outlawed? In a perfect world, yes.  But that world will never exist.  Logically, rationally, people should not be having sex until they are prepared to be parents.  That’s not going to happen either.  But for people to advocate that our culture should try to make a turn in that direction makes a lot of sense to me.  I’m just not one who believes that all humans have a right to sexual intercourse as soon as they hit puberty and should never have to take responsibility for the consequences of it.  It’s somewhere along that line, and probably is best influenced in the culture and not legislated.  But if you believe, and it’s very rational to believe, that it is a human life and that abortion ends it, then it is an issue that should be taken very seriously and soberly and fought for and advocated for and we should really be sympathetic to each other on both sides of the issue.  It is one that in real experience is a very hard an painful issue.\n\nSorry but yeah I’m just not sure I’m ready to bring religion into the conversation here.", "is_submitter": false, "distinguished": null, "created_utc": 1629581055.0, "parent_id": "t1_h9ty2rh", "replies": [{"author": "DDumpTruckK", "id": "h9u36uh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">I’m a Druid and I want to stay here. \n\nYou can discuss religion and not get banned here.  It happens frequently enough.   \n Admittedly you might be the minority in a largely anti-religious sub, but you won't get banned.\n\n>This is really a long discussion topic and probably very few people have probably convinced each other to switch sides on it.\n\nI was more interested in why you think you would need religion in order to occucpy an anti-abortion stance.  Especially since the Holy Texts of the major religions say absolutely *nothing* about abortion, which *absolutely did* happen in time s of antiquity.  I don't know what your religion is, but if it's Christianity then your God is totally ok with abortion.  Or if anything, but Bible is actually on record as valuing the life of the woman as *more* than the life of the child, so you might be going against your God's wishes.\n\nI appreciate that you don't want to talk about religion, but if that's the case, don't bring it up because what you've otherwise done is say \"I know the secret of the answer to the abortion problem.  It's religion, but I don't want to talk about it.\"  Which is pretty lame, honestly.\n\n>But of course it is more complicated than that. Should it be outlawed?\n\nHere's the problem with that.  You're not talking about a system that *legally forces* a woman to birth a child. Are the police going to monitor this mother?  Are they going to escort her to the hospital every month for her check ups?  It's not that what you're suggesting can only exist in a perfect world, it's that even in a perfect world what you're suggesting is stupidly impossible.\n\nAnd worse, you're doing exaclty what I complain about in the post.  You're considering the future of the child *absolutely none*.  You are taking *nothing* about the child's life into consideration and focusing *entirely* on the woman's 'responsibilities'.  You're another person who advocates the forcing of a life into this world, yet refuses to take any responsibility for your own stance.  If you're pro-life you should be paying child support.  Otherwise, I'm sorry, you'd be a hypocritical monster.\n\nI don't mean to brutally dismantle your position here, but you can't just post \"I want to talk about this discussion, but I won't.\" and not expect a response.", "is_submitter": true, "distinguished": null, "created_utc": 1629581770.0, "parent_id": "t1_h9u1nap", "replies": [{"author": "BrynneRaine", "id": "h9u4w5c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #13", "submission": "p8v9gt", "stickied": false, "body": "So back when I joined the rules were a bit different and it was discussed that we should allow religious conversation. They softened the wording in the rules but said not the intent.\n\nI think a pro life stance can be held and defended without bringing religion into it, but there are religious arguments that can be made to strengthen the case.  I don’t expect to convince you, quite honestly, so I don’t care that my argument may be weaker without those pieces. I don’t think religion holds the only secret of the answer to the abortion problem.\n\nI disagree with some of the things you have said in the latest comment. That is all I will say about that.  Sorry.  I know that will annoy you.\n\nWell look, obviously the mother should not be on drugs.  That is obviously not good.  So that is part of the problem.  Two wrongs don’t make a right, though.  So in principle it’s clear to me that abortion is wrong, and so is doing drugs, and so is having irresponsible sex.\n\nThe question is, what do we do about these problems? Do we make excuses for them? Do we make it easier for people to escape the consequences of them?  Would allowing the children to suffer serve to deter society from moving into a better direction?  These are harrrrd questions.  I’m not trying to make it simple.  I’m not even sure I am pro-life by some people’s definition.  I don’t have all the answers, I will admit that.  But I do think that abortion is wrong.\n\nIt is hard for people to help others out of pits they have dug for themselves.  It is truly not their fault and therefore in a sense not their problem.  But we can all do a little to help.  It may not be enough. The real answer is that people shouldn’t do drugs….", "is_submitter": false, "distinguished": null, "created_utc": 1629582567.0, "parent_id": "t1_h9u36uh", "replies": [{"author": "DDumpTruckK", "id": "h9u5l2c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">Well look, obviously the mother should not be on drugs. That is obviously not good. So that is part of the problem. Two wrongs don’t make a right, though. So in principle it’s clear to me that abortion is wrong, and so is doing drugs, and so is having irresponsible sex.\n\nYes but there's one individual here you're not addressing, and it's the point of my entire post.  Unwittingly you're proving the point of my OP.  You're ignoring the life that this druggy mother is bringing into the world.  You're being entirely cold to the future of this child just so you can rant on about the meme of personal responsibility.  I'd really like if you took some of that personal responsibility that you preach so much and actually applied it to yourself.  Your position is going to bring lives into this world that need help and your position says *nothing* about helping those lives.  As soon as that poor, sorry little life slides out of the vagina you stop caring.  That's cold, and cruel.\n\nYou keep acting like we can't be pro-choice *and* address the issues of bad mothers having children.  This isn't the case.  We can address sexual irresponsibility *while* being pro-choice.  But what I'd really like you to do, is take a moment and realize that you're taking someone who doesn't want a child and who can't support a child and you're *forcing* them to bring that child to term, and you're not for a single second thinking about the child's life.  I'd like you to think about the child's life.  Think about how much *you* would be responsible for it if *you* are going to *demand* that it exist.", "is_submitter": true, "distinguished": null, "created_utc": 1629582891.0, "parent_id": "t1_h9u4w5c", "replies": []}]}]}]}]}]}, {"author": "LustigesSporenDrama", "id": "h9vv5j9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #265", "submission": "p8v9gt", "stickied": false, "body": "The funniest thing about the \"pro-life\" position is that they managed to convinced people that they are actually pro life. These are the very people that agree with the notion that some people should be killed for not sharing their (religious) opinions.", "is_submitter": false, "distinguished": null, "created_utc": 1629616680.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "Alirezahjt", "id": "h9t5pl1", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "p8v9gt", "stickied": false, "body": "I am not going to take sides here, but this is a philosophical/theoretical/ethical/mora//religious argument (Choose one or multiple of those), not an empathetic one.\n\nAgain, not taking any sides (Call me a coward I don't care), but the \"pro-life\" group argues that the vast majority (I think above 90% in some studies, regardless of authenticity and accuracy of the study of course) of absorption cases are normal people who CAN raise a child well but choose not to. The druggy mother that you mentioned, or victims of rape, are a tiny fraction (Although even a single person deserves attention and the right to do what's best for them).\n\nSo bottom line, it's much more complicated than my intellectual capacity can handle :D", "is_submitter": false, "distinguished": null, "created_utc": 1629566378.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9t6u03", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">that the vast majority (I think above 90% in some studies, regardless of authenticity and accuracy of the study of course) of absorption cases are normal people who CAN raise a child well but choose not to.\n\nAnd if we forced them to they may be neglectful, resentful, or otherwise negatively affect the child's life.  If they don't *want* to raise a child, I don't see how forcing them to is going to help the child.  This is still a lack of empathy for the child who will be raised in a household that didn't want him/her.\n\nWomen also might be aborting because it's not the right time in their life to have a child, even though they eventually want one.  Forcing a mother to have to drop out of college or highschool to take care of a child is a lack of empathy for the mother and child.\n\nAccording to [this](https://www.guttmacher.org/fact-sheet/induced-abortion-united-states) source some 75% of abortions were had by people who were below the US poverty line or were at low-income level.  It's not a hard argument to suggest that income matters significantly in the quality of child raising.\n\nAlso according to that source 51% of abortions come from women who were on contraceptives at the time of pregnancy.  Meaning they weren't ready for their life to be turned upside down by a child and they were taking steps to try and prevent it.\n\nIt is absolutely still about empathy.  With pro-life we're forcing children into poverty and into family situations where they aren't wanted.  Worse, we're upending other people's lives to do it.", "is_submitter": true, "distinguished": null, "created_utc": 1629566888.0, "parent_id": "t1_h9t5pl1", "replies": []}, {"author": "Tenacious-Tea", "id": "ha4kaop", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "p8v9gt", "stickied": false, "body": "I would go even farther and suggest that empathy has no real value at all in the discussion of this topic. Rational thought and understanding is the only thing that matters. To get anywhere in a discussion on the topic, people have to first address what core beliefs are most fundamental to them personally (the value of life, personal freedom, comfortability, sacrifice, etc) and also understand what is most important to other people. But, ultimately we need to also try to determine what is objectively best for society. That isn’t an easy to agree upon thing on almost any subject that falls into the category, so trying to get agreement on the issues surrounding abortion are even harder.\n\nI think the topic needs to be discussed publicly though, and people from both sides need to keep an open mind about what might actually be the best approach on the matter.  Like most things, it is not uncommon that neither side of an argument ends up being 100% “right.”", "is_submitter": false, "distinguished": null, "created_utc": 1629780971.0, "parent_id": "t1_h9t5pl1", "replies": []}]}, {"author": "IsNowReallyTheTime", "id": "h9t6sxa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #220", "submission": "p8v9gt", "stickied": false, "body": "Growing up around it, the first part is all they are told. Over and over and over and over. They have been hammering bullshit into these people for 40 plus years. Never goes beyond the surface, never gets past feelings, and the default answer to any real question is some iteration of Jesus.", "is_submitter": false, "distinguished": null, "created_utc": 1629566873.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "Ill_NahNah_8140", "id": "h9tvcw3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p8v9gt", "stickied": false, "body": "Although I personally am not in favor of abortion I do agree with this post and the fact that women should be allowed to abort if they want. It makes me cringe and cry when it's late term abortions tho.. but I've seen heard read about many a child brought into this cruel world by even crueler people n those children become adults and the cycle continues.. that's def no better than abortion.. kinda off topic,, I was a young mother at 17 offered an abortion and threatened if I didn't get one,, I didn't and although I had my struggles n my fuck ups my son is 22 now never been in jail or in the streets and though not the perfect picture of \"success\" he is a wonderful well rounded caring hard working responsible young man and I thank God for him and his sisters. Not everyone is so blessed..", "is_submitter": false, "distinguished": null, "created_utc": 1629578139.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "NoSuchKotH", "id": "h9t9ca3", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p8v9gt", "stickied": false, "body": "Looking at it from afar, it was never about about the unborn either. It was always about being right. And showing their own morale and lifestyle down other people's throat.\n\nIf these people would be actually religious and care about their neighbors, they would try to help them. Feed the hungry, clothe the naked, give the homeless shelter. But they are against these things too, because they had to work hard for what they had (they did not) so should others as well.\n\nI think, it is some sweet justice that now, with Covid raging especially in those backwater bible-belt towns, that these people are suddenly facing a lot of healthcare debt. And quite honestly, while I think every death is tragedy, I do not mind these people suffer a bit of what they did to their own health and social welfare systems.", "is_submitter": false, "distinguished": null, "created_utc": 1629568018.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "BrynneRaine", "id": "h9ty54k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #13", "submission": "p8v9gt", "stickied": false, "body": "I’ve been thinking about the concept of theocracy lately and this is an example of where it does kind of break down.  To legislate this issue is very tricky.  But to advocate that people should honor life, be responsible with their sexuality, their drug use, their family values… to understand what they really are doing in an abortion… to try to awaken our culture to some horrible values that are damaging society… I can’t fault them much for that, especially when it is a life and death issue.", "is_submitter": false, "distinguished": null, "created_utc": 1629579424.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9tymgw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">But to advocate that people should honor life, be responsible with their sexuality, their drug use, their family values\n\nDoing these things is not excluded by being pro-choice.  Is it not honoring life to recognize that an accidental child growing up in a poor, drug-stricken home is going to suffer and have a much lower quality of life than one born under priviledged and intended circumstances?\n\nIsn't it honoring life to recognize that immense suffering and being permanently behind is not preferable to death?  Don't we honor and value the sanctity of a *healthy life* over that of one that is almost certainly going to end badly?\n\nAborting a child doesn't mean we stop being responsible sexually.  We can do both.", "is_submitter": true, "distinguished": null, "created_utc": 1629579650.0, "parent_id": "t1_h9ty54k", "replies": []}]}, {"author": "LoreleiOpine", "id": "h9u99ho", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "p8v9gt", "stickied": false, "body": "I don't think it's necessarily about self-serving virtue signaling (although it sometimes is, e.g., in Donald Trump's case). It's more often honest fear of an abusive god.", "is_submitter": false, "distinguished": null, "created_utc": 1629584643.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "laserrobe", "id": "h9ur61l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #69", "submission": "p8v9gt", "stickied": false, "body": "I tend to agree though some pro life people do believe in providing support to mothers after the birth, via both social welfare programs and direct aid from themselves.", "is_submitter": false, "distinguished": null, "created_utc": 1629593500.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9utadu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "I'm much more receptive to the idea of supporting the mothers that would be otherwise forced into having a child and its *only* from that foundation would I ever even start to consider limiting abortions.  However, even with an intent to support the child the reality of enforcing a law against abortion still paints a really grim picture.  We're talking about government agents that would need to go around to all pregnant women, make sure they're still pregnant, and I guess also drive them to doctors appointments and check ups.  And if *that's* the reality of enforcing illegal abortion then we're still screwing over a child that is still being born to unwanted parents, and now we're essentially governmentally enforcing a future of depressed and poorly raised children.  Usually the people against abortion also don't like the government, so I'm not sure how they intend to enforce their abortion positions.", "is_submitter": true, "distinguished": null, "created_utc": 1629594544.0, "parent_id": "t1_h9ur61l", "replies": [{"author": "laserrobe", "id": "h9utqit", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #69", "submission": "p8v9gt", "stickied": false, "body": "Na they could ban abortions but only punish providers. \nIt could also just not be enforced really. \nYou don’t have to have a dystopian law enforcement system to enforce it.\nThough I fear we would/do…", "is_submitter": false, "distinguished": null, "created_utc": 1629594773.0, "parent_id": "t1_h9utadu", "replies": [{"author": "DDumpTruckK", "id": "h9utwhm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Yeah so the problem with *that* solution then would be without enforcement women are just going to go to other, less official and more dangerous methods of abortion.  This is already what we see happening in red blooded Bible humping states that make it difficult for women to get abortions like Texas.", "is_submitter": true, "distinguished": null, "created_utc": 1629594855.0, "parent_id": "t1_h9utqit", "replies": [{"author": "laserrobe", "id": "h9utzvm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #69", "submission": "p8v9gt", "stickied": false, "body": "Oh yeah I’m super pro choice. I’m just saying you don’t necessarily have to have the police being evil while banning abortion.", "is_submitter": false, "distinguished": null, "created_utc": 1629594904.0, "parent_id": "t1_h9utwhm", "replies": [{"author": "DDumpTruckK", "id": "h9uu48x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Sure, it's just the dystopian baby-making police are the *better* way to do it and it's *still* really bad.  If we made it illegal, punished providers, and *didn't* enforce it it would be *even more* dystopic.", "is_submitter": true, "distinguished": null, "created_utc": 1629594965.0, "parent_id": "t1_h9utzvm", "replies": [{"author": "laserrobe", "id": "h9uwb98", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #69", "submission": "p8v9gt", "stickied": false, "body": "You could just have an underground Planned Parenthood that would provide worse outcomes. That’d be better than no access and is enabled by the lack of enforcement.", "is_submitter": false, "distinguished": null, "created_utc": 1629596035.0, "parent_id": "t1_h9uu48x", "replies": [{"author": "DDumpTruckK", "id": "h9v3olq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Yes but it'd be underground and therefore effectively nonexistent to the people who need it.  That's the biggest problem with being in the awkward middle ground we are in the US right now.  In states that want to make it difficult but not illegal to get abortions they find mothers seeking abortions will simply take matters into their own hands and it leads to dangerous and harmful outcomes.  If it's illegal and unenforced it will be identical to what's happening now, which is bad.", "is_submitter": true, "distinguished": null, "created_utc": 1629599634.0, "parent_id": "t1_h9uwb98", "replies": []}]}]}]}]}]}]}]}, {"author": "floofandmemes", "id": "h9v1ikh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "Well that's because you've either exclusively had your interactions with them through curated online media, or they're the ones among the group of the dumbest people to ever exist: twitter users.\n\nThere are many pro-life groups that have charities and other methods of supporting mothers and expectant mothers. I've seen many pro-choice people complain that these places don't offer abortions, which always seemed like a rather silly complaint to me.\n\nBut here we come to an issue that from what I've seen of people seems to be an inherent flaw of humanity: hypocrisy. Particularly tribalistic hypocrisy, in this case. Democrats are pro choice, so pro life people in the US vote Republican. Yet, the GOP supports the death sentence (which is at odds with the position of the Catholic Church, arguably the largest pro life group in existence) and they consistently try to stop any form of government aid to struggling Americans, adhering to McCarthiestic fears that should've died out 30 years ago.\n\nI'm pro-life myself, and personally despise this hypocrisy that can only really exist for political reasons. You briefly mention that in the last area, and my answer to you is that they were told to fear anything their party calls communism. However, from what I see earlier in your post, you also haven't looked at the issue from the perspective of a pro-life person, in which abortion is an action that takes the life of a human being, or you have different ideas regarding whether a life in poverty is worth it, which seems a little nihilistic to me.", "is_submitter": false, "distinguished": null, "created_utc": 1629598574.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9v4jiz", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">Well that's because you've either exclusively had your interactions with them through curated online media, or they're the ones among the group of the dumbest people to ever exist: twitter users.\n\nHow about neither and I've had this discussion with several people face to face?\n\n>There are many pro-life groups that have charities and other methods of supporting mothers and expectant mothers.\n\nUnless we're talking specifics all I can say about these group is there currently exist some that are *highly* religious and exploitative and *unhelpful* to the cause of a new mother who doesn't know what to do.\n\n>I've seen many pro-choice people complain that these places don't offer abortions, which always seemed like a rather silly complaint to me.\n\nMy complaint is that most of these services *lie* to the expecting mother.  They tell her lies about abortion and they try to make it clear to her that abortion is not an option.\n\n>you also haven't looked at the issue from the perspective of a pro-life person, in which abortion is an action that takes the life of a human being, or you have different ideas regarding whether a life in poverty is worth it, which seems a little nihilistic to me.\n\nI have listened to the perspectives of pro-lifers and most of them *balk* when I suggest they help support the child they want to force into existence.  And I know they balk because I'm looking right at their face when I ask them.  And the issue isn't poverty alone.  It's poverty, drugs, and being born into a family that doesn't want a child.  The whole recipe is a terrible one to start a family on, and I'd have thought conservative family memers would know that.  With poverty comes bad neighborhoods, drugs, bad schools, and prejudices.  You're sitting comfortable while you force a child and its mother into a terrible position.  It's setting them up for failure *while also ruining the life of the mother.*", "is_submitter": true, "distinguished": null, "created_utc": 1629600075.0, "parent_id": "t1_h9v1ikh", "replies": [{"author": "floofandmemes", "id": "h9v7rq0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "\"Force into existence\" is a rather hilarious phrase regarding a pregnancy they weren't involved in.\n\nIf you wanna have a discussion about this, you have to stop being so narrow-minded in regard to the human tribalism factor. Everyone is the hero of their own story and all that, and that's the reason for the hypocrisy in regards to government welfare.\n\nSecondly, of course pro life groups would discourage abortion lmao. That statement is a rather strange one to make when everything online is at they're finger tips, including that lady who wanted abortions on the McDonald's dollar menu. Especially since I doubt you've ever stepped foot in such a place and are simply basing that on something someone else told you that you believed without question, possibly John Oliver.\n\nRegardless, making a claim that a position you disagree with is always lacking in empathy, then refusing to account for the human factor to further villainize those you disagree with is the action of someone looking for a self-validating circlejerk, not the action of one looking to inspire meaningful discussion.", "is_submitter": false, "distinguished": null, "created_utc": 1629601743.0, "parent_id": "t1_h9v4jiz", "replies": [{"author": "DDumpTruckK", "id": "h9v8yzw", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">\"Force into existence\" is a rather hilarious phrase regarding a pregnancy they weren't involved in.\n\nWell I'd love to ask the child if they want to be born before they are, but I don't know of a way to do that.  So until then, all births are forced, but especially ones that would other wise be aborted yet through the desires of pro-lifers would be, yes, *forced* into existing.\n\nObviously I refer all judgement for what is to be done to the *mother*.  It's her body, it's her call.  If she wants it, she can have it.  If she doesn't, she shouldn't have to.\n\n>If you wanna have a discussion about this, you have to stop being so narrow-minded in regard to the human tribalism factor.\n\nI don't know how many more times I have to qualify a statement for you to notice it.  The title says \"almost\", the post is specific.  I admit I'm making a generalization and I have admitted that there are surely some pro-life who want to help support the child.  There is no tribalism happening on my end.\n\n>Secondly, of course pro life groups would discourage abortion lmao. \n\nI didn't say they discourage it.  I said they *lie* about it. \n\n>Especially since I doubt you've ever stepped foot in such a place and are simply basing that on something someone else told you that you believed without question, possibly John Oliver.\n\nWell you'd be wrong then.  Maybe you shouldn't make assumptions like that.\n\n>making a claim that a position you disagree with is always lacking in empathy\n\nRead the title, broh.  I never said it's *always*.  I was specific.  If there's tribalism happening here its you feeling like I'm attacking *your team* and that you need to defend *your team.*  You haven't been able to address any of my points I raised, but instead addressed points I didn't raise.\n\n>then refusing to account for the human factor to further villainize those you disagree with\n\nI didn't villainize anyone.  I'm villainizing a position, not people.  People can be mislead.  People can be wrong.  People can change.  I find a lack of empathy in *the position*.   I made no statement about the people.  But nice try at your third strawman in one post.  A new record perhaps?", "is_submitter": true, "distinguished": null, "created_utc": 1629602376.0, "parent_id": "t1_h9v7rq0", "replies": [{"author": "floofandmemes", "id": "h9vcazk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "uh-huh. Oh boy I sure do believe some arrogant prick on the internet that everything he speaks solely as a primary source and that everything he says is 100% true.\n\nAnd yes, saying that a position 40% of people hold is entirely lacking of a trait that makes people human is a villainization of people, whether you try to cover it up or not. \n\nAs I said before, you're far too narrow-minded at the moment in regard to this to have a proper discussion. Enjoy your ignorant and *totally non-tribalistic life.*", "is_submitter": false, "distinguished": null, "created_utc": 1629604143.0, "parent_id": "t1_h9v8yzw", "replies": [{"author": "DDumpTruckK", "id": "h9vdtrg", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">And yes, saying that a position 40% of people hold is entirely lacking of a trait that makes people human is a villainization of people, whether you try to cover it up or not.\n\nIn your mind is it possible to criticize an idea without criticizing a person?\n\n>As I said before, you're far too narrow-minded at the moment in regard to this to have a proper discussion. Enjoy your ignorant and totally non-tribalistic life.\n\nSaid the person who can't even re-phrase a single one of my points and who is projecting their own tribalism *so hard* by falsely accusing me of insulting *their team* and lumping me in with intended pejoratives like 'twitter users' and 'that bitch at McDonalds' it's frankly embarrassing *me* to see *you* do it.  Rethink yourself, mate.", "is_submitter": true, "distinguished": null, "created_utc": 1629604967.0, "parent_id": "t1_h9vcazk", "replies": [{"author": "floofandmemes", "id": "h9vf0jf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "I don't have a team. I even went out of the way to say the hyposcrisy of many pro life people in the US annoys me too. I'm pointing out that your argument is largely a tribalistic one, in its generalization and lack of understanding regarding outgroups. I don't need to rephrase your points. You wrote them down, why would I have to? That doesn't add to what I have to say, the only thing that might do is strawman your argument, which is not something I need to do to point out that it comes from a place lacking in understanding. You can \"listen\" all you want, but if you don't see where they're coming from, you don't *understand* their position as you claim.\n\nAs for the insults....It's always fun to jab at an inflated ego. Couldn't help myself.", "is_submitter": false, "distinguished": null, "created_utc": 1629605601.0, "parent_id": "t1_h9vdtrg", "replies": [{"author": "DDumpTruckK", "id": "h9vfkht", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">I'm pointing out that your argument is largely a tribalistic one, in its generalization and lack of understanding regarding outgroups.\n\nYeah, but what do you think I'm generalizing?  Because I was pretty clear and specific in both title and post and never once did I claim that the issue I'm addressing applies to *all* pro-lifers.\n\n>I don't need to rephrase your points. You wrote them down, why would I have to?\n\nWhy would you?  Because when you say things like: \"Secondly, of course pro life groups would discourage abortion lmao.\" or \"Regardless, making a claim that a position you disagree with is always lacking in empathy\" you're making arguments against positions I don't hold.  You're *trying* (and failing) to restate one of my positions in order to argue against it.  The problem is you're *making up* that position and arguing against it, rather than arguing against one of *my actual* positions.\n\n>the only thing that might do is strawman your argument, which is not something I need to do to point out that it comes from a place lacking in understanding.\n\nBroh you strawmanned me at least twice, probably more.  I'm just going to assume you're ignorant of doing it rather than assume you're maliciously doing it because I'm so polite.\n\n>You can \"listen\" all you want, but if you don't see where they're coming from, you don't understand their position as you claim.\n\nThis is rich coming from the guy who hasn't once argued against a position that I genuinely hold, but instead argues positions I pretty clearly *don't* hold.", "is_submitter": true, "distinguished": null, "created_utc": 1629605915.0, "parent_id": "t1_h9vf0jf", "replies": [{"author": "floofandmemes", "id": "h9vg5c2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "Of course I argue positions you don't hold. If I argued positions you do hold, we wouldn't be arguing.", "is_submitter": false, "distinguished": null, "created_utc": 1629606247.0, "parent_id": "t1_h9vfkht", "replies": [{"author": "DDumpTruckK", "id": "h9vgapj", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "I think you need glasses.  Let me get that for you.\n\n# This is rich coming from the guy who hasn't once argued AGAINST a position that I genuinely hold.", "is_submitter": true, "distinguished": null, "created_utc": 1629606333.0, "parent_id": "t1_h9vg5c2", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "SybariteAussie", "id": "h9v5neu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p8v9gt", "stickied": false, "body": "Main source of discomfort on this subject for me is, what is done with the bio material after a abortion. The harvesting of the bio material being sold for medical research or cosmetic companies. I find the concept of these companies paying extra for bio material that is still alive absolutely terrifying & macabre! It’s a delicate subject. Post WW1 & 2 our society celebrates the individual more, less focus on national goals etc. Birthing pods for babies & a easy method of egg removal for ladies. They could sell their eggs if they don’t want them. The future will probably involve genetic editing, test tube babies. I think the Chinese are researching this? Have heard that having cesarean birth can result in the baby having issues with probiotics in digestive system. We all only have one life & are here briefly. Most religions are the source of the animated pro lifers. We all have our own perceptions and live in separate worlds. Having a contraception pill or option for men could be beneficial for society? There seems to be a empathy drought, world wide. There are no easy answers. Politics seem to have seeped into all facets of society. Rarely things are good or evil. Usually there is nuance, mitigating factors & redeeming features. I certainly don’t have any answers. Just more questions", "is_submitter": false, "distinguished": null, "created_utc": 1629600643.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "areyouseriousdotard", "id": "h9vcmrf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "p8v9gt", "stickied": false, "body": "The bible states a child does not have a soul till it's first breath.\n\nThe prolifers have no argument that is rational...\n\nAnd , it's a stupid name for them.  They are not prolife, they are pro control...", "is_submitter": false, "distinguished": null, "created_utc": 1629604318.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9vdhs5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "I don't exactly disagree, though I'd recognize that some of your statements are probably a bit sweeping.  However, while I also accept that 'pro-life' is a red herring meant to change the focus of the discussion away from bodily autonomy, I also know that if I antagonize their position there's absolutely 0 chance of anything I say getting through to them, where as if I approach them without antagonizing them then maybe something might actually get into their head.", "is_submitter": true, "distinguished": null, "created_utc": 1629604787.0, "parent_id": "t1_h9vcmrf", "replies": [{"author": "areyouseriousdotard", "id": "h9vf8tf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "p8v9gt", "stickied": false, "body": "I'm an old man and am blunt.  I gave up talking to prolifers long ago.\n\nYou can't reason people out of a position they didn't reason themselves into.\n\nI hit them w my ideas.\nEuthanasia of a neonate up to 72 hours after birth should be legal.  A toddler does not reach the same intelligence level as a dog until at least 1 y.o. and we euthanize them.  \nA neonate does not become fully aware until 6 months and that is debatable.\n\nThe main thing for me is to not allow them to call a fetus a baby.  That is just attempting to appeal to emotion and not accurate.", "is_submitter": false, "distinguished": null, "created_utc": 1629605730.0, "parent_id": "t1_h9vdhs5", "replies": [{"author": "DDumpTruckK", "id": "h9vg5b7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">You can't reason people out of a position they didn't reason themselves into.\n\nI agree, which is why this argument is attempting to reach them in the same place that likely convinced them to be pro-life in the first place: the feels.\n\n>The main thing for me is to not allow them to call a fetus a baby.\n\nSee I take a different approach.  Ignore the argument about 'human life must be protected' entirely.  It's not relevant anyway, there's no point to engaging them on it.  Let them call a fetus a human.  The argument is whether or not one human gets to interfere with the bodily autonomy of another human.  Age or motherhood doesn't matter in the slightest.", "is_submitter": true, "distinguished": null, "created_utc": 1629606246.0, "parent_id": "t1_h9vf8tf", "replies": []}]}]}]}, {"author": "AndrewIsOnline", "id": "h9vd67v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p8v9gt", "stickied": false, "body": "The worst part is, is there stupid, man written, backwards as Shit fucking Bible says life starts at first breath, and with the rate of infant death of that era, they *never* would have been able to have the opinion it starts at conception, much less any idea of what conception really entailed. \n\nIt’s ludicrous beyond belief.\n\nThey were purposefully radicalized on this topic too. \n\nIt’s all a tool of corruption and the Republican Party and the Christian evangelists.\n\nThe things I’ve seen happen outside an abortion clinic from these supposed followers of Jesus is enough hate to last centuries.", "is_submitter": false, "distinguished": null, "created_utc": 1629604612.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "Flesh_Bag", "id": "h9ved76", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #95", "submission": "p8v9gt", "stickied": false, "body": "I for one agree with the pro-lifers, life is sacred and should be preserved. As such, I believe that covid vaccinations, masks and lockdowns should be legally and heavily enforced in order to keep as many of the elderly alive as possible. /s", "is_submitter": false, "distinguished": null, "created_utc": 1629605251.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "ARtEmiS_Oo", "id": "h9vrfaw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "I think they’re going about it the wrong way. They shouldn’t be talking about abortion. Instead they should be teaching kinds and young adults to be responsible. \n\nI can understand the argument for the pro-life and I don’t care.\n\nThe pro choice guys sound like entiteled kids frankly…\n\nThat being said, I think that if you want to take away the choice, before you even start the discussion, you should have systems in place capable of taking the baby and raising it to adulthood if the mother cannot.\n\nHave that then start arguing over it is moral, is it not…", "is_submitter": false, "distinguished": null, "created_utc": 1629613765.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9vrsaj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">I think they’re going about it the wrong way. They shouldn’t be talking about abortion. Instead they should be teaching kinds and young adults to be responsible.\n\nAre these things mutually exclusive in your mind?  Couldn't we teach children about being responsible AND have abortion as an option for when it's needed?\n\n[This](https://www.guttmacher.org/fact-sheet/induced-abortion-united-states) source states that in 2014 51% of abortions were induced upon women who were on contraceptives at the time of pregnancy.  That means a full HALF of abortions were from women *at least trying* to be responsible.  I'm so tired of the personal responsibility meme. It's full blown cancer at this point.\n\n>Have that then start arguing over it is moral, is it not…\n\nMorality is an empty word to me.  I have no interest in what you think is moral and what isn't.  The discussion is about who's bodiliy autonomy do you favor, the mother's or the child's and that's the end of it.  Morality is a road to no where.", "is_submitter": true, "distinguished": null, "created_utc": 1629614037.0, "parent_id": "t1_h9vrfaw", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vsh84", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "I thought it was rather clear that until we get ppl to undestand the problem and the solution no one should be forcing anyone to do either.", "is_submitter": false, "distinguished": null, "created_utc": 1629614568.0, "parent_id": "t1_h9vrsaj", "replies": [{"author": "DDumpTruckK", "id": "h9vsss4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "No one is forcing anyone to get an abortion.  The position that you're talking about is called pro-choice.  There's only one side of this debate that wants to force people to do things and it's not the side called *Pro-Choice.*", "is_submitter": true, "distinguished": null, "created_utc": 1629614817.0, "parent_id": "t1_h9vsh84", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vt08t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "I don’t care about the sides. You join your little groups and circlejerk eachother or what ever. I have given my view on the matter, why must you force it into a box?", "is_submitter": false, "distinguished": null, "created_utc": 1629614977.0, "parent_id": "t1_h9vsss4", "replies": [{"author": "DDumpTruckK", "id": "h9vtegb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "What box do you feel I've forced you into?  If your position is truely: \"I thought it was rather clear that until we get ppl to undestand the problem and the solution no one should be forcing anyone to do either.\" then you are pro-choice.  If you don't wish to associate that way that's fine, but your position is definitionally to give women the choice which is what the pro-choice position identifies with.", "is_submitter": true, "distinguished": null, "created_utc": 1629615288.0, "parent_id": "t1_h9vt08t", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vtkvp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "Yes. I would like to not be associated with the group cuz I’ve seen the group saying some pretty dumb shit. It’s my opinion and it happens to allign with that side.", "is_submitter": false, "distinguished": null, "created_utc": 1629615424.0, "parent_id": "t1_h9vtegb", "replies": [{"author": "DDumpTruckK", "id": "h9vtmxl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Ok.  That's fine.  But in reality, whether or not you want to identify as pro-choice, your position is identical to pro-choice so there shouldn't be much that I've said that you would disagree with.", "is_submitter": true, "distinguished": null, "created_utc": 1629615469.0, "parent_id": "t1_h9vtkvp", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vtyfy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "I don’t disagree with the sentiment or the concept is when you get specific and how you form those opinions that I mostly disagree with.", "is_submitter": false, "distinguished": null, "created_utc": 1629615722.0, "parent_id": "t1_h9vtmxl", "replies": [{"author": "DDumpTruckK", "id": "h9vu2oq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "I don't know what this even means.  How do you know how I formed my opinions?  What are you even on about?", "is_submitter": true, "distinguished": null, "created_utc": 1629615816.0, "parent_id": "t1_h9vtyfy", "replies": []}]}]}]}]}]}]}]}, {"author": "ARtEmiS_Oo", "id": "h9vskds", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "Yes, and it’s also the one most often brought up in these discussions.", "is_submitter": false, "distinguished": null, "created_utc": 1629614636.0, "parent_id": "t1_h9vrsaj", "replies": [{"author": "DDumpTruckK", "id": "h9vsw1z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Ok?  So?\n\nMy point isn't: 'Hey look at this study.'  My point is you claim there's a lack of responsibility and I just cited you an example of there being 50% responsibility.", "is_submitter": true, "distinguished": null, "created_utc": 1629614889.0, "parent_id": "t1_h9vskds", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vt27e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "I guess we understand responsability differently", "is_submitter": false, "distinguished": null, "created_utc": 1629615018.0, "parent_id": "t1_h9vsw1z", "replies": [{"author": "DDumpTruckK", "id": "h9vtb7r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "It's possible, but if there's one of us that is out of line with what contemporary US society considers responsible sexuality it's definitely not me.", "is_submitter": true, "distinguished": null, "created_utc": 1629615216.0, "parent_id": "t1_h9vt27e", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vtfcg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "I’m not from the US, I don’t care what the US society considers. It doesn’t change what resposability means and it’s not what you said.", "is_submitter": false, "distinguished": null, "created_utc": 1629615307.0, "parent_id": "t1_h9vtb7r", "replies": [{"author": "DDumpTruckK", "id": "h9vtknk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">I’m not from the US, I don’t care what the US society considers. \n\nWell it's just US society and culture permeates through out the whole world.  AND the US is probably one of the more conservative and backwards societies.  So if we're going to consider the US AND Europe then you're way, WAY off.  You would actually get along more with people from Africa or Saudi Arabia on this issue.", "is_submitter": true, "distinguished": null, "created_utc": 1629615419.0, "parent_id": "t1_h9vtfcg", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vtonx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "Why do you think that just because I don’t agree with you I must be on the complete opposite spectrum?", "is_submitter": false, "distinguished": null, "created_utc": 1629615507.0, "parent_id": "t1_h9vtknk", "replies": [{"author": "DDumpTruckK", "id": "h9vtuks", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "I'm talking about what you personally consider to be 'sexually responsible' and I'm talking about how your personal notion of what that is not only has no real justification to be included in a discussion about laws, but also that your personal notion of sexual responsibility is minority at best.\n\nYou brought up sexual responsibility.  I pointed out how half of people were taking measures to try and avoid pregnancy.  You said that wasn't responsible enough.  Society at large disagrees.", "is_submitter": true, "distinguished": null, "created_utc": 1629615638.0, "parent_id": "t1_h9vtonx", "replies": []}]}]}]}]}]}]}]}, {"author": "ARtEmiS_Oo", "id": "h9vsow0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "Also the women being on contraceptives but their partener not wearing a condom is not responsible. That statistic is meaningless.", "is_submitter": false, "distinguished": null, "created_utc": 1629614732.0, "parent_id": "t1_h9vrsaj", "replies": [{"author": "DDumpTruckK", "id": "h9vtgl1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "How do you know their partner wasn't wearing a condom?  What is your medical expertise to determine what we should consider 'effective contraceptive'?  Where did you get your degree?", "is_submitter": true, "distinguished": null, "created_utc": 1629615334.0, "parent_id": "t1_h9vsow0", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vtvmt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "It doesn’t require medical expertise…it’s auite simple if you think about it… have they done everything non harmful that would prefent it? \n\nI don’t know if they wore a condom but neither do you, which is why I said the statisic is rather pointless.", "is_submitter": false, "distinguished": null, "created_utc": 1629615660.0, "parent_id": "t1_h9vtgl1", "replies": [{"author": "DDumpTruckK", "id": "h9vu13w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">It doesn’t require medical expertise…it’s auite simple if you think about it… have they done everything non harmful that would prefent it?\n\nIt absolutely does require expertise, you are experiencing the Dunning-Kruger effect right now.\n\n>I don’t know if they wore a condom but neither do you, which is why I said the statisic is rather pointless.\n\nYour entire counterpoint *hinged* on the fact that one of them *didn't* use a condom, broh and you just admitted you have no idea if they did or didn't.", "is_submitter": true, "distinguished": null, "created_utc": 1629615779.0, "parent_id": "t1_h9vtvmt", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vu3mm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "You’re missing the point…", "is_submitter": false, "distinguished": null, "created_utc": 1629615835.0, "parent_id": "t1_h9vu13w", "replies": [{"author": "DDumpTruckK", "id": "h9vul3t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "The point is you said:\n\n>Also the women being on contraceptives but their partener not wearing a condom is not responsible. That statistic is meaningless.\r  \n\r\n\nThis is your argument.  Your words.  You're trying to throw out the statistic as meaningless on the basis that their partner didn't wear a condom.  You don't know that's the case, so your argument doesn't work.  I didn't even have to point out that a condom is a contraceptive, but I will now since you don't seem to know.\n\nTHAT's the point that *you're* missing.  You need to accept your counter point doesn't work since you made an assumption to get to your conclusion, not try to act like I'm missing the point somehow.", "is_submitter": true, "distinguished": null, "created_utc": 1629616222.0, "parent_id": "t1_h9vu3mm", "replies": [{"author": "ARtEmiS_Oo", "id": "h9vvju6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p8v9gt", "stickied": false, "body": "I went back and read the thing since I didn’t the first time. What it said was that 51% of the ones who had abortions said that they used a contraceptive method. \n\nWomen who are on contraceptives and contraceptive method during sex are two different categories…\n\nThe fucking point as I’ve said, is that I don’t know whether they used one or not, and neither do you. Because it’s what they said. (People will not admit publicly to things that will damage their social persona, or are very reluctant to)\n\nSo neither of us knows. That doesn’t even matter funnily enough because it doesn’t change what I said. \n\nPeople should be responsible first. \n\nBefore you start again, I’m not saying pregnancy doesn’t happen even with all that so chill.", "is_submitter": false, "distinguished": null, "created_utc": 1629616997.0, "parent_id": "t1_h9vul3t", "replies": [{"author": "DDumpTruckK", "id": "h9vwqck", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">The fucking point as I’ve said, is that I don’t know whether they used one or not, and neither do you. Because it’s what they said.\n\nYou wanted to throw out the statistic because you claimed there wasn't a condom involved.  You made an assumption.  We don't throw out statistics just because you don't understand them.  Your point was daft, and when I showed you that it was daft you moved on to a *different* argument rather than be an adult and admit you either misspoke or were wrong.\n\nSo then you moved to the different argument saying that \"We don't know what they used.\"  What they used is the contraceptives available to them, all of which doctors claim the efficacy AND safety of.  Which is why I asked you why you thought you knew more than doctors and professionals who have studied these contraceptives.  YOU don't get to decide which contraceptives are 'responsible' and which ones aren't.  These women took the advice and knowledge they were given by society.  They can't be expected to know what *your* standard is, nor should they care.  They followed *experts.*\n\n>(People will not admit publicly to things that will damage their social persona, or are very reluctant to)\n\nAnd NOW you've moved on to a *entirely different* argument *again!*  This time you point out an actual issue worth consideration: self reporting.  But rest assured, this issue is very *very* well known in educated groups and educated decisions are made being aware of the problem of self-reporting.  But what is a problem for *you* is that self-reporting is all we have, so while we aren't here to claim absolute truth to these statistics, we can reasonably presume the trend is accurate enough to suggest that there is a decent amount of sexual responsibility in the lives of these women.  *Unless you can prove otherwise you have no data to fall back on.*\n\n>So neither of us knows.\n\nAnd none of us knowing for certain doesn't give us a good reason to throw out the statistics, it only means we shouldn't view them as absolute which is fine with me because nothing is absolute in my world view.\n\n> That doesn’t even matter funnily enough because it doesn’t change what I said.\n\nYes and what you said is *three*, count them, *three* different arguments that you keep changing to whenever I point out the flaw in your logic in one of them.\n\n>People should be responsible first.\n\nThe data shows that people are generally reasonably responsible, and that sexually responsible people make up for somewhere near half of abortions.  Sure, people should be responsible, but when you say that you act like that solves the problem.  As if abortions would just go away if people were only responsible, yet the data says otherwise.\n\n>Before you start again, I’m not saying pregnancy doesn’t happen even with all that so chill.\n\nThe problem is, per your original argument, you seemed to be making the case that this lack of responsibility is a massive majority of abortions.  Your argument was, and I quote:\n\n>I think they’re going about it the wrong way. They shouldn’t be talking about abortion. Instead they should be teaching kinds and young adults to be responsible.\n\nAnd when I asked if you thought it was possible to teach about responsibility AND to discuss the option of abortion, you *ignored me*.  I could only speculate as to why, so I won't.  My issue is with your inability to clarify *upon my asking you to* and then your further degradation of the conversation by being unable to follow the plot.", "is_submitter": true, "distinguished": null, "created_utc": 1629617981.0, "parent_id": "t1_h9vvju6", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "SoulWanderer", "id": "h9wenn6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p8v9gt", "stickied": false, "body": "I am pro life, and I think there should be much more help to families and kids than there are (even if I am from a country where there are quite a few).\nI also support vaccines, wear my mask and am no gay-killing-monster or attend the kkk meetings.\n\n\n>If you're pro-life and you're not at all interested in supporting the lives you are forcing into this world then you need to have a long hard think about your positions and whether or not they really adhere to your morality. \n\nI agree. Being pro life is only the beginning. A kid has a lot of needs and they need to be taken care of. Being pro-life and don't caring about kids is (IMHO) hypocrisy.\n\n>I ask a pro-lifer if they're willing to pay an extra tax to support the children who are being born at a disadvantage, or worse born and abandoned, that pro-lifer says 'no, it's not my problem?'  Is it because the pro-life position actually isn't one of empathy but rather one of self serving virtue signaling?\n\nI do not know where you are from. But in my country, government spends thousands of millions in bullshit. Remove that, and with no additional taxes you can afford that. No need for additional taxes. If rather pay that money to a charity (which I do) than to the government,for the government will spend it on propaganda, stupid shit and generally waste the money.\n\nSo you are pro abortion. What would you think about male abortion? A paper that the father signs saying he wants nothing about the kid and thus has no responsibility? Would you agree with that?", "is_submitter": false, "distinguished": null, "created_utc": 1629633178.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9xggh4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">So you are pro abortion. What would you think about male abortion? A paper that the father signs saying he wants nothing about the kid and thus has no responsibility? Would you agree with that?\n\nYou're trying to relate a woman getting an abortion to a man signing a paper saying he's not responsible for the child.  Those aren't the same thing at all.  Abortion isn't about responsibility.  When a woman gets an abortion 'responsibility' isn't on the paper work.  This isn't about shirking responsibilities or not.  This is about one person being parasitically attached to a woman's body and it's about whether or not we protect that woman's right to choices about her own body.  The pro-life position *must* demand that a woman *does not* get to have full bodily autonomy and the pro-life position *must* demand that she carry the baby to term *regardless of her will.*\n\nThere's nothing about responsibility that's relevant to the abortion discussion. Reponsibility is the discussion that happens *after* the abortion discussion because responsibility hinges entirely on whether or not the child gets aborted.  If the child is delivered and kept the parents are responsible for the future of that child.  If the child is aborted then there's nothing for either to be responsible for.", "is_submitter": true, "distinguished": null, "created_utc": 1629651836.0, "parent_id": "t1_h9wenn6", "replies": [{"author": "SoulWanderer", "id": "h9xmoev", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p8v9gt", "stickied": false, "body": "No, I am asking a question. What would you think about that paper?\n\n\n>This is about one person being parasitically attached to a woman's body and it's about whether or not we protect that woman's right to choices about her own body.  \n\nAnd seeing your argument, if you consider the baby a  person, then it is an independent life, so you are killing it. So you are murdering a baby, aren't you? I prefer to ban murder. \nTo me killing a person, a totally innocent and defenseless person, is the worst solution, and I consider that we need to defend the weakest, in this case the baby. \n\nThe right to live of the baby otweight any other right (except the right to live) of the mother. \n\nThat said I agree that in some cases (medical reasons) abortion is necessary.", "is_submitter": false, "distinguished": null, "created_utc": 1629654488.0, "parent_id": "t1_h9xggh4", "replies": [{"author": "DDumpTruckK", "id": "h9xonc9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">No, I am asking a question. What would you think about that paper?\n\nI don't see why this is topical.  I'm not interested in determining who has responsibility or who can shirk it.\n\n>And seeing your argument, if you consider the baby a person, then it is an independent life, so you are killing it. So you are murdering a baby, aren't you?\n\nYes.  Who cares?  People are murdered all the time in self defense.  In war.  In politics.  In prisons.  Society doesn't seem to mind killing a person in some circumstances, why should I?\n\n>To me killing a person, a totally innocent and defenseless person, is the worst solution, and I consider that we need to defend the weakest, in this case the baby.\n\nAnd if the baby threatens the mother's life?  Because what you're doing is painting it as if it's a decision involving one person.  You're forgetting the mother in this equation.\n\nSo let me put it to you this way.  You wake up on a table, you have tubes stuck in you.  Those tubes connect you to another adult human person.  Doctors say they had to attach him to you in order for him to survive.  They didn't ask you and you have no choice as to whether or not he stays attached to you.  How do you feel about this?  Do you still think it's a good idea to suggest that we're allowed to void another person's autonomy in order to save someone else?  How about instead of you having to be an organ donor, doctors could just take your organs without asking.  Is that alright?\n\n>The right to live of the baby otweight any other right (except the right to live) of the mother.\n\nYeah so my above scenario should cause you to rethink this statement.  But even more, where does this 'right' that you think exists come from?  Because it doesn't come from the government.  The government does not secure this right you're speaking of.  If the 'right to live' of the baby is violated who do we contact to get justice?  You can appeal to a 'right to live' all you want, but rights are just things protected by governments.  There is no 'natural law' whereby people 'have rights' intrinsically.", "is_submitter": true, "distinguished": null, "created_utc": 1629655343.0, "parent_id": "t1_h9xmoev", "replies": [{"author": "SoulWanderer", "id": "h9xplg4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p8v9gt", "stickied": false, "body": "\n>\nYes.  Who cares?  People are murdered all the time in self defense.  In war.  In politics.  In prisons.  Society doesn't seem to mind killing a person in some circumstances, why should I?\n\nWell, I do not know if you are a troll or your views are like this... I feel there is not much more we can talk about.\n\nThanks for taking the time to answer.", "is_submitter": false, "distinguished": null, "created_utc": 1629655755.0, "parent_id": "t1_h9xonc9", "replies": [{"author": "DDumpTruckK", "id": "h9xptgk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "My position is reality.  My position is the current legal system.  There's no trolling.  Killing humans is accepted in many instances within society.", "is_submitter": true, "distinguished": null, "created_utc": 1629655854.0, "parent_id": "t1_h9xplg4", "replies": []}]}]}]}]}]}, {"author": "bolrnly", "id": "h9wrhep", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #155 | Ordo Cognitus", "submission": "p8v9gt", "stickied": false, "body": "you're right, just came here to say that I object to the use of the word \"druggy\", it's a little disrespectful", "is_submitter": false, "distinguished": null, "created_utc": 1629640771.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "LegallyThrownFarAway", "id": "h9x1kmm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p8v9gt", "stickied": false, "body": "There are so many reasons that abortion should be legal. You don’t know until you lose a baby the pain a family goes through when they have a demise. Is it right to force her to carry her dead child any longer than she has to? No. I don’t think so.", "is_submitter": false, "distinguished": null, "created_utc": 1629645443.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "UptightBean", "id": "h9y7gp2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #122", "submission": "p8v9gt", "stickied": false, "body": "Post hoc Trigger alert, so of you are feeling like you hate me, keep reading, otherwiae we will never get anywhere.\n\nWow you all have a lot of opinions about, aparently, me, that are very far off from reality, i do care about the children that grow up in awful households, thats why i believe everyone should get a better education so they dont have unwanted children, and not only that, but i do have a father that hates me, and a mother that really would've prefered not having me had circumnstances been just a bit different. but even after growing up in a shit house, i am on my way to become a succesful human, had my mother aborted me, she would have denied me of the chance, just because she was afraid of the life i would have had, i, not her.\n   Besides, child protective services exist, you know? Rather than letting crackwhores and deadbeats kill the children they don't want, Child protective services should be allowed to operate without so much beurocracy and bumps in the road. \n   Also, how is, geography and timeframe aside, killing a baby, in the uterous, and dumping them in a trashcan ten days after they are borne, different? \n    Also, on a related note, since you are so empathic and rigteous, will you do something about the talibans in afghanistan? Or does your good will end when things get hard? When it's more complicated than \"yeah, lets let everyone kill babies\"?\n\nAlso, since you are all for killing babies to aliviate the auffering in the world, why not let first scientists experiment on those babies? You know, that would be very usefull, genetic experimentation and research could be tremendously boosted. Lifes of children born not in crackhouses and the like could be improved.\n\nTheres is also the matter of calling pro life people braindead hypocrites, wich i answer with a question, why is killing babies wrong, but not death penalty? \nAnd if we are saying that killing those that will live worse that ourselves is right because they never asked for it, why is it wrong when an adavanced civilzation destroys another less advanced one? After all \"those poor people, living in mud huts, and just wating for the day to be killed by tigers\" also, most of them didn't want their children probably either, so, are you willing to put your money were your mouth is? Do you really think that a bad life is worse than no life? And do you really think you should be the one deciding that? At least i don't presume to be the one who decides who should live and who shouldn't.\n\nAlso, let's not joke with ourselves, this issue has become so peolitical, that, if you asume i don't care about anyone for being a pro life, i'll asume you been brainwashed by the media to believe abortion is right so that they could leverage your vote more easily, unless you prove me wrong, and answer my questions in a sincere and smart way, i don't presune to be the owner of you,m though, nor do i think that you suddenly care about my opinion.", "is_submitter": false, "distinguished": null, "created_utc": 1629663574.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9ybuuj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">but even after growing up in a shit house, i am on my way to become a succesful human\n\nI'm sorry, but I just can't and won't try to apply your singular anecdotal story to the entire population.  For every success story you tell me I can tell you a horror story of abusive families, drugs, and suicide.\n\n>Also, since you are all for killing babies to aliviate the auffering in the world, why not let first scientists experiment on those babies? You know, that would be very usefull, genetic experimentation and research could be tremendously boosted. Lifes of children born not in crackhouses and the like could be improved.\n\nIf they want to experiment on the dead babies and the parents consent to it, sure.  I don't care.  Why would I? \n\n>Besides, child protective services exist, you know?\n\nYeah and what are they gonna do?  Take the child away and put them in an orphanage where they're statistically doomed to have a bad outcome?\n\n>Child protective services should be allowed to operate without so much beurocracy and bumps in the road.\n\nGosh its like you have no idea how government works.  The bureaucracy is there to protect the children.  The paper trail and government oversight is all that protects these kids, dude.\n\n>Also, how is, geography and timeframe aside, killing a baby, in the uterous, and dumping them in a trashcan ten days after they are borne, different?\n\nHow is it different?  One is a medical procedure that is performed by experts and the other sounds like something a trailer trash family stuck in a red state with no access to abortions would do.\n\n>Theres is also the matter of calling pro life people braindead hypocrites\n\nWell I didn't do that, so I don't know what you're on about here. You're just rambling to no one.  Check yourself, brother.\n\n>wich i answer with a question, why is killing babies wrong, but not death penalty?\n\nI don't support the death penalty.  You should really probably check with your interlocutor what his positions are instead of making blanket assumptions.\n\n>And if we are saying that killing those that will live worse that ourselves is right because they never asked for it, why is it wrong when an adavanced civilzation destroys another less advanced one?\n\nI firstly didn't say it was 'right'.  I'm not interested in moral quibbles.  Morality isn't real and acting like it is is a waste of time.  But for your second question, the difference there would be the destroyed society isn't living in a parasitic relationship to the other one, so you're presented an entirely unrelated scenario.\n\n>Also, let's not joke with ourselves, this issue has become so peolitical, that, if you asume i don't care about anyone for being a pro life,\n\nOf course the issue is political.  Everything is political.  I haven't assumed you don't care about anyone.  I'm attacking a position, not a person.  I get that you feel triggered, but you need to practice separating your ability to consider issues from your personal feelings.  You're *all* over the place here dude.  Half of this isn't coherent, and the other half is strawmans of positions that I don't hold.\n\n> i'll asume you been brainwashed by the media to believe abortion is right so that they could leverage your vote more easily\n\nWeird.  Because I don't assume anything about you.  I made an argument against a position, why do you feel the need to presume things about my character?  Wouldn't an honest conversation avoid making assumptions about people's character and instead discuss the positions?  Why are you so eager to paint my person one way or the other?  I think you need to step back, take a breath, and have an honest think about how you're going about this.", "is_submitter": true, "distinguished": null, "created_utc": 1629665527.0, "parent_id": "t1_h9y7gp2", "replies": [{"author": "UptightBean", "id": "h9ye43d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #122", "submission": "p8v9gt", "stickied": false, "body": "I respect you for the time you took to read and write, but, if my answers aren't adressed to you, don't be surprised you don't get it, i especifically said who i was adressing the questions to, for example, those who think they know who i am, just because i am pro life, like a lot of the comments in this comment section.\n\nAlso, the typo one was my fault, i admit that\n\n\"Why is killing babies wrong But not death penalty\" should be \"why is killing babies right, but not death penalty\"\n\nNow for the answers that aply:\n\n>I'm sorry, but I just can't and won't try to apply your singular anecdotal story to the entire population. For every success story you tell me I can tell you a horror story of abusive families, drugs, and suicide.\n\nDon't you think denying people of the chance is kinda selfish and narrowminded? Is as if i said \"no, you can't go to college because i think you won't make it\" or \"no, you are to fat to try this sport\" or you are in favour of that kind of attitude?\n\n\n\n>If they want to experiment on the dead babies and the parents consent to it, sure. I don't care. Why would I? \n\nI suggest experimenting on babies that are still alive, after all, if you don't need consenr for killing them, why would you need it to experiment on them?\n\n>\nYeah and what are they gonna do? Take the child away and put them in an orphanage where they're statistically doomed to have a bad outcome?\n\n\nA later part adresses that.\n\n>Gosh its like you have no idea how government works. The bureaucracy is there to protect the children. The paper trail and government oversight is all that protects these kids, dude.\n\nI grant you, i don't know much about the state of CPS on the US, but it would seem it's not very good since i see it brought up a lot, i just suggest spending tax money on that instead of stealth bombers.\n\n>How is it different? One is a medical procedure that is performed by experts and the other sounds like something a trailer trash family stuck in a red state with no access to abortions would do.\n\nSo if a medical expert dunked a kid in a trashcan it would be ok?\n\n>I firstly didn't say it was 'right'. I'm not interested in moral quibbles. Morality isn't real and acting like it is is a waste of time. But for your second question, the difference there would be the destroyed society isn't living in a parasitic relationship to the other one, so you're presented an entirely unrelated scenario.\n\nSo, morality is not a big deal for you? Cool", "is_submitter": false, "distinguished": null, "created_utc": 1629666526.0, "parent_id": "t1_h9ybuuj", "replies": [{"author": "DDumpTruckK", "id": "h9yhe8i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">\"Why is killing babies wrong But not death penalty\" should be \"why is killing babies right, but not death penalty\"\n\nOk, well that's even easier.  Because prisoners don't have a physical and literal parasitic dependency on other individuals in the same way that a pregnant woman has a parasitic life growing inside her.  So why is it ok to kill babies?  Because they're threatening the autonomy of another person, where prisoners aren't.\n\n>Don't you think denying people of the chance is kinda selfish and narrowminded?\n\nNo, because in denying someone that chance, I'm rescuing the life of the mother who would otherwise likely be thrown into unrecoverable poverty *with* her child to support, condemning *both* of them.   And because, ultimately, it's not my call to make, it's hers.  Her body, her choice.\n\n>Is as if i said \"no, you can't go to college because i think you won't make it\" or \"no, you are to fat to try this sport\" or you are in favour of that kind of attitude?\n\nI mean if you have a child who has flunked out of highschool, doesn't have good SAT scores, and your family has no money, refusing them going to college would probably be a prudent financial decision.  Or rather, since once they're an adult you can't really tell them what to do anymore, you'd just let them pay of it on their own if they wanted.  Sorry I don't think this comparison works at all.  It's not really the same situation.\n\n>I suggest experimenting on babies that are still alive, after all, if you don't need consenr for killing them, why would you need it to experiment on them?\n\nHuh?  You don't think you need consent to abort a child?  The mother gives consent.  As with anything in childhood, you ask the parents.  Children can't give legal consent *anywhere*.  It's really weird that you think they can.  The consent I'm talking about is the consent of the parents.  As for experimenting on *living* children, I mean...honestly, you realize we already do this, right?  We just perform experiments that aren't torture and we do it on babies that aren't planned to be killed.  There's a pretty big difference between aborting a child, and keeping a child alive just to perform torturous experiments on it.  If you can't see that difference then I don't know what to tell you.\n\n>I grant you, i don't know much about the state of CPS on the US, but it would seem it's not very good since i see it brought up a lot, i just suggest spending tax money on that instead of stealth bombers.\n\nI wouldn't disagree, but the problem is you're the one forcing a child to go through an orphanage.  You're the one forcing the child to be born to abusive parents that don't want it, condemning it to a difficult life in shitty orphanages and if they're lucky they get a good family.  If they're statistically average they get a shit family.\n\n>So if a medical expert dunked a kid in a trashcan it would be ok?\n\nIf the trashcan was a medical waste bin, and if the abortion had been performed by an expert, in a facility, with clean tools and safe regulations, sure.  But this is part of the problem with saying it's 'ok'.  Saying something is right or wrong doesn't mean anything.  I'm interested in outcomes, and aborting children avoids unnecessary suffering which is an outcome I'm interested in.\n\n>So, morality is not a big deal for you? Cool\n\nMorality doesn't exist.  Any moral statement cannot be objectively true. It's a matter of what your personal sense of fairness agrees on, which will be different from mine.  Us arguing over what 'right' or 'wrong' is is entirely pointless because neither of us will be able to ground our foundation in reality.  Morality has no grounding and it has no meaning.", "is_submitter": true, "distinguished": null, "created_utc": 1629668016.0, "parent_id": "t1_h9ye43d", "replies": [{"author": "UptightBean", "id": "h9yjddf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #122", "submission": "p8v9gt", "stickied": false, "body": ">Ok, well that's even easier. Because prisoners don't have a physical and literal parasitic dependency on other individuals in the same way that a pregnant woman has a parasitic life growing inside her. So why is it ok to kill babies? Because they're threatening the autonomy of another person, where prisoners aren't.\n\nPrisioner do be kinda parasitic though, tax money pays for jails not the tooth fairy.\n\n>No, because in denying someone that chance, I'm rescuing the life of the mother who would otherwise likely be thrown into unrecoverable poverty with her child to support, condemning both of them. And because, ultimately, it's not my call to make, it's hers. Her body, her choice.\n\nMostly a fair point, though what i am arguing is, aborting your child is pretty bad parenting, theres is that.\n\n>I mean if you have a child who has flunked out of highschool, doesn't have good SAT scores, and your family has no money, refusing them going to college would probably be a prudent financial decision. Or rather, since once they're an adult you can't really tell them what to do anymore, you'd just let them pay of it on their own if they wanted. Sorry I don't think this comparison works at all. It's not really the same situation.\n\nWhat about the other analogy? \n\n>Huh? You don't think you need consent to abort a child? The mother gives consent. As with anything in childhood, you ask the parents. Children can't give legal consent anywhere. It's really weird that you think they can. The consent I'm talking about is the consent of the parents. As for experimenting on living children, I mean...honestly, you realize we already do this, right? We just perform experiments that aren't torture and we do it on babies that aren't planned to be killed. There's a pretty big difference between aborting a child, and keeping a child alive just to perform torturous experiments on it. If you can't see that difference then I don't know what to tell you.\n\nAsking the mother for consent to abort a child is like a forensic detective asking for the guy if he had consented to raping the girl. Is the baby you are killing, not the mother, and yeah, if you don't ask for the mothers consent before killing her baby is a crime anyway.\n\n>\nI wouldn't disagree, but the problem is you're the one forcing a child to go through an orphanage. You're the one forcing the child to be born to abusive parents that don't want it, condemning it to a difficult life in shitty orphanages and if they're lucky they get a good family. If they're statistically average they get a shit family.\n\nYou are confusing stuff, forcing something is interrupting it's natural course, you are forcing an abortion. A childbirth, you are just letting it happen, semi valid point either way.\n\nI'll have to cut my answer short, battery is running out.", "is_submitter": false, "distinguished": null, "created_utc": 1629668905.0, "parent_id": "t1_h9yhe8i", "replies": [{"author": "DDumpTruckK", "id": "h9ym7m0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">Prisioner do be kinda parasitic though, tax money pays for jails not the tooth fairy.\n\nI mean, do you recognize the difference between an economical, largely metaphorical parasitic relationship and literal and physical parasitic relationship?  Or are those the same to you?\n\n>Mostly a fair point, though what i am arguing is, aborting your child is pretty bad parenting, theres is that.\n\nI would disagree.  Let's pretend we can see into the future for a child that would be born into a family that isn't ready for it financially or psychologically.  In the future we see drugs, strife, suffering, trauma, depression and eventually suicide.  Is it still bad parenting to abort this child?  Versus, let's say we can see the future for another potential child from the same family, but the only change with this child is it came at a time where the family was ready for it, wanted it, and prepared to face the challenges of responsibly raising a child.  Wouldn't it be better that they abort the child they're not ready for, so they can give the next child that they are ready for a hugely better shot at having a healthy life?\n\nNow obviously the issue is we don't have crystal clear foresight, but to just blanket statement all abortions as bad parenting just doesn't cut it for me.\n\n>What about the other analogy?\n\nThe sports team one? Same issue.  It's not analogous at all.  We're talking about a situation in which one being is physically dependent, parasitically, on another person, and you're trying to compare it to telling your child they can't do sports.  It's not even close to the same ball park.\n\n>Asking the mother for consent to abort a child is like a forensic detective asking for the guy if he had consented to raping the girl.\n\nUh.  I mean it's not like that at all.  Does it bother you that your position is pretty significantly outside of reality?  We ask parents to give consent for their children *all the time.*  Children don't give consent.  That's just a fact.\n\n>Is the baby you are killing, not the mother, and yeah, if you don't ask for the mothers consent before killing her baby is a crime anyway.\n\nDo you think there are medical abortions that are going on without the consent of the mother?  Where are you going with this?\n\n>You are confusing stuff, forcing something is interrupting it's natural course, you are forcing an abortion.\n\nNo...MY position is to let the woman decide.  There is no force from ME.  You might argue there is force from the mother, but that's HER call, not mine.  I'm just supporting her option of doing such.  YOUR position is to FORCE her to bring the child to term, no options.  She MUST deliver the child under your position.  If your position didn't exist, then there would be no child.  You are forcing it.", "is_submitter": true, "distinguished": null, "created_utc": 1629670189.0, "parent_id": "t1_h9yjddf", "replies": [{"author": "UptightBean", "id": "ha0ur0p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #122", "submission": "p8v9gt", "stickied": false, "body": "You avoid the point so flawlesly, how do people ever even have conversations with you?", "is_submitter": false, "distinguished": null, "created_utc": 1629720725.0, "parent_id": "t1_h9ym7m0", "replies": [{"author": "DDumpTruckK", "id": "ha1i0t3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "First by accurately and clearly staing my position instead of contributing uselessly by saying things that  effectively translate to: not uh.", "is_submitter": true, "distinguished": null, "created_utc": 1629731927.0, "parent_id": "t1_ha0ur0p", "replies": []}]}]}]}]}]}]}]}, {"author": "Tenacious-Tea", "id": "ha4hr3e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "p8v9gt", "stickied": false, "body": "If someone is going to be pro-life they should be willing to adopt any women’s baby that they are telling to not have an abortion.", "is_submitter": false, "distinguished": null, "created_utc": 1629779367.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "obiwanlenobi", "id": "haqrllj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "p8v9gt", "stickied": false, "body": "It's very interesting to see your view, as I come from a mostly conservative state where pretty much everyone is pro-life, so hopefully I can learn something from a different view. But what I find really interesting is that people on the pro-life side think the same thing about people on the pro-choice; this is often true for many different views, and that they accuse each other of having the same problems. I personally don't really have a view on this issue, as I've heard good and bad arguments coming from both sides, plus, I don't really have anything to add to the discussion. Thank you for sharing your perspective.\n\nEdit: A good example of my point that all sides of an argument accuse each other of the same things would be how republicans and democrats alike both seem to consider themselves to be the reasonable, and often more intelligent side.", "is_submitter": false, "distinguished": null, "created_utc": 1630194443.0, "parent_id": "t3_p8v9gt", "replies": []}, {"author": "YLASRO", "id": "h9t90ic", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p8v9gt", "stickied": false, "body": "Thats because its an unempathetic position that masks a desire to force women to be babyfactorys as a false moral position to be more palletable", "is_submitter": false, "distinguished": null, "created_utc": 1629567871.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "Prior_Technology_868", "id": "h9thq5n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p8v9gt", "stickied": false, "body": "Or, maybe they just dont like the idea of an unborn baby being killed? Is it that hard to understand this or are you trying to make it sound like they’re the bad guy?\n\nIts pretty fricken obvious that their main priority is to stop abortion, or widespread infant murder as they see it, first, then deal with the welfare of the baby and mother’s livelihood second.", "is_submitter": false, "distinguished": null, "created_utc": 1629571815.0, "parent_id": "t1_h9t90ic", "replies": [{"author": "YLASRO", "id": "h9tix9x", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p8v9gt", "stickied": false, "body": "the idea that what gets killed in most abortions is a baby is plain lies or plain failure to understand medicine. abortionopponents love to not actually apply usefull parameters of when its bad to abort. a good example of this is heartbeat bills. \n\na heartbeat means nothing. a rudimentary heart is one of the first structures that ever forms. far before the brain wich would be a much better waypoint. they dont care about when it makes sense to set the point. \n\nif they got their will it would be from conception because they have 0 interrest in science as a basis for good lawmaking. \n\nthe point where most people would call it an infant is 3rd trimerster abortions. and third trimester is a TINY minority of actual abortions and tend to only be performed in emergencys. most people dont wait till the thrid trimester to get an abortion. most abortions happen in the early weeks and months after detection when there isnt a brain or nervoussystem yet.", "is_submitter": false, "distinguished": null, "created_utc": 1629572374.0, "parent_id": "t1_h9thq5n", "replies": [{"author": "Prior_Technology_868", "id": "h9tjf1h", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p8v9gt", "stickied": false, "body": "Look, i dont personally give a shit, let the degenerates kill their children. If they’re not reproducing then im happy. Thats where i stand on the matter. \n\nIf you wanna argue about what babies or fetuses are alive or not, talk to an actual pro life person. They believe that unborn babies are actually alive. Im arguing for their sake because some people here most likely refuse to understand their motives.", "is_submitter": false, "distinguished": null, "created_utc": 1629572606.0, "parent_id": "t1_h9tix9x", "replies": [{"author": "YLASRO", "id": "h9tkii2", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p8v9gt", "stickied": false, "body": "i dont need to talk to \"pro life\" people about what constitutes life. talking to medical professionals makes more sense since they are a far better person to ask that question. all youd get from abortionopponent is thinlyveiled arguments for souls beeing real and making you a person from the moment of conception. so their framework of what counts towards \"human life\" is so wide that it becomes useless.\n\n**P.S.:** the fact that you use fascist buzzwords like \"degenerates\" raises some red flags. id be carefull in your choice of words unless you actually are a fascist and want others to know that.", "is_submitter": false, "distinguished": null, "created_utc": 1629573114.0, "parent_id": "t1_h9tjf1h", "replies": [{"author": "Prior_Technology_868", "id": "h9tlc9w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p8v9gt", "stickied": false, "body": "But a study showed that out of 5,500 biologists, 95% believe life begins at fertilization. I think they’re the science expert guys so I believe what they have to say about it. \n\nCitation: Jacobs, Steven, Biologists' Consensus on 'When Life Begins' (July 25, 2018). \n\nAnyway i also dont give a shit if anyone thinks im a fascist or whatever. I mean, i thought it was obvious that I’m a lot worse than the average fascist LOL. LMAO but yeah this isnt the time for that i think.", "is_submitter": false, "distinguished": null, "created_utc": 1629573499.0, "parent_id": "t1_h9tkii2", "replies": [{"author": "YLASRO", "id": "h9tqb4t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p8v9gt", "stickied": false, "body": "the definition of life used here is the baseline. if you think killing life this basic is evil then you should be upset at killing germs with dishsoap. they also qualify as life under the basic definition.\n\nthe relevant thing is when it becomes a human life. and the best point to set that is when there is a brain. the scientiffic consensus is that you are bioelectric reactions in your brain. so setting the point of \"now its somewhat human\" before a brain froms is just dishonest semantics that abuse the term \"life\" as scientists tend to use it vs how average people use it. the average person is alot less speciffic about terms.", "is_submitter": false, "distinguished": null, "created_utc": 1629575809.0, "parent_id": "t1_h9tlc9w", "replies": [{"author": "Prior_Technology_868", "id": "h9trsuc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p8v9gt", "stickied": false, "body": "Well if you’re asking me, it all depends. I think the baby has no idea what the hell is going on and if the mom wants to murder it then clearly nobody is going to miss it so its as bad as killing a rodent. Except that rodent was probably going to end up a thief or gangster or something. So probably worse than a rodent? Okay that sounds a little callous. Again this is my own thoughts on it, I was previously arguing for the pro life sake. \n\nObviously i think the baby is alive and has a soul, but thats another interesting thing. Kill the unborn baby, send its soul back to the ethereal realm. Save it from the sorrowful dimension that is the Material.", "is_submitter": false, "distinguished": null, "created_utc": 1629576505.0, "parent_id": "t1_h9tqb4t", "replies": [{"author": "YLASRO", "id": "h9u4rpn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p8v9gt", "stickied": false, "body": "The soulthing can be dismissed out of hand due to souls not beeing proven but that other part is just a really depressing view of the average human life. Sheesh. Thats a dark vision of a life.", "is_submitter": false, "distinguished": null, "created_utc": 1629582509.0, "parent_id": "t1_h9trsuc", "replies": []}]}]}]}]}]}]}, {"author": "DDumpTruckK", "id": "h9tlqqz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">Is it that hard to understand this or are you trying to make it sound like they’re the bad guy?\n\nIt's hard to understand your logic that forcing a child into undeserved suffering would be a better alternative to killing it.  I'd rather not kill it if we can avoid it, but the people who want to *force* it to exist also aren't willing to *aid* its life.  Unless you're one of the rare ones willing to pay an extra tax to go to all the families you're forcing into existence.\n\n>Its pretty fricken obvious that their main priority is to stop abortion, or widespread infant murder as they see it, first, then deal with the welfare of the baby and mother’s livelihood second.\n\nYes and it's very fricken obvious that once the baby is born, they don't care any more.  So when that baby gets born into a poverty family that didn't want it full of abuse and drugs, you send that baby to a fate worse than death.  I mean we'll put suffering horses and animals out of their misery, but you won't extend the same empathy to human children?  Yes, that's a bad guy move.", "is_submitter": true, "distinguished": null, "created_utc": 1629573688.0, "parent_id": "t1_h9thq5n", "replies": [{"author": "Prior_Technology_868", "id": "h9tm6n6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p8v9gt", "stickied": false, "body": "Fair argument. If i was born into an environment where drugs, abuse, parental neglect and other immorality was omnipresent, I think I would kill myself.", "is_submitter": false, "distinguished": null, "created_utc": 1629573898.0, "parent_id": "t1_h9tlqqz", "replies": [{"author": "DDumpTruckK", "id": "h9tna7n", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">I think I would kill myself.\n\nIf you were ever sober enough to reach that point.  Of course reality would probably be so much worse.  You would grow up not knowing any better.  You would already have drug problems before you're even an adult and you'd have a lack of good role models to teach you otherwise.  Once you're a druggy yourself your just chasing that next fix.  Your never sober enough to adequately understand your position in life, and you have a much much lower chance of ever equaling the quality of life that others have.\n\nYet this is the kind of life pro-lifers want to force into the world.", "is_submitter": true, "distinguished": null, "created_utc": 1629574409.0, "parent_id": "t1_h9tm6n6", "replies": []}]}]}]}]}, {"author": "Zealousideal_Mix_629", "id": "h9to966", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p8v9gt", "stickied": false, "body": "Caring about the murder of a yet to be born baby lacks empty? 🤡", "is_submitter": false, "distinguished": null, "created_utc": 1629574858.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9tocgi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Yes when that baby is going to be born into a family that didn't want it, can't support it, and probably shouldn't be raising children in the first place.", "is_submitter": true, "distinguished": null, "created_utc": 1629574900.0, "parent_id": "t1_h9to966", "replies": [{"author": "Zealousideal_Mix_629", "id": "h9tp82j", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p8v9gt", "stickied": false, "body": "Shouldn't have done the deed if they were not ready for the consequences.", "is_submitter": false, "distinguished": null, "created_utc": 1629575305.0, "parent_id": "t1_h9tocgi", "replies": [{"author": "DDumpTruckK", "id": "h9tpb8x", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "And that right there is you not caring about the baby.  Thanks for making it easy for me.", "is_submitter": true, "distinguished": null, "created_utc": 1629575346.0, "parent_id": "t1_h9tp82j", "replies": [{"author": "PreOpTransCentaur", "id": "h9ut8p5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #221", "submission": "p8v9gt", "stickied": false, "body": "Guy just came in all \"let me prove your point.\"", "is_submitter": false, "distinguished": null, "created_utc": 1629594521.0, "parent_id": "t1_h9tpb8x", "replies": [{"author": "DDumpTruckK", "id": "h9ute8i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "I know right?  I didn't even have to set him up to look like an unempathetic monster, he did it all by himself!", "is_submitter": true, "distinguished": null, "created_utc": 1629594597.0, "parent_id": "t1_h9ut8p5", "replies": []}]}]}]}, {"author": "floofandmemes", "id": "h9v9wp7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "It's the idea that being dead is worse than being poor. Not that hard to grasp tbh.", "is_submitter": false, "distinguished": null, "created_utc": 1629602858.0, "parent_id": "t1_h9tocgi", "replies": [{"author": "DDumpTruckK", "id": "h9vd935", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Except 1.) it's a lot more than just being poor that you're totally ignoring and 2.) I would argue being dead might not be worse than the fate of a child of a crackwhore rape victim who dies from OD 2 years later.\n\nAs far as number one is concerned you're overlooking nearly every single aspect about poverty.  The fact that they're in a bad neighborhood.  The fact that they will be predisposed to drugs earlier and with more pressure.  The fact that they won't have a good parental role model to help them.  The fact that they won't have availability to good schools and probably won't have availability to a college education (which is becoming more and more mandatory every year).  It's the fact that they'll be in a home with parents that didn't want them and might actually resent them.  It's the fact that regardless of the parental relationship, a druggy mom isn't going to be an effective mom.  This is the worst possible place to start a family, let alone *force one to exist without support or special care.*\n\nIf you were wondering, your position is exactly what someone who doesn't give any fucks about the child they're bringing into this world would hold.  Unless you want to admit your ignorance of the reality of what being poor means.", "is_submitter": true, "distinguished": null, "created_utc": 1629604655.0, "parent_id": "t1_h9v9wp7", "replies": [{"author": "floofandmemes", "id": "h9vec68", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "Sorry that you're exaggerating the circumstances of most people who get abortions and letting your emotions control all your thought through exceptional cases that barely ever match up to reality.\n\nI've already stated that we need better welfare, but noooooooo apparently thinking that *not giving some a chance at life is being completely uncaring.*\n\nAs I've said before, you're far too narrow-minded, especially in your pessimistic views on life.", "is_submitter": false, "distinguished": null, "created_utc": 1629605236.0, "parent_id": "t1_h9vd935", "replies": [{"author": "DDumpTruckK", "id": "h9veilh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">Sorry that you're exaggerating the circumstances of most people who get abortions\n\nWhen exactly did I suggest that the case I listed is all circumstances?  I didn't.  Put your strawman away, no one wants to see it.  Come back when you can actually comprehend my position.", "is_submitter": true, "distinguished": null, "created_utc": 1629605332.0, "parent_id": "t1_h9vec68", "replies": [{"author": "floofandmemes", "id": "h9vg243", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "I get your position. I've seen it before. You make up an exceptional circumstance to tug at people's heartstrings, like nearly all positions. You believe a life that includes hardships is not one worth living. You probably have a disdain for your own life, and so cannot understand the idea of giving someone a chance at life even if it might not start off well. You believe that women have the right to choose whether to destroy a life they willingly helped create simply because in your mind the baby isn't a human life and is thus a null factor.\n\nSo far you've only parroted the propaganda of every other pro-choice person I've seen, it's hardly difficult to understand.", "is_submitter": false, "distinguished": null, "created_utc": 1629606194.0, "parent_id": "t1_h9veilh", "replies": [{"author": "DDumpTruckK", "id": "h9vh9mx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">I get your position. I've seen it before. You make up an exceptional circumstance to tug at people's heartstrings, like nearly all positions.\n\nIt's like you've never had a conversation before.  I brought up the argument that most strongly supports my position.  If you want I can argue the whole spectrum and how obviously the less problems we pile on the less life-changing having a child would be, but it'd be straight daft for me to start with the weakest argument and build up from there.\n\n>You believe a life that includes hardships is not one worth living. \n\nI didn't say that and at this point, you're either massively ignorant to be unable to figure that out, or you're malicious.  You pick which one.\n\n>You probably have a disdain for your own life, and so cannot understand the idea of giving someone a chance at life even if it might not start off well.\n\nMaking *lots* of assumptions here to try and justify your opinion of me.  Comes across as pretty tribal if you ask me.  Desperate to paint me as something I'm not.  Did you notice how I made literally *no* assumptions about *you*?  Isn't that strange...\n\n>You believe that women have the right to choose whether to destroy a life they willingly helped create simply because in your mind the baby isn't a human life and is thus a null factor.\n\nAgain, no where did I say the baby isn't a human life.  More projected tribalism.  You're just going down the check boxes of talking points like an NPC now aren't you?  It doesn't even matter if they're relevant.  Sheesh.\n\n>So far you've only parroted the propaganda of every other pro-choice person I've seen, it's hardly difficult to understand.\n\nI'm cringing at the projection here.  There's *demonstrably* people on my side who disagree with me.  They're in *this thread.*  Yet your the one pulling out all the strawmen talking points that *I don't hold* and then accusing me of holding all those generic talking points XD.", "is_submitter": true, "distinguished": null, "created_utc": 1629606902.0, "parent_id": "t1_h9vg243", "replies": [{"author": "floofandmemes", "id": "h9vhf8y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "Tbh I was giving you the benefit of the doubt, if you believe that abortions take a human life that makes it worse.", "is_submitter": false, "distinguished": null, "created_utc": 1629606993.0, "parent_id": "t1_h9vh9mx", "replies": [{"author": "DDumpTruckK", "id": "h9vhu2m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">Tbh I was giving you the benefit of the doubt\n\nAdmission that you know nothing of my position, yet assume that you do.  Thank you.", "is_submitter": true, "distinguished": null, "created_utc": 1629607242.0, "parent_id": "t1_h9vhf8y", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "vanillaandzombie", "id": "h9uav98", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #154", "submission": "p8v9gt", "stickied": false, "body": "Anti abortion political positions are born from a desire to implement dogmatic moral positions in law. \n\nAny appeal to empathy to justify those positions is, at best, disingenuous.", "is_submitter": false, "distinguished": null, "created_utc": 1629585419.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9ubye5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">Anti abortion political positions are born from a desire to implement dogmatic moral positions in law.\n\nI'm sorry, but what?  Pro-choice is literally the opposite of that.  It's people defending the rights of bodily autonomy.  Rights that we currently already have.  Pro choice positions are trying to keep the laws we have now.  It's the pro-life position that wants to change the law.  What country do you live in that your world view is this backwards?\n\nEdit: Anti-abortion is a confusing term.  Complete misinterpretation here.", "is_submitter": true, "distinguished": null, "created_utc": 1629585947.0, "parent_id": "t1_h9uav98", "replies": [{"author": "vanillaandzombie", "id": "h9ueddq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #154", "submission": "p8v9gt", "stickied": false, "body": "So you think abortions should not be allowed or only allowed in very little circumstances?\n\nI mean that’s fine you do you. \n\nI’d rather that women have access to medical procedures without moral judgement. \n\nThere’s not much point in having arguments about this stuff online because the format lacks the “in person ness” that drives a lot of the formation of world view. \n\nWhat is more interesting is the motivation of anti-abortion politics and I’m very happy to have a conversation about that. Though I don’t know much. \n\nI’m not interested in angry yelling or judgements about backwardness.", "is_submitter": false, "distinguished": null, "created_utc": 1629587153.0, "parent_id": "t1_h9ubye5", "replies": [{"author": "DDumpTruckK", "id": "h9ueq4u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "Sorry, I misread what you were saying initially.  You threw me by referring to it as anti-abortion.", "is_submitter": true, "distinguished": null, "created_utc": 1629587331.0, "parent_id": "t1_h9ueddq", "replies": [{"author": "vanillaandzombie", "id": "h9v45d4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #154", "submission": "p8v9gt", "stickied": false, "body": "No worries. I did wonder if that was the case. \n\nI suggest not using their language to describe them. It just gives their messaging another opportunity. \n\nRegardless of my actual opinion. I think there is little point in an emotive argument online. The “other side” presents arguments based on emotional response (e.g. “pro-life”). Why use their techniques? I think doing so legitimatises opinions based on emotion.", "is_submitter": false, "distinguished": null, "created_utc": 1629599869.0, "parent_id": "t1_h9ueq4u", "replies": [{"author": "DDumpTruckK", "id": "h9v73s7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": ">I suggest not using their language to describe them. It just gives their messaging another opportunity.\n\nYeah I understand where you're coming from.  Calling it pro-life refocuses the argument to the red herring of 'It's a human life' instead of 'I want to remove bodily autonomy from people.'  I just try to approach a position without antagonizing them.  A wolf in sheep's clothing if you will.\n\n> I think there is little point in an emotive argument online.\n\nHere we actually disagree.  I think there's plenty of benefits to having this discussion online.  Firstly and foremost, I'm fucking *sick* of living in a country (the US) where certain topics (a lot actually) are just considered taboo and that everyone is entitled to hold their positions without ever having to justify them, even if only socially.  If you're not willing to have a conversation about a strongly held position then you should not hold that position.  Yet in America almost any political disagreement is considered 'off limits'.  But what that means in reality is people will vote and hold positions that affect other people while never being challenged on it and always feeling uncomfortable to talk about it.  I want people to get the fuck over their stupid fear of having a public disagreement.  I take this culture of 'non-politics' incredibly seriously.\n\nAnother benefit in this abortion context specifically  is it exposes the positions for what they are.  People on the fence or people who are only slightly on my side might come along and see [this](https://www.reddit.com/r/TheFlyingTree/comments/p8v9gt/the_prolife_position_almost_always_comes_across/h9to966?utm_source=share&utm_medium=web2x&context=3) comment chain and recognize the position for what it is.\n\nYet another benefit is some of my arguments may be convincing and they may be arguments that others haven't heard before, or heard put that way.  The more people using better arguments the better the word spreads.\n\n>Why use their techniques? I think doing so legitimatises opinions based on emotion.\n\nWell because it's the emotional appeal that worked on them in the first place.  I can't rationalize a person out of a position that they didn't rationalize themselves into.  Yet if they have strong emotions about babies dying, maybe I can appeal to their sense of strong emotions about babies suffering (if they have any).", "is_submitter": true, "distinguished": null, "created_utc": 1629601399.0, "parent_id": "t1_h9v45d4", "replies": [{"author": "vanillaandzombie", "id": "h9v8iqb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #154", "submission": "p8v9gt", "stickied": false, "body": "I love your optimism.", "is_submitter": false, "distinguished": null, "created_utc": 1629602136.0, "parent_id": "t1_h9v73s7", "replies": []}]}]}]}]}]}]}, {"author": "FreyjaSunshine", "id": "h9uo07k", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "p8v9gt", "stickied": false, "body": "It's not about babies, it's about controlling women by controlling their reproductive rights.  \n\nIf they were *truly* interested in babies, then preventing unwanted pregnancies would be a priority, but the forced birthers are against that, too.  \n\nThey also get abortions/have their women get abortions because their morality applies to others, not them.", "is_submitter": false, "distinguished": null, "created_utc": 1629591927.0, "parent_id": "t3_p8v9gt", "replies": [{"author": "DDumpTruckK", "id": "h9urek3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p8v9gt", "stickied": false, "body": "At the top level down sure, it probably is about controlling women, but I think there's plenty of people out there who hold a pro-life position and don't view it as controlling women.\n\nI don't necessarily disagree with anything you've said, but I think we can undermine the efforts of rich white men who are afraid of change by just pointing out the position for what it is: a shitty, unempathetic position that doesn't even for a second consider the future of the child they're forcing into the world.", "is_submitter": true, "distinguished": null, "created_utc": 1629593616.0, "parent_id": "t1_h9uo07k", "replies": [{"author": "FreyjaSunshine", "id": "h9uukh6", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "p8v9gt", "stickied": false, "body": "[I totally agree with you](https://m.media-amazon.com/images/I/71MjXW83NSL._AC_SL1500_.jpg)", "is_submitter": false, "distinguished": null, "created_utc": 1629595186.0, "parent_id": "t1_h9urek3", "replies": []}]}, {"author": "floofandmemes", "id": "h9v9swz", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "If you thought about that statement you just made for like 2 seconds you'd realize it makes no sense.", "is_submitter": false, "distinguished": null, "created_utc": 1629602804.0, "parent_id": "t1_h9uo07k", "replies": [{"author": "FreyjaSunshine", "id": "h9vt7ov", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "p8v9gt", "stickied": false, "body": "It makes perfect sense.  What don't you understand?", "is_submitter": false, "distinguished": null, "created_utc": 1629615139.0, "parent_id": "t1_h9v9swz", "replies": [{"author": "floofandmemes", "id": "h9wj18i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p8v9gt", "stickied": false, "body": "Clearly you didn't think about it. Seriously, there's no gap in the sexes on opinions on abortion, men and women are equally likely to be for or against it. \n\nFurthermore, there's literally no gain to be made from telling people to not kill their babies.\n\n\"It's about controlling women\" is nothing but a conspiracy theory.", "is_submitter": false, "distinguished": null, "created_utc": 1629636137.0, "parent_id": "t1_h9vt7ov", "replies": [{"author": "FreyjaSunshine", "id": "h9zpqn6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "p8v9gt", "stickied": false, "body": "We will have to disagree, then.", "is_submitter": false, "distinguished": null, "created_utc": 1629689863.0, "parent_id": "t1_h9wj18i", "replies": []}]}]}]}]}]}