{"title": "Does the phrase 'Western Culture' mean anything to you?", "name": "t3_on8mn1", "url": "https://www.reddit.com/r/TheFlyingTree/comments/on8mn1/does_the_phrase_western_culture_mean_anything_to/", "selftext": "Some people seem very eager to categorize something about 'the West' as something somehow different from anything else.  What is 'the West' to you?  Does categorizing 'the West' have any value to you?", "score": 7, "upvote_ratio": 0.9, "permalink": "/r/TheFlyingTree/comments/on8mn1/does_the_phrase_western_culture_mean_anything_to/", "id": "on8mn1", "author": "DDumpTruckK", "link_flair_text": "Discussion", "num_comments": 120, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1626676990.0, "comments": [{"author": "MisanthropicScott", "id": "h5q5a31", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "on8mn1", "stickied": false, "body": "Yes, but it varies by context. \"The West\" could mean most of Europe and all of North America and possibly South and Central Americas as well. The West, from the eastern United States generally means the west coast.\n\n\"Western Culture\" to me generally means the secularism of most of Europe and North America.\n\nI'm not sure what else it might mean depending on context. I don't actually hear the term all that often these days. When I do, it's generally in contrast to less secular and open societies.\n\nI'm curious how others will respond.", "is_submitter": false, "distinguished": null, "created_utc": 1626677447.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5q770f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">Yes, but it varies by context. \"The West\" could mean most of Europe and all of North America and possibly South and Central Americas as well. The West, from the eastern United States generally means the west coast.\n\nWell, and I guess I wasn't clear, Cardinal Directions aren't really the kind of answer I'm looking for.  I know what 'the west' is in comparison to 'the north, the south, and the east.'\n\n>\"Western Culture\" to me generally means the secularism of most of Europe and North America.\n\nThat's interesting, because Jordan Peterson (hopefully you've never heard of him) would argue that Christianity is some kind of defining feature of 'the West'.", "is_submitter": true, "distinguished": null, "created_utc": 1626679070.0, "parent_id": "t1_h5q5a31", "replies": [{"author": "MisanthropicScott", "id": "h5q8k89", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "on8mn1", "stickied": false, "body": ">> Yes, but it varies by context. \"The West\" could mean most of Europe and all of North America and possibly South and Central Americas as well. The West, from the eastern United States generally means the west coast.\n\n> Well, and I guess I wasn't clear, Cardinal Directions aren't really the kind of answer I'm looking for. I know what 'the west' is in comparison to 'the north, the south, and the east.'\n\nI didn't intend it to mean the cardinal direction, which is why I first noted that it generally included most of Europe which is an ocean to the east of me personally.\n\nBut, in the U.S. we do also use the phrase \"the west\" to mean the cardinal direction. So, it depends on context. If I'm going out west, it probably means the west coast. If I'm skiing out west, it probably means Colorado or Utah.\n\nThe point is that context matters. Sometimes \"the west\" does just mean the cardinal direction. Sometimes it doesn't. In the phrase \"western culture\", it never means the direction.\n\n>> \"Western Culture\" to me generally means the secularism of most of Europe and North America.\n\n> That's interesting, because Jordan Peterson (hopefully you've never heard of him) would argue that Christianity is some kind of defining feature of 'the West'.\n\nI've heard of him but know next to nothing about him and don't want to know more from the sound of this.\n\nI'm not sure how Canadians would feel about that. Nor do I know how Europe would feel about that. I know large swaths of the U.S. would agree and large swaths would disagree. I would strongly disagree.\n\nThe U.S. has been increasingly forgetting that we actually have the proud distinction of being the very first constitutionally secular country in the world. Many of our founders were Deist. Sorry Christians, Deism is not a form of Christianity. Jefferson in particular actively hated Christianity but was still secular and believed in Christians' rights to practice their religion in their own way.\n\nThe famous [\"wall of separation\" letter](https://loc.gov/loc/lcib/9806/danpre.html) was actually written by Jefferson (not a Christian) to the Danbury Baptists (Christians) to assure them that they would be free to practice Christianity in their own way ... *free of the influence of other Christians!*\n\nThe letter was intended to protect Christians from Christians and today's Christians want to tear down that wall (and largely have already done so to significant degrees).", "is_submitter": false, "distinguished": null, "created_utc": 1626680275.0, "parent_id": "t1_h5q770f", "replies": [{"author": "DDumpTruckK", "id": "h5q8wsp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">I've heard of him but know next to nothing about him and don't want to know more from the sound of this.\n\nIt's definitely nicer being ignorant of ol' JP, at least up and until the point someone you care about says something really stupid that they heard Peterson say.\n\nYou know it's funny how that all works out.  You definitely are stating a fact that we're the first constitutionally secular state.  Yet it's almost as if some significant portion of this nation didn't get the memo.  I could probably pretty easily wrangle up a big crowd of people who claim the US is a Christian nation XD.  Ironically, those people are usually the one trying to use the phrase \"Western Culture\" the most.", "is_submitter": true, "distinguished": null, "created_utc": 1626680586.0, "parent_id": "t1_h5q8k89", "replies": []}]}, {"author": "Cregaleus", "id": "h5qz4fp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "on8mn1", "stickied": false, "body": "Jordan Peterson is a hack and a sell-out. He's just smart enough to convince lay-people to buy his books. Please, I beg, don't take him seriously.\n\n\"The West\" is a reference to the western world, or the culture that has arisen from the western intellectual tradition. The core of western culture comes from ancient Greece where some unique geographic and political circumstances made for fertile soil for western philosophy to emerge.\n\nAs far as I'm concerned western civilization starts with Plato/Socrates (not going to get into distinguishing the two). \nMost people know enough to credit Greece with giving the western world Democracy, but Greece is also where a lot of our notions of egalitarianism come from.\n\nA lot of people, Peterson included, like to credit Christianity for the western egalitarianism. The reasons for this range from not knowing anything about classical history to wanting to sell more books to more Christians. For the most part, early Christianity borrowed ~~a lot~~ **all** of its ethics from the Greek world, which makes perfect sense if you know the history of the period. Christianity, however, refined Greek ethics and adapted it for the common man. It took Greek egalitarianism, raised it to new heights, and spread it all over the place.\n\nAnother hallmark of western civilization is intellectual absolutism, as opposition to relativism. Edgy teens these days, and in all days past, have thought that they're clever and modern by saying things like \"everything is relative, so nothing can be known for certain\". You can make such an argument, but if you sit down and think about it for a while you'll find that this sort of epistemology gives a very non-western view of the world. For example, if everything is relative, then there can be no such thing as injustice, at least in its own stand-alone abstract sense not bound up with the will of an emperor,\n\nAnother hallmark of the west is science as we know it. You can argue that science isn't uniquely western, but you'd only be partially correct and it'd be the lesser part. Yes I know very well the technological advancements of ancient Egypt and China. They are impressive, important, and foundational in their own right. Natural Philosophy (what *science* was called before someone came up with the word) gives more than some useful technologies for solving our current problems, it gives a method, the scientific method, as a means of discovering more *absolute* (sorry for the dirty word) truths about the natural world.\n\nTL;DR:\nThe West is characterized by egalitarian ideals which have informed not only our political lives but our social lives and sense of identity; a level of absolutism that allows us to say things like \"theft is wrong\" and \"there should be things called 'laws' which have authority in their own right, and also \"true things are true independent of authority\"; and the scientific method, which if you know anything about science you'll know is more than just a convenient way of conducting a scientific test.", "is_submitter": false, "distinguished": null, "created_utc": 1626700556.0, "parent_id": "t1_h5q770f", "replies": [{"author": "DDumpTruckK", "id": "h5s4njr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">TL;DR: The West is characterized by egalitarian ideals which have informed not only our political lives but our social lives and sense of identity; a level of absolutism that allows us to say things like \"theft is wrong\" and \"there should be things called 'laws' which have authority in their own right, and also \"true things are true independent of authority\"; and the scientific method, which if you know anything about science you'll know is more than just a convenient way of conducting a scientific test.\n\nBut aren't you describing most if not all of the first world here?", "is_submitter": true, "distinguished": null, "created_utc": 1626719021.0, "parent_id": "t1_h5qz4fp", "replies": [{"author": "Cregaleus", "id": "h5s9chu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "on8mn1", "stickied": false, "body": "Yes, and the reason for this is simple: this western tradition has been enormously influential. Don't fall into the trap of believing that western means American or European. For example, while in the middle-east there are a lot of eastern cultural elements, Islam is undeniably western and is often included within western history books and excluded entirely from eastern.", "is_submitter": false, "distinguished": null, "created_utc": 1626721020.0, "parent_id": "t1_h5s4njr", "replies": [{"author": "DDumpTruckK", "id": "h5s9m5r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Why are we calling it western then?  It's really putting across a kind of special ignorance to pretend like something that happens around the globe would be 'western'.", "is_submitter": true, "distinguished": null, "created_utc": 1626721134.0, "parent_id": "t1_h5s9chu", "replies": [{"author": "Cregaleus", "id": "h5svtz3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "on8mn1", "stickied": false, "body": "You asked \"does 'Western Culture' mean anything to you?\" and the answer is that it does. We can study its progression, say this and that happened; whatever, it is a describable body of knowledge that has largely shaped how you and I understand the world, our very epistemologies.\n\nFor the most part it isn't terribly important for lay-people to think in terms of \"this type of thinking, or school of thought, comes from whatever/whoever/whenever/where-ever\". Even if it is very important for this to be the case, we're far from being able to convincing lay-people to treat it as such. It takes all we've got to get the general public to study enough to accomplish a rudimentary understanding of the world as they find it, nevertheless try and understand how we got here and how it might evolve further.\n\nAs you suggested, if something becomes completely ubiquitous, what value is there in distinguishing a thing? There are insights to be had in studying how this thing called \"western civilization\" has changed over time. We know it isn't completely ubiquitous because we still call it \"Western civilization\" and not just \"civilization\", and we can draw somewhat clear lines between the progression of one and the other to its current state.\n\nPeople tend to get impassioned when talking about the meeting of western and eastern civilization, as if one might win out over the other. We already know what'll happen, they'll both die and their deaths will be greatly exaggerated. What tends to happen with any sort of body of knowledge in the face of new challenges, information, criticisms, changing dynamics, whathaveyou, is that the parts that work break free of the context of the model within-which they're first conceptualized and informs a broader scope understanding. We've watched this happen with all sorts of models of knowledge, for example evolution - I pity anyone who thinks that all there is to evolutionary theory stops with biology.\n\nIt happens quite naturally with philosophy itself. You might have heard philosophers gleefully report that philosophy is dying/dead; well, that means philosophy is doing something right. It used to be that classifying animals and fauna, measuring the stars, right from wrong, knowing how we know, all used to be philosophy until philosophers refined these bodies of knowledge far enough such that they could stand independently as their own models. The same will happen with human culture. It will become such that it is no-longer useful to describe egalitarianism within the context of western civilization, perhaps as you suggest we are already there. But if you ask about \"Western Culture\", then the historical importance of recognizing the context from which these now disparate things arose.\n\nThe reason we have quantum mechanics, and not just \"mechanics\" is because the model isn't universal. And when we have a \"universal mechanics\" or a \"unified theory\" as they call it, quantum mechanics and Newtonian physics will both be \"dead\", yet we know that whatever the universal model ends up being it will at least partially be composed of, or predict, the features of both of these distinct models.\n\nEdit:\nI'll try and make a clarifying point and say that my use of the term model is such that theories, mathematical equations, bodies-of-knowledge such as biology, Newtonian physics, Ford F150s, Beethoven's 5th, are all sorts of models. When I start talking philosophy of science it does get very hand-wavy, but that's because I'm trying to highlight general and abstract trends that can be found between otherwise dissimilar concepts.", "is_submitter": false, "distinguished": null, "created_utc": 1626730790.0, "parent_id": "t1_h5s9m5r", "replies": [{"author": "DDumpTruckK", "id": "h5syq5i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">We can study its progression\n\nEhm....are you sure about that?  It's a pretty vague term and I just can't imagine any of my old professors using it in class.  You haven't even been able to define it in a way that doesn't also include the whole world.  So why does 'western culture' mean 'global culture'.  Are you trying to imply something about the west as different from the rest?  Because everything you listed is not a difference between the west and the world, its a similarity.\n\n>There are insights to be had in studying how this thing called \"western civilization\" has changed over time\n\nSee, you're missing my point.  You say the phrase 'western civilization' but when you talk about it, you end up talking about the world.  Why?  What specifically are you referring to when you use the phrase 'western civilization' because I can't figure out what you're on about.\n\n>We know it isn't completely ubiquitous because we still call it \"Western civilization\"\n\nOh don't make me point out that just because people use certain words a certain way that that doesn't mean those words have some kind of truth behind them.  People still think race is a real thing and that's been scientifically debunked since like...2001 when we decoded the human genome.  Are you saying just because people use the term 'race' that there actually are races?\n\n>and we can draw somewhat clear lines between the progression of one and the other to its current state.\n\nWho is 'we'?  *I* can't draw those lines, and every time I asked you to draw those lines, all you did was describe the globe to me, not 'the west'.\n\n>We already know what'll happen, they'll both die and their deaths will be greatly exaggerated.\n\nAre you referencing some sort of academic paper with these claims?  Who is this 'we'?  The only thing I recognize is that 'western culture' means nothing, that 'eastern culture' means nothing, and that the two have been one and the same, intermingling, forever.  That if these things are going to die, they'll die because people will recognize they make no sense and never existed in the first place.", "is_submitter": true, "distinguished": null, "created_utc": 1626732099.0, "parent_id": "t1_h5svtz3", "replies": [{"author": "Cregaleus", "id": "h5tsb49", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "on8mn1", "stickied": false, "body": "> Ehm....are you sure about that? It's a pretty vague term and I just can't imagine any of my old professors using it in class. You haven't even been able to define it in a way that doesn't also include the whole world. So why does 'western culture' mean 'global culture'. Are you trying to imply something about the west as different from the rest? Because everything you listed is not a difference between the west and the world, its a similarity.\n\nIts called history... Are you simple?\n\n> See, you're missing my point. You say the phrase 'western civilization' but when you talk about it, you end up talking about the world. Why? What specifically are you referring to when you use the phrase 'western civilization' because I can't figure out what you're on about.\n\nNo, I end up talking about characteristics of the western cultural tradition. I'm sorry that you are so narrow-minded such that you can't even imagine thinking a way that's different than you own.\n\n> Oh don't make me point out that just because people use certain words a certain way that that doesn't mean those words have some kind of truth behind them...\n\nI must admit that I'd like to see you try. Not that you're wrong, but I would be surprised if you knew enough linguistics to be able to come up with a strong argument to backup this claim.\n\n> People still think race is a real thing and that's been scientifically debunked since like...2001 when we decoded the human genome.\n\nWe didn't need the human genome to be decoded to know that there wasn't a such thing as race... I see what you're doing, conscious or not, and it is amateurish. I'm not interested in letting you twist the context of the conversation such that we're suddenly talking about race, with you on the winning side because in the context of racial discussions the side arguing that there is legitimate purpose for differentiation. The thing is, your argument is so poor that it is somewhat racist in its own right. As if the had the human genome project found some blatant gene that make one Asian, or black, or caucasian, green, whatever, things would have been different and our regard for one-another ought to be different.\n\n> Are you saying just because people use the term 'race' that there actually are races?\n\nReally trying hard to twist it here, aren't you?\n\n> Who is 'we'? I can't draw those lines, and every time I asked you to draw those lines, all you did was describe the globe to me, not 'the west'.\n\nI have no doubt that you can't draw those lines, and I'm frankly getting tired of trying to help you understand. How fucking close do these dots need to be for you? I'm talking about linguistics, psychology, politics, and history (of all of the above).\n\n> Are you referencing some sort of academic paper with these claims?\n\nNobody has bothered writing an academic paper arguing against your idiotic claim because nobody of repute argues in favor of it. Similarly, nobody has written academic papers critical of the theory of unicorns.\n\n> Who is this 'we'? The only thing I recognize is that 'western culture' means nothing, that 'eastern culture' means nothing, and that the two have been one and the same, intermingling, forever.\n\nThe only reason you're able to believe this is because you don't know shit about either subject.\n\n> That if these things are going to die, they'll die because people will recognize they make no sense and never existed in the first place.\n\nWell, finally you made a coherent point, if only accidentally. I thought you were going to leave me utterly disappointed. I can tell that you don't understand how this doesn't defeat my argument, and you seem to be the sort of person that will never understand cognitive science well enough to understand.\n\nI regret to say that I interpreted your questioning to be an openness discussing the history of knowledge, but now I see you've just some agenda to assert a claim without support and then win some subsequent manufactured argument. What a waste", "is_submitter": false, "distinguished": null, "created_utc": 1626746540.0, "parent_id": "t1_h5syq5i", "replies": [{"author": "DDumpTruckK", "id": "h5ttf42", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">Its called history... Are you simple?\n\nHistory doesn't study the rise of western culture.  I have a degree in history by the way.\n\n>No, I end up talking about characteristics of the western cultural tradition.\n\nAll those characteristics apply to things that you wouldn't consider 'western'.  So you've lost your grip on the word 'western' when you can no longer differentiate it between anything else.\n\n>I must admit that I'd like to see you try. Not that you're wrong, but I would be surprised if you knew enough linguistics to be able to come up with a strong argument to backup this claim.\n\nLol.  I already did.  People constantly refer to 'race' as if its real.  By your flawed line of reasoning, that means race is real, except it's not which is why your reasoning makes no sense.\n\n>I have no doubt that you can't draw those lines\n\nYeah but *you* haven't drawn those lines either.  You've circled the earth and said \"There, see?  Western culture.\"\n\n>Nobody has bothered writing an academic paper arguing against your idiotic claim because nobody of repute argues in favor of it.\n\nI see you've failed to recognize *your* the one claiming western culture is a thing. *I'm* rejecting *your* claim.  The burden of proof is on you.\n\n>but now I see you've just some agenda to assert a claim without support and then win some subsequent manufactured argument.\n\nComing from the guy who claims 'western culture' is a thing, but can't describe it, explain it, or cite any sources about it.", "is_submitter": true, "distinguished": null, "created_utc": 1626747117.0, "parent_id": "t1_h5tsb49", "replies": []}]}]}]}]}]}]}]}]}, {"author": "NoSuchKotH", "id": "h5qg2nn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "on8mn1", "stickied": false, "body": ">\"Western Culture\" to me generally means the secularism of most of Europe and North America.\n\nI laughed at this remark. The US is probably the least secular \"western\" society, yet it sees itself as the cradle of freedom and democracy. Heck, it's even less secular than Turkey, where Erdowahn tries to create a second Iran.", "is_submitter": false, "distinguished": null, "created_utc": 1626686992.0, "parent_id": "t1_h5q5a31", "replies": [{"author": "MisanthropicScott", "id": "h5r37t9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "on8mn1", "stickied": false, "body": "> The US is probably the least secular \"western\" society\n\nAlmost certainly!\n\nI'm not sure I agree about Turkey. I probably don't know enough to compare them to the U.S. They're literally borderline western by the standards of \"western culture\" and \"the west\". I think the physical line goes through Istanbul. It's where east meets west.\n\nBut, the Christian Wrong have been subverting our secular government and later our democracy (which it really technically isn't anyway) since at least the McCarthy era.\n\n> yet it sees itself as the cradle of freedom and democracy.\n\nWe have a pretty overinflated national ego. We also see ourselves as having once been great, which is actually a common theme for humanity in general, the myth of a golden age.\n\nBut, good luck picking a time when the U.S. was actually great. The MAGA people are probably thinking about the 1950s (with the Jim Crow laws)  when we were able to manufacture stuff because the rest of the world had been bombed into oblivion. But, there was never a time when the U.S. did not have some pretty fucking systemic problems.", "is_submitter": false, "distinguished": null, "created_utc": 1626702655.0, "parent_id": "t1_h5qg2nn", "replies": [{"author": "NoSuchKotH", "id": "h5re329", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "on8mn1", "stickied": false, "body": ">I'm not sure I agree about Turkey. I probably don't know enough to compare them to the U.S. They're literally borderline western by the standards of \"western culture\" and \"the west\". I think the physical line goes through Istanbul. It's where east meets west.\n\nTurkey used to be pretty \"western\" back in the 80s and 90s. To the point that skirts were shorter in Turkey than they were in Germany or France. But everything changed when the Fire Nation... err... The islamic conservatives attacked.. Today, while still maintaining an air of democracy, Turkey is probably closer to how Iran works, than it is to Turkey 30 years ago.\n\nBut, Turkey still does not start its [parliamentary hearings with a prayer](https://youtu.be/Agl3wOo8xak?t=69). That would not fly. It would lead to riots. Heck, I don't know of any other country that does that and was quite shocked, when I first saw this.\n\n&#x200B;\n\n>We have a pretty overinflated national ego. We also see ourselves as having once been great, which is actually a common theme for humanity in general, the myth of a golden age.\n\nThis is indeed true. Though, I have to admit, it is far less prevalent in Europe than in the US or UK. Interestingly, it even exists in Japan to some extend, though everyone I spoke to agrees that pre-WW2 Japan was a pretty shitty place to live in. Though instead of going for a specific time, these people who cling to the past allude to some mythical time in the past when Japan was the center of the world.\n\n&#x200B;\n\n>But, good luck picking a time when the U.S. was actually great. The MAGA people are probably thinking about the 1950s (with the Jim Crow laws)  when we were able to manufacture stuff because the rest of the world had been bombed into oblivion. But, there was never a time when the U.S. did not have some pretty fucking systemic problems.\n\nYeah... People tend to also get pretty angry when I point that out. One of my pet peeves is that until about WW2, smart people in the US would go to Europe to get their PhD as all the good universities where there (and not many PhD programs even existed in the US). Yet so many people claim that all modern technology came from the US and thus English is naturally the language of science.\n\nAnother pet peeve is that the US space program was built on the backs of abducted German scientists and engineers. And it would have taken the US probably 10 maybe even 20 years longer to get to space without them. But hardly anyone even acknowledges that von Braun was German, much less that he was not the only German from the Nazi rocket and airplane development labs who \"voluntarily\" went to the US.\n\nOh... And the Apollo program used SI units to get to the moon. All calculations were done in SI and only converted to imperial when they needed to be shown to humans (and only because the test pilots were more used to imperial than metric, which might have cost them precious seconds to interpret some output in case of an emergency).", "is_submitter": false, "distinguished": null, "created_utc": 1626707654.0, "parent_id": "t1_h5r37t9", "replies": [{"author": "MisanthropicScott", "id": "h5rrd7v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "on8mn1", "stickied": false, "body": "> Turkey used to be pretty \"western\" back in the 80s and 90s. To the point that skirts were shorter in Turkey than they were in Germany or France. But everything changed when the Fire Nation... err... The islamic conservatives attacked.. Today, while still maintaining an air of democracy, Turkey is probably closer to how Iran works, than it is to Turkey 30 years ago.\n\nA lot of the world is going backwards these days both in terms of religion and in terms of human rights. I think both Turkey and the U.S. are more extreme examples. But, I think there's somewhat of a global right-shift going on.\n\n> But, Turkey still does not start its parliamentary hearings with a prayer. That would not fly. It would lead to riots. Heck, I don't know of any other country that does that and was quite shocked, when I first saw this.\n\nI'm shocked every time I see it here. Ditto for our national day of prayer. Seriously??!!? Yes.\n\nMost people in this country aren't even aware that the change of our motto from the inclusive \"E. Pluribus Unum\" to the divisive \"In God We Trust\" and the addition of \"under God\" in our pledge of allegiance are holdovers from McCarthyism as we tried to differentiate ourselves from \"the Godless Communists\".\n\nTexas writes the public school textbooks for something like 47 states that don't do their own. They've been downplaying Jefferson and even claiming that somehow Moses was one of our country's founders and that are laws are based on the Ten Commandments (only 3 of which are actually laws).\n\n>> We have a pretty overinflated national ego. We also see ourselves as having once been great, which is actually a common theme for humanity in general, the myth of a golden age.\n\n> This is indeed true. Though, I have to admit, it is far less prevalent in Europe than in the US or UK.\n\nI thought even the ancient Greeks had the concept of a mythical golden age. (google break)\n\nYup. This concept has a long history.\n\nhttps://en.wikipedia.org/wiki/Golden_Age\n\n> Interestingly, it even exists in Japan to some extend, though everyone I spoke to agrees that pre-WW2 Japan was a pretty shitty place to live in. Though instead of going for a specific time, these people who cling to the past allude to some mythical time in the past when Japan was the center of the world.\n\nThe \"center of the world\" is another interesting concept. I don't think I really have any desire to go there Joules Verne style. But, living in NYC, there is sort of a feeling here that people think NYC is the center of the world, or at least the global capital. It's kind of a funny thing. But, we do have the U.N. here. So, maybe there's a small touch of reality behind the feeling.\n\n>> But, good luck picking a time when the U.S. was actually great. The MAGA people are probably thinking about the 1950s (with the Jim Crow laws) when we were able to manufacture stuff because the rest of the world had been bombed into oblivion. But, there was never a time when the U.S. did not have some pretty fucking systemic problems.\n\n> Yeah... People tend to also get pretty angry when I point that out.\n\nI'm not surprised. I don't get good responses pointing that out either.\n\n> One of my pet peeves is that until about WW2, smart people in the US would go to Europe to get their PhD as all the good universities where there (and not many PhD programs even existed in the US).\n\nI didn't know that. I do know my great uncle went to Switzerland to become a doctor because the U.S. schools had already filled up their quota of Jews. Yup. That's still in living memory. He's in his 90s but is still alive.\n\n> Yet so many people claim that all modern technology came from the US and thus English is naturally the language of science.\n\nBecause, of course it is! This is 'Murica.\n\n> Another pet peeve is that the US space program was built on the backs of abducted German scientists and engineers. And it would have taken the US probably 10 maybe even 20 years longer to get to space without them. But hardly anyone even acknowledges that von Braun was German, much less that he was not the only German from the Nazi rocket and airplane development labs who \"voluntarily\" went to the US.\n\nActually, von Braun was solidly German. But, a lot of the others were Jews and didn't leave voluntarily so much as escape.\n\n[Werner von Braun -- Tom Lehrer](https://www.youtube.com/watch?v=TjDEsGZLbio)\n\n> Oh... And the Apollo program used SI units to get to the moon.\n\nI did not know that. But, it makes a lot of sense. I was in high school in the 70s when the U.S. was failing to make the transition to the metric system.\n\nAll of our physics problems were split 50-50 between the British system (which we get wrong on the size of a gallon) and the metric system. I used to convert the ones in the British system to metric, do the problem, then convert back. It was easier that way.\n\n> All calculations were done in SI and only converted to imperial when they needed to be shown to humans (and only because the test pilots were more used to imperial than metric, which might have cost them precious seconds to interpret some output in case of an emergency).\n\nLuckily it never caused a huge problem. Well ... other than the loss of a Mars probe decades later.", "is_submitter": false, "distinguished": null, "created_utc": 1626713373.0, "parent_id": "t1_h5re329", "replies": [{"author": "NoSuchKotH", "id": "h5svoax", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "on8mn1", "stickied": false, "body": "You deserve a decent reply for what you wrote. I learned new things, even! But unfortunately, I'm a bit burned out from a long work day :-(\n\nMaybe I get back to you tomorrow.", "is_submitter": false, "distinguished": null, "created_utc": 1626730718.0, "parent_id": "t1_h5rrd7v", "replies": [{"author": "MisanthropicScott", "id": "h5t4kfk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "on8mn1", "stickied": false, "body": "No worries. Take your time.", "is_submitter": false, "distinguished": null, "created_utc": 1626734844.0, "parent_id": "t1_h5svoax", "replies": []}]}]}]}]}]}]}, {"author": "Zabawa13", "id": "h5q6tp1", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #229 | Classis Veritatus", "submission": "on8mn1", "stickied": false, "body": "I live in Poland. Western Culture is a phrase I often heard because my country supposedly lacks it. To me it refers to a diffrence in cultures caused by the separation during Cold War. I am aware that it has much wider meaning, but this is also partialy true", "is_submitter": false, "distinguished": null, "created_utc": 1626678756.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5q7ah4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">Western Culture is a phrase I often heard because my country supposedly lacks it.\n\nWhat do you think people are specifically appealing to when they use the phrase like that?  What are the things that 'Western culture' has that Poland doesn't?\n\n>To me it refers to a diffrence in cultures caused by the separation during Cold War. \n\nDo those differences exist today still?  What are they?", "is_submitter": true, "distinguished": null, "created_utc": 1626679152.0, "parent_id": "t1_h5q6tp1", "replies": [{"author": "Zabawa13", "id": "h5q7x1k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #229 | Classis Veritatus", "submission": "on8mn1", "stickied": false, "body": "I often believe that people use this term in a wrong way as they believe it only refers to western countries being more tolerant, progressive, accepting. Literally half of Poland's population believes it's good to do so, while the other half despises it, viewing this as an attack on mortality and catholic beliefs, or worse, degrading it to communist propaganda (Yes, really). Once there was an Pride parade in my town and one guy from my highschool (who was a school Council president at the Time) streamed it on Facebook and called them idiots, antichrists, communists. Students from my school wasted him expelled.", "is_submitter": false, "distinguished": null, "created_utc": 1626679701.0, "parent_id": "t1_h5q7ah4", "replies": [{"author": "DDumpTruckK", "id": "h5q8kjn", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">I often believe that people use this term in a wrong way as they believe it only refers to western countries being more tolerant, progressive, accepting.\n\nI guess the United States isn't in 'the West' either by those people's definition then XD.  There's not exactly a lot of tolerance, acceptance, or progressive ideas here.  I mean we fought hard for labor rights and then almost immediately surrendered those advances to corporate neolib bullshit.\n\n>while the other half despises it, viewing this as an attack on mortality and catholic beliefs, or worse, degrading it to communist propaganda (Yes, really).\n\nOh I totally believe that.  That's the majority of the US right now.  Anything progressive is condemned as unChristian and communist.  Conservatives in the US have no clue what communism is.\n\n>Once there was an Pride parade in my town and one guy from my highschool (who was a school Council president at the Time) streamed it on Facebook and called them idiots, antichrists, communists.\n\nSounds a lot like the US to me XD.  Looks like we're both in non-Western countries lol.", "is_submitter": true, "distinguished": null, "created_utc": 1626680283.0, "parent_id": "t1_h5q7x1k", "replies": [{"author": "Zabawa13", "id": "h5qavx4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #229 | Classis Veritatus", "submission": "on8mn1", "stickied": false, "body": "This is why the definition of western culture is flawed. because everyone interprets it diffrently", "is_submitter": false, "distinguished": null, "created_utc": 1626682314.0, "parent_id": "t1_h5q8kjn", "replies": [{"author": "DDumpTruckK", "id": "h5s4txy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "I think its flawed because it doesn't really mean anything.  Anything you can attribute to the West it seems to me you could attribute to the majority of the first world.", "is_submitter": true, "distinguished": null, "created_utc": 1626719097.0, "parent_id": "t1_h5qavx4", "replies": [{"author": "Zabawa13", "id": "h5s53rt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #229 | Classis Veritatus", "submission": "on8mn1", "stickied": false, "body": "I guess you're right", "is_submitter": false, "distinguished": null, "created_utc": 1626719214.0, "parent_id": "t1_h5s4txy", "replies": []}]}]}]}]}]}]}, {"author": "TesseractToo", "id": "h5qb2m1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "on8mn1", "stickied": false, "body": "It used to have a strong delineation of Geopolitics but due to so much importing and exporting the cultural line is burring. Isn't it the definition the West put on things anyway though?   \n\n\nThe West though is the descendants of Europe/Britain and its colonized countries, it's anything Geographically West of Istanbul but not down into Africa. It's the countries that have politics with democracy derived from Greek and Latin where individuals matter and can be unique and followed the movement of The Enlightenment. I think.  \n\n\nI wrote a whole thing but then I felt stupid and deleted it hehe. To define it properly would take a long time and might push into insensitive territory where racism and ethnocentrism *were* the rules of separating one culture from another so it can get touchy. I come from a multicultiral/multiethnic family so it might be my idea isn't as defined as, say, someone who doesn't like multiculturalism. Bleah I feel awkward trying to answer :D", "is_submitter": false, "distinguished": null, "created_utc": 1626682477.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5s5xtd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">The West though is the descendants of Europe/Britain and its colonized countries, it's anything Geographically West of Istanbul but not down into Africa. It's the countries that have politics with democracy derived from Greek and Latin where individuals matter and can be unique and followed the movement of The Enlightenment. I think.\n\nDoesn't this describe the majority of the world at this point though?  3rd World Countries excluded. Why are we calling this 'west' when it's clearly 'globe'?", "is_submitter": true, "distinguished": null, "created_utc": 1626719569.0, "parent_id": "t1_h5qb2m1", "replies": [{"author": "TesseractToo", "id": "h5u5mp3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "on8mn1", "stickied": false, "body": "Well Asia and for some reason USSR isn't called the \"West\", nor is Africa and many of the island countries.  \n\n\nIt's an antiquated term from when people (who called it this) were European and from their perspective the \"East\" was Asia, the \"centre of the world\" was Istanbul. But then there was also this saying \"the sun never sets on the British Empire\" because they had colonies dotted all over the world.  \n\n\nI mean the world might be called colonized now but not by one people, like I said the line is blurring. Multiculturalism is normal. In the US they call it a \"melting pot\" but it sounds too much like tempers boiling over so in Canada they refer to that and say \"we aren't a melting pot, we are a mixed salad\" :D", "is_submitter": false, "distinguished": null, "created_utc": 1626753748.0, "parent_id": "t1_h5s5xtd", "replies": [{"author": "DDumpTruckK", "id": "h5u7bdb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">Well Asia and for some reason USSR isn't called the \"West\", nor is Africa and many of the island countries.\n\nYes.  For *some reason.*  If I could invite you to hazard a guess...what would that guess look like?\n\n>It's an antiquated term from when people (who called it this) were European and from their perspective the \"East\" was Asia, the \"centre of the world\" was Istanbul. But then there was also this saying \"the sun never sets on the British Empire\" because they had colonies dotted all over the world.\n\nYes, it's quite antiquated, yet people still use it.  Are they referring to the antiquated definition that doesn't really apply to this world (and arguably never applied to the colonial world either)?  That'd be weird, wouldn't it? It'd be like me going around and saying \"I'm gay.  No no no, I mean happy.\"  Just isn't how people talk anymore. So *what is it* that people mean by 'the west' when anything they ever answer to that question ends up applying to the whole world?\n\n>but it sounds too much like tempers boiling over so in Canada they refer to that and say \"we aren't a melting pot, we are a mixed salad\" :D\n\nThe mixed salad approach is used in the US too these days.  At least by academics.  The approach isn't because the melting pot sounds too hostile though.  It's because a melting pot paints an image of a nation having a single, homogenous culture.  This is not the picture we see in reality though.  What we see is a little bit of mixing, but also large chunks of identifiably different cultures mixed throughout.  Like a salad.", "is_submitter": true, "distinguished": null, "created_utc": 1626754757.0, "parent_id": "t1_h5u5mp3", "replies": [{"author": "TesseractToo", "id": "h5u8o6c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "on8mn1", "stickied": false, "body": ">.  \n>  \n>If I could invite you to hazard a guess...what would that guess look like?\n\n(Oh FFS Reddits copy paste on browser al all fucked to shit so bear with me. I usually have to edit things 11 billiondy times because it keeps going all screwy and I'm retyping this all a second time because the broken BS erased it, and do I remember everything I posted? No, I have really shit short term memory lol.)\n\nOk I think you are inferring race, right? That people in the USSR were predominantly white and Christian? Thing is Russia/USSR wasn't considered the West either. But yeah it seems it excludes nations that are predominantly non-white.\n\nI'm not a scholar on this and I'm definitely not qualified to make a definitive statement on what it is and isn't but like i said, due to multiculturalism the line is very blurred. I think the people who use it the most these days are right nationalists and I definitely don't know what's going on in their heads but it seems to be revisionist history for the most part.\n\nThat's interesting that the US is adopting the \"mixed salad\" metaphor and for a different reason and the mental imagry described. When I imagined the melting pot metaphor I was imaging a stew, but of potato there, bit of carrot there and all mixing but still identifiable pieces and now I see they were thinking of something more. Interesting. :)", "is_submitter": false, "distinguished": null, "created_utc": 1626755611.0, "parent_id": "t1_h5u7bdb", "replies": [{"author": "DDumpTruckK", "id": "h5uaclb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">Ok I think you are inferring race, right? That people in the USSR were predominantly white and Christian? Thing is Russia/USSR wasn't considered the West either. But yeah it seems it excludes nations that are predominantly non-white.\n\nI'm not inferring anything.  I'm not the one who believes 'western culture' means something, but can't define any particular aspect of it that doesn't also just apply to everywhere else.   It's just when I ask people what they mean by western culture they end up giving me things that apply to countries that they don't consider to be 'western'.  If their definition of 'western culture' applies to pretty much every first and most second world countries, then it doesn't seem very useful of a definition to use.  So that's why I ask, why would they use it?\n\n>like i said, due to multiculturalism the line is very blurred.\n\nI agree.  From where I'm standing it seems so blurry that I'm really not sure there's a line there at all, and I don't even know if there ever *was* a line.\n\n>When I imagined the melting pot metaphor I was imaging a stew, but of potato there, bit of carrot there and all mixing but still identifiable pieces and now I see they were thinking of something more.\n\nWell the melting pot analogy typically invokes like a fondue pot of cheese.  Put in 100 types of cheeses and cook it and you eventually get one new type of cheese.  I'm not trying to fight you on this or anything XD, but the stew interpretation kinda falls flat because stew doesn't melt.  The key in the analogy is the 'melting' part.  When different things melt, they combine into a homogenous mixture.", "is_submitter": true, "distinguished": null, "created_utc": 1626756687.0, "parent_id": "t1_h5u8o6c", "replies": [{"author": "TesseractToo", "id": "h5uhrd8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "on8mn1", "stickied": false, "body": "I think it means different things to different people. Same as many things, if you ask Scientologist what 'ethics' means, it means punishment to them; If you ask an artist what 'blue' is you will get a different answer from a non-artist; if you ask what is 'white person' is you will get different answers remember in the past Italians and Irish didn't count as white for whatever reason so it is more of a political concept than an appearance one.  \n\n\nI'm GenX so I was in high school and in Canada when the cold war was in full swing and 'the west' was much more definitive than it is now, but as a person who was in it, everything non-western seemed exotic and interesting to me. A good example of how insular it was before even in open and accepting societies, think of the movie The Exorcist where the super scary demon statue was an Indonesian carving (I wonder what Indonesians thought of that if they thought it was funny or got annoyed). Edit: Opps just looked it up and it was Asserian (Iraq)- i wonder what they thought! Funny how it looks so similar to the Indonesian ones.)  \n\n\nSorry I'm having a migraine so my thought are all scattery (yeah the format thing and a migraine so annoying lol)  \n\n\nI think there IS a line, otherwise we wouldn't have cultural centres in cities like a Chinatown area. And some people do want to be able to practice their culture and find these places more comforting than the rest of the city as signs on stores and products are often in their home language or first language. In my opinion I think cultures should be celebrated.   \n\n\nOooOOOh I get it, fondue is a great visualization thanks :)", "is_submitter": false, "distinguished": null, "created_utc": 1626762127.0, "parent_id": "t1_h5uaclb", "replies": [{"author": "DDumpTruckK", "id": "h5uji4d", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">Same as many things, if you ask Scientologist what 'ethics' means, it means punishment to them; If you ask an artist what 'blue' is you will get a different answer from a non-artist; if you ask what is 'white person' is you will get different answers remember in the past Italians and Irish didn't count as white for whatever reason so it is more of a political concept than an appearance one.\n\nYes but this is kind of proving my point that there is no such thing as 'western culture' and that it's all just in our heads.  Because likewise, there is no such thing as ethics: it's just in our heads.  There is no such thing as 'white people' it's all just what ever arbitrary lines we draw in our heads.  You're spot on with the Irish thing, but that's just proving my point.  'Western Culture' isn't something real.  It's just a vague, useless term that doesn't really convey anything that resembles reality, but rather only conveys the person who's using it's view of the world and nothing else.\n\n>I'm GenX so I was in high school and in Canada when the cold war was in full swing and 'the west' was much more definitive than it is now\n\nWell, I appreciate that it probably seemed that way.  But I'd argue that the phrase, while certainly more popular in the Cold War era, was still a kind of vacuous nonsense word used to invoke emotional and nationalistic responses from people.  I mean what did 'the west' mean back then?  What would be the tick boxes to fill in order to be 'the west' Capitalism?  Neolibereral?  Iran was democratic (well a republic) and fairly neolib in the 80s.  They even say the nation had 'westernized' but obviously I take issue with that word, since even to this day they're not considered a 'western nation' even though they 'westernized'.  Which kind of supports my thesis even more.  Why can a country 'westernize' and still not be a 'western civilization?'  Is it because the people who use the term 'westernize' are either intentionally or unintentionally trying to paint democracy as something that came from what ever 'the west' means?  That there's some kind of Western Exceptionalism?  See it's all very shady and awkward when you think about it.\n\n>I think there IS a line, otherwise we wouldn't have cultural centres in cities like a Chinatown area.\n\nWell when you can think of a definition of 'western culture' that doesn't incidentally also include a ton of nations that generally aren't considered to be 'western' let me know.\n\n>And some people do want to be able to practice their culture and find these places more comforting than the rest of the city as signs on stores and products are often in their home language or first language. In my opinion I think cultures should be celebrated.\n\nTotally.  I'm all for diversity and other cultures.  It's just the existence of other cultures doesn't really define or prove in any way what 'the west' is.", "is_submitter": true, "distinguished": null, "created_utc": 1626763546.0, "parent_id": "t1_h5uhrd8", "replies": [{"author": "TesseractToo", "id": "h69r4au", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "on8mn1", "stickied": false, "body": "Sorry this didn't come up in my notifications, just seeing it now.\n\nI've been doing some observing and thinking and I think that from the people that use it the most (predominantly white males with a right wing leaning) that it is *now* (but not before) a dog whistle for neo-facism.", "is_submitter": false, "distinguished": null, "created_utc": 1627060771.0, "parent_id": "t1_h5uji4d", "replies": []}, {"author": "TesseractToo", "id": "h69s3j0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "on8mn1", "stickied": false, "body": "The copy paste thing in Reddit is borked. See if this works  \n\n\nNick Fuentez, fan of adapting this term to dog whistle \"the West\" as neo-facism, is going to have a bad day when they decide his name means he isn't white.  \n\n\nhttps://www.reddit.com/r/PublicFreakout/comments/ohsauz/nick\\_fuentes\\_and\\_his\\_crew\\_as\\_they\\_entered\\_cpac/\n\n  \nhttps://www.forbes.com/sites/jackbrewster/2021/07/09/twitter-bans-white-nationalist-leader-nick-fuentes-ally-of-arizona-republican-rep-gosar/?sh=54252afe49f7", "is_submitter": false, "distinguished": null, "created_utc": 1627061192.0, "parent_id": "t1_h5uji4d", "replies": [{"author": "DDumpTruckK", "id": "h69vfpk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Yeah no joke.  Destiny pointed it out to him once and he just shrugs it off.  As usual, white nationalists are clueless.", "is_submitter": true, "distinguished": null, "created_utc": 1627062631.0, "parent_id": "t1_h69s3j0", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "timotioman", "id": "h5qpft3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #184", "submission": "on8mn1", "stickied": false, "body": "Doesn't really mean anything to me. I live in Western Europe and I've only seen it on internet discussions and frankly it seems odd. \n\nWestern europe is a cultural mess. Putting everything in the same bag is quite the oversimplification. Throwing America into the mix just makes me laugh.", "is_submitter": false, "distinguished": null, "created_utc": 1626694623.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "haz_mat_", "id": "h5sgfyh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "on8mn1", "stickied": false, "body": "\"Space may be the final frontier, but its made in a Hollywood basement. It's understood that Hollywood sells Californiacation.\"", "is_submitter": false, "distinguished": null, "created_utc": 1626724084.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "Djolox", "id": "h5q8nt4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "To me, as an Eastern European \"Western Culture\" means american influence and globalism, that's at least how most people here perceive it.", "is_submitter": false, "distinguished": null, "created_utc": 1626680367.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5q9284", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "So is it just purely a synonym for \"American\" and \"globalism\" or is there a more specific meaning to it?  Like is Western Europe included in Western Culture?  What specifically are the attributes of a Western Culture?", "is_submitter": true, "distinguished": null, "created_utc": 1626680719.0, "parent_id": "t1_h5q8nt4", "replies": [{"author": "Djolox", "id": "h5qf5k7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "It is not as much of a synonym for globalism and american as it is an umbrella term to define all the perceived american influence on pretty much all european cultures. While said perceived and real influences of american pop culture can be seen as positive, neutral or negative, the term western culture almost always has a negative connotation. It is most likely a cold war \"us versus them\"mentality relic", "is_submitter": false, "distinguished": null, "created_utc": 1626686168.0, "parent_id": "t1_h5q9284", "replies": [{"author": "DDumpTruckK", "id": "h5s5iq3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">It is most likely a cold war \"us versus them\"mentality relic\n\nSure, but back then it was used largely to differentiate between capitalist societies and socialist societies, with capitalism being 'the West' obviously but not exclusive to the US.  So now it seems the word means something else.  Now it means 'the influence of the US'?  What about when I hear people using it in the US who are saying 'Western culture' is dying?", "is_submitter": true, "distinguished": null, "created_utc": 1626719391.0, "parent_id": "t1_h5qf5k7", "replies": [{"author": "Djolox", "id": "h5s97cl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "I'm only giving you the meaning of the term from the perspective of people from former yugoslavia, obviously the term western culture doesn't have the same meaning here and in the US. My reasoning for why it might have such a dated meaning here is because the idea of a \"western culture\" is pretty american in it's nature, because we don't see different cultures of western europe as a single, unified culture as some americans might be tempted to think, every country/region has it's own unique culture and more often than not language, making them hard to generalise together in a single, unified western culture.", "is_submitter": false, "distinguished": null, "created_utc": 1626720959.0, "parent_id": "t1_h5s5iq3", "replies": [{"author": "DDumpTruckK", "id": "h5s9uxx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Well, I guess my point is, it *used* to mean the same thing around the world.  Now it doesn't seem to mean anything consistent.  Now it seems like an empty word that's tossed around without any real thought about what it means.  Not accusing you of such, just anyone who generally uses the word or phrase.", "is_submitter": true, "distinguished": null, "created_utc": 1626721237.0, "parent_id": "t1_h5s97cl", "replies": []}]}]}]}]}]}, {"author": "YLASRO", "id": "h5q5m2u", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "Mostly as a rightwing buzzword to differentiate us from the rest of the world by drawing arbitrary limits onto culture instead if aknowledging that all cultures fluidly intersect with eachother.\n\nWestern culture isnt one thing. It seamlessly flows into other cultures and viceversa.", "is_submitter": false, "distinguished": null, "created_utc": 1626677725.0, "parent_id": "t3_on8mn1", "replies": [{"author": "Stand_kicker", "id": "h5qdtkp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "on8mn1", "stickied": false, "body": "Disagree.", "is_submitter": false, "distinguished": null, "created_utc": 1626684941.0, "parent_id": "t1_h5q5m2u", "replies": []}, {"author": "DDumpTruckK", "id": "h5q7f1o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Personally, I would agree.  I'd even go further than you do:\n\n>Western culture isnt one thing. It seamlessly flows into other cultures and viceversa.\n\nWhen you say this all I see happening is you removing any defining features of Western Culture and applying them elsewhere, meaning not only is Western culture not 'one thing' as you put it, but rather, Western Culutre isn't *anything.*  It lacks *all* meaning if you can apply every attribute that it's supposed to stand for to other non-western cultures.", "is_submitter": true, "distinguished": null, "created_utc": 1626679260.0, "parent_id": "t1_h5q5m2u", "replies": [{"author": "YLASRO", "id": "h5qaayj", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "I think a good way to put it is \"culture exists but not western culture.\" you can put a magnifying glass on a region and see culture but once you zoom out it just becomes gradients covering the earth. Distinct cultures cease to exist as a coherent concept", "is_submitter": false, "distinguished": null, "created_utc": 1626681804.0, "parent_id": "t1_h5q7f1o", "replies": [{"author": "DDumpTruckK", "id": "h5s57cs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Here's my problem with the idea of homogenous culture while we're on the topic: I can't find it.\n\nAny time you think you've found a homogenous culture, just zoom *in* and it all disappears.", "is_submitter": true, "distinguished": null, "created_utc": 1626719257.0, "parent_id": "t1_h5qaayj", "replies": []}]}]}]}, {"author": "Crusty_Blob", "id": "h5qffm3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "No. It's an empty dog whistle used by neo-nazis who are too spineless / stupid to define what they're pretending to defend. \n\n\"The West\" as a political term means nothing. It doesn't mean Christian or geographically western, otherwise Catholic Latin America would also be considered a part of the \"Western Civilization\". You could say it only refers to white Christians, but whiteness as a label is equally vague and pseudoscientific.", "is_submitter": false, "distinguished": null, "created_utc": 1626686418.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "TiggerBane", "id": "h5qkpvp", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #236", "submission": "on8mn1", "stickied": false, "body": "Western culture is when women only know how to eat potato chip, shake booty on tiktok and complain. \n\nOh and when people will defend people’s right to do said things to the death.", "is_submitter": false, "distinguished": null, "created_utc": 1626691003.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5s5n5x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">Western culture is when women only know how to eat potato chip, shake booty on tiktok and complain.\n\nThat kind of person exists everywhere there exists TikTok though.  China, India, Russia, Europe, America.  Seems to be quite global, not a 'western' thing.", "is_submitter": true, "distinguished": null, "created_utc": 1626719442.0, "parent_id": "t1_h5qkpvp", "replies": []}]}, {"author": "von_Viken", "id": "h5qabiy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #230", "submission": "on8mn1", "stickied": false, "body": "Not really, so instead you'll get my fathers opinion. He defines western culture, as a reasonably well-functioning democracy and generally high living-standard.", "is_submitter": false, "distinguished": null, "created_utc": 1626681818.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5s5r4l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Well, my challenge to your father then is that his definition of 'western culture' seems to encompass quite a lot of the globe.", "is_submitter": true, "distinguished": null, "created_utc": 1626719489.0, "parent_id": "t1_h5qabiy", "replies": [{"author": "von_Viken", "id": "h5s98e7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #230", "submission": "on8mn1", "stickied": false, "body": "Then quite alot of the globe is western", "is_submitter": false, "distinguished": null, "created_utc": 1626720971.0, "parent_id": "t1_h5s5r4l", "replies": [{"author": "DDumpTruckK", "id": "h5s9ils", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Yeah so like...why are we calling it 'western'?", "is_submitter": true, "distinguished": null, "created_utc": 1626721092.0, "parent_id": "t1_h5s98e7", "replies": [{"author": "von_Viken", "id": "h5sacwy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #230", "submission": "on8mn1", "stickied": false, "body": "Cuz that's the only really pan-western thing.", "is_submitter": false, "distinguished": null, "created_utc": 1626721452.0, "parent_id": "t1_h5s9ils", "replies": [{"author": "DDumpTruckK", "id": "h5sbpzy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "But it's not even pan-western though.  It's pan-global lol", "is_submitter": true, "distinguished": null, "created_utc": 1626722039.0, "parent_id": "t1_h5sacwy", "replies": [{"author": "von_Viken", "id": "h5sc2s1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #230", "submission": "on8mn1", "stickied": false, "body": "Well-functioning with high living standards are not that conmon", "is_submitter": false, "distinguished": null, "created_utc": 1626722194.0, "parent_id": "t1_h5sbpzy", "replies": [{"author": "DDumpTruckK", "id": "h5skiiw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Yes.  So why are we calling it 'western culture' then if it's not exclusive to the west?  Calling it western culture seems to imply a certain ignorance about the fact that most of the world is the same, but isn't considered 'the west'. It's very 'American Exceptionalism' to me.", "is_submitter": true, "distinguished": null, "created_utc": 1626725837.0, "parent_id": "t1_h5sc2s1", "replies": [{"author": "von_Viken", "id": "h5ugbf1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #230", "submission": "on8mn1", "stickied": false, "body": "I dunno, it's just that if i am going to give it a definition that would be it.", "is_submitter": false, "distinguished": null, "created_utc": 1626760973.0, "parent_id": "t1_h5skiiw", "replies": [{"author": "DDumpTruckK", "id": "h5uh9co", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Well I'm kind of arguing with your father through you by proxy here so I guess there's only so far we can go XD.\n\nIt seems like you ultimately agree with me that it doesn't mean very much, if anything.", "is_submitter": true, "distinguished": null, "created_utc": 1626761723.0, "parent_id": "t1_h5ugbf1", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "Skastrik", "id": "h5qhip5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "on8mn1", "stickied": false, "body": "It's just a set of democratic and some cultural values that characterize a part of the world.\n\nDoesn't really mean anything to specific.", "is_submitter": false, "distinguished": null, "created_utc": 1626688276.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h5qi562", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "on8mn1", "stickied": false, "body": "Yes, it's the culture of Western civilizations", "is_submitter": false, "distinguished": null, "created_utc": 1626688829.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "BuccaneerRex", "id": "h5r3ptt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "on8mn1", "stickied": false, "body": "To me, the 'west' is the descendents of the western Roman Empire. But that's not how I think most people use it.\n\nThere's also the 'west' as opposed to the 'east', with east being Near, Middle and Far. Near east is Eastern Europe + the Stans, Middle East is Anatolia, the Levant, Arabian Penninsula, and Iran. And Far East is Mongolia, China and Japan, along with Southeast Asia. This is more of a vague American notion, as it is of course relative to America's position in the world. Pretty sure China is west of Japan last I checked, so it would be weird for them to refer to China as the East.\n\nThe more common and vague definition for 'the west' is the loose historical association with the democratic heritage of the ancient Greeks. 'Western Democracy' refers to republican (government style, not US politicult) democratically elected governments that came out of the Enlightenment. US, England post-reformation, and the spread of republican democracy after the two WWs.", "is_submitter": false, "distinguished": null, "created_utc": 1626702900.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "THF-Killingpro", "id": "h5r7nhj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "No", "is_submitter": false, "distinguished": null, "created_utc": 1626704769.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "DELETED", "id": "h5rn94v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "on8mn1", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1626711612.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5s42l2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "So is life being easy such that people get upset about useless things the only qualifier that describes 'Western Culutre'?  Because those people exist in nearly all societies around the world everywhere.  You think the West has the monopoly on Karens?", "is_submitter": true, "distinguished": null, "created_utc": 1626718768.0, "parent_id": "t1_h5rn94v", "replies": [{"author": "DELETED", "id": "h5saijr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "on8mn1", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1626721520.0, "parent_id": "t1_h5s42l2", "replies": [{"author": "DDumpTruckK", "id": "h5sbawe", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">Monopoly no, higher frequency, yes. It comes with the freedoms we have here.\n\nHow are you measuring higher frequency?  Are you aware how many people in China have cellphones?  Are you aware where the company that created TikTok is even *from?*  It's not 'the West.'\n\n>The west is freedom, we better be thankful.\n\nOof.  Bro.  Come on, don't recite country pick 'em up truck lyrics at me as if it means anything.  Our government spies on us exactly as much as China does on its citizens, if not more.\n\n>This girl can't rebel, she will be beaten. If she breaks the family honour, she dies. If she goes to the police, she is probably taken back to her family in disgrace, broken the family honour and she dies.\n\nThis describes a pretty similar situation of a lot minorities in the US right now.", "is_submitter": true, "distinguished": null, "created_utc": 1626721860.0, "parent_id": "t1_h5saijr", "replies": [{"author": "DELETED", "id": "h5sdi82", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "on8mn1", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1626722815.0, "parent_id": "t1_h5sbawe", "replies": [{"author": "DDumpTruckK", "id": "h5skp5h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Lol.  Coming from the guy who thinks TikTok culture is 'western culture' and the guy who quotes country songs about 'freedom' as if it's a serious statement, that's rich.  I think you need to stop smoking the American Exceptionalism.", "is_submitter": true, "distinguished": null, "created_utc": 1626725915.0, "parent_id": "t1_h5sdi82", "replies": []}]}]}]}]}]}, {"author": "ugg_monster", "id": "h5rnl7b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "Whenever I hear someone use it I think \"I have never met a person who thinks like this or does this stuff\", so if the west exists, idk where.", "is_submitter": false, "distinguished": null, "created_utc": 1626711756.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "FreeBiskit", "id": "h5sc6bl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "on8mn1", "stickied": false, "body": "I immediately think Hollywood but other than that I barely think about East vs West unless I am in a philosophy discussion.", "is_submitter": false, "distinguished": null, "created_utc": 1626722236.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5skb3m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "What about Bollywood.  The US isn't the only ones with massive film making studios.", "is_submitter": true, "distinguished": null, "created_utc": 1626725749.0, "parent_id": "t1_h5sc6bl", "replies": [{"author": "FreeBiskit", "id": "h5sko39", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "on8mn1", "stickied": false, "body": "True. I think I meant that Hollywood portrays Western culture in a really artificial, over the top way. It’s just what I imagine when someone says “Western culture” and I live in America.", "is_submitter": false, "distinguished": null, "created_utc": 1626725902.0, "parent_id": "t1_h5skb3m", "replies": [{"author": "DDumpTruckK", "id": "h5sm1mq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Ok.  I'm just still unclear on what you mean by western culture then.  I thought you were saying Hollywood *is* western culture, but it seems like you're saying it's just *portraying* western culture.  So what *is* western culture?  What list of descriptors can you give me that I can compare things to in order to find out if its considered western culture or not?", "is_submitter": true, "distinguished": null, "created_utc": 1626726485.0, "parent_id": "t1_h5sko39", "replies": [{"author": "FreeBiskit", "id": "h5smlkd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "on8mn1", "stickied": false, "body": "Again, I don’t think about Eastern or Western culture. In fact I don’t think there is much of a western culture or if there is, it is an amalgam of years of immigration and culture mixing.", "is_submitter": false, "distinguished": null, "created_utc": 1626726723.0, "parent_id": "t1_h5sm1mq", "replies": [{"author": "DDumpTruckK", "id": "h5smrpd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Ok, so you're saying it's a generally vacuous term that doesn't really mean anything specific?", "is_submitter": true, "distinguished": null, "created_utc": 1626726796.0, "parent_id": "t1_h5smlkd", "replies": [{"author": "FreeBiskit", "id": "h5sno7m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "on8mn1", "stickied": false, "body": "I think the word holds merit when speaking generally about things like religion or food.\n\nCulturally, it’s grey in my opinion. What defines a place as Western, non geographically speaking? I’m not sure. I’m sure there is a list of criteria some person made but it’s arbitrary in my opinion. \n\nWhat about you? What do you think of Western culture?", "is_submitter": false, "distinguished": null, "created_utc": 1626727180.0, "parent_id": "t1_h5smrpd", "replies": [{"author": "DDumpTruckK", "id": "h5so9w2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">I think the word holds merit when speaking generally about things like religion or food.\n\nWell I'd hesitate to agree.  We'd have to be *so* utterly general in our terms in order to try and make 'western culture' make any sense.  So general that we lose any and all use of the term in the first place.  Is Chinese food 'western culture'?  It's all over the US.  What about Mexican food?  What about Sushi?  What about peirogies?  These are foods from everywhere, they exist in almost all cultures.  How could we ever say some foods are 'western culture'.  Like the phrase \"as American as apple pie\" just means absolutely nothing.  Apple pie wasn't invented in the US.  It's a recipe made across practically all cultures.\n\nSo that kind of answers what I think about 'western culture', but to be specific, I don't think it means anything of use.  It's akin to American Exceptionalism.  It's just a racist, bigoted belief that makes it easier for people to group themselves in an entirely arbitrary way and they get to pretend like they're special.", "is_submitter": true, "distinguished": null, "created_utc": 1626727442.0, "parent_id": "t1_h5sno7m", "replies": [{"author": "FreeBiskit", "id": "h5sqtbb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "on8mn1", "stickied": false, "body": "If an American person is traveling abroad in Asia and they ask a local for the nearest restaurant with “Western style food” I do not think they are considered racist nor do I consider their choice of words to be incorrect or vague. \n\nIt’s a generalization that’s only being used to categorize a difference in taste. \n\nFor the instance of religion. If I want to study Western religion then I probably wouldn’t come across Buddhism or Sikhism many times in my studies. Vice versa for Eastern religion. The word is just being used geographically. \n\nNow I do agree though that words can become weaponized and in this case Western Culture is already being weaponized, just like third world and first world country have been/are.", "is_submitter": false, "distinguished": null, "created_utc": 1626728557.0, "parent_id": "t1_h5so9w2", "replies": [{"author": "DDumpTruckK", "id": "h5stb9u", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">If an American person is traveling abroad in Asia and they ask a local for the nearest restaurant with “Western style food” I do not think they are considered racist nor do I consider their choice of words to be incorrect or vague.\n\nWell I wouldn't say they're being *intentionally* racist, but they are inevitably, if accidentally, making an exclusionary definition based on a series of largely unrealistic stereotypes.  What kind of food is 'western style food'?  Because again, Chinese food is all over the US.  Is that western food?  Chinese culture exists in the US, is Chinese considered western culture?  The problem with identifying anything as 'western' is you're making an assumption that doesn't reflect reality.\n\n>It’s a generalization that’s only being used to categorize a difference in taste.\n\nIt's a generalization that *ignores* certain things that the user of the term wants to ignore, despite the things they're ignoring having a perfectly strong foothold in 'western culture'.  I live in Pennsylvania.  I can have sfougato for breakfast, tacos for lunch, and pork and sauerkraut for dinner.  I can go and get a kebab, or have some pierogis.  I can have Chinese food, sushi, Indian, Thai, or literally anything.  I live in western culture, and these are the foods I eat, so what exactly is 'western style food'?  The generalization of 'western style food' is excluding those foods as 'ethnic' yet they're as American as apple pie is.  That's where it's racist: to use the term is making a certain assumption that doesn't really align with reality.\n\nNow is it the same kind of racism as if I went to China, painted myself yellow, squinted at everyone and made incredibly offensive interpretations of their language?  No. It's not the same.  But it's still using a term to exclude a certain group of people that in reality really ought to be included.\n\n>For the instance of religion. If I want to study Western religion then I probably wouldn’t come across Buddhism or Sikhism many times in my studies.\n\nWhy not?  There's at least 5 Sikh community buildings within an hour of me.  There's a [Pagoda in Reading](https://en.wikipedia.org/wiki/Pagoda_(Reading,_Pennsylvania)).  Though it's only a visitor center that's never open any more :(\n\nAnd to be clear, I'm not calling you a racist, nor do I think you're intending to be malicious when you use the term.  However, there's a certain stereotyping that is happening even if you're ignorant to it, when you use the term like that.\n\nIt all reminds me of when I was in University in a history 300-level class.  The student next to me, also a history major (you don't take 300-level history classes unless you're aiming for a degree there), had \"Manifest Destiny\" tattooed on his arm.  I was blown away that someone would put a phrase permanently on their arm that references a period that disenfranchised so many people.  I was further blown away that he seemed completely ignorant of what that phrase actually implies. To an educated history student, he might as well have tattooed a swastika on his arm and gone around saying \"Yeah I don't really know what it means tho.\"", "is_submitter": true, "distinguished": null, "created_utc": 1626729665.0, "parent_id": "t1_h5sqtbb", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "018118055", "id": "h5sec7b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #215", "submission": "on8mn1", "stickied": false, "body": "Paraphrasing Gandhi, I think it's a good idea.", "is_submitter": false, "distinguished": null, "created_utc": 1626723179.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5sk4zd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "What is a good idea?", "is_submitter": true, "distinguished": null, "created_utc": 1626725676.0, "parent_id": "t1_h5sec7b", "replies": [{"author": "018118055", "id": "h5skez9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #215", "submission": "on8mn1", "stickied": false, "body": "Western culture.\n\nGandhi was once asked what he thought about Western civilization. He gave the same response implying that it did not yet exist.", "is_submitter": false, "distinguished": null, "created_utc": 1626725795.0, "parent_id": "t1_h5sk4zd", "replies": [{"author": "DDumpTruckK", "id": "h5slrum", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "What even *is* western culture?  What are we talking about though?", "is_submitter": true, "distinguished": null, "created_utc": 1626726370.0, "parent_id": "t1_h5skez9", "replies": [{"author": "018118055", "id": "h5sm713", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #215", "submission": "on8mn1", "stickied": false, "body": "I think it's probably whatever you want it to be. Poorly defined and abused for whatever purpose.", "is_submitter": false, "distinguished": null, "created_utc": 1626726548.0, "parent_id": "t1_h5slrum", "replies": [{"author": "DDumpTruckK", "id": "h5smko3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Ah ok.  So you're saying its a vacuous term that doesn't actually mean anything.", "is_submitter": true, "distinguished": null, "created_utc": 1626726713.0, "parent_id": "t1_h5sm713", "replies": [{"author": "018118055", "id": "h5smpyn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #215", "submission": "on8mn1", "stickied": false, "body": "I don't even know that. But my guess is that it means different things to different people and so is open to abuse.", "is_submitter": false, "distinguished": null, "created_utc": 1626726775.0, "parent_id": "t1_h5smko3", "replies": [{"author": "DDumpTruckK", "id": "h5snssr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "Well, those things generally mean the same thing to me.  I'd go as far as to say the *best* terms to be abused by people are terms that don't really mean anything.  Concepts like 'white people' or 'western culture' don't actually have a real meaning, so any group who would want to can simply insert their own meaning to it.\n\nSo like when Jordan Peterson (may he experience a thousand paper cuts) says 'western culture is dying' if we were to ask him to be more specific about what he means when he says 'western culture' he will inevitably struggle to list things that can't be applied to the whole world.  This is because there is no real, specific,  western culture he is appealing to.  It means nothing.", "is_submitter": true, "distinguished": null, "created_utc": 1626727236.0, "parent_id": "t1_h5smpyn", "replies": []}]}]}]}]}]}]}]}, {"author": "germz80", "id": "h5sv27s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "on8mn1", "stickied": false, "body": "I think there probably are some cultural differences between the west vs other parts of the world, but I also think it gets used as a dog whistle too much. And I think people who talk about it overestimate the cultural homogeneity of the west. And it's probably going to mean different things to different people. So even ignoring dog whistling, I don't think it's very useful.\n\nEdit: thinking about this more: sometimes people compare and contrast western sorry telling and film to say Asian story telling and film, which I think can be interesting and not dog whistling. However, neither of these are monoliths either - and there are many examples of stores from each culture breaking from the norm for their culture. But I think it could be an example of a case where you could have a meaningful and interesting discussion about it.", "is_submitter": false, "distinguished": null, "created_utc": 1626730444.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h5svj1g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "I agree, I'd just add:\n\n>I think there probably are some cultural differences between the west vs other parts of the world,\n\nThis seems like a really empty statement.  You're going to find cultural differences between any two individuals.  Even if they're both from whatever 'the west' is.  You said so yourself when you say people overestimate the cultural homogeneit of 'the west'.", "is_submitter": true, "distinguished": null, "created_utc": 1626730652.0, "parent_id": "t1_h5sv27s", "replies": [{"author": "germz80", "id": "h5swl9n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "on8mn1", "stickied": false, "body": "Sorry, I just made an edit to my comment that I think addresses your comment.", "is_submitter": false, "distinguished": null, "created_utc": 1626731130.0, "parent_id": "t1_h5svj1g", "replies": [{"author": "DDumpTruckK", "id": "h5szidv", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "> thinking about this more: sometimes people compare and contrast western sorry telling and film to say Asian story telling and film, which I think can be interesting and not dog whistling.\n\nJust tell me what aspects make a film a 'western film' and what aspects make it an 'eastern film'.  If we made a movie that included all of the 'eastern film aspects' but we made it in the US, and made it with only US citizens involved, what happens?  Does a blackhole open up and swallow the world?  These lines drawn to fit things into the boxes just don't seem to work in any productive way apart from entirely unproductive generalization.  Is a French film the same as a Hollywood film?  They'd both be west, right?  Yet they'd be totally different.\n\n>But I think it could be an example of a case where you could have a meaningful and interesting discussion about it.\n\nBut wouldn't the interesting discussion *immediately* move us away from those vague, vacuous generalizations and into specificity that entirely negates and probably completely contradicts anything you could infer from the generalized terms we used?", "is_submitter": true, "distinguished": null, "created_utc": 1626732455.0, "parent_id": "t1_h5swl9n", "replies": [{"author": "germz80", "id": "h5t73wj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "on8mn1", "stickied": false, "body": ">Just tell me what aspects make a film a 'western film' and what aspects make it an 'eastern film'.\n\nIt would probably take a course at a university to answer this properly. But western and Asian stories tend to have different tropes. In Asian stories, villains tend to be people with good intentions who are misguided, while western stories tend to have villains who are just irredeemably evil. Asian stories often have teams of heros, each with a specialty, including one who doesn't get along with the leader until the end, while western stories tend to have a single hero or a more homogenous group. Asian stories tend to more heavily feature Confucian values like filial piety, while western stories don't feature them as much.\n\nYou are of course going to find big exceptions to these, but that doesn't mean that they are not a *tendencies* that can make for interesting discussion and university courses. Learning about the exceptions can also be interesting. Also, I think globalization is blurring these lines more than they would otherwise be blurred.\n\n>But wouldn't the interesting discussion immediately move us away from those vague, vacuous generalizations and into specificity that entirely negates and probably completely contradicts anything you could infer from the generalized terms we used?\n\nI don't think that's necessarily the case. I think anthropology is fascinating. I find it fascinating to learn about other cultures and their underlying reasons for thinking and behaving a certain way, even if there are exceptions to that. I think learning these things broadens my understanding of the world and opens me to new ideas.", "is_submitter": false, "distinguished": null, "created_utc": 1626736058.0, "parent_id": "t1_h5szidv", "replies": [{"author": "DDumpTruckK", "id": "h5tc8cm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">It would probably take a course at a university to answer this properly.\n\nI took a course on the history of film in East Asia when I was studying for my degree in history that I have.  You're talking nonsense.\n\n>In Asian stories, villains tend to be people with good intentions who are misguided, while western stories tend to have villains who are just irredeemably evil\n\nYeah but these are simply over-generalizations that when you examine them, don't hold up to reality (unsurprising as that's pretty much all generalizations). Ever seen IP Man? Pretty blatantly evil guy there from Asian movies.  Ever seen Marvel Avengers?  Tons of characters in a team of heroes.  Ever seen Kagemusha?  Asian film with one hero, not a team.  I could go on.  Your generalizations are useless and wrong and don't accurately play out in reality.  Just like the generalization of 'western culture'.\n\n>You are of course going to find big exceptions to these, but that doesn't mean that they are not a tendencies that can make for interesting discussion and university courses.\n\nThey're more than big exceptions.  There's nothing *but* exceptions.  Your generalizations make for a disinteresting conversation about a fantasy world and don't happen in university courses, in my experience. \n\n>I don't think that's necessarily the case.\n\nIt *absolutely* is the case.  Having taken several anthropology classes as well I can tell you first hand, there is no generalization ever applied and as soon as you dive into the course the professor will tell you to shed all your previous generalizations about any given culture.", "is_submitter": true, "distinguished": null, "created_utc": 1626738567.0, "parent_id": "t1_h5t73wj", "replies": [{"author": "germz80", "id": "h5te5lj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "on8mn1", "stickied": false, "body": "I also studied East Asian film in college as well as East Asian culture, and I disagree with your conclusion. You're using hyperbole when you say \"there are nothing but exceptions\", right?\n\nIP Man has people who started as enemies, daughter him, and became his friend, which is a more common trope in Asian films.\n\n>Having taken several anthropology classes as well I can tell you first hand, there is no generalization ever applied and as soon as you dive into the course the professor will tell you to shed all your previous generalizations about any given culture.\n\nDo the courses say that all cultures are the same and once you study one culture, there's no need to learn about any others because they're all the same? If I say that Asian cultures tend to value filial piety due to Confucian teachings, would you call that a completely inaccurate generalization?", "is_submitter": false, "distinguished": null, "created_utc": 1626739507.0, "parent_id": "t1_h5tc8cm", "replies": [{"author": "DDumpTruckK", "id": "h5tl50e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">You're using hyperbole when you say \"there are nothing but exceptions\", right?\n\nNo.  When you say \"most Asian films use these trends\" how many is most?  Because it's probably at *best* half.  Which isn't really a trend worth commenting on.  There's just no value in trying to make that kind of generalized statement.\n\n>IP Man has people who started as enemies, daughter him, and became his friend, which is a more common trope in Asian films.\n\nAnd it has a generically irredeemable villain, which is a trend it shouldn't be following.\n\n>Do the courses say that all cultures are the same and once you study one culture, there's no need to learn about any others because they're all the same?\n\nNo actually.  They say there's not really such a thing as a homogenous culture anywhere, which runs counter to the argument that 'eastern films do x'.\n\n>If I say that Asian cultures tend to value filial piety due to Confucian teachings, would you call that a completely inaccurate generalization?\n\nIt's fairly inaccurate, yes.  More so, I would say its not only fairly inaccurate, but also useless for all purposes beyond stereotyping people.\n\nLike what value is saying \"Asian films follow these trends, except for the ones that don't of which there's a lot.\"?  Because if we're being factual, that's as close as you can get to a fact without being overly generalizing to the point of destroying all value of the sentence.  The most valuable discussion you can have with \"Asian movies follow this trend\" is \"Yeah, but not really.\"", "is_submitter": true, "distinguished": null, "created_utc": 1626742953.0, "parent_id": "t1_h5te5lj", "replies": [{"author": "germz80", "id": "h5tu3c5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "on8mn1", "stickied": false, "body": "You:\n\n>homogenous culture anywhere, which runs counter to the argument that 'eastern films do x'.\n\nMe:\n\n>more common\n\n>tend to\n\nYou seem to be trying to twist my arguments into absolute statements rather than what I'm actually saying which is that there are tendencies.\n\n>More so, I would say its not only fairly inaccurate, but also useless for all purposes beyond stereotyping people.\n\nSo when professors and books taught me that East Asian cultures have tended to value filial piety which came from Confucianism, I should have told them that that statement is inaccurate and serves no purpose other than to stereotype people?\n\nI'm against stereotyping people as well, but I think you're taking it to an extreme that doesn't match what I've learned in college. And in my studies, I learned things that had explanatory power for various things in East Asian cultures, which I found interesting. But you seem to be trying to shame me for learning about things that have explanatory power for things in East Asian culture. It seems weird to me.", "is_submitter": false, "distinguished": null, "created_utc": 1626747468.0, "parent_id": "t1_h5tl50e", "replies": [{"author": "DDumpTruckK", "id": "h5ty30r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": ">more common tend to\n\nThere is no value in these words when you do not define them.  If you were to define them you would find that they require so many caveats and footnotes there is no purpose to claiming them in the first place.\n\n>I'm actually saying which is that there are tendencies.\n\nAnd what good is a 'tendency' that doesn't reliably follow a pattern, nor does it reliably map to reality?  What is the point in saying \"Some Asian films follow x tendencies, some US films follow x tendencies too.\" because you've pidgeon holed yourself into that being your claim now.  It's a powerless claim.  It's practically a deepity now.  I mean sure to some extent some Asian movies too follow those tendencies, but only because all movies follow those tendencies.\n\n>So when professors and books taught me that East Asian cultures have tended to value filial piety which came from Confucianism, I should have told them that that statement is inaccurate and serves no purpose other than to stereotype people?\n\nI don't know, I wasn't in your class.  Sounds me like you misunderstood them, or perhaps yes, they should have chosen their words better.  Your statement was initially about 'Asian culture' not 'East Asian culture' as well.  Isn't it weird how you keep getting more specific?  It's almost like you recognize that generalized terms aren't really very helpful.\n\n>And in my studies, I learned things that had explanatory power for various things in East Asian cultures, which I found interesting.\n\nYou're literally stereotyping all of the different cultures in east Asia into one.  How you don't see this is beyond me.  If I said Americans have a tendency to be fat, are I not stereotyping?  I mean sure, we can agree to some generalized extent that there is a weight problem for many in America, but I'm 6'1\" and I weigh 150 pounds soaking wet.  If you think it's fair to say Americans are fat then my existence makes your statement that much less valuable as an assessment of reality *and* you'd either be excluding me from being American because I'm *not* fat OR you'd be ignoring the fact that there are plenty of Americans who aren't fat in favor of generalizing them as a whole.  Either way, it's not really giving a useful picture, is it?\n\nIf you want to paraphrase Asian culture in a single sentence, then sure, generalize all you want.  Just recognize that your single sentence and massive generalization isn't really communicating anything close to reality.\n\n>But you seem to be trying to shame me for learning about things that have explanatory power for things in East Asian culture.\n\nI'm shaming you for not being more specific when you apparently know better.", "is_submitter": true, "distinguished": null, "created_utc": 1626749548.0, "parent_id": "t1_h5tu3c5", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "Past-Responsibility7", "id": "h5ya3ph", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "on8mn1", "stickied": false, "body": "Western culture means white people, Europeans, or ariens depending on how racist you Are", "is_submitter": false, "distinguished": null, "created_utc": 1626833401.0, "parent_id": "t3_on8mn1", "replies": []}, {"author": "DELETED", "id": "h6bn1oz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "on8mn1", "stickied": false, "body": "Yes, it's the shepherd of the Greek tradition, expressed through the enlightenment.\n\nThe whole equal rights, freedom, etc. thing is purely western culture.", "is_submitter": false, "distinguished": null, "created_utc": 1627093592.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h6bscxd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "So eastern cultures don't have equal rights or freedom?", "is_submitter": true, "distinguished": null, "created_utc": 1627096634.0, "parent_id": "t1_h6bn1oz", "replies": []}]}, {"author": "TesseractToo", "id": "h6clhbt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "on8mn1", "stickied": false, "body": "Thought you might find this interesting, lockdown protesters in Sydney (this was onlt a few hours ago) are equating \"the West\" with anti-mask and anti-vaxx sentiment\n\n[https://youtu.be/t8qdrI3tObI?t=112](https://youtu.be/t8qdrI3tObI?t=112)", "is_submitter": false, "distinguished": null, "created_utc": 1627119326.0, "parent_id": "t3_on8mn1", "replies": [{"author": "DDumpTruckK", "id": "h6cm5em", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "on8mn1", "stickied": false, "body": "LOL.  Perfect.", "is_submitter": true, "distinguished": null, "created_utc": 1627119987.0, "parent_id": "t1_h6clhbt", "replies": []}]}]}