{"title": "Onward to infinite space, to find out new lives, to boldly go where no one has gone before.", "name": "t3_pecc4s", "url": "https://www.reddit.com/gallery/pecc4s", "selftext": "", "score": 7, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/pecc4s/onward_to_infinite_space_to_find_out_new_lives_to/", "id": "pecc4s", "author": "DrivenAssimilator", "link_flair_text": "Other", "num_comments": 17, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630304002.0, "comments": [{"author": "Concrete_Grapes", "id": "hawe34l", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pecc4s", "stickied": false, "body": "Looks like a Jenquai ship from earth and beyond.   \n\n\nMan that was a long time ago.", "is_submitter": false, "distinguished": null, "created_utc": 1630304631.0, "parent_id": "t3_pecc4s", "replies": [{"author": "DrivenAssimilator", "id": "haweby0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #263", "submission": "pecc4s", "stickied": false, "body": "Well, it's an Eternal class multi mission science vessel from Star Trek videogame, Star Trek Online.", "is_submitter": true, "distinguished": null, "created_utc": 1630304823.0, "parent_id": "t1_hawe34l", "replies": [{"author": "Concrete_Grapes", "id": "hawj9qv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pecc4s", "stickied": false, "body": "Was tempted to try that thing when it came out, but i was never able to give up Eve Online.   \n\n\nAnd most of us Eve players that went over there, didnt play nice and caused some nerfs/bans, and i knew i woulda been one of them.", "is_submitter": false, "distinguished": null, "created_utc": 1630308862.0, "parent_id": "t1_haweby0", "replies": [{"author": "DrivenAssimilator", "id": "hawogjg", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #263", "submission": "pecc4s", "stickied": false, "body": "EVE Online is MAAAAAASSIIIIIIVVVVEEEE compared to Star Trek Online. I tried that sometimes, and get completely f-ed in nullsec zones.\n\nStar Trek Online on the other hand has a great storyline and if you are a star trek fan, it's very nice. Some canon ships like U.S.S. Verity, an odyssey class vessel was taken from STO Canon.", "is_submitter": true, "distinguished": null, "created_utc": 1630313381.0, "parent_id": "t1_hawj9qv", "replies": [{"author": "Concrete_Grapes", "id": "haws0xs", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pecc4s", "stickied": false, "body": "I may have to give it a go for the story. I've nerded out on Trek my whole life. Almost got a GF out of it a few years ago, talking at lunch breaks about how she'd write her Trek fan fiction, but i just couldnt get over her total lack of knowledge about Voyager--i just lost all interest when she said \"Was Tuvok the cook?\"--ARGH! no--well, half way, for like an episode, but janeway fixed that... lol.   \n\n\nEve's my game, for sure. I hate null sec. high and low are my jam. If i want pvp i do low sec, faction warfare space, pirate stuff. High sec is where i make the isk to pay for it all.", "is_submitter": false, "distinguished": null, "created_utc": 1630316476.0, "parent_id": "t1_hawogjg", "replies": [{"author": "DrivenAssimilator", "id": "hax5qcq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #263", "submission": "pecc4s", "stickied": false, "body": "I wanted to pick up Elite Dangerous for some times, but couldn't invest over 100 quids for a game. \n\nEVE is great, but for a beginner, it feels so intimidating.", "is_submitter": true, "distinguished": null, "created_utc": 1630326225.0, "parent_id": "t1_haws0xs", "replies": []}]}]}]}, {"author": "thegreatJLP", "id": "hawvwt0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #276", "submission": "pecc4s", "stickied": false, "body": "Need to pick it back up, sounds outside of battle always make me sleepy after a few hours lol", "is_submitter": false, "distinguished": null, "created_utc": 1630319633.0, "parent_id": "t1_haweby0", "replies": [{"author": "DrivenAssimilator", "id": "hax62dr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #263", "submission": "pecc4s", "stickied": false, "body": "Temporal ships are a bit different to play with if you used Intel ship to cloak and flank enemies or Miracle Worker ships where you MAS and NSB then Torpedo Spread III and Beam Overload III enemies.\n\nYou'll have to build up Entropy for a lot which causes physical damage directly.", "is_submitter": true, "distinguished": null, "created_utc": 1630326417.0, "parent_id": "t1_hawvwt0", "replies": []}]}]}]}, {"author": "maniacallyhappy", "id": "hawlryn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #373", "submission": "pecc4s", "stickied": false, "body": "Sorry to burst the bubble, but in order to be able to escape our current little slice of perceiveable universe, we would have to be able to travel at a faster speed than the speed of light.\n\nOur section of the perceiveable universe seems to all be flying in the same direction moving away from the same source location. Whenever we look out into the Universe, we are literally looking into the past as the light that we are finally perceiving is ancient. That ancient energy took millions if years travelling at the speed of light to reach us.The longer it takes us to figure out how to travel at a speed faster than the speed of light, the farther and farther the universe continues to expand, lessening our chances of ever leaving our little section of the universe. \n\nThankfully we have this wonderful little cosmic oasis on Earth, how ever tiny it is compared to the vastness of this Universe.", "is_submitter": false, "distinguished": null, "created_utc": 1630311011.0, "parent_id": "t3_pecc4s", "replies": [{"author": "DrivenAssimilator", "id": "hawokul", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #263", "submission": "pecc4s", "stickied": false, "body": "Thank you, I too am in touch with reality.\n\nBut isn't it nice to slow down a bit, have a few whiskies and play a videogame, enjoy a bit?", "is_submitter": true, "distinguished": null, "created_utc": 1630313485.0, "parent_id": "t1_hawlryn", "replies": []}, {"author": "Alatain", "id": "hax0cvj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pecc4s", "stickied": false, "body": "We will at very least be able to get out into our own Galaxy at our current technology level (if we can get our shit together as a society and start manufacturing in orbit). The Galaxy is a really big place with plenty of places to explore.", "is_submitter": false, "distinguished": null, "created_utc": 1630322864.0, "parent_id": "t1_hawlryn", "replies": [{"author": "maniacallyhappy", "id": "haxpqn6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #373", "submission": "pecc4s", "stickied": false, "body": "If we don't figure out how to clean up after ourselves, there is a high likelihood that we will land lock ourselves to Earth. We will have left enough debris and  orbiting shrapnel that can destroy vessels attempting to even leave orbit. It's funny how pop-culture loves to play with the idea that there is some kind of Galactic force that might induct us into the rest of the universe if we happen to figure out the correct technology to explore the universe, but we're essentially locking our selves away due to our own negligence. \nIt is fun to dream of what it would be like to form a type 1 galactic society. It's funny because for us to be able to survive the rigor of space travel, we really would have to be the equivalent of a Viltrumite from the Amazon show, \"Invincible\".", "is_submitter": false, "distinguished": null, "created_utc": 1630335784.0, "parent_id": "t1_hax0cvj", "replies": [{"author": "Alatain", "id": "hay2wt6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pecc4s", "stickied": false, "body": "While Kessler syndrome is a real problem and we should be tackling it now while we can still get into orbit, it is not insurmountable from the ground if it kicks off. We do have non-space-based options for clearing space debris and could dig our way out again. \n\nAll that said, I don't think we could get to a cohesive galactic society in the best case scenarios if FTL communication remains out of reach. The cultural drift from it taking thousands of years for communications to reach different systems would make legislating such a society nearly impossible. I think the logistics would likely result in a whole lot of smaller (but still vast in terms of what we have now) regions of control. \n\nIn any event I will settle for just getting a decent orbital colony going that can mine asteroids and manufacture shit in space.", "is_submitter": false, "distinguished": null, "created_utc": 1630341284.0, "parent_id": "t1_haxpqn6", "replies": [{"author": "maniacallyhappy", "id": "hay872g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #373", "submission": "pecc4s", "stickied": false, "body": "I appreciate being able to have a more realistic conversation regarding our potential interstellar travel plans pre- light speed travel achievements. I greatly appreciate you and your knowledge on this topic!", "is_submitter": false, "distinguished": null, "created_utc": 1630343470.0, "parent_id": "t1_hay2wt6", "replies": [{"author": "Alatain", "id": "haybau7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pecc4s", "stickied": false, "body": "If you are interested in what we can do with current tech and knowledge Issac Arthur is a great Youtube channel for it. The [upward bound](https://www.youtube.com/watch?v=JgxkilF5XUM&list=PLIIOUpOge0LsGJI_vni4xvfBQTuryTwlU) playlist is a good overview, but he has literally hundreds of hours of content discussing various tangential topics.", "is_submitter": false, "distinguished": null, "created_utc": 1630344753.0, "parent_id": "t1_hay872g", "replies": [{"author": "maniacallyhappy", "id": "haydlmb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #373", "submission": "pecc4s", "stickied": false, "body": "I'll make sure to check him out!\nI know in regards to actual interstellar travel, in regards with being able to scavenge resources from asteroids, instead of operating off of debre being flung at us by Jupiter, the best location to set up a colonies would most likely be within distance of the asteroid belt. \nThe trickiest part ends up being acquisition of water in the void of space seeing how the majority of space has minerals to spare. I've read that it's theorized that Earth acquired a fair bit of its water content from a rogue asteroid. Not sure if it was one of the past 5 mass extinction events that the Earth has cycled through though.\nThe most current travel tech that I'm to date with involves using ionic thrust and catching solar winds. They're both slow to start up, but after a long enough time period they build up like compound interest. In regards to travelling at those velocities though, I do not envy coming up with a solution to the requirement for robust enough material to be able to withstand impact with rogue debris when you're at velocity. We're having problems attempting to detect collisions with autonomous terrestrial driving. Going to be interesting seeing what solutions are available for detecting debris fast enough with a reaction time of a fraction of a second when you're travelling at insane speeds.", "is_submitter": false, "distinguished": null, "created_utc": 1630345709.0, "parent_id": "t1_haybau7", "replies": []}]}]}]}]}]}]}, {"author": "Summonest", "id": "haxkggb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #44 | Classis Veritatus", "submission": "pecc4s", "stickied": false, "body": "what", "is_submitter": false, "distinguished": null, "created_utc": 1630333501.0, "parent_id": "t3_pecc4s", "replies": []}]}