{"title": "The perils of social media", "name": "t3_pj8ne2", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pj8ne2/the_perils_of_social_media/", "selftext": "I’m not a huge “social media” person (I don’t think, at least). I use discord, Snapchat, reddit, and YouTube. At least 3/4 of those - possibly all - are not like Twitter or Tiktok it seems. \n\nSo as someone who doesn’t do social media a ton, I have to know. What is it that makes social media so bad? Specifically the apps that get the worst shit: Tiktok, Instagram, Facebook, and Twitter. \n\nAre there any good things about these social media apps, at least?", "score": 4, "upvote_ratio": 0.83, "permalink": "/r/TheFlyingTree/comments/pj8ne2/the_perils_of_social_media/", "id": "pj8ne2", "author": "DylanowoX", "link_flair_text": "Discussion", "num_comments": 15, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630962764.0, "comments": [{"author": "sweber145", "id": "hbus4cf", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #68", "submission": "pj8ne2", "stickied": false, "body": "I think its mainly the addiction factor. A lot of people get addicted and can’t put it down", "is_submitter": false, "distinguished": null, "created_utc": 1630963019.0, "parent_id": "t3_pj8ne2", "replies": [{"author": "DylanowoX", "id": "hbust0k", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #10", "submission": "pj8ne2", "stickied": false, "body": "Oh yeah. That makes sense with like most of those, especially tiktok it seems.", "is_submitter": true, "distinguished": null, "created_utc": 1630963327.0, "parent_id": "t1_hbus4cf", "replies": [{"author": "sweber145", "id": "hbux8pn", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #68", "submission": "pj8ne2", "stickied": false, "body": "I can tell you from personal experience that tiktok is very addictive. I had it for about a month, and i was using it about 8 hours a day", "is_submitter": false, "distinguished": null, "created_utc": 1630965371.0, "parent_id": "t1_hbust0k", "replies": [{"author": "DylanowoX", "id": "hbvcc1a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #10", "submission": "pj8ne2", "stickied": false, "body": "Reminds me of the time I spent like 11 hours on Reddit, 4 hours on discord, and like 3 hours on this one game all in one day. \n\nCan’t do stuff like that now with school around though lol.", "is_submitter": true, "distinguished": null, "created_utc": 1630972770.0, "parent_id": "t1_hbux8pn", "replies": []}]}]}]}, {"author": "SleepySuper", "id": "hbut37g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #188", "submission": "pj8ne2", "stickied": false, "body": "I only use Reddit myself, so I can’t provide much insight.  I used to enjoy discussion forums on the old BBS systems prior to widespread internet usage and I find Reddit is not all that different at its core.", "is_submitter": false, "distinguished": null, "created_utc": 1630963456.0, "parent_id": "t3_pj8ne2", "replies": [{"author": "penguin_clubber", "id": "hbxbett", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #576", "submission": "pj8ne2", "stickied": false, "body": "Same here. I was pretty fond of WWIV and Synchronet. The forum format was essentially terminal Reddit but local. I met my first real girlfriend through a BBS. Wild times", "is_submitter": false, "distinguished": null, "created_utc": 1631018888.0, "parent_id": "t1_hbut37g", "replies": []}]}, {"author": "usernames_suck_ok", "id": "hbuuoxu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "pj8ne2", "stickied": false, "body": "I hate Facebook, Twitter and Instagram as a person who has tried all of them, and I hate Snapchat in a more detached way, though I have advertised on it a couple of times for my side business. Then when you get to other stuff like TikTok, I barely know what they are.\n\nThe positive to Facebook is it gives me a way to have people I knew back in school at my fingertips if I ever want to reach out to them or see what's up with them. I don't have to rely on phone numbers that change. Aside from that, FB is far too share-y for me. I don't know about now since I don't use it at all now and just simply have an account, but in the past it gave way too much info as a default/against your will and also encouraged this with all of this \"So and so was at xyz restaurant\" type of info. My friends and I used to joke that it was going to start updating everyone whenever we went to the restroom at some point. And people do too much faux flossing on it, just trying really hard to show off or present a positive image of their life.\n\nTwitter is something I don't see the point of. Like, for me, I've basically tweeted to thin air when I used it. People who get a following, I have no idea how they do that. I could easily go on and tweet \"controversial\" opinions about politics and sports, but I don't know if that would get me followers, unless maybe I put half-naked images on my Twitter account. Then again, if I had to do all of that to get followers, then I can imagine losing a job over it at some point. I also just think something is wrong with thinking people care about my opinions to the degree that I'm going to go on Twitter on a regular basis and tweet them to a bunch of followers or to get more followers. Like, my thoughts matter no more than anyone else's, so I keep them to myself until they're solicited. For lack of a better word, many regular Twitter users seem self-important, and their followers encourage that mentality. \n\nInstagram is another one like Twitter, like, how do you get followers without being half-naked? No point for me whatsoever. That's why there are so many \"Instagram models.\"\n\nI will say--a lot of people on Reddit trash LinkedIn and that's social media to some people...to me, it's the best social media, if you consider it social media. It has been huge for my career and salary, and it has helped boost my self-esteem when it comes to my career and feeling imposter syndrome.", "is_submitter": false, "distinguished": null, "created_utc": 1630964193.0, "parent_id": "t3_pj8ne2", "replies": [{"author": "DylanowoX", "id": "hbvbs40", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #10", "submission": "pj8ne2", "stickied": false, "body": "Oh, I see… very informative. Thank you", "is_submitter": true, "distinguished": null, "created_utc": 1630972495.0, "parent_id": "t1_hbuuoxu", "replies": []}]}, {"author": "TSM-", "id": "hbuvo51", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #39", "submission": "pj8ne2", "stickied": false, "body": "It comes down to how much you can curate and filter what content you see and who can see what you say. \n\nDiscord is great for that because you can hang out in private servers and people cannot stalk you. \n\nFacebook unfortunately exposes you to crazy relatives and extended family and stuff unless you specifically make a new account, so it can be kinda toxic. It is also filled with boomers and people post drama stuff on there often, which is why I stopped using it.\n\nTiktok is just funny videos and comment sections aren't important, much like instagram. You can quickly curate what content you want to see and avoid influencers or those dance videos, so it's cool in my books, it is just like vine. The same can be said for instagram, although I do not use it, you can pick who you want to susbcribe to.\n\nTwitter, unfortunately, is the worst. Your offhand tweet can get some random person offended and then get swarmed with negativity, and anyone can see anything you post (unless it is like a followers only type of thing). It's good for keeping tabs on news headlines and announcements and stuff, but time and time again someone will say something somewhat controversial or stupid and get mobbed. Like a joke about being gay (when you yourself are gay) will get misinterpreted as people seek clout and sic their followers on you. For example, a lead AI engineer at Google said that machine learning models are not inherently biased and the problem often arises from the training and dataset used and they got driven off Twitter entirely by \"activists\".", "is_submitter": false, "distinguished": null, "created_utc": 1630964644.0, "parent_id": "t3_pj8ne2", "replies": [{"author": "DylanowoX", "id": "hbvc0ue", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #10", "submission": "pj8ne2", "stickied": false, "body": "Oh man, Twitter sounds fucking horrible.", "is_submitter": true, "distinguished": null, "created_utc": 1630972616.0, "parent_id": "t1_hbuvo51", "replies": []}]}, {"author": "Smaug_themighty", "id": "hbux7h1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #499", "submission": "pj8ne2", "stickied": false, "body": "To me, worse than it being a waste of time is the fact that people tend to get influenced heavily by social media. It’s also what creates polarisation.. people don’t know how to be objective anymore. It’s all about choosing a side and then social media website ONLY feeding you data related to your interest.. so in effective you don’t even see the “other side” of an argument etc..", "is_submitter": false, "distinguished": null, "created_utc": 1630965355.0, "parent_id": "t3_pj8ne2", "replies": [{"author": "DylanowoX", "id": "hbvc4q2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #10", "submission": "pj8ne2", "stickied": false, "body": "Oh yeah, good one! I’ve noticed this too", "is_submitter": true, "distinguished": null, "created_utc": 1630972670.0, "parent_id": "t1_hbux7h1", "replies": []}]}, {"author": "everhardlysmiles", "id": "hbuyajr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #535", "submission": "pj8ne2", "stickied": false, "body": "In my opinion, this is pertaining to my experience on IG* and a bit of TikTok. \n\nALSO* My experience isn’t universal. This is a great topic. Thank you for this. \n\nI just wanna say some stuff real quick.  \n\nI cannot stand TikTok. I tried. But I deleted it within the same hour. It’s loud, there’s too much stimulation for me. It’s abrupt, it’s bright, it’s extremely nonsensical. \n\nDon’t get me wrong I like funny shit (or what I find to be funny) but I personally find most of the shit on TikTok that I come across INADVERTENTLY to be very fucking stupid and infuriating. Although there are some interesting things. Very few to me, I don’t stick around or search of that. I don’t want to be on it. \n\nLike most things I try to take it with a grand of salt. But I hate it. And avoid it. It’s so bad to me cause it advocates stupidity the most, probably up there with FB imo. TikTok creates this culture of pick me, and look at me, and w/e. Shit idk that’s how I feel lmao. \n\nI’m sorry but I can’t find anything good about TikTok. There’s probably one thing maybe. And tbh I don’t want to search for it lol. That app..it’s repulsive to me. \n\nIG: I like fashion and art and shit so it’s cool for that to a certain extent. To find new artists, and new ways of doing things, new clothes (vintage or new), and speak with people irl who are most likely to respond to dms rather than their phones. \n\nI like to post what I find interesting or what catches my eye when I’m out and about. But I don’t go out much lol. And No selfies or pictures of people I know irl. I don’t post as much. And I hate how I FEEL like I need to make it look good. There’s this incessant to make it “look good”. Structure and shit. I’m sick of that shit. I’m over it. I don’t like feeling that way. \n\nI private and public. Deactivate and delete. I have a real like and hate relationship with social media in general. It doesn’t stimulate me in the way that I need. It just looks nice. Good for passing the time, to a certain extent. \n\nThe reels on IG (like tiktok) are a bit annoying. I tend to avoid them. The Explore page is cluttered and riddled with shit, mini screens of shit everywhere. But it’s a lot more tolerable to me than tiktok. Cause I CAN GET OUT OF IT. It’s not the sole purpose of the app. \n\nWhat I dislike about IG is that …fuck idk, people seem way too full of themselves. It reeks of facades, people are very performative, seemingly shallow, stealing ideas, all for likes, for shares, for the fuck of it. Idk. Too many carbon copies of each other, the way some of them think, act, move. I find it a bit eerie and off putting. \n\nIt just seems that way to me and it irritates me. Makes me feel inadequate, confused, and it can be discouraging at times from an artistic perspective. And life for that matter. Perhaps it’s all in my head? Haha. \n\nBut art, photography, and fashion…so I stick around. Although I deleted the app weeks ago. \n\nOnly on Reddit right now. I like it. I can talk about shit that I feel I can’t talk about on my IG stories. I can do that here. \n\nI guess idk that’s all I can say. A generic answer for the good would be: make connections with people and find new things. \n\nThat’s it.", "is_submitter": false, "distinguished": null, "created_utc": 1630965862.0, "parent_id": "t3_pj8ne2", "replies": []}, {"author": "Kelyaan", "id": "hbviwmi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pj8ne2", "stickied": false, "body": "I've just got rid of my last social traditional social media.  \n\n\nTwitter is a shit hole that really puts a taint on humanity.", "is_submitter": false, "distinguished": null, "created_utc": 1630976024.0, "parent_id": "t3_pj8ne2", "replies": []}, {"author": "naivenb1305", "id": "hbw1ye3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pj8ne2", "stickied": false, "body": "It's addictive; you know that each karma pt/ retweet is done by an irl person who likes your content. It can be distracting; switching between so many accounts has really been nerve wracking for me. Possible mental exhaustion; those many accounts all need new ideas for the media figure to continue to rise. I spend a lot of time coming up with plans for my accounts. Emotional attachment; even though accounts are objects, I have grown somewhat attached to some. But this is a folly, an account is simply a reflation on who the owner was when they last updated it. Loss: right as I felt like I had begun to master those things, I became humbled by other people's creative ideas. Now, I have to look back and see what concepts I can borrow.", "is_submitter": false, "distinguished": null, "created_utc": 1630985687.0, "parent_id": "t3_pj8ne2", "replies": []}]}