{"title": "Right to own firearms? Yay or Nay?", "name": "t3_p2uato", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p2uato/right_to_own_firearms_yay_or_nay/", "selftext": "", "score": 32, "upvote_ratio": 0.9, "permalink": "/r/TheFlyingTree/comments/p2uato/right_to_own_firearms_yay_or_nay/", "id": "p2uato", "author": "FalconRelevant", "link_flair_text": "Debate", "num_comments": 309, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1628749992.0, "comments": [{"author": "TesseractToo", "id": "h8mw6fi", "score": 16, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p2uato", "stickied": false, "body": "Depends what you mean by firearms, and I say \"yes' but with many caveats.  \n\n\n1) licensing, making sure you are of sound mind, higher fines for shooting under the influence, etc  \n2) the right gun for the right reason. Hunting rifles for hunting or farm stuff etc, maybe certain shooting ranged can have special guns for target shooting recreation but they are under very special circumstances and you need to do special training certificates to even try the harder guns like semiautomatics.  \n\n\nSo my idea is less regulations than the country I am in and I am not a gun user but I think the country I'm in is over restrictive on a few things.  That having been said, I'm glad of it. There was an incident of some guy a few years ago attempting a shooting but had a shotgun, I think one person was killed and two wounded, the damage done by people in that mindset with military grade weapons is much much worse.", "is_submitter": false, "distinguished": null, "created_utc": 1628760962.0, "parent_id": "t3_p2uato", "replies": [{"author": "Jesus_n_the_T-Rexs", "id": "h8r5wym", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "I agree with you there, I just know that people can’t always trust the state, sometimes we have to defend ourselves, so I would argue for more expansive military grade weapon ownership (my example is that of my family who lived through the Troubles in Ireland)", "is_submitter": false, "distinguished": null, "created_utc": 1628835752.0, "parent_id": "t1_h8mw6fi", "replies": [{"author": "TesseractToo", "id": "h8rfvbh", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p2uato", "stickied": false, "body": "Yeah I honestly don't know what to do in situations like that, I'm privileged in that i haven't had to deal with that. On the other side though, how can someone know if they can trust the people who are protesting the state and building militias? They have zero accountability and that's a bit scarier. Have a look at Africa with the child soldiers.", "is_submitter": false, "distinguished": null, "created_utc": 1628843790.0, "parent_id": "t1_h8r5wym", "replies": [{"author": "Jesus_n_the_T-Rexs", "id": "h8tgkqa", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "African child soldiers is a solid point, but that’s more a product of resource curse, postcolonial systemic dysfunction, ingrained violence, and crippling poverty \n\nThe Irish during the Troubles suffered from all of those bar resource curse, I’d argue that’s why it never fell to the point of mass child soldier use. Of course, it was not unheard of for young teens to pick up arms in some areas", "is_submitter": false, "distinguished": null, "created_utc": 1628881656.0, "parent_id": "t1_h8rfvbh", "replies": []}, {"author": "Jesus_n_the_T-Rexs", "id": "h8tfyts", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "The militia my family were part of was based upon the clan system, it was tied by a law of blood kinship, besides religion that’s all you can trust when the state is trying to kill you", "is_submitter": false, "distinguished": null, "created_utc": 1628881407.0, "parent_id": "t1_h8rfvbh", "replies": []}, {"author": "Jesus_n_the_T-Rexs", "id": "h8tg3q4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "The state also had zero accountability, it answered to itself", "is_submitter": false, "distinguished": null, "created_utc": 1628881463.0, "parent_id": "t1_h8rfvbh", "replies": []}]}]}, {"author": "floofandmemes", "id": "h8nn71l", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Every weapon was military grade at some point, that's an arbitrary condition. Hell, if you wanna be specific, military intermediate cartridge rifles are select fire, so even the guns you're talking about aren't \"military grade.\"\n\nFurthermore, most weapons nowadays are semiautomatic, particularly pistols. Yes, semiautomatics can shoot faster than bolt actions and lever actions, but if your goal is to keep lunatics from having guns that should just be part of the background check process.\n\nLastly, if you need a license for something, then it's not a right.", "is_submitter": false, "distinguished": null, "created_utc": 1628777442.0, "parent_id": "t1_h8mw6fi", "replies": [{"author": "TesseractToo", "id": "h8no4jc", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p2uato", "stickied": false, "body": "\"Right\" is a tricky word I guess because it has so many homonyms. \"Legally entitled\", no. Morally.... yep. And if needing a license takes it away as a right in your mind then no.  \n\n\nAs for the \"military grade\" etc I guess you're right there but I really meant war weapons like what you see in the middle east now. And yeah they are going to have all the kinds but I mean the high grade ones that no one would need solely for tools in peacetime.  \n\n\nI wanted to put my two cents in not play semantics.", "is_submitter": false, "distinguished": null, "created_utc": 1628777854.0, "parent_id": "t1_h8nn71l", "replies": [{"author": "R5Cats", "id": "h8qtgye", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "> I wanted to put my two cents in not play semantics.\n\nUnfortunately \"semantics\" is the favorite game for gun-grabbers. :/ Not saying you are one of course! Just saying that they use language to manipulate and propagandize, not to discuss or inform.\n  \n\"Military grade\" is one of their buzzwords. It's meaningless but it sounds so scary! Their intention is to frighten people into believing actual military weapons are commonplace and used in crimes. They are not. Actual automatic weapons have been used in crimes so rarely it barely is a bump in the stats for the post-WW2 years.", "is_submitter": false, "distinguished": null, "created_utc": 1628827627.0, "parent_id": "t1_h8no4jc", "replies": []}, {"author": "roundearthervaxxer", "id": "h8qy05w", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "weapons that have been created specifically to kill people should be categorically outlawed.", "is_submitter": false, "distinguished": null, "created_utc": 1628830344.0, "parent_id": "t1_h8no4jc", "replies": [{"author": "TesseractToo", "id": "h8r0sei", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p2uato", "stickied": false, "body": "Yeah I live in a country where the police don't carry guns. In a thread similar to this some person was trying to argue that a person with a knife has to be shot because they could throw it.and what should the cop do. I maybe \\*I\\* haven't been trained in that but I'm sure police and social workers have, they were asking the wrong person, but lethal force isn't necessary. Public (and police) that are armed causes unrest and paranoia in a population and putting pressure on a country by, say, destroying the middle class and making a massive wealth gap, you get police who execute on the street before a hearing and people who think they need lethal force at any moment. And mentally ill people and kids that think its a good idea to go on a rampage/spree.\n\nIt's quite sad.", "is_submitter": false, "distinguished": null, "created_utc": 1628832135.0, "parent_id": "t1_h8qy05w", "replies": []}]}]}, {"author": "roundearthervaxxer", "id": "h8qxqdg", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "Extended clips, bump stocks, and assault style weapons that have created specifically for killing humans is how I see military grade. Pistols too for that matter. They have no place in modern society.\n\nMachine guns are illegal outside of specialized ranges. There is a precedent for making dangerous weapons illegal.", "is_submitter": false, "distinguished": null, "created_utc": 1628830178.0, "parent_id": "t1_h8nn71l", "replies": [{"author": "floofandmemes", "id": "h8qyxas", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "\"extended clips\" lmao\n\nAnd you say that as if you can't kill people with any number of other things, including hunting rifles which are usually more powerful to kill the game quicker.\n\nAnd no, machine guns are illegal for people without an FFL and proper licensing if it was manufactured or imported after 1986.", "is_submitter": false, "distinguished": null, "created_utc": 1628830917.0, "parent_id": "t1_h8qxqdg", "replies": [{"author": "roundearthervaxxer", "id": "h8qz7zl", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "Try to be civil please. Many people have died because of extended clips. Just because you can kill with different weapons doesn’t make them all equally as lethal.", "is_submitter": false, "distinguished": null, "created_utc": 1628831109.0, "parent_id": "t1_h8qyxas", "replies": [{"author": "floofandmemes", "id": "h8r03fc", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Nobody's died from \"extended clips.\" The only firearm that holds a clip internally is the US Rifle Cal .30, M1, which has a maximum capacity of 8 rounds, max, and it can't have any more.\n\nAnd yeah, hunting rifles are more lethal. You don't hunt just to give your game a slight bruise.", "is_submitter": false, "distinguished": null, "created_utc": 1628831679.0, "parent_id": "t1_h8qz7zl", "replies": [{"author": "roundearthervaxxer", "id": "h8r0i5h", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "https://en.m.wikipedia.org/wiki/High-capacity_magazine\n\nHigh capacity magazines", "is_submitter": false, "distinguished": null, "created_utc": 1628831946.0, "parent_id": "t1_h8r03fc", "replies": [{"author": "floofandmemes", "id": "h8r3s6q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Magazines aren't clips, buddy. And \"high capacity\" is relative to standard capacity for a given weapon.", "is_submitter": false, "distinguished": null, "created_utc": 1628834199.0, "parent_id": "t1_h8r0i5h", "replies": [{"author": "roundearthervaxxer", "id": "h8s9ywq", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "Gun people love to get tangled up in semantics. It doesn’t make any difference what you call them. Cops, magazines, Assault rifles, “assault style” rifles. Who cares. They are weapons designed to kill people and I believe all of that should be banned. It is ok that you don’t.", "is_submitter": false, "distinguished": null, "created_utc": 1628863859.0, "parent_id": "t1_h8r3s6q", "replies": [{"author": "FireMaker125", "id": "h8ugiaz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "You do know that even bolt action rifles and shotguns can kill, and they are designed to. Guns are always weapons.", "is_submitter": false, "distinguished": null, "created_utc": 1628896397.0, "parent_id": "t1_h8s9ywq", "replies": []}]}]}]}]}]}]}, {"author": "FireMaker125", "id": "h8ugamn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "“Extended clips”. No. It’s called an magazine, not a clip. A clip is a strip of metal which bullets slot into to be pushed into the gun, a magazine contains the bullets that are loaded in. And anyway, extended mags don’t really matter. Larger mags make it harder to carry more. 4 thirty round mags are easier to carry than two 50 round drums (and more reliable). And any weapon can kill. Most guns that people call “assault style weapons” aren’t even assault rifles. AR-15s, for example, are civilian grade rifles. They aren’t as powerful as a military grade M16 or MCX Spear, and they are rarely select fire. They aren’t assault rifles either. An assault rifle is a battle rifle chambered in an intermediate calibre such as 5.56 NATO (and AR doesn’t stand for assault rifle with the AR-15, it stands for Armalite). “Assault-style weapons” really doesn’t make sense either, as any weapon could be used in combat.", "is_submitter": false, "distinguished": null, "created_utc": 1628896299.0, "parent_id": "t1_h8qxqdg", "replies": [{"author": "roundearthervaxxer", "id": "h8ujq23", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "Who cares what it is called. Weapons designed specifically to kill people, especially ones designed to kill many people should be made illegal. It is OK if you disagree.\n\nHopefully, I won't die on this hill.", "is_submitter": false, "distinguished": null, "created_utc": 1628897888.0, "parent_id": "t1_h8ugamn", "replies": [{"author": "FireMaker125", "id": "h8uk1xf", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Literally all weapons are designed to kill people. Any weapon can kill lots of people. All it takes is a psycho and some basic skill to kill people, but 99% of guns owners probably won’t kill people with their guns.", "is_submitter": false, "distinguished": null, "created_utc": 1628898045.0, "parent_id": "t1_h8ujq23", "replies": [{"author": "roundearthervaxxer", "id": "h8unnx2", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "No they absolutely are not. Being able to kill people does not mean designed to commit mass murder. This is a straw man in its most classic sense.", "is_submitter": false, "distinguished": null, "created_utc": 1628899776.0, "parent_id": "t1_h8uk1xf", "replies": []}]}]}]}]}]}, {"author": "roundearthervaxxer", "id": "h8qxbq7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "This is the way", "is_submitter": false, "distinguished": null, "created_utc": 1628829928.0, "parent_id": "t1_h8mw6fi", "replies": []}, {"author": "RiderHood", "id": "h8niyy1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "p2uato", "stickied": false, "body": "I agree with this.  Guns are a problem when they are being used to kill people.  The correct laws and regulations can make sure they are being used only for things like sport shooting and hunting.", "is_submitter": false, "distinguished": null, "created_utc": 1628775518.0, "parent_id": "t1_h8mw6fi", "replies": [{"author": "TesseractToo", "id": "h8noqh7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p2uato", "stickied": false, "body": "YEah even so I think unregulated hunting can cause issues like too much pressure on a population can do all kinds of weird things.\n\nI think trophy hunting needs more regulation for example- so many generations of killing the strongest and must beautiful bucks with the largest antlers has to have been causing change in natural selection, for example. In Africa this can be seen in elephants where the elephants are growing up with smaller or no tusks. And whales aren't growing to the size they used to (although they might if they can live out their entire life spans, this will be interesting now they are tagging and watching them)", "is_submitter": false, "distinguished": null, "created_utc": 1628778116.0, "parent_id": "t1_h8niyy1", "replies": []}, {"author": "dashingThroughSnow12", "id": "h8nydrx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p2uato", "stickied": false, "body": "🤨\n\n> Guns are a problem when they are being used to kill people.\n\n🙋If a man is about to kidnap a woman and she shoots him, guns seem to be a solution in that scenario and not a problem.", "is_submitter": false, "distinguished": null, "created_utc": 1628782199.0, "parent_id": "t1_h8niyy1", "replies": [{"author": "RiderHood", "id": "h8ojpg9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "p2uato", "stickied": false, "body": "The “good guy with a gun” argument is ridiculous (which essentially this is). Bad guys with guns are a problem, yes, but in the vast majority of these situations, the bad guy wins. Very rarely does a gun actually a) protect the good people and b) result in fewer lives lost. \n\nIf a woman is being overpowered by a man, what makes you think the man isn’t going to get ahold of the gun? What if the man has his own gun? What right does she have to kill him?\n\nGuns are a problem. Bad guys with guns are a problem. Having more guns is not going to fix that problem.", "is_submitter": false, "distinguished": null, "created_utc": 1628790800.0, "parent_id": "t1_h8nydrx", "replies": [{"author": "FireMaker125", "id": "h8ugslm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "She has the right of self defence. If someone is attacking you, and you shoot them dead, you have defended yourself against violence or death and you aren’t in the wrong.", "is_submitter": false, "distinguished": null, "created_utc": 1628896528.0, "parent_id": "t1_h8ojpg9", "replies": []}, {"author": "dashingThroughSnow12", "id": "h8ose26", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p2uato", "stickied": false, "body": "> Very rarely does a gun actually a) protect the good people and b) result in fewer lives lost. \n\nTo (a) it's about as rare as for someon to experience gun crime.\n\nTo (b) that's irrelevant.\n\n> If a woman is being overpowered by a man, what makes you think the man isn’t going to get ahold of the gun?\n\nThe premise is a bit wonky. The conclusion is even odder.\n\nLife isn't like the movies. Someone with a knife or gun is deadly. What you describe can happen but it isn't a trivial task.\n\n> What if the man has his own gun?\n\nGuns are equalizers.\n\nThe average man is around 15 kg larger and 130mm taller than the average woman in Canada. Size isn't everything but it is a major advantage.\n\nA gun is just as effective at a 200 kilo man as a 50 kilo woman.\n\nTo answer your question of \"what if the man has his own gun\", at least now they are on somewhat equal footing.\n\n> What right does she have to kill him?\n\nPeople tend not to be single offenders.\n\nI don't think she has an obligation to let him harm her without consequence and a duty to impede him harming others.", "is_submitter": false, "distinguished": null, "created_utc": 1628794554.0, "parent_id": "t1_h8ojpg9", "replies": [{"author": "RiderHood", "id": "h8rrzts", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "p2uato", "stickied": false, "body": "My whole point is boiled down to this: Good guys don’t need guns if bad guys don’t have guns.", "is_submitter": false, "distinguished": null, "created_utc": 1628853518.0, "parent_id": "t1_h8ose26", "replies": []}]}, {"author": "R5Cats", "id": "h8qtpvm", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "3,000,000 lawful uses of guns in self-defense every year in America disagrees with your nonsense.  \nThere's many thousands of stories of people lawfully defending themselves and their loved ones with pistols (usually) or other guns. These never \"make the news\" because the Media no longer talks about news, it is purely about propaganda.\n\n>What right does she have to kill him?\n\nAre you serious? What right does he have to rape her? SHE has a right to protect herself by any means necessary.", "is_submitter": false, "distinguished": null, "created_utc": 1628827769.0, "parent_id": "t1_h8ojpg9", "replies": [{"author": "vook485", "id": "h989xu0", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p2uato", "stickied": false, "body": ">3,000,000\n\n>These never \"make the news\"\n\nHow many of those three million cases are newsworthy? How many deaths or bloody injuries resulted?\n\n>because the Media no longer talks about news, it is purely about propaganda.\n\nIn a lot of cases, yes. But in this case an even bigger factor is exemplified by the saying \"if it bleeds, it leads\". If no one's injured from a stopped crime, then it's simply not an exciting story.", "is_submitter": false, "distinguished": null, "created_utc": 1629160707.0, "parent_id": "t1_h8qtpvm", "replies": [{"author": "R5Cats", "id": "h998kfg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "> How many deaths or bloody injuries resulted?\n\nNone for most of them, which is terrific. It is almost always a criminal getting injured or killed, which doesn't fit the agenda and thus is also \"not news\" too.\n\nIt isn't exciting when a Mom drifts 2 of 3 home invaders who were breaking into a locked bathroom where she and her children were hiding? They had the run of the house, but still were kicking in the door, no doubt to rape both her and her children too.  \nNot news though! Makes local news sure, but not a peep nationally.", "is_submitter": false, "distinguished": null, "created_utc": 1629178795.0, "parent_id": "t1_h989xu0", "replies": [{"author": "vook485", "id": "h9c8pm5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p2uato", "stickied": false, "body": "If that happens 3 million times a year, then a station dedicated to covering only that type of story, and every case of that story would have 10.5 seconds to cover each one. That's not national news; it's a statistic.\n\nIf the statistic changes significantly, then that's news. But reporting on the status quo (no matter how exciting and/or fucked up) is not news. Maybe it should still be covered under journalism (I'd love for some major media sources to do some series on statistical literacy, particularly base rate fallacies), but it's really not news without something truly notable to make it stand out from the other 2394 times that has happened or will happen that week.", "is_submitter": false, "distinguished": null, "created_utc": 1629237192.0, "parent_id": "t1_h998kfg", "replies": [{"author": "R5Cats", "id": "h9cabam", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "There are sites dedicated to reporting self-defense news items. As I said: local papers and stations will carry them sometimes, but \"George Floyd\" level of attention? NEVER!\n\nActually, the most famous self-defense shooting of all time? Zimmerman vs Martin! 😏 But the gun-grabbers refuse to believe the facts or the courts...\n\nIt's the same as traffic accidents: those don't make national news unless it's a 30 car pile-up, and even then.\n\nThe point is that the few studies done on it show 1 million a year easily and as many as 5 million annually. The vast majority of them do not have a shot fired. Also few actually get reported to police, and different States will count them or not, making it even fuzzier.\n\nIf the Media had a \"ticker\" counting automobile injuries and deaths every day? People would *lose their minds* over the carnage. The one-sided reportage of \"gun violence\" is the problem, eh?", "is_submitter": false, "distinguished": null, "created_utc": 1629237930.0, "parent_id": "t1_h9c8pm5", "replies": []}]}]}]}]}]}]}]}]}, {"author": "TopHatGuy413", "id": "h8ml8s8", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Druid #18", "submission": "p2uato", "stickied": false, "body": "Yay. I will admit there are a bunch of morons though.", "is_submitter": false, "distinguished": null, "created_utc": 1628751642.0, "parent_id": "t3_p2uato", "replies": [{"author": "FalconRelevant", "id": "h8mmblw", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Yeah, there should be proper training and license to own firearms, and a general test to measure intellect and responsibility.", "is_submitter": true, "distinguished": null, "created_utc": 1628752535.0, "parent_id": "t1_h8ml8s8", "replies": [{"author": "BasilDream", "id": "h8n8ldy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #163 | Classis Veritatus", "submission": "p2uato", "stickied": false, "body": "I know several people who could pass that test but should not own a firearm.  There are plenty of people who are perfectly fine with them, but it seems impossible to keep them out of the hands of those who aren't.  There is no easy answer to this.  Also people who are fine now but may not be ok down the line.  This is a tough one!", "is_submitter": false, "distinguished": null, "created_utc": 1628770061.0, "parent_id": "t1_h8mmblw", "replies": [{"author": "LoriLuckyHouse", "id": "h8p0jcf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "I agree with all of this. My father owns firearms. He’s also a “functional” alcoholic who could easily pass any test he needed to. He was a lifelong teacher while also owning a business on the side. He is a very different person during the day than he is at night…and one of those people should NOT have access to firearms. Throw my mentally ill brother and mother into the mix, and I’m surprised no one got shot in my home (guns we’re definitely pointed at each other at various times.)", "is_submitter": false, "distinguished": null, "created_utc": 1628798033.0, "parent_id": "t1_h8n8ldy", "replies": []}]}, {"author": "R5Cats", "id": "h8qu686", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "All those things are unconstitutional in the USA.   \nThey are used primarily to illegally stop law-abiding citizens from owning a firearm. They do *absolutely nothing* to stop criminals from having them.  \nFirearm laws were started by Democrats long ago to prevent Blacks from getting them. Exactly like Jim Crow \"voting laws\" they (bad laws) were never intended to protect anyone.", "is_submitter": false, "distinguished": null, "created_utc": 1628828033.0, "parent_id": "t1_h8mmblw", "replies": []}]}]}, {"author": "TheDeadMonument", "id": "h8nn6ck", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "p2uato", "stickied": false, "body": "Personally I think gun ownership is a straw man used as a point of anger to sway voters. \n\nNothing more.\n\nThere are literally MILLIONS of responsible *licenced* gun owners in the US that have never shot anyone. Yet bad actors get sensationalized to push a narrative. \n\nOh, and since big banks and hedge funds are starting to making buying a single family home impossible, I guess we should start talking about how being a renter is so much better. Oh right, that started happening already, too.\n\nStop assisting in pushing a narrative.", "is_submitter": false, "distinguished": null, "created_utc": 1628777434.0, "parent_id": "t3_p2uato", "replies": [{"author": "Financial-Process-86", "id": "h8nydo6", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #268", "submission": "p2uato", "stickied": false, "body": "Yes. Agreed.", "is_submitter": false, "distinguished": null, "created_utc": 1628782198.0, "parent_id": "t1_h8nn6ck", "replies": []}, {"author": "solarshado", "id": "h8vm71s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #459", "submission": "p2uato", "stickied": false, "body": "Agreed.\n\nWhile I *do* think we should probably try do something about the high rate of gun-related crime in the US, I'm not entirely convinced that \"regulate gun ownership\" is necessarily the solution. Nor do I think it's a problem that deserves as much airtime (literal and metaphorical) as it often gets; there are far bigger problems, in the US and around the world, that unfortunately get pushed aside.", "is_submitter": false, "distinguished": null, "created_utc": 1628918057.0, "parent_id": "t1_h8nn6ck", "replies": [{"author": "TheDeadMonument", "id": "h8vma3o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "p2uato", "stickied": false, "body": "You're absolutely right.", "is_submitter": false, "distinguished": null, "created_utc": 1628918114.0, "parent_id": "t1_h8vm71s", "replies": []}]}]}, {"author": "FlipSchitz", "id": "h8n9oey", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #237", "submission": "p2uato", "stickied": false, "body": "I have no idea.  I own firearms and I like them. I like to fire them at targets and cans and make things go kablooey!  I have hunted a few times and enjoyed the experience.  But I feel like such a hypocrite because overall, they seem to detrimental to society. I think that background checks are effective only to assess one's past.  I'm sure there a quite a lot of people out there who are one horrible day away from harming themselves or someone else.  The whole defending your country thing is romantic and all, but it seems unrealistic and more of a fantasy that people use as leverage.", "is_submitter": false, "distinguished": null, "created_utc": 1628770695.0, "parent_id": "t3_p2uato", "replies": [{"author": "DELETED", "id": "h8nwryd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628781532.0, "parent_id": "t1_h8n9oey", "replies": [{"author": "FlipSchitz", "id": "h8oof3k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #237", "submission": "p2uato", "stickied": false, "body": "Well said, my person!", "is_submitter": false, "distinguished": null, "created_utc": 1628792718.0, "parent_id": "t1_h8nwryd", "replies": []}]}]}, {"author": "floofandmemes", "id": "h8nlw3c", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Yay.\n\nA disarmed populace is not but slaves.", "is_submitter": false, "distinguished": null, "created_utc": 1628776856.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "QueenOfNights", "id": "h8ml6q4", "score": 25, "subreddit": "TheFlyingTree", "author_flair": "Seeker #144", "submission": "p2uato", "stickied": false, "body": "Yes under proper training, individual testing and lisence.", "is_submitter": false, "distinguished": null, "created_utc": 1628751596.0, "parent_id": "t3_p2uato", "replies": [{"author": "yrogerg123", "id": "h8n89nr", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "p2uato", "stickied": false, "body": "If it were treated similar to a driver's license, I would have no problem with gun ownership. I'd probably require yearly renewal with a gun safety course requirement.\n\nI also think some form of gun insurance should be mandatory.\n\nI'd also require stricter background checks.\n\nIf I thought all gun owners were responsible, I wouldn't really have a problem.", "is_submitter": false, "distinguished": null, "created_utc": 1628769866.0, "parent_id": "t1_h8ml6q4", "replies": [{"author": "DaBaiterr", "id": "h8oc06k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #132", "submission": "p2uato", "stickied": false, "body": "Yeah this actually seems very reasonable especially that it would be impossible to take away everyone’s guns in America. So having training and having to take a test to use it would be good. \nIt seems like a lot of people use it out of no where sometimes not thinking about the situation they are in.\nI’d definitely feel much safer like that.", "is_submitter": false, "distinguished": null, "created_utc": 1628787719.0, "parent_id": "t1_h8n89nr", "replies": []}, {"author": "QueenOfNights", "id": "h8nbl15", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #144", "submission": "p2uato", "stickied": false, "body": "I agree, It's not the guns that's the problem but rather the owners. If there were stricter measurements for ownership then it would help big time.", "is_submitter": false, "distinguished": null, "created_utc": 1628771766.0, "parent_id": "t1_h8n89nr", "replies": []}, {"author": "havens1515", "id": "h8nzo10", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "This exactly. You have to jump through hoops to be able to drive a car, in part because it is a dangerous tool. \n\nHowever, in most parts of the US (if not ALL of the US) it's much easier to legally obtain a gun than it is to legally drive a car. Despite the fact that the **only** use for a gun is as a dangerous weapon.\n\nIf they treated obtaining a gun the same way as they treat obtaining a driver's license and car, I'd be OK with it.", "is_submitter": false, "distinguished": null, "created_utc": 1628782731.0, "parent_id": "t1_h8n89nr", "replies": [{"author": "modernzen", "id": "h8o1z51", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #46", "submission": "p2uato", "stickied": false, "body": "Not to split hairs, but guns can also be used for sport such as target practice or clay pigeon shooting, which I find incredibly fun as someone who has no interest in purchasing a gun for myself. Obviously these sports do not remove the danger behind the weapons, but it's not like people are only buying guns to go shoot other people.", "is_submitter": false, "distinguished": null, "created_utc": 1628783680.0, "parent_id": "t1_h8nzo10", "replies": [{"author": "havens1515", "id": "h8o2o76", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "It is still a dangerous weapon. If aimed improperly, or if the bullet ricochets, or if any of hundreds of other things go wrong, someone is getting injured or killed. And it's main purpose is to kill. Either to kill humans or to kill animals, the purpose of a gun is to kill.", "is_submitter": false, "distinguished": null, "created_utc": 1628783964.0, "parent_id": "t1_h8o1z51", "replies": []}]}, {"author": "R5Cats", "id": "h8qw071", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "Self defense is not \"dangerous\" except to criminals.   \nAll the laws in the world don't stop criminals from having guns, it's culture that prevents gun crime.", "is_submitter": false, "distinguished": null, "created_utc": 1628829122.0, "parent_id": "t1_h8nzo10", "replies": [{"author": "havens1515", "id": "h8rhyys", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Oh it's not dangerous?\n\nThis man gave me a look, which made me feel threatened. I shot him in self defense.\n\nR5Cats told me that Self defense is not dangerous. I shot him because his words made me feel threatened. It was self defense.\n\nNot to mention that deadly force is usually not necessary as a means of self defense. And a gun is ALWAYS deadly force. Even if you shoot the person in the arm or leg, which is generally less lethal, if you hit an artery or something suddenly it is lethal.\n\nSelf defense sure as hell is dangerous, in any form. Especially so when a gun is involved.", "is_submitter": false, "distinguished": null, "created_utc": 1628845625.0, "parent_id": "t1_h8qw071", "replies": [{"author": "R5Cats", "id": "h8se8pm", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "> This man gave me a look, which made me feel threatened. I shot him in self defense.\n\nThen you're an idiot and you go to jail. Psychopaths should not have guns, aren't you saying that? \n\nShoot them in the arm or leg? Dear Lord, stop watching Hollywood westerns and go educate yourself. You aim for center mass. Even then you're highly likely to miss so the more training and bullets you have the better.   \n\nSelf defense is better than 2 home invaders cutting your children's throats after tying you to a chair, or do they have 'a right' to do that too?", "is_submitter": false, "distinguished": null, "created_utc": 1628866086.0, "parent_id": "t1_h8rhyys", "replies": []}, {"author": "FireMaker125", "id": "h8uhk5n", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Dude, getting shot in the arm or leg is incredibly deadly. The bullet can easily hit an artery and cause you to bleed out. You always aim for center mass. If somebody pulls out a knife and threatens me and I have a gun, I will shoot them. Nearly anything can be deadly. And if you shoot someone because they gave you a mean look, you’re a dumbass you should go to jail.", "is_submitter": false, "distinguished": null, "created_utc": 1628896878.0, "parent_id": "t1_h8rhyys", "replies": [{"author": "havens1515", "id": "h8uhrrk", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Good thing you both missed the point.", "is_submitter": false, "distinguished": null, "created_utc": 1628896976.0, "parent_id": "t1_h8uhk5n", "replies": [{"author": "FireMaker125", "id": "h8uir5c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "What point? You made the point that self defence is dangerous to the criminal, because a moron may shoot an innocent person, and that somehow shooting them in the leg isn’t deadly force (despite being deadlier than center mass). Self defence is deadly because you could lose your life, and an attacker could lose their life, because a death can happen in a situation like that. It doesn’t matter whether both of you have baseball bats, or knifes, or guns, you could still die. Sometimes hurting someone may be required to save yourself from injury or death.", "is_submitter": false, "distinguished": null, "created_utc": 1628897434.0, "parent_id": "t1_h8uhrrk", "replies": []}]}]}]}]}]}, {"author": "TheOneTrueWigglyBoi", "id": "h8njbpq", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "The issue is in the current state of things, its about a gun being a right where a car is not, so it should be illegal to restrict it or say you have to prove you deserve a right.", "is_submitter": false, "distinguished": null, "created_utc": 1628775684.0, "parent_id": "t1_h8n89nr", "replies": [{"author": "yrogerg123", "id": "h8nkg4i", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "p2uato", "stickied": false, "body": "If we were smart we would remove the second amendment. The right to individual gun ownership makes no sense in a world with ICBMs, stealth bombers, tanks, and drones. Gun ownership should be a privilege, not a right. I don't have a problem with individuals owning a gun if they know how to care for it safely. But I strongly object to this second amendment worship. I haven't heard a good case for the right to bear arms in modern society that doesn't use the second amendment as its foundation. Other than the odd fact that a few pre-industrial humans thought it was a good idea, why should it be a right?", "is_submitter": false, "distinguished": null, "created_utc": 1628776201.0, "parent_id": "t1_h8njbpq", "replies": [{"author": "floofandmemes", "id": "h8nnqui", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Why should it not be a right? Guns are an equalizer, and can discourage harmful crimes. The government is not the only group of people that harm you. If someone else has a weapon and you don't, and that other person has nefarious intentions with it, that other person now has power over you. If you have a weapon as well, you at least have a chance, even better if that weapon doesn't require physical strength.", "is_submitter": false, "distinguished": null, "created_utc": 1628777686.0, "parent_id": "t1_h8nkg4i", "replies": [{"author": "yrogerg123", "id": "h8o64hf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "p2uato", "stickied": false, "body": "Cool, fine. Learn how to use and care for it properly, get licensed for it properly, and buy it through a licensed dealer. And have a background check so we know you don't have a history of mental illness or violence.", "is_submitter": false, "distinguished": null, "created_utc": 1628785372.0, "parent_id": "t1_h8nnqui", "replies": []}]}, {"author": "TheOneTrueWigglyBoi", "id": "h8nle6d", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "That is a horrible thought process right there. It does make sense, think right now of the countless coups or current civil wars going on in the world. In that would with icbms stealth bombers and all that people still fight, think back to the beginning of the US, we were out gunned, out manned, and were going against the world's biggest super power at the time and still kicked their ass. You'd be surprised what people are capable of. The fact that most argument are based on the 2a is right, there is a reason it is that way, thats like asking someone to explain why we need the 1a or should free speech just be a right, its not that complicated, but you do realize if they took away all the guns or restricted them like a lot of people propose what would happen if the next day they said that free speech isn't a thing anymore and you could be jailed for saying anything the government doesn't like. What would you do? You no longer have the tools to protect yourself or your rights. The 2a creates a power balance that keeps the government for the people so they don't go against the people, its the same concept as the whole world every day pointing nukes at each other, this stalemate with the threat of annihilation keeps everyone in line. In the US its just a smaller scale version. It's crazy to me that in the US we have people that want to take away their own rights and the rights of others all because they choose not to exercise it.\n\n\nEdit, wanted to add one more point, even if you say the citizens of the US are still outmatched and would loose another civil war, there are some of us that would rather die free than live under tyranny. No matter if you think that's a dumb ideology or not its something I and a lot of other people feel strongly about. That's not something you can change or dismiss all because you don't feel the same way.", "is_submitter": false, "distinguished": null, "created_utc": 1628776631.0, "parent_id": "t1_h8nkg4i", "replies": [{"author": "yrogerg123", "id": "h8o5i22", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "p2uato", "stickied": false, "body": "We'll never have the tools to protect our rights. I'm not sure what people think a few guns will do if the tanks start rolling in or if drones start dropping bombs. And the US govt will always have force superiority, in a lot of ways having a handgun against the state is worse than not having one, if that time ever comes. This hero complex is not healthy and not useful.", "is_submitter": false, "distinguished": null, "created_utc": 1628785124.0, "parent_id": "t1_h8nle6d", "replies": [{"author": "TheOneTrueWigglyBoi", "id": "h8ofdtm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Yes we do, once again we have won with inferior firepower before, but even so you just gave a reason why they shouldn't be restricted. That way we can stand on even ground with a higher power.  I will go down fighting, you will roll over and take it because you are a submissive pussy.  It's not a hero complex, it's doing what you think is right for the betterment of your people, you just don't have it in you to fight, you are too settled into complacency. We see the bigger picture, you just are a yes man.", "is_submitter": false, "distinguished": null, "created_utc": 1628789078.0, "parent_id": "t1_h8o5i22", "replies": []}]}, {"author": "floofandmemes", "id": "h8nmau2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Ah, the useless no circlejerk rule as anyone who disagrees with a moronic democrat position on gun ownership gets downvoted.", "is_submitter": false, "distinguished": null, "created_utc": 1628777041.0, "parent_id": "t1_h8nle6d", "replies": []}, {"author": "AndrewIsOnline", "id": "h8nlqhp", "score": -4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p2uato", "stickied": false, "body": "Lol.", "is_submitter": false, "distinguished": null, "created_utc": 1628776786.0, "parent_id": "t1_h8nle6d", "replies": [{"author": "TheOneTrueWigglyBoi", "id": "h8nt4wm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Thank you to your worthwhile addition to the discussion", "is_submitter": false, "distinguished": null, "created_utc": 1628779999.0, "parent_id": "t1_h8nlqhp", "replies": [{"author": "AndrewIsOnline", "id": "h8nxg87", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p2uato", "stickied": false, "body": "Do you really think that peashooters will be able to fight back against government?\n\nOr that a populace without access to guns couldn’t manufacture guns", "is_submitter": false, "distinguished": null, "created_utc": 1628781810.0, "parent_id": "t1_h8nt4wm", "replies": [{"author": "TheOneTrueWigglyBoi", "id": "h8ny6qp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "On the first note, yes its happened before, refer back to the revolutionary War where a few rebels kicked the world superpower at the times ass.\n\nYes I know how to build a gun and could do so pretty easily, know quite a few other people who can do the same, you don't seem to know anything about firearms to understand how thats possible.\n\nIn short you could sum up your comment by changing it to \"im a quivering submissive pussy please do whatever you want to me gov\"\nId rather die free and fighting than live in tyranny, there is a difference between surviving and living.", "is_submitter": false, "distinguished": null, "created_utc": 1628782117.0, "parent_id": "t1_h8nxg87", "replies": [{"author": "FirstUser", "id": "h8o3qhk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #127", "submission": "p2uato", "stickied": false, "body": "> yes its happened before, refer back to the revolutionary War where a few rebels kicked the world superpower at the times ass.\n\nYou only forgot one *small detail*: both sides had the same kind of weapons.", "is_submitter": false, "distinguished": null, "created_utc": 1628784400.0, "parent_id": "t1_h8ny6qp", "replies": []}, {"author": "AndrewIsOnline", "id": "h8o2q2x", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p2uato", "stickied": false, "body": "I know plenty about firearms, it seems you don’t know anything about sarcasm.\n\nWhat part of freedom is shooting up schools and nightclubs? \n\nYour freedom ends when it tramples other people’s right to life liberty and pursuit of happiness. \n\nJust because some old ass paper says you are supposed to have guns under a militia doesn’t mean every inbred undereducated redneck or military cosplayer needs a gun with no regulations \n\nKids have to live with the fear of their schools getting shot up and you want to talk about tyranny? How is that living in freedom for those kids?", "is_submitter": false, "distinguished": null, "created_utc": 1628783984.0, "parent_id": "t1_h8ny6qp", "replies": []}]}]}]}]}]}]}]}]}, {"author": "floofandmemes", "id": "h8nmfp7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "It says \"right.\"\n\nIt's not a right if you create prerequisites like licenses.\n\nIn other words, you just said \"yes right to own firearms, as long as it's not a right, so no.\"", "is_submitter": false, "distinguished": null, "created_utc": 1628777103.0, "parent_id": "t1_h8ml6q4", "replies": [{"author": "dashingThroughSnow12", "id": "h8ny2sj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p2uato", "stickied": false, "body": "Me playing devil's advocate for a second.\n\nSome people would say housing is a right. In Canada, moving to a different province is a right. Some countries have added internet access as a right.\n\nHouses require permits and code following. Taxes.\n\nDuring COVID, moving was hindered.\n\nTraditionally, the right to vote was tied to men being required to respond to calls to action.\n\nIt seems that at least some things we consider rights do have obligations that restrict them.", "is_submitter": false, "distinguished": null, "created_utc": 1628782071.0, "parent_id": "t1_h8nmfp7", "replies": [{"author": "floofandmemes", "id": "h8nzrdv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Not according to the SCOTUS. And I might suggest that there is a difference between a natural right, something you have without government restriction, and an entitlement, or \"government provides 'right'\", as internet and housing would be if they were ruled to be rights. The right to move also has a natural restriction that where you move to would have to approve of your stay, as they're the people who live there.\n\nFurthermore, just because there are some restrictions on some rights doesn't make those restrictions justified. Many regions in the US used to have poll taxes, but they have been done away with on the basis that they are a prerequisite to a right, and it's much better that they don't come back.", "is_submitter": false, "distinguished": null, "created_utc": 1628782769.0, "parent_id": "t1_h8ny2sj", "replies": []}, {"author": "R5Cats", "id": "h8qwj03", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "Housing is not a \"right\" you have to pay for it.  \nGun *ownership* is a right in the USA, but you still have to pay for your own guns, eh?  \nVoting is NOW a universal right, but it wasn't always the case.", "is_submitter": false, "distinguished": null, "created_utc": 1628829435.0, "parent_id": "t1_h8ny2sj", "replies": []}]}, {"author": "FirstUser", "id": "h8o1smi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #127", "submission": "p2uato", "stickied": false, "body": "Can you point me to a definition of \"right\" that excludes needing a license?", "is_submitter": false, "distinguished": null, "created_utc": 1628783606.0, "parent_id": "t1_h8nmfp7", "replies": [{"author": "floofandmemes", "id": "h8o2y9u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Well if you need permission to do it then it's not a right, it's a privilege. You don't have to ask for rights, if they're rights, you just have them. This goes especially for natural rights.\n\nRights are not needs nor privileges. This is especially true of natural rights, those rights which you have without the aid or interference of a party outside yourself.", "is_submitter": false, "distinguished": null, "created_utc": 1628784076.0, "parent_id": "t1_h8o1smi", "replies": []}, {"author": "ev3nt_horiz0n", "id": "h8o581p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #113", "submission": "p2uato", "stickied": false, "body": "Spewing some nonsense opinion onto the internet.", "is_submitter": false, "distinguished": null, "created_utc": 1628785012.0, "parent_id": "t1_h8o1smi", "replies": []}, {"author": "R5Cats", "id": "h8qwtcw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "Free speech? Voting? Pursuit of happiness?  \nI can go on... there's a lot actually.  \n\nGun Licenses are not used for the safety of society, they're used to stop lawful citizens from exercising their rights. And for graft and corruption by government officials of course.  \n\nCriminals will always have guns, there is literally no way on Earth to stop a determined criminal from acquiring firearms. The only defense is self-defense. The police are 15 minutes away, if you can call for them...", "is_submitter": false, "distinguished": null, "created_utc": 1628829613.0, "parent_id": "t1_h8o1smi", "replies": []}]}, {"author": "Espumma", "id": "h8oeoz5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #12", "submission": "p2uato", "stickied": false, "body": "The current American right to bear arms can already be said to have qualifiers. Making prerequisites to a right is just being more specific about what 'a well regulated militia' actually means.  \n\nedit: Instead of downvoting me, I'd rather you explain to me how I'm wrong.", "is_submitter": false, "distinguished": null, "created_utc": 1628788803.0, "parent_id": "t1_h8nmfp7", "replies": [{"author": "floofandmemes", "id": "h8ou0ju", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Going by the wording, that's not really a qualifier. It doesn't instruct or prohibit any legal action.", "is_submitter": false, "distinguished": null, "created_utc": 1628795282.0, "parent_id": "t1_h8oeoz5", "replies": []}]}, {"author": "N0rthWind", "id": "h8o7m4m", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #74", "submission": "p2uato", "stickied": false, "body": "In that case as a \"no questions asked right\" then definitely a hard no.", "is_submitter": false, "distinguished": null, "created_utc": 1628785967.0, "parent_id": "t1_h8nmfp7", "replies": [{"author": "floofandmemes", "id": "h8o82vf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Rights can be revoked for criminals, hence why prisons and background checks exist.", "is_submitter": false, "distinguished": null, "created_utc": 1628786153.0, "parent_id": "t1_h8o7m4m", "replies": [{"author": "N0rthWind", "id": "h8o9i92", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #74", "submission": "p2uato", "stickied": false, "body": "Evidently it's not working very well though", "is_submitter": false, "distinguished": null, "created_utc": 1628786723.0, "parent_id": "t1_h8o82vf", "replies": [{"author": "floofandmemes", "id": "h8o9zci", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Well we don't have any checks for mental health implemented in the US and frankly a lot of people in this country aren't in a good place emotionally speaking.\n\nCertainly we have problems, but unfortunately they won't ever be addressed, since fixing problems normal people face doesn't benefit the people in power or the people with lots of money.", "is_submitter": false, "distinguished": null, "created_utc": 1628786912.0, "parent_id": "t1_h8o9i92", "replies": [{"author": "N0rthWind", "id": "h8oaa11", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #74", "submission": "p2uato", "stickied": false, "body": "True but until then, maaaaybe stop with the guns? :)\nSeems to work great for everyone else", "is_submitter": false, "distinguished": null, "created_utc": 1628787030.0, "parent_id": "t1_h8o9zci", "replies": [{"author": "floofandmemes", "id": "h8oazpj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "America has more guns than people, that's not a very feasible solution here.", "is_submitter": false, "distinguished": null, "created_utc": 1628787316.0, "parent_id": "t1_h8oaa11", "replies": [{"author": "N0rthWind", "id": "h8ocmg1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #74", "submission": "p2uato", "stickied": false, "body": "Yeah okay that's fair enough", "is_submitter": false, "distinguished": null, "created_utc": 1628787967.0, "parent_id": "t1_h8oazpj", "replies": []}]}]}]}]}]}]}]}]}, {"author": "DoglessDyslexic", "id": "h8moa1k", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p2uato", "stickied": false, "body": "I don't think that's a question that has a simple yes or no answer.  Considerations like \"do I have a history of violence\", or \"am I mentally competent\", or \"have I had training on the legal ramifications and proper safe operation of firearms\" all should play a role in an answer.", "is_submitter": false, "distinguished": null, "created_utc": 1628754159.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "OscarOzzieOzborne", "id": "h8mupwi", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #121", "submission": "p2uato", "stickied": false, "body": "Yay.", "is_submitter": false, "distinguished": null, "created_utc": 1628759707.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "PenguinInDistress", "id": "h8nlym6", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #156", "submission": "p2uato", "stickied": false, "body": "Of course.", "is_submitter": false, "distinguished": null, "created_utc": 1628776888.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "fastcarsandliberty", "id": "h8nuddx", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #207", "submission": "p2uato", "stickied": false, "body": "Yay!", "is_submitter": false, "distinguished": null, "created_utc": 1628780523.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Financial-Process-86", "id": "h8nyb1m", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #268", "submission": "p2uato", "stickied": false, "body": "Definitely", "is_submitter": false, "distinguished": null, "created_utc": 1628782167.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "robbdire", "id": "h8mos3u", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #112", "submission": "p2uato", "stickied": false, "body": "No need for them where I am, bringing them in would be a bad idea.\n\nIf you mean the US. Active shooter drills in schools should explain why overall it is a bad idea. However the issue isn't guns in and of itself. Other nations have guns and do not have the same problems as the US does. It is something wrong with the US itself (or at least a large amount of people in it.)", "is_submitter": false, "distinguished": null, "created_utc": 1628754586.0, "parent_id": "t3_p2uato", "replies": [{"author": "ctm-8400", "id": "h8n2p9f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "What countries?", "is_submitter": false, "distinguished": null, "created_utc": 1628766227.0, "parent_id": "t1_h8mos3u", "replies": [{"author": "robbdire", "id": "h8n9a4l", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #112", "submission": "p2uato", "stickied": false, "body": "Off the top of my head, Canada and Switzerland.", "is_submitter": false, "distinguished": null, "created_utc": 1628770467.0, "parent_id": "t1_h8n2p9f", "replies": []}, {"author": "Arjun_Dhama", "id": "h8n3pz4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "A lot of them\nHere in India it's really difficult to get one legally (even handguns) and there are still some people who can get shotguns and assault rifles legally if they are living in some place where they might need one, say some area with frequent terrorist activity or some regions with those communist geurilla terrorists", "is_submitter": false, "distinguished": null, "created_utc": 1628766950.0, "parent_id": "t1_h8n2p9f", "replies": []}]}]}, {"author": "Concrete_Grapes", "id": "h8mk1t9", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "p2uato", "stickied": false, "body": "With exceptions. Sure.", "is_submitter": false, "distinguished": null, "created_utc": 1628750686.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "PlatinumSix", "id": "h8moya7", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #25", "submission": "p2uato", "stickied": false, "body": "Yes, but there should be more thorough background checks. That and some firearms should have more requirements before being available to civilians.", "is_submitter": false, "distinguished": null, "created_utc": 1628754732.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Ulfgardleo", "id": "h8na4n7", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Nay.", "is_submitter": false, "distinguished": null, "created_utc": 1628770950.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Prior_Technology_868", "id": "h8n51gv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p2uato", "stickied": false, "body": "Yeah obviously. Swords are obsolete because of them so you have to stay up to par.", "is_submitter": false, "distinguished": null, "created_utc": 1628767838.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "BrynneRaine", "id": "h8n7nu3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #13", "submission": "p2uato", "stickied": false, "body": "Yea.", "is_submitter": false, "distinguished": null, "created_utc": 1628769493.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "nergalelite", "id": "h8n8auk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #84", "submission": "p2uato", "stickied": false, "body": "Yes. Although most people whom exercise that right do not understand why they have it.", "is_submitter": false, "distinguished": null, "created_utc": 1628769886.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "baalroo", "id": "h8n8us5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #120 | Legio Virtus", "submission": "p2uato", "stickied": false, "body": "Sure, I don't really see it as a particularly big deal, but I live somewhere that if you're an adult without a criminal background you're allowed to concealed carry a handgun in public without any special licensing.", "is_submitter": false, "distinguished": null, "created_utc": 1628770215.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Cheomesh", "id": "h8nbhym", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p2uato", "stickied": false, "body": "Yay, I suppose, though my enthusiasm for it wanes as the years go by.", "is_submitter": false, "distinguished": null, "created_utc": 1628771719.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "cptnobveus", "id": "h8nek8q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #35", "submission": "p2uato", "stickied": false, "body": "Absolutely yay. I live in a state where you are practically given one at birth and taught safety/responsibility growing up. We are one of the top states with the most guns per person, yet have some of the lowest gun crimes/deaths. I will agree with others, that there are always idiots out there. But you don't punish the good people because of a few bad ones.", "is_submitter": false, "distinguished": null, "created_utc": 1628773355.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Brohozombie", "id": "h8nn6k4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Nay. You don't even see every mass shooting in the US anymore because they are so frequent. 2A is good in theory but people can't seem to get it.", "is_submitter": false, "distinguished": null, "created_utc": 1628777436.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "arr4k1s", "id": "h8nput1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #90", "submission": "p2uato", "stickied": false, "body": "Nay, it only brings more violence.", "is_submitter": false, "distinguished": null, "created_utc": 1628778602.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "veringer", "id": "h8p78zl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #87", "submission": "p2uato", "stickied": false, "body": "Yes, but we should treat them like we do cars (mandatory licensing, registration, training, strict evaluation of basic skills, required insurance, inspections, limits on what is and isn't \"road worthy\", policing of the aforementioned). \n\nFurthermore, I see no justifiable reason for an individual to hoard 100 guns (unless it's a legitimate gun business).  We should determine what's reasonable for home defense and/or sport/hunting and treat anything beyond that with some suspicion.\n\nIf people want to possess firearms that are out of the bounds of reasonability (ie. too many, too big), there should be some kind of armory system (maybe using post offices?) where people can house their excess weaponry and perhaps agree to their use in communal defense (God forbid).", "is_submitter": false, "distinguished": null, "created_utc": 1628800646.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "mudbutt20", "id": "h8u5osp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #37", "submission": "p2uato", "stickied": false, "body": "Yes but we need stricter laws, better mental healthcare to go along with it, and somehow move our gun culture away from this violent \"come and take it\" mentality.", "is_submitter": false, "distinguished": null, "created_utc": 1628891593.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Botwmaster23", "id": "h8mn8hf", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p2uato", "stickied": false, "body": "Yes but you need to pass a sanity test and show you know how to use it first, kinda like a driving lisence", "is_submitter": false, "distinguished": null, "created_utc": 1628753286.0, "parent_id": "t3_p2uato", "replies": [{"author": "FalconRelevant", "id": "h8mne0i", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Also VAT the hell out of ammunition, as well as regulating it **very** heavily. Like we should know where each manufactured bullet went.", "is_submitter": true, "distinguished": null, "created_utc": 1628753414.0, "parent_id": "t1_h8mn8hf", "replies": [{"author": "Prior_Technology_868", "id": "h8n55xc", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p2uato", "stickied": false, "body": "That’s gonna be ridiculously expensive and time consuming. When you get a firearm for any reason you have to actually use it to become comfortable with it. That means training, which means using a lot of ammo. Right now you’re encouraging people not to become comfortable with their guns.", "is_submitter": false, "distinguished": null, "created_utc": 1628767921.0, "parent_id": "t1_h8mne0i", "replies": [{"author": "dashingThroughSnow12", "id": "h8nyy01", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p2uato", "stickied": false, "body": "To preemptively defend Falcon, the workaround would be that ammunition at gun ranges is VAT-free and can't be taken off sight. Outside of gun ranges, VAT it up to the max.\n\nThen though we realize we tried this with cigarettes and beer in Canada and that doesn't work.", "is_submitter": false, "distinguished": null, "created_utc": 1628782434.0, "parent_id": "t1_h8n55xc", "replies": []}]}, {"author": "Botwmaster23", "id": "h8mnett", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p2uato", "stickied": false, "body": "Yes", "is_submitter": false, "distinguished": null, "created_utc": 1628753432.0, "parent_id": "t1_h8mne0i", "replies": []}, {"author": "DELETED", "id": "h8molje", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628754433.0, "parent_id": "t1_h8mne0i", "replies": [{"author": "Natural-Sun-8613", "id": "h8ms8di", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "So I just learned how to cast and polish my own bullets, hollow tip and all.", "is_submitter": false, "distinguished": null, "created_utc": 1628757546.0, "parent_id": "t1_h8molje", "replies": [{"author": "FalconRelevant", "id": "h8mt8hk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Really? I thought they required more precision than is available at a home workshop.", "is_submitter": true, "distinguished": null, "created_utc": 1628758412.0, "parent_id": "t1_h8ms8di", "replies": [{"author": "Natural-Sun-8613", "id": "h8mtlm0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "What do you consider a home workshop?", "is_submitter": false, "distinguished": null, "created_utc": 1628758731.0, "parent_id": "t1_h8mt8hk", "replies": [{"author": "FalconRelevant", "id": "h8mtofx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Like the sort of stuff smithing hobbyists have at home?", "is_submitter": true, "distinguished": null, "created_utc": 1628758800.0, "parent_id": "t1_h8mtlm0", "replies": [{"author": "Natural-Sun-8613", "id": "h8mtw0m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "The hardest part is ventilation for the lead fumes.", "is_submitter": false, "distinguished": null, "created_utc": 1628758984.0, "parent_id": "t1_h8mtofx", "replies": [{"author": "FalconRelevant", "id": "h8mvr3n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "So how long does it take to make one?", "is_submitter": true, "distinguished": null, "created_utc": 1628760596.0, "parent_id": "t1_h8mtw0m", "replies": [{"author": "Natural-Sun-8613", "id": "h8mx9ek", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "To cast one, about the time it took me to respond from time you responded. In order to have it nice and polished; I take my time and it takes about a day for one bullet. I go up to that powdered stuff that you mix with water to polish coins and medals. It’s not all my stuff but I can describe the process in further detail if needed.", "is_submitter": false, "distinguished": null, "created_utc": 1628761907.0, "parent_id": "t1_h8mvr3n", "replies": []}]}]}]}]}]}]}, {"author": "FalconRelevant", "id": "h8mt5p2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "On the shipment boxes would be fine ig.", "is_submitter": true, "distinguished": null, "created_utc": 1628758345.0, "parent_id": "t1_h8molje", "replies": [{"author": "DELETED", "id": "h8mudux", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628759413.0, "parent_id": "t1_h8mt5p2", "replies": [{"author": "FalconRelevant", "id": "h8mvpfj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "A tracker on every bullet? Can't you just tally the number of bullets lost in shipment to see if there has been any malpractice? The shop owners can then keep a record of their customers.", "is_submitter": true, "distinguished": null, "created_utc": 1628760556.0, "parent_id": "t1_h8mudux", "replies": [{"author": "Botwmaster23", "id": "h8mw4ve", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p2uato", "stickied": false, "body": "Yes that would be a little cheaper", "is_submitter": false, "distinguished": null, "created_utc": 1628760926.0, "parent_id": "t1_h8mvpfj", "replies": []}]}, {"author": "R5Cats", "id": "h8qxb2b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "Put serial numbers on the billions of bullets! Register them all, $1 fee each! Lots and lots of paperwork!  \nThat will stop criminals! Just like making heroin and cocaine illegal stopped drugs too!", "is_submitter": false, "distinguished": null, "created_utc": 1628829917.0, "parent_id": "t1_h8mudux", "replies": []}, {"author": "LaLiLuLeLo_0", "id": "h8n3xsm", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "Bullets tend to break up and explode into tiny fragments when they hit a target. When they don't, they heat up tremendously, to temperatures that would fry any microelectronics, and deform into a pancake shape when they hit, that would also stretch and break any microelectronics. I don't think you really understand how impossible what you're asking for is.\n\nIt's already possible to determine which gun fired which bullet, without any extra technology required. Every barrel has unique imperfections inside that etch themselves onto every bullet they fire, and it's not really that hard for a forensics lab to match a bullet to a barrel these days.", "is_submitter": false, "distinguished": null, "created_utc": 1628767101.0, "parent_id": "t1_h8mudux", "replies": [{"author": "Botwmaster23", "id": "h8n4ih6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p2uato", "stickied": false, "body": "Sorry for that we dont learn anything about guns in my country.", "is_submitter": false, "distinguished": null, "created_utc": 1628767487.0, "parent_id": "t1_h8n3xsm", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8n4ztv", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "Perhaps you should learn more about how guns work before trying to regulate them.", "is_submitter": false, "distinguished": null, "created_utc": 1628767809.0, "parent_id": "t1_h8n4ih6", "replies": [{"author": "Wafflebot3500", "id": "h8nidxf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #135", "submission": "p2uato", "stickied": false, "body": "This is a discussion on the internet, not US Congress…", "is_submitter": false, "distinguished": null, "created_utc": 1628775242.0, "parent_id": "t1_h8n4ztv", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8niosl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "An uninformed voter is no different from an uninformed legislator, they both have the same outcomes.", "is_submitter": false, "distinguished": null, "created_utc": 1628775383.0, "parent_id": "t1_h8nidxf", "replies": []}]}]}]}]}]}]}, {"author": "ctm-8400", "id": "h8n2kyt", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "No that'd be terrible and ruin the fucking point. The right to have firearms shouldn't be in expenses of you right for privacy.", "is_submitter": false, "distinguished": null, "created_utc": 1628766142.0, "parent_id": "t1_h8molje", "replies": [{"author": "Botwmaster23", "id": "h8n470f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p2uato", "stickied": false, "body": "The point of gun rights is so people can protect themself. Im not trying to rob people of privacy, this was an idea so if the bullet was fired in an unusual place the police could investigate right away.", "is_submitter": false, "distinguished": null, "created_utc": 1628767271.0, "parent_id": "t1_h8n2kyt", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8ni7e6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "What if the person you need to protect yourself from is a tyrannical government that can track every bullet? Consider the [Uyghurs](https://en.wikipedia.org/wiki/Uyghur_genocide), currently being slowly genocided by the Chinese State. Self-protection, to them, includes protection from the police and the State.", "is_submitter": false, "distinguished": null, "created_utc": 1628775155.0, "parent_id": "t1_h8n470f", "replies": [{"author": "Botwmaster23", "id": "h8nn1xo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p2uato", "stickied": false, "body": "I didnt think of that", "is_submitter": false, "distinguished": null, "created_utc": 1628777380.0, "parent_id": "t1_h8ni7e6", "replies": []}]}, {"author": "ctm-8400", "id": "h8nhamy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "OK, but this clearly also violates privacy.", "is_submitter": false, "distinguished": null, "created_utc": 1628774720.0, "parent_id": "t1_h8n470f", "replies": []}]}]}, {"author": "Prior_Technology_868", "id": "h8n5acq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p2uato", "stickied": false, "body": "You know bullets cost cents a piece? Tracking devices cost like 20 bucks.", "is_submitter": false, "distinguished": null, "created_utc": 1628767999.0, "parent_id": "t1_h8molje", "replies": [{"author": "Botwmaster23", "id": "h8n83vm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p2uato", "stickied": false, "body": "No i dont, im not american i cant just go up to my local mall and buy a gun.", "is_submitter": false, "distinguished": null, "created_utc": 1628769770.0, "parent_id": "t1_h8n5acq", "replies": []}]}]}, {"author": "R5Cats", "id": "h8qx3v7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "Lets register all the knives in America too! With a fee, a 27 digit registration number and paperwork (in triplicate!) for any blade over 2\" ok? That will stop knife attacks, right?", "is_submitter": false, "distinguished": null, "created_utc": 1628829793.0, "parent_id": "t1_h8mne0i", "replies": [{"author": "FalconRelevant", "id": "h8r5xf7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Despite what Warhammer 40k might tell you, melee combat is much less effective than guns. Also knives are used for cooking.", "is_submitter": true, "distinguished": null, "created_utc": 1628835762.0, "parent_id": "t1_h8qx3v7", "replies": [{"author": "R5Cats", "id": "h8sedlh", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "You are aware that knives are 'controlled weapons' in most of the UK? Even longish kitchen knives require ID to buy.  \n\nYes, guns are effective, that's why lawful citizens should have them.", "is_submitter": false, "distinguished": null, "created_utc": 1628866154.0, "parent_id": "t1_h8r5xf7", "replies": [{"author": "FalconRelevant", "id": "h8ss47d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Yes, after proper training and checks.", "is_submitter": true, "distinguished": null, "created_utc": 1628871896.0, "parent_id": "t1_h8sedlh", "replies": [{"author": "R5Cats", "id": "h8tne20", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "\"Training and checks\" are code words for \"prevent everyone from getting a gun, unless they bribe us\".  \n\nJohn Stossel talks about his efforts to get a carry permit in Ney York a few years back. Many tries and a year later, still denied. Turns out he could have \"donated\" to a certain police charity and got one in a week. \n\nChicago is famous for doing these things over and over, then getting them tossed by the courts every time. They sound \"reasonable\" but that assumes that governments are reasonable and unbiased. They are not.", "is_submitter": false, "distinguished": null, "created_utc": 1628884362.0, "parent_id": "t1_h8ss47d", "replies": []}]}]}]}]}]}]}, {"author": "PurpleDevilR", "id": "h8mnj9y", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p2uato", "stickied": false, "body": "Nay. Things are bad enough with knifes in the UK, we don’t need anymore fuel for the fire.", "is_submitter": false, "distinguished": null, "created_utc": 1628753537.0, "parent_id": "t3_p2uato", "replies": [{"author": "FalconRelevant", "id": "h8mo8qj", "score": -5, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Check out Czechia.", "is_submitter": true, "distinguished": null, "created_utc": 1628754128.0, "parent_id": "t1_h8mnj9y", "replies": [{"author": "PurpleDevilR", "id": "h8nhu0c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p2uato", "stickied": false, "body": "I’m talking about Britain. You can’t just point at a country and say “ha, proof” because there are different situations. You can’t for example, turn a large country into Monaco.\n\nFor Britain there is knife crime, illegal travelers, gang worries and to top it all of a police force that refuses to do anything out of fear.\n\nIf you give guns then gang warfare will have civilians in the crossfire, travellers will never leave and the police will be completely decapitated.", "is_submitter": false, "distinguished": null, "created_utc": 1628774977.0, "parent_id": "t1_h8mo8qj", "replies": []}]}]}, {"author": "TheMoorhsum", "id": "h8mxfs7", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Nay. Not a right (e.g. education) but a privilege (e.g. driving).", "is_submitter": false, "distinguished": null, "created_utc": 1628762062.0, "parent_id": "t3_p2uato", "replies": [{"author": "Wafflebot3500", "id": "h8nin4y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #135", "submission": "p2uato", "stickied": false, "body": "Came here to say exactly this! The only correct answer IMO.", "is_submitter": false, "distinguished": null, "created_utc": 1628775362.0, "parent_id": "t1_h8mxfs7", "replies": [{"author": "TheMoorhsum", "id": "h8oz1fz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Seems pretty straightforward right?", "is_submitter": false, "distinguished": null, "created_utc": 1628797472.0, "parent_id": "t1_h8nin4y", "replies": []}]}]}, {"author": "RiresBarter", "id": "h8muxy2", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #158", "submission": "p2uato", "stickied": false, "body": "From a country that has vert strict restriction on access to guns. It baffles me why countries like the US allows the citizens to own firearms.\n\nIn my view, unless it is occupational, one should not be allowed any access to firearms. Now, that's my general  point of view, though in actuality, most laws would allow a person to own firearms under very strict licensing protocols, which I don't necessarily agree but its not sounding any alarms yet, not to me.\n\nI am not sure if what I have read is correct, that in the US, there's more than at least 120million guns owned by private citizens, and that 1 out of 3 Americans owns a gun. And amongst them, many own more than just one gun.\n\nMost gun owners will cite safety as a reason (let's just exclude \"because that's my right\" as a reason  because that's just saying I can be as stupid as I want to, and whilst that is correct, it's not contributing to anything at all in a progressive discussion, though I do know that handling this \"right\" in terms of an amendment to the Constitutional Law will bring out further discussional branches out there, which I also think is why Firearm Law in US is such a hot debate, simply because people are not able to isolate all these issues one by one and discuss their merits, but instead squeezes everything together, allowing so much chaos to exist within an discussion). \n\nI have digressed, but most gun owners will cite safety as an issue, but it seems that there is an issue of over owning guns, more than enough for personal protection. \n\nNow, what are they protecting themselves from, guns and other threats. For guns, the more guns there are in an environment, the more dangerous it is, and the more you need to protect yourself (I want to make a joke about how this contributes to an obesity issue, where I am eating as much as can to outlast another person who is eating to outlast me, and that we both got obese in the end and ended up dying even earlier than when we could have survived in this first place without this competition, and hence, this is America, which is of poor taste, I hope its treated just as a joke). I'm not too sure what \"other threats\" mean, I can think of robberies and people breaking in, which I think can be solved with advance alarms and strong tall fences, maybe things like window grills, surely, the money to own a firearm can be used for those instead, unless firearms are cheap in which case, that's just not right at all. Other threats perhaps also mean domestic issues (a violence from within a household), which I think is understandable, but I think there are also other ways to go about this, for now, this is the only strong point that I find supports a gun owning rights. Other threats like animals, should be handled by the government, instead of being justified as a reason to own a gun. As I am saying this, I am coming from a standing that gun is dangerous to begin with so the fewer the better. Instead of \"a gun is everyone's right and therefore we are discussin whether to uphold this right\" kinda standing. I am not listing it as a need to begin with wither.\n\nNow most of the threats so far are within or around a house, meaning to say the gun does not leave the house. \n\nWhen the threat is outside the house, I believe that is stage 2 of the discussion. Whether guns are allowed to be carried outside. And then comparing the list of threats and other alternatives, discuss whether there is such a need. \n\nHonestly, I don't think anyone would read this far, so I'm just stopping here. No conclusions drawn except for, I feel safe knowing that my enemies (threats) don't have guns, or the likelihood is low).", "is_submitter": false, "distinguished": null, "created_utc": 1628759902.0, "parent_id": "t3_p2uato", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8n8p54", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "> Other threats like animals, should be handled by the government, instead of being justified as a reason to own a gun\n\nI'm not going to focus on the rest of what you mentioned, because there's a lot here, but I'm going to very strongly push back against this. How should people living in Alaska, or the northern parts of Canada handle wild animals? Should they just accept getting attacked, or only live in the areas the government chooses to let them live by providing police?\n\nMaybe in highly urban areas, this is reasonable. However, in rural communities, police response times can average up to *45 minutes*. I don't think the proper response is to tell people they either can't live there or should just suck it up and be unable to defend themselves and their families.\n\nAnd what about places without access to cellular networks? It might not even be possible to call the state in to help with your animal problem in really rural areas.", "is_submitter": false, "distinguished": null, "created_utc": 1628770121.0, "parent_id": "t1_h8muxy2", "replies": [{"author": "JaimelesBN", "id": "h8o3z9k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p2uato", "stickied": false, "body": "Yup how do I keep wild boar and other animals from eating all the crops, yeah yeah tall fences. But fences are really expensive and not very practical. Farmers literally allow hunters when he is not asking for them to come hunt wild boar and cervidae on his property. \n\nAnd this guy is telling us that the government should be dealing with it, the government is itself asking for hunters to regulate wild life on designated area. Some people never left big cities and think they know better smh...", "is_submitter": false, "distinguished": null, "created_utc": 1628784501.0, "parent_id": "t1_h8n8p54", "replies": [{"author": "RiresBarter", "id": "h8odb4y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #158", "submission": "p2uato", "stickied": false, "body": "Hi there, just a bit of correction, I never said I was from any big cities. I'm just from a country where its almost unheard of for normal citizens to have any guns.\n\nI am also just stating out the merits of a country giving access to their citizen guns, versus alternatives that may be provided by the government or any organisation should they wish to tighten gun law or even restrict any owning of guns at all. \n\nBut one thing I do agree is for special occupations to have access to guns. From an occupational perspective, a qualified hunter is in my opinion, qualified to own a gun. \n\nEssentially, I think what you said is not too far off from what I said (in my opinion). But does the government offer some sort of subsidies for the farmers for their fences or facilities? They are truly the backbone of the country and they should be greatly supported by the country.", "is_submitter": false, "distinguished": null, "created_utc": 1628788246.0, "parent_id": "t1_h8o3z9k", "replies": [{"author": "JaimelesBN", "id": "h8ofkjr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p2uato", "stickied": false, "body": "Well they struggle enough to pay themself a salary, even with various subsidies. But there is nothing close to professional hunter, 90% of the hunters are gun owner hunting for fun. And think about a fence high enough to prevent any cervidae to jump above, strong enough to prevent a wild boar from destroying it, impassable for rodent of all sizes to climb or dig under. Now think about the birds, those need to be hunted too, they can be worse.\n\nEven if you have this fence, think about the cost of fencing multiple giant fields and the cost of maintenance. Guns are way cheaper, hunters are pleased and have access to good meat, farmers continue what they have been doing for decades.\n\nRural folks are the main owners of firearms, but those areas have really really low crimes and violence. So I don't think preventing them to own guns because of problems in urban areas would be fair.", "is_submitter": false, "distinguished": null, "created_utc": 1628789152.0, "parent_id": "t1_h8odb4y", "replies": [{"author": "RiresBarter", "id": "h8oh4od", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #158", "submission": "p2uato", "stickied": false, "body": "I see, I understand now. Its good to know that there is already an interdependent and benefitting reliancy in the rural areas. That really opens up my perspective.\n\nI really don't have any statistics in hand, so I was only looking at the sheer amount of guns there are within the American population as a whole. \n\nI think from what you said, perhaps we should look the urban areas first when talking about gun laws.", "is_submitter": false, "distinguished": null, "created_utc": 1628789771.0, "parent_id": "t1_h8ofkjr", "replies": [{"author": "R5Cats", "id": "h8qy43p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "In America? The bulk of gun crime happens in large cities, usually run by Democrats. It's just a fact.  \nThis is largely caused by race-based drugs gangs. Not just \"Blacks\" I mean ALL races have their gangs. Italian Mafia anyone? Hells Angles? MS-13?\n\nMost rural areas have a lot of guns, in USA and Canada. Gun crime is very low there, lots of guns but little gun crime: it's cultural.", "is_submitter": false, "distinguished": null, "created_utc": 1628830411.0, "parent_id": "t1_h8oh4od", "replies": []}]}]}]}]}, {"author": "RiresBarter", "id": "h8ofoyc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #158", "submission": "p2uato", "stickied": false, "body": "Hi there, I'm sorry for the long post. I was just trying to list out what are the causes of concerns and whether there are alternatives to a country which gives so much access to guns to its citizens (in relation to what I personally experience).\n\nI \"wish(?)\" that the government would take those concerns and formulate some sort of a plan for them. Police response time should be faster, and cellular access should already be a commonplace facilities. I understand \"should\" and \"what is\" are very different. I'm just saying the government should play a very \"immersive\" role when it wants to decide to restrict gun access to its citizen. \n\nBut out of curiosity, people living in Alaska or the northern parts of Canada, do they have land titles to the land they own? If they have land titles, and they pay taxes, shouldn't the government allocate available access to police and other basic protection? \n\nThank you for letting me know about what you said. I truly didn't know about it until you pointed it out.", "is_submitter": false, "distinguished": null, "created_utc": 1628789200.0, "parent_id": "t1_h8n8p54", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8onfa1", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "People in Alaska do own their land. However, many of them *do not want* the state intruding on their lives, and vote accordingly; I think it would be wrong to force them to live otherwise. Even aside from that, the US is a *huge* country, it is simply not feasible to have police stations and cellular infrastructure all over the country. Take a look at this [US population density map](https://upload.wikimedia.org/wikipedia/commons/2/21/US_population_map.png), and compare the density numbers to this map of the [EU population density](https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Density_of_Population_in_EU_2014.svg/1218px-Density_of_Population_in_EU_2014.svg.png). Even Europe's \"sparse\" areas are ~10x more densely populated than America's sparse areas. The US is simply [much larger than Europe](https://vividmaps.com/wp-content/uploads/2020/10/EU-US.jpg), and our rural population is also much more self-reliant.\n\nThis might be a cultural thing, but it struck me reading your comment; as much as Reddit makes it seem otherwise, many of us don't want high taxes and for the government to \"provide\" us with everything, we would rather have low taxes and to direct our property and our money as we see fit, individually. We also don't want the government to \"formulate a plan\" for us, we want to be left alone to direct our lives how we see fit. Clearly, not all Americans feel this way, but certainly the more rural ones feel similarly to how I do.\n\nIn short, it's not really feasible to have an ever-present state, ready to handle our issues at a moment's notice, and it's not something average rural Americans want, either.", "is_submitter": false, "distinguished": null, "created_utc": 1628792294.0, "parent_id": "t1_h8ofoyc", "replies": []}, {"author": "R5Cats", "id": "h8qybv7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "When the nearest police station is a good 45 minute drive away? Assuming the 1-2 cops on duty aren't already busy? You are pretty much on your own.  \nYet gun crime is pretty low in rural areas, it's cultural, not the number of guns.", "is_submitter": false, "distinguished": null, "created_utc": 1628830545.0, "parent_id": "t1_h8ofoyc", "replies": []}]}]}, {"author": "Karyo_Ten", "id": "h8n7ro1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "In Switzerland, you get a firearm after mandatory army training. But no ammunitions.", "is_submitter": false, "distinguished": null, "created_utc": 1628769558.0, "parent_id": "t1_h8muxy2", "replies": []}]}, {"author": "Skastrik", "id": "h8mqogd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "p2uato", "stickied": false, "body": "Sure,\n\nI'm not from the US but I come from a country that has an extremely high gun ownership per capita.\n\nBut it is highly regulated, you need a license that includes instruction and training along with a doctors assement that you are of sound mind.\n\nPlus handguns and semiautomatics are rare qnd require very specific licenses.\n\nThe gun culture is one of hunting and target shooting.\n\nGuns can be owned without the freaking insanity that is the US.", "is_submitter": false, "distinguished": null, "created_utc": 1628756211.0, "parent_id": "t3_p2uato", "replies": [{"author": "DELETED", "id": "h8n07o2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628764350.0, "parent_id": "t1_h8mqogd", "replies": [{"author": "Skastrik", "id": "h8qd2fa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "p2uato", "stickied": false, "body": "Nope an island in the North Atlantic. The icy one.\n\nIt surprising but we have massive gun ownership per capita here. Like really massive.", "is_submitter": false, "distinguished": null, "created_utc": 1628819294.0, "parent_id": "t1_h8n07o2", "replies": []}]}]}, {"author": "areyouseriousdotard", "id": "h8mjzhh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "p2uato", "stickied": false, "body": "Yay", "is_submitter": false, "distinguished": null, "created_utc": 1628750636.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "FreeBiskit", "id": "h8mpza0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "p2uato", "stickied": false, "body": "Weed and firearms and I’ll be a happy camper.", "is_submitter": false, "distinguished": null, "created_utc": 1628755612.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "InfiniteEmotions", "id": "h8mv6hs", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #167", "submission": "p2uato", "stickied": false, "body": "Yes, people should have the right to own firearms. Traditionally, governments have enslaved their working populations by banning the right to own weapons (some of the ways to get around that ban were nothing short of inspired, you should check it out), because this made them unable to defend themselves and dependent upon government officials to \"protect\" them. (In quotations because, when the State goes out of its way to enforce mandates like this, the policing agencies tend to be corrupt and \"protection\" is \"pay me not to violate your rights.\") People should be able to protect themselves.", "is_submitter": false, "distinguished": null, "created_utc": 1628760104.0, "parent_id": "t3_p2uato", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8n0jhg", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "I agree with this. All the other people here mentioning the need for strict regulation and vetting people and so on are assuming the government has its people’s best interest at heart, which cannot be taken for granted. In the exact same way that “minor tests and vetting” can be taken to extreme lengths, as with Jim Crow laws in the past, they can also be made into de-facto bans on gun ownership as well. If you trust the government will always be benevolent and protect you, then I guess that’s fine, but every disarmed population living under authoritarian governments probably wishes they kept their arms once it gets bad enough. See China for what a government you can’t resist might turn into.", "is_submitter": false, "distinguished": null, "created_utc": 1628764608.0, "parent_id": "t1_h8mv6hs", "replies": [{"author": "InfiniteEmotions", "id": "h8nd4qo", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #167", "submission": "p2uato", "stickied": false, "body": "I think it's sad that people don't look at that. Every time I've brought it up locally, people mention how good gun control laws would have prevented the Sandy Brook Elementary Massacre. Which, they wouldn't. Why? *Because he stole the gun.* He didn't *have* a gun of his own and people were/are all, \"We need to ban all access to guns!\" And in the meantime I'm looking at the shit going down with authorities, with lawmakers trying to revoke the rights of every citizen that's not part of the 1%, and I'm going, \"You trust *these* people to protect us?\"\n\nJust--I don't know.", "is_submitter": false, "distinguished": null, "created_utc": 1628772604.0, "parent_id": "t1_h8n0jhg", "replies": []}]}]}, {"author": "Harronix0", "id": "h8mw55i", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #45", "submission": "p2uato", "stickied": false, "body": "If there's a mandatory course for firearm safety, handling and a proper license, yes. Don't forget background checks and a reasonable age restriction, I'd day 21 is a good age limit.", "is_submitter": false, "distinguished": null, "created_utc": 1628760933.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Rue_Bixcube", "id": "h8naht1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #103", "submission": "p2uato", "stickied": false, "body": "I don't like fire arms, but I support peoples right to own them. However I think if you are allowed to own a fire arm, I should be allowed to own all the drugs that I want. Fair is fair.", "is_submitter": false, "distinguished": null, "created_utc": 1628771160.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "maxime7567", "id": "h8nqf58", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #83", "submission": "p2uato", "stickied": false, "body": "Yay. People have to be able to defend themselves, not just from attackers, but more importantly, the government. That is why America had the second amendment, to protect the first.", "is_submitter": false, "distinguished": null, "created_utc": 1628778846.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "ianovic69", "id": "h8moqs8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #216", "submission": "p2uato", "stickied": false, "body": "It seems to me that people should have to earn the right to own firearms, not be granted them first.\n\nBy that I mean there should be a very strict set of criteria that includes several stages of application.\n\nEg, are you over 21? Do you have a police record? And so on for the initial application.\n\nFollowed by meeting requirements to store safely at home such as in the UK.\n\nFollowed by a licence that only allows use at certain locations such as specific vetted ranges or designated areas.\n\nFollowed by a request to purchase from a specific, vetted retailer.\n\nIE, make it regulated and not quick or easy to acquire or use lethal weapons.\n\nI like guns and I think we should be allowed to own and use them. I used hand guns and rifles as a youth, competitively and for fun.\n\nShould we have the right? Only if it's earned.\n\nI'm from the UK.", "is_submitter": false, "distinguished": null, "created_utc": 1628754556.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Zumokamo350", "id": "h8msp3a", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #287", "submission": "p2uato", "stickied": false, "body": "Like most people here I would say licenses, psychological evaluations and proper training is a must.\n\nIn the end thoug, it’s my honest belief that having a gun is completely useless and should be banned entirely except perhaps for hunting and as a sport", "is_submitter": false, "distinguished": null, "created_utc": 1628757950.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "DELETED", "id": "h8n11f6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628764999.0, "parent_id": "t3_p2uato", "replies": [{"author": "R5Cats", "id": "h8qyq70", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "You can in America: tank, cannon, machinegun not rockets though, iirc. So why aren't tanks used in crimes, hummm?   \nBecause it's a cultural problem, not the tools the criminals or lawful citizens use. Drugs Gangs = violence, there's the problem. Lawful owners = self defense, there's the solution.", "is_submitter": false, "distinguished": null, "created_utc": 1628830792.0, "parent_id": "t1_h8n11f6", "replies": []}, {"author": "floofandmemes", "id": "h8nnvyg", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "That would destroy the roads, unless you have rubber treads and it's a particularly light one, in which case it would be legal in the US without the weaponry.", "is_submitter": false, "distinguished": null, "created_utc": 1628777751.0, "parent_id": "t1_h8n11f6", "replies": [{"author": "DELETED", "id": "h8nqy2f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628779070.0, "parent_id": "t1_h8nnvyg", "replies": [{"author": "R5Cats", "id": "h8qz4o7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "I know you're being /s but you really should learn about what you're talking about before spouting false information.  \n\nIn the USA you can, with a special permit, own tanks, actual cannon, actual real machineguns, all sorts of stuff. This permit system has been in place for decades, no one is trying to overturn it, it works very well.\n\nJoe Biden claimed the founding fathers outlawed or restricted cannons? Joe *lied*. You didn't even need a license until recently, just go buy it. Armed merchants were *commonplace* before the US Civil War...", "is_submitter": false, "distinguished": null, "created_utc": 1628831050.0, "parent_id": "t1_h8nqy2f", "replies": []}]}, {"author": "R5Cats", "id": "h8qyv87", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "It is legal with the weaponry too, but most owners take them out.  \n\nIt's perfectly legal to drive them, but driving is not a right: they need proper lights and there's weight restrictions to follow, eh? Just like a really big truck!", "is_submitter": false, "distinguished": null, "created_utc": 1628830880.0, "parent_id": "t1_h8nnvyg", "replies": [{"author": "floofandmemes", "id": "h8r0cb7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Anything over .50 Caliber is considering a destructive device and either needs licensing or special exemption in the US. Thus, the main gun of most tanks is illegal for most people to possess.", "is_submitter": false, "distinguished": null, "created_utc": 1628831839.0, "parent_id": "t1_h8qyv87", "replies": [{"author": "R5Cats", "id": "h8r17qo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "Most people don't but some do! Yes it already does require a special permit, I do mention that elsewhere.  \n\nSo lots of people DO have them, yet they are never used in crimes. (except once, but the guy stole a tank from the army so...)", "is_submitter": false, "distinguished": null, "created_utc": 1628832419.0, "parent_id": "t1_h8r0cb7", "replies": []}]}]}]}]}, {"author": "ToastyCaribiu84", "id": "h8mmcr7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #42", "submission": "p2uato", "stickied": false, "body": "Guns aint worth the risk", "is_submitter": false, "distinguished": null, "created_utc": 1628752561.0, "parent_id": "t3_p2uato", "replies": [{"author": "FalconRelevant", "id": "h8mmlcd", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "A legal and well-regulated firearms industry may out-compete the black market, making it harder for criminals to get them.", "is_submitter": true, "distinguished": null, "created_utc": 1628752757.0, "parent_id": "t1_h8mmcr7", "replies": [{"author": "DELETED", "id": "h8n0e2e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628764489.0, "parent_id": "t1_h8mmlcd", "replies": [{"author": "FalconRelevant", "id": "h8n0f9w", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Canada just did with marijuana.", "is_submitter": true, "distinguished": null, "created_utc": 1628764515.0, "parent_id": "t1_h8n0e2e", "replies": [{"author": "DELETED", "id": "h8n10ej", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628764977.0, "parent_id": "t1_h8n0f9w", "replies": [{"author": "Rue_Bixcube", "id": "h8natd1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #103", "submission": "p2uato", "stickied": false, "body": "How is that a problem? Marijuana through the internet is a fantastic idea.", "is_submitter": false, "distinguished": null, "created_utc": 1628771341.0, "parent_id": "t1_h8n10ej", "replies": []}, {"author": "FalconRelevant", "id": "h8n1am6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "They should have, it is easier to buy legally.", "is_submitter": true, "distinguished": null, "created_utc": 1628765192.0, "parent_id": "t1_h8n10ej", "replies": [{"author": "DELETED", "id": "h8n1ohu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628765479.0, "parent_id": "t1_h8n1am6", "replies": [{"author": "FalconRelevant", "id": "h8n266z", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "That must be more expensive than legal options.", "is_submitter": true, "distinguished": null, "created_utc": 1628765846.0, "parent_id": "t1_h8n1ohu", "replies": [{"author": "DELETED", "id": "h8n39el", "score": 2, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p2uato", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628766628.0, "parent_id": "t1_h8n266z", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8n48sq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "\"Expensive\" doesn't only include what you pay up front, it also includes what you pay in risk of imprisonment, or in being hurt by a dealer without being able to go to the police.\n\nDo you have any actual data for legal weed being \"a lot more expensive\" than illegal weed in Canada?", "is_submitter": false, "distinguished": null, "created_utc": 1628767304.0, "parent_id": "t1_h8n39el", "replies": []}]}]}]}]}]}, {"author": "R5Cats", "id": "h8qzf22", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "Not really, but it drove demand for illegal pot down, which lowered illegal pot prices as the only way to compete with legal stuff (undersell it, or have higher quality).  \n\nWith less profits to be had? Criminal gangs lost interest in large-scale pot smuggling, thus less fighting over \"turf\" too, at least for pot. Now they smuggle opioids from China, along with traditional heroin and cocaine... and guns.", "is_submitter": false, "distinguished": null, "created_utc": 1628831238.0, "parent_id": "t1_h8n0f9w", "replies": []}]}]}]}]}, {"author": "qwerty0981234", "id": "h8mrrkh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #7", "submission": "p2uato", "stickied": false, "body": "I don’t think civilians should have any need to carry weapons and if they do there’s a bigger underlying issue (when we’re talking about weapons for own safety). There are many people that I don’t even think should be allowed to drive in public let alone carry a firearm.\n\nWhen you look at the statistics of the safest countries in the world there are only 3 countries I know off where owning a gun is legal for self protection without any special permits in the top 50 of safest countries. So it’s gonna be a nay for me.", "is_submitter": false, "distinguished": null, "created_utc": 1628757140.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Munnin41", "id": "h8mu1vo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #298", "submission": "p2uato", "stickied": false, "body": "When following the system as it is in the US, nay. \n\nStrict rules and regulations like most of (western) europe has? sure. \n\nBut it shouldn't be a right, it should be privilige.", "is_submitter": false, "distinguished": null, "created_utc": 1628759123.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "MysticTheMeeM", "id": "h8n0883", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #16", "submission": "p2uato", "stickied": false, "body": "Sure, but not the way the US do it. Also, not a right.", "is_submitter": false, "distinguished": null, "created_utc": 1628764363.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "jcooli09", "id": "h8n2ukd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #101", "submission": "p2uato", "stickied": false, "body": "Define right.\n\nThere are no unrestricted rights granted by the US  constitution, and no such thing as a natural right.  \n\nIn case it matters, I own 2 handguns.  I’m a pretty good shot, too.", "is_submitter": false, "distinguished": null, "created_utc": 1628766331.0, "parent_id": "t3_p2uato", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8n4iwx", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "> no such thing as a natural right\n\nA natural right is something you can do by default, unless other people intervene to prevent you from doing it, and that doesn't rely on other people doing something for you.\n\nAre you saying natural rights don't matter? Because natural rights, as defined, are very much a thing.", "is_submitter": false, "distinguished": null, "created_utc": 1628767496.0, "parent_id": "t1_h8n2ukd", "replies": []}, {"author": "floofandmemes", "id": "h8nolvh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p2uato", "stickied": false, "body": "Natural rights definitely exist, and if I were you I would think twice before quoting Joe Biden on the extent of the constitutional amendments. I should think it would be very concerning if people started discussing exemptions to the right to vote based on race or sex, or exemptions allowing them to own slaves.", "is_submitter": false, "distinguished": null, "created_utc": 1628778061.0, "parent_id": "t1_h8n2ukd", "replies": [{"author": "jcooli09", "id": "h8nsh05", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #101", "submission": "p2uato", "stickied": false, "body": "I’m not quoting anyone. \n\nIt is very concerning that the right to vote is being curtailed, it’s been going on for decades.  Just this year many states have enacted measures which interfere with the right of hundreds of thousands or millions of voters.  These acts will have the effect of disenfranchising orders of magnitude more legitimate voters than legitimate votes.\n\nIf you can think of a single right that’s absolute I’ll concede that I’m wrong.", "is_submitter": false, "distinguished": null, "created_utc": 1628779721.0, "parent_id": "t1_h8nolvh", "replies": []}]}]}, {"author": "ev3nt_horiz0n", "id": "h8n7xpv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #113", "submission": "p2uato", "stickied": false, "body": "From the US? Shall not be infringed means one thing. Politicians have already been allowed to get away with too much.", "is_submitter": false, "distinguished": null, "created_utc": 1628769664.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "bogon64", "id": "h8n3y0d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #77", "submission": "p2uato", "stickied": false, "body": "Nay. I say that both personally and professionally (I’m a physician and get to deal with the (usually self-inflicted) consequences of rampant gun ownership).\n\nI see a common theme here of wanting higher requirements, including a police records check, for the privilege of gun ownership. That seems like something the USA would abuse Jim Crow style, to prohibit African Americans from gun ownership (hey, you smoked cannabis as a teen? No gun for you).\n\nOne thing I haven’t seen mentioned yet is how self-manufacture can interfere with a ban. Through my studies and hobbies, I’ve learned that alcohol, cannabis, and guns are surprisingly easy to make at home. Life… finds a way.", "is_submitter": false, "distinguished": null, "created_utc": 1628767105.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "headofmedusa1", "id": "h8nbl29", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #11", "submission": "p2uato", "stickied": false, "body": "Yes! As many have said here with the right training etc you should always have the right to defend yourself and your home and loved ones, even though people don’t like it who stoops a bad guy with a gun? A good guy with a gun the more people that have then the quicker any kind of problem that arises will be stopped, most of shootings in places like America are with illegal guns brought in illegally and sold illegally, a home owner who wants to protect what is his isn’t in a gang selling drugs involved in turf wars", "is_submitter": false, "distinguished": null, "created_utc": 1628771767.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "amitym", "id": "h8nqfto", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "p2uato", "stickied": false, "body": "I'm all for it if it comes with equivalent discipline and responsibility.  Many, many gun enthusiasts piously intone the same stock phrases about how guns are not toys, guns are a great responsibility, etc etc, and then act like complete fools with guns anyway.\n\nIt's like people who go to church, recite some litany, say \"amen,\" and then go out running around sinning or whatever as soon as church is over.  That's fine for most things, but when you fuck around with firearms, it's not just theology.  People get hurt and die.\n\nI say, establish a principle that you are absolutely responsible for whatever happens to a gun that you own.  If someone steals it, and commits murder with it, you are an accessory.  If you lend it to your dumb-ass brother Cletus, who shoots some kid by accident, you share responsibility.  Accidental discharge?  Not accidental anymore -- you're responsible for it.\n\nDon't like it?  Then secure your gun.  Don't lend it to dumbasses.  Walk the responsibility walk, don't just talk the talk.\n\nThe same would apply all up and down the chain of custody.  If someone commits a crime with a gun that has no ownership, then the seller or potentially even the manufacturer shares direct responsibility.  It's like they were right there, helping to pull the trigger.\n\nSuddenly you'd see a very great rush by arms manufacturers to make sure their products didn't end up in the hands of shady dealers, or conveniently fall off the backs of trucks somewhere.\n\nIf that all seems draconian, think again -- it's pretty much how militaries the world over treat guns.  I've heard some accounts of people in some armed services getting the shit beaten out of them, quite badly, by their own peers simply for not knowing exactly where their gun is at a particular moment.", "is_submitter": false, "distinguished": null, "created_utc": 1628778854.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "jmcsquared", "id": "h8nr8of", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "p2uato", "stickied": false, "body": "I really, really don't want this sub to turn into a politics cesspool.\n\nBut honestly, it's the 21st century. Kids need to be able to go to school without worrying if someone is going to start mowing students down. We shouldn't have to worry about nutters randomly starting a shooting spree in the middle of broad daylight.\n\nWe need to establish gun licenses, fully loaded with training, background checks, and psychological testing. That way, competent people get to bear arms, like the 2nd amendment allows, and guns are kept farther away from wackos at the same time.\n\nThis way, we can sensibly address gun violence without infringing on sane people's rights.", "is_submitter": false, "distinguished": null, "created_utc": 1628779198.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "here_4_cat_memes", "id": "h8nst5s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #178 | Consortii Concordus", "submission": "p2uato", "stickied": false, "body": "Yay with proper training, background checks, and other important protective measures.", "is_submitter": false, "distinguished": null, "created_utc": 1628779863.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Alert_Watercress4998", "id": "h8ntirj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #34", "submission": "p2uato", "stickied": false, "body": "Yay if it’s made certain people are responsible and safe with the weapon", "is_submitter": false, "distinguished": null, "created_utc": 1628780164.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "CielTheEarl", "id": "h8oc5ef", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #172 | Consortii Concordus", "submission": "p2uato", "stickied": false, "body": "For civilians, I'd say no. Unless you're military, sure. I don't see a reason why firearms should be allowed for ordinary citizens when there's bound to be a couple of bad sheep here and there.", "is_submitter": false, "distinguished": null, "created_utc": 1628787778.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "DDumpTruckK", "id": "h8oo4bc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p2uato", "stickied": false, "body": "I'm not really sure what a civilian needs a gun for, but I'm not intrinsically against people having guns.  Though it seems like we've got a few problems in the US that our amount of guns make a lot worse so in the interest in not exacerbating the other issues we have I think there's probably some restrictions that would be good.\n\nThere's not a convincing amount of data on guns ever *actually* helping people defend their homes.  Every story I've seen where a good guy with a gun actually *does* stop the bad guys almost *every single time* that good guy ends up getting shot by the police when they come on the scene.  I'm not sympathetic to the argument that guns are self defense.\n\nWhich leaves sport.  I understand guns are fun to shoot.  So my compromise to gun owners is this: keep them at the range.  Or keep the ammo at the range.  Or have laws that your gun must be unloaded, in a locked cabinet, *at all times* when its in your house.  No one needs loaded weapons in public.", "is_submitter": false, "distinguished": null, "created_utc": 1628792582.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "arnitdo", "id": "h8mwty5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #194", "submission": "p2uato", "stickied": false, "body": "Yes, but restricted with at least a year of firearms training.", "is_submitter": false, "distinguished": null, "created_utc": 1628761535.0, "parent_id": "t3_p2uato", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8n0mq7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "Why a year? Why not 2 weeks or 5 years? Why a time-based requirement and not a learning-based requirement?", "is_submitter": false, "distinguished": null, "created_utc": 1628764678.0, "parent_id": "t1_h8mwty5", "replies": [{"author": "arnitdo", "id": "h8nbowp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #194", "submission": "p2uato", "stickied": false, "body": "Learning based evaluation is easy to cheat and bribe. You can easily bribe your way into getting a certificate. Having a long period will discourage people who wish to buy firearms and do horrible things with them. The entire course can be structured like a uni course, such as including practical exams, theory exams, having special lectures, and also include disaster management and worst case scenario evaluation", "is_submitter": false, "distinguished": null, "created_utc": 1628771826.0, "parent_id": "t1_h8n0mq7", "replies": [{"author": "LaLiLuLeLo_0", "id": "h8ncbzq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #130", "submission": "p2uato", "stickied": false, "body": "Many states already have a mandatory waiting period, and they do nothing good. The people that wish to do harm steal or illegally buy guns whenever they want, while people needing protection sometimes [die waiting for their legal firearm](https://www.courierpostonline.com/story/news/crime/2015/06/04/woman-fatally-stabbed-berlin-twp/28461361/). Gun laws only restrict the people who follow the law.\n\nEdit: just pointing out that some coward is following me around and downvoting all my comments. Hi stranger!", "is_submitter": false, "distinguished": null, "created_utc": 1628772180.0, "parent_id": "t1_h8nbowp", "replies": []}]}]}, {"author": "FalconRelevant", "id": "h8mynz0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "People learn at different rates though.", "is_submitter": true, "distinguished": null, "created_utc": 1628763107.0, "parent_id": "t1_h8mwty5", "replies": []}]}, {"author": "LostInTheWoods1219", "id": "h8mxk6w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Basically yes. But under the condition that there is a background check and other things that can show what your intentions are. The question itself is hard to answer because not every country actually needs their citizens to have guns. Not every country is equally safe or unsafe. (If we're talking about guns as a mean of protection)", "is_submitter": false, "distinguished": null, "created_utc": 1628762167.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "WeebBalzacDeFromage", "id": "h8mznmc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #274", "submission": "p2uato", "stickied": false, "body": "Conditionally, yay. But as others have said, it's not just yes or no, it depends on their mental state, training, and whatnot.", "is_submitter": false, "distinguished": null, "created_utc": 1628763907.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "thegreatJLP", "id": "h8n26oq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #276", "submission": "p2uato", "stickied": false, "body": "Yay but no armor piercing rounds, extended magazines, bump stocks, or semi-automatic weapons. Rifles should be breech loaders or have ejectors (not allowing for rapid firing), clips should be the norm instead of magazines (fewer rounds), etc. If the guns are for self or home defense there is no need for rapid fire or armor piercing rounds (more likely to hit other members of the household) and if a rifle is used for hunting it should be a single shot rifle (caliber is up for debate depending on what animals you are using it to hunt). \n\nMy personal view has always been that the only guns someone ever would need would be a pistol, shotgun, and rifle (maybe 2 if hunting small and large game). Other than that it seems to lead to people abusing them and trying to acquire a personal armory for some perceived threat. The people who claim it is their protection from governments should just realize they have tanks, jets, drones, robots, and .50 cal snipers sitting over a mile or so away that could end you. It's a false sense of security that usually leads to those firearms being used/stolen and used to commit crimes against other citizens. But I also live in a state where every 4th of July someone chilling outside is hit by a bullet someone shot off into the air (last few years mostly children were shot), hundreds of guns being stolen from cars (unlocked and locked) daily, and people setting bombs off on Christmas. My state also made it to where anyone could own a gun and conceal carry without a permit/license so the recent rise in gun violence was easy to see coming.", "is_submitter": false, "distinguished": null, "created_utc": 1628765857.0, "parent_id": "t3_p2uato", "replies": [{"author": "R5Cats", "id": "h8qzypc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "> or semi-automatic weapons.\n\nThat's a LOT of weapons you've just banned, like 80% if you include revolvers. Criminals will still own them, and law-abiding civilians will have what, a single-shot pistol? A bolt-action rifle? Harsh language? C'mon man!", "is_submitter": false, "distinguished": null, "created_utc": 1628831594.0, "parent_id": "t1_h8n26oq", "replies": [{"author": "thegreatJLP", "id": "h8rph43", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #276", "submission": "p2uato", "stickied": false, "body": "Nah revolvers are fine, more speaking about spring loaded magazine pistols. 6 shots is understandable, needing 10+ in a magazine is unnecessary. Why not a bolt action rifle? If you're a hunter that just means you have to be a good shot or get some cardio by tracking the game you shot. It may ban a lot of guns but not all, which is the main argument against gun control, if you have to spray and pray, you probably shouldn't own a firearm in the first place.", "is_submitter": false, "distinguished": null, "created_utc": 1628851751.0, "parent_id": "t1_h8qzypc", "replies": [{"author": "R5Cats", "id": "h8sdxq8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "For self defense? You need large magazines. Criminals rarely use them  since they're harder to hide. Home owners often have seconds to get their firearm and don't have time to grab extra ammo too. Criminals can come more prepared though, another reason they don't bother with large magazines.  \n\nEven highly trained police will miss a lot, a homeowner's best hope is that the sight of a gun, or one shot will send robber(s) running. If they don't, it could take a lot of bullets to put them down, thus large magazines are best for self- or home defenders.\n\nHunters are supposed to hit hard with the first shot. I've never seen anyone advocate \"spray and pray\" while hunting, in fact only the opposite of that. All a semi- automatic does is shoot a little bit faster than a bolt action.", "is_submitter": false, "distinguished": null, "created_utc": 1628865929.0, "parent_id": "t1_h8rph43", "replies": [{"author": "thegreatJLP", "id": "h8sqyfw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #276", "submission": "p2uato", "stickied": false, "body": "Pretty sure 6 shots would be enough to send a robber running, walls are super thin in homes, so you're more likely to shoot one of your own family members in that situation. Also, my points are to cut down on mass shooting events, last one done with a bolt action style rifle was the Texas campus shooting decades ago. However, now they're a daily occurrence. I'd rather take my chances than enable unstable individuals to have access to faster shooting and higher capacity magazines. There should be a limit on the amount of firearms one person should be able to purchase and keep for a lifetime without some record of selling or gifting the gun to someone else, no one needs an arsenal in their home.", "is_submitter": false, "distinguished": null, "created_utc": 1628871437.0, "parent_id": "t1_h8sdxq8", "replies": [{"author": "R5Cats", "id": "h8tny84", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "> you're more likely to shoot one of your own family members in that situation.\n\nThat is absolute fiction. Pure gun-grabber fantasy. The most likely person hit will always be the robbers, your family is usually behind you.  \nYou're confused by drugs-gangs drive-by shootings where children are often hit. That has nothing to do with lawful citizens defending themselves.\n\n>no one needs an arsenal in their home.\n\nNo one needs a 6-digit stamp or coin collection either, but people still do it.  \nAre you suggesting that having 20 or 50 guns means you can shoot 20X or 50X more people? Lolz! Nonsense.", "is_submitter": false, "distinguished": null, "created_utc": 1628884578.0, "parent_id": "t1_h8sqyfw", "replies": [{"author": "thegreatJLP", "id": "h8u0pgc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #276", "submission": "p2uato", "stickied": false, "body": "Depending on the layout of your house that is not always the case, if your family had enough time to get behind you with someone else in your house then the smart move would be to leave the house and call police. Seriously, that was a pretty weak argument. There are two story houses where family members sleep on both floors, and ranch style houses where bedrooms are on opposite ends. If you were to use full metal jacket bullets, they would go through the drywall quite easily, which is why hollow points are the best to use for handguns in home defense.\n\nComparing a coin/stamp collection to a deadly weapon is another false equivalence, never heard of someone dying by someone throwing their stamp/coin collection at another individual. My point was there is no reason to collect deadly weapons except for the possibility of using it with deadly force, so increasing the amount of them in your home greatly increases the risk to every individual in that house. Local news story last week in my state, a guy who collected guns and passed away, left them to his children in his will. Before they could go to the house it was robbed, and over 50 firearms were taken and used in a murder a few days later. Obviously you're a gun advocate but your grand view of the situation is flawed tbh.", "is_submitter": false, "distinguished": null, "created_utc": 1628889501.0, "parent_id": "t1_h8tny84", "replies": [{"author": "R5Cats", "id": "h8uv7o3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "I give highly simplified versions of solid arguments since most gun-grabbers have the attention span (and intelligence) of a gnat.  \n\nI said \"usually\" did I not? Also: if the intruders (home invaders) also have guns? Your family is already in mortal danger. You cannot outrun most robbers, especially if you have kids in tow. Shoot them or watch your family die, it's not even a close choice.  \n\nHaving improperly stored guns in a house can be a problem, but laws forcing you to (for example) store all guns in one gun safe, and the ammunition in another, essentially deny your right to self-defense. That is by design of course, not by accident.  \nIt is up to the owner to educate all the people in or visiting the residence on proper safety, not the government.\n\nStolen guns make up a tiny % of firearms used in crimes. Even in Canada (where police chiefs outright lie about it to push the grabber agenda) this is the case. If he was a collector the guns are probably worth more on re-sale than could be obtained by crime, but crooks are stupid so...  \n\nUntil such time as the criminals are disarmed? It is genocidal to disarm the law-abiding population.   \nLook at the UK: after their big push to limit guns? Gun crime drooped a bit, then shot up as criminals now smuggled guns when it wasn't profitable to do so before. Now there were criminals with drugs AND guns involved.  \nIn response, more people bought whatever guns they could legally, and ownership actually increased after that, several years later.  \nOf course modern UK criminals (mostly, but not all, being \"recent migrants\") happily use a knife or acid. They task is to drive out infidels from Londonistan and other cities, as proscribed in the Koran.", "is_submitter": false, "distinguished": null, "created_utc": 1628903504.0, "parent_id": "t1_h8u0pgc", "replies": []}]}]}]}]}]}]}]}, {"author": "germz80", "id": "h8n2xd7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "p2uato", "stickied": false, "body": "It depends what you mean by \"right\". I think there should be better background checks, people should be tested for mental competency, and get some safety training. Training should include proper storage and better statistical information. Many people get convinced by talking heads on Fox that they are going to be attacked by criminals soon, even though they live in a really safe area. For most people, having a fire arm in the home actually *increases* the danger of someone in their home being injured or killed, especially if they aren't trained in gun safety.", "is_submitter": false, "distinguished": null, "created_utc": 1628766384.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Flesh_Bag", "id": "h8n6lc3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #95", "submission": "p2uato", "stickied": false, "body": "nay", "is_submitter": false, "distinguished": null, "created_utc": 1628768838.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "stanky_tanky", "id": "h8n6n3d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #81", "submission": "p2uato", "stickied": false, "body": "If I had a magic wand and could make gun ownership more like the UK/Canada here in the US, I would.  However, there have been so many guns in this country, for so long, that I feel like you need to armed now because of how many lunatics there are with guns out here.  There are actually more privately owned firearms in the US than there are people.", "is_submitter": false, "distinguished": null, "created_utc": 1628768869.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "jumpinjahosafa", "id": "h8n76dp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #218", "submission": "p2uato", "stickied": false, "body": "Uhh yay in general, nay for many cases though", "is_submitter": false, "distinguished": null, "created_utc": 1628769194.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "The_Ultimate_Fakr", "id": "h8nb0u1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Yay, but only your standard pistol or rifle with better background checks. There's no need for anything more powerful to defend yourself.", "is_submitter": false, "distinguished": null, "created_utc": 1628771457.0, "parent_id": "t3_p2uato", "replies": [{"author": "R5Cats", "id": "h8r0ne2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p2uato", "stickied": false, "body": "That's all the vast majority of lawful gun owners in America have. \n\nStandard semi-automatic pistols (like revolvers) and rifles.   \nWhat they look like is irrelevant: a Ruger 223 fires the same ammo the same way as an AR-15, it just \"looks more normal\" with a wooden stock. That's the gun used in Canada's [Polytechnique Massacre](https://en.wikipedia.org/wiki/%C3%89cole_Polytechnique_massacre)", "is_submitter": false, "distinguished": null, "created_utc": 1628832043.0, "parent_id": "t1_h8nb0u1", "replies": []}]}, {"author": "karlovilla", "id": "h8nbd3s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #3", "submission": "p2uato", "stickied": false, "body": "Yay, but I suppose there could be a similar system as with a driver's license.", "is_submitter": false, "distinguished": null, "created_utc": 1628771646.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "BuccaneerRex", "id": "h8nezpd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p2uato", "stickied": false, "body": "Yes, with caveats.", "is_submitter": false, "distinguished": null, "created_utc": 1628773576.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "arokace", "id": "h8nfet1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p2uato", "stickied": false, "body": "Nay.  In the current context of it.    \n\n\nLike hunting rifles, sure, that's fine.  Pistol, probably fine too.  But the whole assortment of weapons that the US Citizens have access to, no, god no.  There is no reason for someone to be able to own an assault rifle, a machine gun, etc.", "is_submitter": false, "distinguished": null, "created_utc": 1628773790.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "sapoconcho_", "id": "h8ngb38", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Nope", "is_submitter": false, "distinguished": null, "created_utc": 1628774240.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "AndrewIsOnline", "id": "h8nln7m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p2uato", "stickied": false, "body": "I feel that the history of the 2a included the militia and after three major wars over time we turned to militias into the national guard and state run militia. Gun ownership should only be allowed by those willing to join and receive training and psychological testing. Like an army reserve thing with yearly tests.\n\nOr make no gun fireable without a high tech fingerprint or dna lock", "is_submitter": false, "distinguished": null, "created_utc": 1628776744.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "risisas", "id": "h8nocgp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #280", "submission": "p2uato", "stickied": false, "body": "an individual should be trained, licensed and with a good reason to have one (ex: living in the woods were police can't help you in time) and inside a city you should have at any time you aren't treathened with safe on and mag off\n\nalso backgrownd and psicologological checks and if you commint crimes this license can be removed, and you need to renew it after some time", "is_submitter": false, "distinguished": null, "created_utc": 1628777949.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "craftycontrarian", "id": "h8noxf2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #125", "submission": "p2uato", "stickied": false, "body": "You're first going to have to convince me that rights exist.", "is_submitter": false, "distinguished": null, "created_utc": 1628778199.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "ZappyHeart", "id": "h8nucng", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Arming millions of potential mass murders isn’t a great idea. Gun death statistics show this quite clearly.", "is_submitter": false, "distinguished": null, "created_utc": 1628780514.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "roundearthervaxxer", "id": "h8nushr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p2uato", "stickied": false, "body": "No. It is insane what we are doing.", "is_submitter": false, "distinguished": null, "created_utc": 1628780698.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "sparant76", "id": "h8nzazc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #51", "submission": "p2uato", "stickied": false, "body": "I prefer waterlegs", "is_submitter": false, "distinguished": null, "created_utc": 1628782582.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "pine_ary", "id": "h8o31v5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "p2uato", "stickied": false, "body": "Yeah I think if you don‘t have a severe mental condition or a history of criminal violence you should have one. Clearly you need proper educated and a functioning society (looking at you, school shooting capital of the world) for this to work. I think Switzerland gets it right.\n\nBesides the benefits for people in rural areas and marginalized groups, I think it‘s important that the _possibility_ of violent uprising is there in case things turn south.", "is_submitter": false, "distinguished": null, "created_utc": 1628784117.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "DmitryTheRussianSpy", "id": "h8odgqt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #103", "submission": "p2uato", "stickied": false, "body": "Nay", "is_submitter": false, "distinguished": null, "created_utc": 1628788309.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "solise69", "id": "h8oj2kc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #269", "submission": "p2uato", "stickied": false, "body": "As long as you got a license to own them and common sense", "is_submitter": false, "distinguished": null, "created_utc": 1628790547.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Trickybiz", "id": "h8on510", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #7", "submission": "p2uato", "stickied": false, "body": "FUCK YEAH", "is_submitter": false, "distinguished": null, "created_utc": 1628792172.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Comrade_NB", "id": "h8oyvap", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #9", "submission": "p2uato", "stickied": false, "body": "This is so simple: We start by maximizing rights, and then justify any limits. That includes guns. \n\nI'd like to point out that handguns are by FAR the most commonly used guns in violent crime. They get almost no media attention because they don't look scary.", "is_submitter": false, "distinguished": null, "created_utc": 1628797405.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Stfudeal", "id": "h8p6mut", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #114", "submission": "p2uato", "stickied": false, "body": "Yes, people should be able to own firearms.", "is_submitter": false, "distinguished": null, "created_utc": 1628800407.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "gr13fy", "id": "h8pfn41", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #223", "submission": "p2uato", "stickied": false, "body": "of course people have the right to own fire arms. \n\nthe question is: *how* fire arms are obtained, and *who* has the right to obtain them. as well as the *type* of weapon obtained. \n\nand we need to engineer the law to make these variables as safe as possible, because a gun is a weapon and we need to treat weapons with responsibility.", "is_submitter": false, "distinguished": null, "created_utc": 1628804011.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "rustyseapants", "id": "h8q14y1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "At what point in our society guns will be totally irrelevant? Wouldn't you want to move our planet away from guns to other means of maintaining order?", "is_submitter": false, "distinguished": null, "created_utc": 1628813772.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "OuttaSightOutyaMind", "id": "h8q2irt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "The right to defend yourself as an individual, especially when governments are given access to military grade equipment I feel is paramount for any true defense of autonomy. The existence of gunpowder literally changed the inherit power dynamics of the world and depriving modern individuals of that because of superficial reasonings is Nay. \n\nLicensing is a flawed system as are all licensing systems the exist of fakes and counterfeits prove this, meaning regardless of the screening process who is screening the screeners? gets real spicey for me there.\n\nOther than that I think there should be a financially affordable public training programs or prerequisite that can prove competence with a firearm, much like certain rifles require now. \n\nI don’t think people need ARs or anything more than a pistol for most self defense situation I think even a nice is best, it’s just the fact of the matter that 9/10 times a bigger and better gun will put you at a disadvantage,\n\nThat last example may be a bit extreme but I think this conversation really lies within application and less about relative feelings or emotions around the production of guns and their owners", "is_submitter": false, "distinguished": null, "created_utc": 1628814391.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "TrueNinjafrog", "id": "h8qeb7j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #146 | Legio Virtus", "submission": "p2uato", "stickied": false, "body": "100% yes, especially within context of the US. People will malintent will always find a way to attempt to inflict harm upon other people, and while firearms are the easiest mean to do so, they're ultimately not the cause. As California and many existing laws have proven, firearm restrictions (in terms of function) do not do nearly enough to warrant their inclusion. Taxes, background checks, federal stamps, etc. already do a lot to discourage people from acquiring firearms of high potential legally, or even firearms in the first place.\n\nmost importantly, however, I believe that every person should have the right to choose to be able to defend themselves and loved ones whenever a situation heavily acts against their favor. Not to justify shooting a lost person who wandered onto your lawn, but to be able to fight back with lethal force, when it is presented.\n\ni may have biases, being a Korean-American who was raised about LA.", "is_submitter": false, "distinguished": null, "created_utc": 1628819882.0, "parent_id": "t3_p2uato", "replies": [{"author": "FalconRelevant", "id": "h8r62lx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "And end up being shot by the police when they arrive on the scene?", "is_submitter": true, "distinguished": null, "created_utc": 1628835872.0, "parent_id": "t1_h8qeb7j", "replies": [{"author": "TrueNinjafrog", "id": "h8um5gw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #146 | Legio Virtus", "submission": "p2uato", "stickied": false, "body": "Ambiguous question, who is being shot?", "is_submitter": false, "distinguished": null, "created_utc": 1628899045.0, "parent_id": "t1_h8r62lx", "replies": [{"author": "FalconRelevant", "id": "h8vqw13", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Any civilian with a gun in their hand, whether they're a criminal or an ordinary citizen trying to defend themselves.", "is_submitter": true, "distinguished": null, "created_utc": 1628921332.0, "parent_id": "t1_h8um5gw", "replies": [{"author": "TrueNinjafrog", "id": "h8vrcmx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #146 | Legio Virtus", "submission": "p2uato", "stickied": false, "body": "Those situations are quite rare (friendly fire) but honestly, but I see your concern. That ultimately goes down to police training and civilian training, where the innocent civvie should have been in a position to not pose a threat if they had the choice or chance (holstering weapon), and officer for using lethal force too quickly.", "is_submitter": false, "distinguished": null, "created_utc": 1628921673.0, "parent_id": "t1_h8vqw13", "replies": []}]}]}]}]}, {"author": "ZuccBoi_69", "id": "h8qgai8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #86", "submission": "p2uato", "stickied": false, "body": "If by right you mean every person who is not considered a danger to themselves or others (a suicidal or violent person should not have a firearm) and by firearms you mean firearms that aren’t overly dangerous compared to most firearms (automatic firearms, cannons and recoilless rifles specifically the handheld ones, and some other types should all be banned) then yes.", "is_submitter": false, "distinguished": null, "created_utc": 1628820843.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "thelma1907", "id": "h8u2ckc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #30", "submission": "p2uato", "stickied": false, "body": "Yay, but for responsible people only. No one with a history of violence or recklessness.", "is_submitter": false, "distinguished": null, "created_utc": 1628890189.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "FireMaker125", "id": "h8uht72", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2uato", "stickied": false, "body": "Yes, but with background checks and yearly psychological testing.", "is_submitter": false, "distinguished": null, "created_utc": 1628896995.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Abject_Hall7810", "id": "h8zvhxp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #176", "submission": "p2uato", "stickied": false, "body": "Yay", "is_submitter": false, "distinguished": null, "created_utc": 1629002514.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "SybariteAussie", "id": "h9aubok", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p2uato", "stickied": false, "body": "I think that those deemed worthy & responsible enough to own one should be given tax breaks & a informal reserve temporary national guard. I am not responsible enough to own one. I would be shooting in the air drunk on New Year’s Eve.", "is_submitter": false, "distinguished": null, "created_utc": 1629214283.0, "parent_id": "t3_p2uato", "replies": []}, {"author": "Valuable-Peace8307", "id": "h8oxlt7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "p2uato", "stickied": false, "body": "Aye. Every man, woman, and child should always have the ability to protect him/herself from those who would wish to take his/her life, liberty, or property. \n\nAnd a firearm is a great equalizer. An individual can defend him/herself from one or more human predators with a single firearm.", "is_submitter": false, "distinguished": null, "created_utc": 1628796885.0, "parent_id": "t3_p2uato", "replies": [{"author": "FalconRelevant", "id": "h8r66d1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "And end up being shot by the police when they arrive on the scene?", "is_submitter": true, "distinguished": null, "created_utc": 1628835949.0, "parent_id": "t1_h8oxlt7", "replies": [{"author": "Valuable-Peace8307", "id": "h8srh5d", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "p2uato", "stickied": false, "body": "No, if you’ve got a firearm legally, and cops show up, they’ll ask you to put it down. You put it down, follow instructions and everyone who isn’t a bad guy goes home.", "is_submitter": false, "distinguished": null, "created_utc": 1628871644.0, "parent_id": "t1_h8r66d1", "replies": [{"author": "FalconRelevant", "id": "h8srx25", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "The cops aren't psychic. They see you with a gun in your hand, they shoot.", "is_submitter": true, "distinguished": null, "created_utc": 1628871817.0, "parent_id": "t1_h8srh5d", "replies": [{"author": "Valuable-Peace8307", "id": "h8sw31e", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "p2uato", "stickied": false, "body": "Cops tell you to lower your weapon first. And if you don’t, then they ask again. They’re only going to shoot if they feel as if lives are going to be in danger.  And if you have a firearm and you’re told to put it down by the police and you don’t… then you’re an idiot.", "is_submitter": false, "distinguished": null, "created_utc": 1628873448.0, "parent_id": "t1_h8srx25", "replies": [{"author": "FalconRelevant", "id": "h8sxxui", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "Okay then, try being in that situation, I'll write idiot on your grave.", "is_submitter": true, "distinguished": null, "created_utc": 1628874165.0, "parent_id": "t1_h8sw31e", "replies": [{"author": "Valuable-Peace8307", "id": "h8szkg1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "p2uato", "stickied": false, "body": "I wouldn’t be stupid enough to ignore the police when/if they told me to lower my weapon. And it’s not only firearms… it’s could be freaking crowbar. If a cop tells me to lower a weapon, I’m putting whatever is in my hands onto the ground cause I don’t want someone with a gun mistaking my phone for a weapon.", "is_submitter": false, "distinguished": null, "created_utc": 1628874815.0, "parent_id": "t1_h8sxxui", "replies": [{"author": "FalconRelevant", "id": "h8t06rp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2uato", "stickied": false, "body": "The thing is that a lot of cops don't follow protocol to ensure their own safety.", "is_submitter": true, "distinguished": null, "created_utc": 1628875060.0, "parent_id": "t1_h8szkg1", "replies": []}]}]}]}]}]}]}]}]}