{"title": "Thoughts?", "name": "t3_pfn7f6", "url": "/r/TrueUnpopularOpinion/comments/pfbnjp/we_will_not_be_participating_in_the_blackout/", "selftext": "", "score": 10, "upvote_ratio": 0.79, "permalink": "/r/TheFlyingTree/comments/pfn7f6/thoughts/", "id": "pfn7f6", "author": "FalconRelevant", "link_flair_text": "Discussion", "num_comments": 112, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1630473406.0, "comments": [{"author": "Catesa", "id": "hb5uwne", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #427", "submission": "pfn7f6", "stickied": false, "body": "Vaccinated by the way. And pro-mrna vax for most people. No for children and pregnant people and people who are one fever away from death or complications. \n\nThe problem with this is that the fact that long term studies on this vax type aren't that common. There are a few on ebola and some cancers. But even those aren't that old. I am sure enough that my safety won't be compromised for the next 10 years. But longer term I don't know. There don't seem to be problems there. The next generation won't be impacted by childhood disease caused by the vaccine. And that is data before politicization of the vaccine thing. \n\nThere are some changes to blood cells, but that seems to be a covid thing in general. So if it causes problems covid most likely would have killed you.\n\n There is also the problem of hospitals being overrun in some places and nurses can bbe held accountable for mistakes caused during overflow and there are only a certain number of beds they can service lawfully. And data shows... \n\nThere also is the worsening of mental illness due to lock downs. Suicide attempts have been up, but weirdly enough successful suicides have stayed the same. Also abuse victims cannot get away from abusers sometimes because of lock downs.\n\nAnti body test isn't enough proof of having had covid. To only get one dose of vaccine. There might be reasons why, but you know that still seems stupid.\n\nThis seems like a perfect storm to freak people out. And the more uneducated, but intellectual people who are naturally more anxious will justify their feeling of unease with what is going on and they will talk and look into the politics around the vaccine and draw parallels. They see censorship and the alarm bells go off. They see the lock downs. They see the agression. They see the tracking. And green passes. And holly berries I can't blame them. \n\nStupider people look at these distrustful smarter people and take their opinions as their own. They are afraid and anxious and depraved of human contact and the fear has nowhere to go.  So they will take the first explanation that is convenient.", "is_submitter": false, "distinguished": null, "created_utc": 1630482798.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "gerkletoss", "id": "hb7zoyy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "pfn7f6", "stickied": false, "body": ">No for children and pregnant people and people who are one fever away from death or complications.\n\nWhy?", "is_submitter": false, "distinguished": null, "created_utc": 1630522756.0, "parent_id": "t1_hb5uwne", "replies": [{"author": "Catesa", "id": "hb8db1y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #427", "submission": "pfn7f6", "stickied": false, "body": "Hard no for children-I can't find any data on effects of mrna vaccines on children. Childrens bodies work differently enough that drugs sometimes work differently on them. Organ systems haven't fully developed yet including immune system. Kids very often get sick with something mild. Vaccine might make it worse if there is already an infection. Pediatrics is too complex for me right now. Until there is at least some proof that it is safe for kids to take it just seems very very ick.\n\nLeft to choice for pregnant. Pregnant I haven't found data on mrna long term effects on children born to mothers who were vaccinated while pregnant. Short term everything is more than good. The outcomes to mothers who get covid while pregnant carries higher risks for birth complications. The current cdc recommendations are for it. The weighted risks come out positive. I am okayish with it, but more than that I believe that, ideally every one around them would be vaccinated and that there should not be a need to deal with unknown.\n\nNeutural and a bit horrified for sickly people-Fever is a common enough side effect that people aren't worried about it. If you are a fever away from death then taking the vaccine is close to assisted suicide. If the person is one fever away from complications and might be covid away from death, they really should not be pressured in any way.", "is_submitter": false, "distinguished": null, "created_utc": 1630528259.0, "parent_id": "t1_hb7zoyy", "replies": [{"author": "gerkletoss", "id": "hb8f7u9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "pfn7f6", "stickied": false, "body": "What is the potential mechanism of harm for children and fetuses? Because they've already got mRNA and COVID exposure, and on average they handle it better than adults.", "is_submitter": false, "distinguished": null, "created_utc": 1630529039.0, "parent_id": "t1_hb8db1y", "replies": [{"author": "Catesa", "id": "hb9puko", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #427", "submission": "pfn7f6", "stickied": false, "body": "Fetuses live on the mother's immune system,. there are adolescent trials already done. \n\nPeople under 12 do not get vaccinated unless as a part of a trial? As far as I am aware. Covid exposure yeah they do handle it better than adults. A lot better.  1 in thousand if I remember correctly get mis-c tho.\n\nI do not know. If the benefits out weight the risks. In adolescents they do.", "is_submitter": false, "distinguished": null, "created_utc": 1630551183.0, "parent_id": "t1_hb8f7u9", "replies": [{"author": "gerkletoss", "id": "hb9pydm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "pfn7f6", "stickied": false, "body": "Wrong on the first sentence.", "is_submitter": false, "distinguished": null, "created_utc": 1630551239.0, "parent_id": "t1_hb9puko", "replies": [{"author": "Catesa", "id": "hb9ru05", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #427", "submission": "pfn7f6", "stickied": false, "body": "You are right. I meant more anti-bodies, they do have their own T-cells and NK cells, but you are right.", "is_submitter": false, "distinguished": null, "created_utc": 1630552209.0, "parent_id": "t1_hb9pydm", "replies": [{"author": "gerkletoss", "id": "hb9sq2u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "pfn7f6", "stickied": false, "body": "Not antibodies either.", "is_submitter": false, "distinguished": null, "created_utc": 1630552679.0, "parent_id": "t1_hb9ru05", "replies": [{"author": "Catesa", "id": "hb9t0xj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #427", "submission": "pfn7f6", "stickied": false, "body": "Isn't there passive immunity? From antibodies that pass through the placenta?", "is_submitter": false, "distinguished": null, "created_utc": 1630552837.0, "parent_id": "t1_hb9sq2u", "replies": []}]}]}]}]}]}]}]}, {"author": "Psychological-Bee352", "id": "hb9hus4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #455", "submission": "pfn7f6", "stickied": false, "body": "wow, that’s a powerful analysis. well done", "is_submitter": false, "distinguished": null, "created_utc": 1630547249.0, "parent_id": "t1_hb5uwne", "replies": [{"author": "Catesa", "id": "hb9qs7k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #427", "submission": "pfn7f6", "stickied": false, "body": "Ehhh, I would consider it a 6 out of 10 if being generous. 1 being bulship and 10 being 1+1=2 kind of true. Not well done. \n\nNot baseless, but more opinion based on research and talking  to health care personnel than hard scientific fact with solid logic.", "is_submitter": false, "distinguished": null, "created_utc": 1630551665.0, "parent_id": "t1_hb9hus4", "replies": []}]}]}, {"author": "DDumpTruckK", "id": "hb79eoz", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "pfn7f6", "stickied": false, "body": "People getting angry about social media 'censorhip', meanwhile culture, society, and government censor the *actual* media *every day* in ways that are *far more complex, difficult to fight, and dangerous,* than someone getting banned from Reddit.  It is a failure to correctly prioritize dangers to call Reddit bans 'censorship'.", "is_submitter": false, "distinguished": null, "created_utc": 1630512024.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "Akeldama22", "id": "hb7rrne", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #423", "submission": "pfn7f6", "stickied": false, "body": "This right here. Until we prioritize correctly things are gonna stay the same. Get the media to return to integrity based journalism and get rid of the sensational fear spreading clown show that it is, get money out of politics (lobbying, stocks, all of it) because until we do money will control everything, the federal reserve is a scam and our economy is a joke, our wars are funded on both sides by the same banks, income inequality gets worse and worse. Meanwhile we all give into materialism and consumerism and do whatever we can to escape our reality instead of digging inside ourselves and figuring out how to make it better for us and everyone else involved. A handful of people could essentially fix the world if they chose to do so, but greed is a strong emotion. Until we stop bickering about miniscule things on the internet and address these core problems of our reality, shits gonna stay the same.", "is_submitter": false, "distinguished": null, "created_utc": 1630519493.0, "parent_id": "t1_hb79eoz", "replies": []}]}, {"author": "Traditional_Meat1299", "id": "hb5joo2", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seer", "submission": "pfn7f6", "stickied": false, "body": "I tend to agree with non censorship. My personal feelings have nothing to do with this.", "is_submitter": false, "distinguished": null, "created_utc": 1630473995.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "PalatableNourishment", "id": "hb6omug", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "pfn7f6", "stickied": false, "body": "Yep. Censoring misinformation makes the misinformed double-down on it, feeing vindicated that they know the hidden truth.\n\nDebunking it takes a lot of effort and is usually a thankless job. In my opinion, everyone can lighten that burden by having open, respectful conversations within their own circle to decrease the feelings of isolation that usually precede someone falling into a rabbit hole of conspiracies.", "is_submitter": false, "distinguished": null, "created_utc": 1630503253.0, "parent_id": "t1_hb5joo2", "replies": []}]}, {"author": "Ryuujinx", "id": "hb5rk1p", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #411", "submission": "pfn7f6", "stickied": false, "body": "Debunking misinformation only works if the person goes into it with an open mind. If they are simply looking for something to confirm their bias, then it does not matter - the damage is already done and they will then spread their own misinformation. Look at how large the anti-vaxx movement is. Not just for COVID, but in general. The information that vaccines do not in fact cause autism have been around for years, yet they still parrot it.", "is_submitter": false, "distinguished": null, "created_utc": 1630479944.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "U_L_Uus", "id": "hb5ur55", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #119 | Classis Veritatus", "submission": "pfn7f6", "stickied": false, "body": "I mean, this is kinda like saying \"we'll allow nazis, you just have to debunk their propaganda\". Seriously, people just think about the freedom of speech but not of the duties behind it (e.g.using non-malicious, contrasted information)", "is_submitter": false, "distinguished": null, "created_utc": 1630482664.0, "parent_id": "t1_hb5rk1p", "replies": [{"author": "Golden-Snowflake", "id": "hb6odg5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "exactly, well said.", "is_submitter": false, "distinguished": null, "created_utc": 1630503128.0, "parent_id": "t1_hb5ur55", "replies": []}, {"author": "Psychological-Bee352", "id": "hb9iflw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #455", "submission": "pfn7f6", "stickied": false, "body": "Are you comparing having doubts about vaccines to Naziism?", "is_submitter": false, "distinguished": null, "created_utc": 1630547524.0, "parent_id": "t1_hb5ur55", "replies": [{"author": "U_L_Uus", "id": "hbabg8q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #119 | Classis Veritatus", "submission": "pfn7f6", "stickied": false, "body": "I'm comparing vaccine conspirationist propaganda to the nazi's, yes", "is_submitter": false, "distinguished": null, "created_utc": 1630564355.0, "parent_id": "t1_hb9iflw", "replies": []}]}]}, {"author": "R5Cats", "id": "hb7x424", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "It cuts both ways though: there's been a great deal of 'misinformation' and confirmation bias on the pro-vaxx side too. As the science 'evolves' so too do the facts. What was anti-science one day may be certified truth a month later.  \n\nFor the record, pre-covid \"anti-vaxxers' were largely liberal-leftists & hippies. Some religious kooks in there too, but mostly middle class White 'liberal' women.  \n\nDemanding that children (under 18!) get vaxxed when they literally have no chance of dying from Covid-19, and 1/20th the chance of that from Delta? That's not a good idea. They should catch the Delta and be 5-10X more resistant to any future strains that come along.  \nNon-symptomatic people simply don't spread the disease, not nearly as much as those with symptoms do.  \n& etc.", "is_submitter": false, "distinguished": null, "created_utc": 1630521693.0, "parent_id": "t1_hb5rk1p", "replies": []}]}, {"author": "Psychological-Bee352", "id": "hb9k2dy", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #455", "submission": "pfn7f6", "stickied": false, "body": "u/GLXC_AUS another  Star  Wars  quote  fits  perfectly  here:  “If  you  strike  me  down  I  shall  become  more  powerful  than  you  can  possibly  imagine.”\n\nThe idea that we can erase these voices is naive. It just convinces them they’re right and a threat to the ‘powers that be’, and then they come up with ways of communicating that are harder to reach (and reason with).", "is_submitter": false, "distinguished": null, "created_utc": 1630548300.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "pine_ary", "id": "hb5y43m", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "pfn7f6", "stickied": false, "body": "The marketplace of ideas is a stupid concept. It completely falls apart with bad faith actors. I can just spew quippy nonsense and anyone who wants to debunk it has to waste lots of their time on a detailed and nuanced answer. Then I just disregard that and move on to the next talking point.  Look it up, it‘s called [Brandolini‘s law](https://en.wikipedia.org/wiki/Bullshit_asymmetry_principle). Also lying and logical fallacies give you a rhetoric advantage.\n\nPeople fail to realize that arguments aren‘t what‘s winning people over. Narratives are. You need to package your arguments right and tell a story with them. Outside academia is rarely matters who has the best argument.\n\nThe way I see it, this is enabling bad outcomes on principle. And that‘s just idealistic nonsense.\n\nAlso that sub is awful. It normalizes right-wing talking points. And there‘s some vile shit in there that goes unquestioned. So many conservatives circlejerking their persecution complex.", "is_submitter": false, "distinguished": null, "created_utc": 1630485672.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "John__Nash", "id": "hb6ahzt", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #17", "submission": "pfn7f6", "stickied": false, "body": "I fully agree about narratives. But for the person who is falling for bullshit like the ivermectin thing, censoring them and doing the porn spam thing feeds directly into that narrative and serves to reinforce that belief. \n\nAlternative, productive narratives would be a better option.", "is_submitter": false, "distinguished": null, "created_utc": 1630495576.0, "parent_id": "t1_hb5y43m", "replies": [{"author": "pine_ary", "id": "hb6b39m", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "pfn7f6", "stickied": false, "body": "I wouldn‘t worry about individual people who fell for it. The underlying causes are way more interesting. Misinformation, populism, and reactionary politics are profitable. That is the problem. As long as something is profitable, it will be done. Instead of trying to \"convert\" or censor people who fell for it we need to dry up the money that feeds the propaganda machine.\n\nIn my opinion political movements should come from the bottom up as grassroots efforts. As such large donations or funding to political causes should not be a thing. Any monetary contribution for political aims that is too big should be illegal.", "is_submitter": false, "distinguished": null, "created_utc": 1630495962.0, "parent_id": "t1_hb6ahzt", "replies": [{"author": "Golden-Snowflake", "id": "hb9ycjz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "well said.", "is_submitter": false, "distinguished": null, "created_utc": 1630555728.0, "parent_id": "t1_hb6b39m", "replies": []}]}]}]}, {"author": "GLXC_AUS", "id": "hb5uklc", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #260", "submission": "pfn7f6", "stickied": false, "body": "Censorship can be best represented by the Anakin Skywalker and Obi wan analogy:\n“You became the very thing you swore to destroy!”\n\nPeople become the oppressor when there's contradictory ideas and values - they want to have the freedom to say their mind while silencing those who are against,  all for the sake of fight oppressors. \n\nI've read it's based off from misinformation from either insufficient evidences or blant lies and deceptions.  \nAnd like I say,  if it exists or known,  it should always be up for questioning and accountability. \n\nNo side of politics or soul has been guilt free of censorship (I've been and am guilty myself). Learning to mediate, apply countermeasures and resolutions is vital.", "is_submitter": false, "distinguished": null, "created_utc": 1630482508.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "Golden-Snowflake", "id": "hb6oa9f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "what is the answer to 1+1?  \n\n\ndo we know it?   \nCan we say what it is definitively?  \n\n\nIf yes, then why do we allow \"Alternative\" concepts, around this?  \nDoes it help someone?  \nDoes it do more good than harm?  \nIf no, then why don't we simply stop the behaviors, just like we would stop the behaviors of a child, biting another child?  \n\n\nHarm is harm, we should not allow others to harm the intelligence of others, nor their physical bodies.   \nWe know, for a fact, that if we allow someone to learn 1+1 = 6 they will have a worse time of things in the future, we can easily prevent that, so we should prevent it.   \n\n\nNot every instance of misinformation is nefarious.   \nThough enough of it is, that folks are getting dosed with radiation, due to \"Magical healing\" Bracelets.", "is_submitter": false, "distinguished": null, "created_utc": 1630503086.0, "parent_id": "t1_hb5uklc", "replies": [{"author": "Psychological-Bee352", "id": "hb9ggfd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #455", "submission": "pfn7f6", "stickied": false, "body": "Playing devil’s advocate, if we had Reddit in the olden days, the idea that the world is indeed round would have been censored as misinformation. Censorship may prevent some harms but at the expense of also blocking access to new ideas that are true and important yet controversial.", "is_submitter": false, "distinguished": null, "created_utc": 1630546582.0, "parent_id": "t1_hb6oa9f", "replies": [{"author": "Golden-Snowflake", "id": "hb9m1f3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "if we didn't have scientists, yes... yes that's very true.\n\nHowever we do, and they are already more important than the regular chaff for a reason.  \n\n\n[https://en.wikipedia.org/wiki/Appeal\\_to\\_fear](https://en.wikipedia.org/wiki/Appeal_to_fear)", "is_submitter": false, "distinguished": null, "created_utc": 1630549271.0, "parent_id": "t1_hb9ggfd", "replies": [{"author": "Psychological-Bee352", "id": "hb9njgd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #455", "submission": "pfn7f6", "stickied": false, "body": "Scientists existed back then but had to be careful not to challenge the real intellectual authorities of the time — the priests. Each era defers to its experts, some people of integrity and others corrupt to the core. Though science itself is fucking awesome.\n\nBTW, are you saying I am making an appeal to fear by talking about the drawbacks of censorship? Or am I jumping to conclusions?", "is_submitter": false, "distinguished": null, "created_utc": 1630550016.0, "parent_id": "t1_hb9m1f3", "replies": [{"author": "Golden-Snowflake", "id": "hb9xerf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "I am listing that, as we are both kinda making an appeal to fear, yes.   \n\n\nMe, using the concept of the \"Magical bracelets\" and you using the concept of too much power, causing corruption.   \n\n\nhonestly, either way, I would rather have the corruption, as it is generally far easier to root out a few bad eggs, than it is to root out an entire trained population. \n\n  \nThere are always pro's and cons to every scenario.   \nThe pro for mine, is its easy to root out a couple bad eggs, vs a billion.   \n\n\nThe pro for yours, freedom, which can be good... but in this case, I feel we have too much freedom.   \n\n\nhttps://www.youtube.com/watch?v=C7TwBUxxIC0", "is_submitter": false, "distinguished": null, "created_utc": 1630555203.0, "parent_id": "t1_hb9njgd", "replies": []}]}]}]}, {"author": "R5Cats", "id": "hb7uw5w", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "Well, 2+2=5 we all know that!  \n\nAnd yes, 'modern' teaching methods in US Public schools will tell a child that their answer of 1+1=6 *is correct*. \n\nWhy do we \"allow alternative concepts\"? Because we're (well, y'all) are supposed to be a free society! That includes the freedom of speech & that includes the freedom to say stupid things.  \n\nWhen the top Government Institutions are the ones spreading lies, misinformation and propaganda? WHO are we supposed to believe as they change their story every few weeks?  \nNo masks, one mask, TWO masks, ok just 1 mask & etc. (Why not THREE masks! Are you trying to murder Grandma?) \n\nThe facts remain that children under 17 simply don't die from Covid-19 without 2-3 co-morbidities, and the Delta Variant is 1/20th as lethal.  \nSo why force them to wear masks at all? When masks have been proven to have little to no influence in spreading the covid in schools, a recent CDC report concluded.\n\nYet here we are (Manitoba) locked down *again* with miniscule mortality rates and forcing children in schools to wear masks... IF they'll be allowed back at all. \n\nThe damage done by lockdowns, the countless lives lost, the suffering of the children will never be admitted to by the 'Government Institutions' that now rule unchecked.", "is_submitter": false, "distinguished": null, "created_utc": 1630520778.0, "parent_id": "t1_hb6oa9f", "replies": [{"author": "Alatain", "id": "hb7z6k8", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pfn7f6", "stickied": false, "body": "Please cite your sources for any of the information you are claiming. Specifically any reports you are citing.", "is_submitter": false, "distinguished": null, "created_utc": 1630522545.0, "parent_id": "t1_hb7uw5w", "replies": [{"author": "R5Cats", "id": "hb8676t", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "2+2=5 because the government says so. You can always believe the government, right? When have they ever been wrong?\n\n>No masks, one mask, TWO masks, ok just 1 mask & etc. (Why not THREE masks! Are you trying to murder Grandma?)\n\nC'mon man, you haven't been paying attention for the past 20 months of \"5 weeks\"?\n\n[Table 2](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1001359/Variants_of_Concern_VOC_Technical_Briefing_16.pdf) this is UK official government data, ok? Not some random blogger. If you can't agree this is accurate? Then what is?  \nYes they preface this by saying 'more study is required' *that's always the case* in science. Table 2 is definitive.", "is_submitter": false, "distinguished": null, "created_utc": 1630525394.0, "parent_id": "t1_hb7z6k8", "replies": [{"author": "Alatain", "id": "hb8yj2a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pfn7f6", "stickied": false, "body": "Given your post and you not giving any context for what you are claiming, can I have you specifically state what you are arguing for in citing table 2 above. Otherwise, I can try and guess what you are getting at, but would really only be discussing strawmen that I construct against you. \n\nWhat are you actually trying to say?", "is_submitter": false, "distinguished": null, "created_utc": 1630538084.0, "parent_id": "t1_hb8676t", "replies": [{"author": "R5Cats", "id": "hba1x3a", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "Are you dense? The official UK government data says that Delta is 0.1% lethal, which is 1/20th the alleged lethality of standard Covid-19.84 at 2%.  \nClear enough for you now? It's right there: 0.1%. Of course normal Covid-19.84 has dropped in lethality recently, but the \"2%\" myth is still being pushed.", "is_submitter": false, "distinguished": null, "created_utc": 1630557796.0, "parent_id": "t1_hb8yj2a", "replies": [{"author": "Alatain", "id": "hbb2651", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pfn7f6", "stickied": false, "body": "Not dense. Just getting you to actually state what it is you are claiming. I have found that in these types of discussions, ambiguous claims can lead to goalpost moving and other rhetorical tricks. I like to get very clear statements. \n\nSo, looking at your data, I see one glaring issue. According to the same table you cite, there is actually very little collected data on the Delta variant available at the moment. Especially in the one statistic that would be necessary to calculate a death rate. We have a total of 60,655 possible cases, but have only managed to follow up on 5,762 of those after 28 days. That is a tiny sample size and only about 9% of the suspected cases. Compare that to the data sample from the Alpha variant where over 96% of cases were followed up on after 28 days and you get much better data. \n\nThe truth is that we just don't know enough at this time to get a good fatality rate estimation. We do have two studies (one from Scotland and one from Canada) that show that symptoms seem to be worse and hospitalization rates are higher for the Delta variant, but we just don't know with any certainty at the moment.", "is_submitter": false, "distinguished": null, "created_utc": 1630585064.0, "parent_id": "t1_hba1x3a", "replies": [{"author": "R5Cats", "id": "hbc94g8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "So you claim we should pay NO attention to emerging data? OR should we apply the solid data we have?  \n5,762 is a pretty large sample size. There's also thousands with no symptoms at all, of course. And the fatality rate for Covid-19 Alpha has fallen considerably as treatments improve.  \nAll those things suggest there is no reason to panic & lockdown because of Delta.", "is_submitter": false, "distinguished": null, "created_utc": 1630603515.0, "parent_id": "t1_hbb2651", "replies": [{"author": "Alatain", "id": "hbcdq42", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pfn7f6", "stickied": false, "body": "You are setting up a false dichotomy. There are more options than paying \"NO attention to emerging data\" or fully accepting a preliminary statistic from a single country with a limited data set. We should be adjusting as evidence comes out, but currently we have pretty good evidence that states with low-vaccination rates and low rates of masking and social distancing quickly get overwhelmed and result in unnecessary deaths. Florida is a pretty good example.\n\nAre full lock downs needed? Probably not. Is vaccine advocacy and mask mandates a good idea? Probably.", "is_submitter": false, "distinguished": null, "created_utc": 1630605353.0, "parent_id": "t1_hbc94g8", "replies": []}]}]}]}]}, {"author": "Golden-Snowflake", "id": "hb9ku3a", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "This illness, has been proven to have the ability to re-infect those it has infected.   \n\n\nWhat this means, is if we don't nip it in the bud, entirely, it will continue to spread, killing those we care about.   \nWho are those we care about? your grandmother, your grandpa, your elderly father and mother...   \n\n\nthe rate of infection, and the high death toll to those that ARE affected by the death toll, are the reason we all wear equipment to reduce that affect, and why we are supposed to be staying in doors.   \n\n\na child with a knife, isn't really a problem, and even when he's stabbing other kids, so long as he's not hurting himself he will be fine... Right?  \n\n\nIf we take away the knife, the stabbing stops.", "is_submitter": false, "distinguished": null, "created_utc": 1630548677.0, "parent_id": "t1_hb8676t", "replies": [{"author": "R5Cats", "id": "hb9zi9h", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "It will spread, yes. And is less lethal than the common flu in a bad season.  \nAnd once infected? People are 5X more resistant to new strains than if they got the shots. Facts matter.\n\nIt will NOT SPREAD after herd immunity is reached. It may continue to exist, but until it mutates into a NEW form? Those who've caught it are virtually immune and cannot transmit what they cannot catch! This is simple stuff right here...\n \nYou can take every knife away from criminals? You can take away every knife from *potential criminals*? You can take away pieces of metal that could be sharpened?  \nYou're a loony. \n\nKids used to carry jackknives every day, everywhere. ALL of them had a knife. When a fight broke out? NO ONE pulled their knife because all the other boys would beat the shit out of them for just showing it. Knife injuries were few and far between. Reality.\n\nJust IGNORE the facts I presented, pretend they don't exist! Genius!", "is_submitter": false, "distinguished": null, "created_utc": 1630556386.0, "parent_id": "t1_hb9ku3a", "replies": [{"author": "Golden-Snowflake", "id": "hba19qn", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "[https://en.wikipedia.org/wiki/Gish\\_gallop](https://en.wikipedia.org/wiki/Gish_gallop)  \n[https://en.wikipedia.org/wiki/Spreading\\_(debate)](https://en.wikipedia.org/wiki/Spreading_(debate))\n\nEvery attempt you have made, was irrevocably wrong.  \nThis isn't a question, you're just daft.\n\nWill it spread?  \nyes.  \n does an elderly person still die, after that asshole who has had it 6 times, spreads it to them?  \nyes.\n\nStop being a dumbass. Thank you.  \n\n\nhttps://ibb.co/TcF27tP", "is_submitter": false, "distinguished": null, "created_utc": 1630557405.0, "parent_id": "t1_hb9zi9h", "replies": [{"author": "R5Cats", "id": "hba3163", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "[Delta is 0.1% lethal.](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1001359/Variants_of_Concern_VOC_Technical_Briefing_16.pdf) Unless you think the UK Government is lying? Table 2 says it all.\n  \nYou notice how NO one is talking about deaths any longer? Yeah that's why. Delta's 0.1% is lower than the common Flu in a bad year. Other variants are even lower, most are 0.0% lethal. See above.\n \nYour fantasy scenario is *completely stopped* by herd immunity. That is what herd immunity DOES! It stops chain reactions like control rods in a nuclear reactor.  \nWHO has had Covid-19 6 times? That's fucking fiction. Proof or STFU. Show me the thousands who've had it 6X!", "is_submitter": false, "distinguished": null, "created_utc": 1630558486.0, "parent_id": "t1_hba19qn", "replies": [{"author": "Golden-Snowflake", "id": "hba3b9j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "[https://ibb.co/TcF27tP](https://ibb.co/TcF27tP)\n\nSorry dumdum, you are wrong again.\n\nHerd immunity only works, if everyone is treated, and there are no antivaxxers, nor folks intentionally spreading the damn disease.\n\nWhich guess what dumdum?\n\nThere are, it keeps being shown on tiktok, and youtube.\n\nOhhh goodness, he's name calling now, watch out... you're an adorable idiot, at least.  \n\n\nOnly way to stop the disease from spreading, is to prevent it from spreading, which requires masks, and requires those like, teenagers to man the fuck up. stop being stupid stupid.", "is_submitter": false, "distinguished": null, "created_utc": 1630558663.0, "parent_id": "t1_hba3163", "replies": []}]}]}]}]}]}]}, {"author": "Psychological-Bee352", "id": "hb9gnte", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #455", "submission": "pfn7f6", "stickied": false, "body": "Thank you for existing.", "is_submitter": false, "distinguished": null, "created_utc": 1630546677.0, "parent_id": "t1_hb7uw5w", "replies": []}]}]}]}, {"author": "shig23", "id": "hb6baw3", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pfn7f6", "stickied": false, "body": "I’m generally against censorship. But when it comes to covid misinformation, we’re way beyond \"difference of opinion\" and well into \"fire in a crowded theater\" territory. It is causing deaths. Freedom of expression does not supersede the right to not die needlessly.", "is_submitter": false, "distinguished": null, "created_utc": 1630496100.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "GLXC_AUS", "id": "hb5sxoh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #260", "submission": "pfn7f6", "stickied": false, "body": "Wait,  r/mbtimemes ?\n\nAh well.", "is_submitter": false, "distinguished": null, "created_utc": 1630481091.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "Niskanen204", "id": "hb6tkgz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "pfn7f6", "stickied": false, "body": "Doing a blackout is pointless. May as well go hide under the covers and huff your own farts.", "is_submitter": false, "distinguished": null, "created_utc": 1630505440.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "KuriousKhemicals", "id": "hb7vqqz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pfn7f6", "stickied": false, "body": "NNN was just banned about an hour ago and a large selection of other misinfo subs quarantined.", "is_submitter": false, "distinguished": null, "created_utc": 1630521127.0, "parent_id": "t1_hb6tkgz", "replies": []}]}, {"author": "Zealousideal_Mix_629", "id": "hb83cyp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pfn7f6", "stickied": false, "body": "Agreed, censorship only gives it power.", "is_submitter": false, "distinguished": null, "created_utc": 1630524247.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "BasketCase1234567", "id": "hb5kxia", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #449", "submission": "pfn7f6", "stickied": false, "body": "Censorship is always bad imo", "is_submitter": false, "distinguished": null, "created_utc": 1630474868.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "Golden-Snowflake", "id": "hb9ye1m", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "so jail is bad, ok, good talk.", "is_submitter": false, "distinguished": null, "created_utc": 1630555751.0, "parent_id": "t1_hb5kxia", "replies": [{"author": "BasketCase1234567", "id": "hb9yinp", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #449", "submission": "pfn7f6", "stickied": false, "body": "Jail =/= censorship", "is_submitter": false, "distinguished": null, "created_utc": 1630555824.0, "parent_id": "t1_hb9ye1m", "replies": [{"author": "Golden-Snowflake", "id": "hba0izf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "Bro, they just want to murder folks, its their life, why you telling them how to live it?  \n\n\nYes, jail and censorship are the same thing, its gatekeeping.   \nWe have done it for eons, to protect one another, till recently, it was a viable tool, now ya'll whining about it like its somehow inherently bad, which isn't true.", "is_submitter": false, "distinguished": null, "created_utc": 1630556968.0, "parent_id": "t1_hb9yinp", "replies": [{"author": "BasketCase1234567", "id": "hba3bkw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #449", "submission": "pfn7f6", "stickied": false, "body": "I actually cannot believe you're trying to argue such a ridiculous point. Idc if you think jail is censorship. You can understand what I meant from my first comment. Stop looking for a fight when there is none.", "is_submitter": false, "distinguished": null, "created_utc": 1630558668.0, "parent_id": "t1_hba0izf", "replies": [{"author": "Golden-Snowflake", "id": "hba45s5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "You were wrong, and I fixed it for you, no need to be mad about it.", "is_submitter": false, "distinguished": null, "created_utc": 1630559198.0, "parent_id": "t1_hba3bkw", "replies": [{"author": "BasketCase1234567", "id": "hba49jz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #449", "submission": "pfn7f6", "stickied": false, "body": "Censorship is the suppression of free speech and information. I wasn't wrong.", "is_submitter": false, "distinguished": null, "created_utc": 1630559268.0, "parent_id": "t1_hba45s5", "replies": [{"author": "Golden-Snowflake", "id": "hba5nem", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "Censorship is gatekeeping.\n\nAnd gatekeeping has protected us for millennia.\n\nAll censorship is gatekeeping, though not all gatekeeping is censorship.  \nJail, is a form of gatekeeping.  \nJail is also a form of censorship.\n\nall depends on who's perspective you are looking from.  \n\n\nSo yes, you were wrong.", "is_submitter": false, "distinguished": null, "created_utc": 1630560168.0, "parent_id": "t1_hba49jz", "replies": [{"author": "BasketCase1234567", "id": "hba6njz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #449", "submission": "pfn7f6", "stickied": false, "body": "You can't just link things together until you get the answer you want. \n\nStrawberries are a fruit which is a plant and a Venus fly trap is also a plant therefore Venus fly traps are a type of strawberry.\n\nCensorship restricts information. Jail does not. That's my point now stfu.", "is_submitter": false, "distinguished": null, "created_utc": 1630560848.0, "parent_id": "t1_hba5nem", "replies": [{"author": "Golden-Snowflake", "id": "hba7ow6", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "Jail restricts information, just as blackholes preserve it.   \n\n\nThus your point is false, wrong, etc.   \n\n\nAll censorship is gatekeeping, not all gatekeeping is censorship.  \n we have already gone over this.   \n\n\nThis is a fact, just as is a fact, that all plants are plants, and all strawberries are plants, but not all plants are strawberries.   \n\n\nI'm sorry if that is upsetting you, but this is how reality is.   \n\n\nCensorship when used correctly, is good, we have been doing it for eons.   \nCorruption happens certainly, though its a risk that folks must take, to protect those weaker to such things.   \n\n\nFor instance you, are having a hard time understanding a simple concept, and must be protected. <3", "is_submitter": false, "distinguished": null, "created_utc": 1630561572.0, "parent_id": "t1_hba6njz", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "TesseractToo", "id": "hb6a4xb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "pfn7f6", "stickied": false, "body": "This would be the answer if we were talking about sensible people. Unfortunately for the last 40 years part of the population that is already been primed to disregard and distrust science has been manipulated to the point where they now believe that this is a control tactic not a way to help them.\n\nReality isn't the same to them and words don't mean the same thing.\n\nThe group of people I'm talking about are or course radical pentacostal christian republicans. These are the people who can be manipulated int anything as they have been raised with male authority figures denying science and being taught that everything good and bad that happens is because God or if they don't like it, because Satan. It's not even the bible anymore it's like a weird fanfiction version gone out of hand.\n\nPeople get more radical when times are bad and events like 9/11 and the 2008 housing crash in the US and privatization if services and minimum wage going lower and lower (well staying steady despite inflation) and many other things has put pressure on these communities causing radicalization.\n\nI've been following the Flat Earth comminuty since late 2016 and it;s the same mindset. You can show them all the answers there are and they are still going to make up shit that distorts reality to suit their theory.\n\nLogic can't help people who think there is a conspiracy. (Censorship won't help either as it makes conspiracy believers buckle down so I don't really have an answer. The best thing would be for their leaders to stop being asshats but they are already bleeding their people dry financially, it's really sad.)", "is_submitter": false, "distinguished": null, "created_utc": 1630495335.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "areyouseriousdotard", "id": "hb6atkw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "pfn7f6", "stickied": false, "body": "It's ridiculous, to go private in protest.\nBut, I have been having fun trolling the antivaxxers on /r/banned\n\nMost subs have been using an automod to preemptively ban people from that sub.\nI really don't like those people but they should not be banned without reason.\nI think it's overkill.  But, I think people take reddit way too seriously.\nReddit has created a group of powermods because it it useful for keeping costs down.  It's free labor.  But, It has caused these superusers to become drunk w power w frequent mod abuse.", "is_submitter": false, "distinguished": null, "created_utc": 1630495788.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "HM_mtl", "id": "hbb7zg2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #487", "submission": "pfn7f6", "stickied": false, "body": "Unpopular opinion: If \"they\" are trying to censor misinformation, that means that \"misinformation\" is likely true.", "is_submitter": false, "distinguished": null, "created_utc": 1630588050.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "SybariteAussie", "id": "hb5lgyj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pfn7f6", "stickied": false, "body": "I have no idea what that is?", "is_submitter": false, "distinguished": null, "created_utc": 1630475255.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "U_L_Uus", "id": "hb5uk2g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #119 | Classis Veritatus", "submission": "pfn7f6", "stickied": false, "body": "TL;DR: Some subs protested together against Reddit's permissiveness regarding COVID misinformation. Reddit's answer was \"they've a different opinion, so no matter how baseless and/or dangerous it is, we'll allow it\", and now those subs, a huge majority, are doing a blackout as a mean pf protest against it", "is_submitter": false, "distinguished": null, "created_utc": 1630482495.0, "parent_id": "t1_hb5lgyj", "replies": [{"author": "SybariteAussie", "id": "hb5wjkb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pfn7f6", "stickied": false, "body": "Perhaps it’s my age but I don’t understand most of your comment? Not criticising you. I just am unfamiliar with some of the jargon or slang words. Don’t tell me, I will try to imagine what a blackout is? 🤔Lots of people have stronger feelings about vaccines than I do for my dog. I’m trying to understand. Maybe because I ceased consuming any domestic media years ago? I hear blackout, I think of WW2, people had to pull the blinds closed. Drive without headlights etc. Am also enjoying the ambiguity about your first sentence. I’m not sure what your concept of misinformation is? I find the extremes on both sides a little startling.", "is_submitter": false, "distinguished": null, "created_utc": 1630484262.0, "parent_id": "t1_hb5uk2g", "replies": [{"author": "U_L_Uus", "id": "hb5yeej", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #119 | Classis Veritatus", "submission": "pfn7f6", "stickied": false, "body": "When we talk about misinformation we talk about information that, be it on purpose or not, ignores facts, evidence,... , therefore making it useless for the common folk, yet is still spread about like there's no tomorrow. Think of it this way: if there's a bump on the road and I go around saying there's no bump, that's misinformation. The great problem comes when a group of people distributes it on purpose, no matter if they're wilful ignorants or not.\n\nThat's the great problem with the antivaxx movement, and the anti-COVID in particular. Their opinions are based on studies that ignore pieces of evidence, thus disabling them as scientifical proof. And on this I want to tie in something that the answer to the protest mentioned, this isn't dissidency. Disidency is when on the 19th century some people on the scientific community were holding that platypuses were mammals, while being dissed by the remainder scientific community. Saying that because your 10 people study (which is useless because in statistics the size of the sample greatly influences the conclusions) was rejected you're a  disident is like saying that because no one in your immediate surroundings is attached to you you're a pariah.\n\nThat's why people is so tilted about reddit doing this (and why those subreddits won't have any posts for a while), because they are refusing to close down those that are spewing things out that are utterly detrimental because we're in a global pandemic and every step someone takes back is a step back for the whole world", "is_submitter": false, "distinguished": null, "created_utc": 1630485932.0, "parent_id": "t1_hb5wjkb", "replies": [{"author": "SybariteAussie", "id": "hb6099r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pfn7f6", "stickied": false, "body": "I would take the vaccines for for $ or a recent’ish photo of my sons. Everyone has their price. I won’t be carrying any passports etc. I only carry a mobile phone when driving somewhere far from home. Otherwise it’s in bedroom drawer. I’m down with being a hermit. Only the masks irk me. It’s bizarre what’s happening! I wouldn’t go on a angry protest. A passive one where everyone stands in line & takes turns to be beaten could be tempting? Wear numbers, have a person with a stopwatch keep score. Who can stand the longest while being beaten & sprayed with chemical weapons in the face? No fighting back. A panel of 3, awarding bonus seconds for flair. Handcuff yourself, fancy dress, telling the people about to beat you that you forgive them etc.", "is_submitter": false, "distinguished": null, "created_utc": 1630487611.0, "parent_id": "t1_hb5yeej", "replies": []}, {"author": "SybariteAussie", "id": "hb60kw7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pfn7f6", "stickied": false, "body": "So you are in favour of taking it, it sounds like? Is your passion for others taking the vaccine because you are worried that they might get ill or die?", "is_submitter": false, "distinguished": null, "created_utc": 1630487909.0, "parent_id": "t1_hb5yeej", "replies": [{"author": "U_L_Uus", "id": "hb625km", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #119 | Classis Veritatus", "submission": "pfn7f6", "stickied": false, "body": "Not only I'm in favour but I have also taken my two shots (Pfizer). I'm on the opinion that, those that actually can, must take it, because this illness poses a risk to all of us. Sure, people getting ill/dying is a problem, but more of a problem is that, if due the enormous amount of mutations the virus can have if unrestricted (and vaccines are a big part of the restrictions) a variety comes that not only bypasses all the measures taken before but that it's so virulent and lethal that the Bubonic Plage is left as an innocent lamb. It's only a matter of getting **that** dice roll, and a new infectee means a few rolls more", "is_submitter": false, "distinguished": null, "created_utc": 1630489292.0, "parent_id": "t1_hb60kw7", "replies": [{"author": "SybariteAussie", "id": "hb63ntz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pfn7f6", "stickied": false, "body": "The Enchiridion by Epictetus is a book by a former slave about Stoic philosophy. It’s available free as audiobook on YouTube. Helps with worrying about things beyond our control. I still worry, if it intensifies. I listen to the Stoics. Do you know if the vaccine is sulphur based? I’m allergic to sulphur based medicines. However I could still be bribed to take it. So just to clarify, there’s a different group which are vehemently against taking the vaccine?", "is_submitter": false, "distinguished": null, "created_utc": 1630490563.0, "parent_id": "t1_hb625km", "replies": [{"author": "U_L_Uus", "id": "hb646ir", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #119 | Classis Veritatus", "submission": "pfn7f6", "stickied": false, "body": "Vaccines aren't sulphur based as in they aren't made with sulfates or the like, mainly because even the mRNA vaccines are based on using a safe version of the antigen (the mollecule that triggers the immune reaction) plus some substances which the body usually recognizes as harmful to aid in the immunity trigger (substances which are present on our everyday and that if accumulated can pose a threat to the organism)\n\nAlso, yes. Ever heard someone saying \"the vaccine is the mark of the Beast\"? That's the kind of people we're talking about", "is_submitter": false, "distinguished": null, "created_utc": 1630490989.0, "parent_id": "t1_hb63ntz", "replies": [{"author": "R5Cats", "id": "hb7ymfl", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "> Ever heard someone saying \"the vaccine is the mark of the Beast\"?\n\nNo, not even once. I'm sure there's lunatics out there who say that, and 5X the number of fakes trying to make the \"right wing look bad\" too. Same people who deliberately set forest fires to prove Global Warming causes more fires, I suppose.  \n\nWhen we are forced get bar-codes tattoo'd to our hands or foreheads? That's the mark of the beast. \"16 And he causeth all, both small and great, rich and poor, free and bond, to receive a mark in their right hand, or in their foreheads: 17 And that no man might buy or sell, save he that had the mark, or the name of the beast, or the number of his name.\" [Revelations 13:17](https://www.kingjamesbibleonline.org/Revelation-13-17/)   \nIf one believes in that sort of thing.", "is_submitter": false, "distinguished": null, "created_utc": 1630522317.0, "parent_id": "t1_hb646ir", "replies": []}]}]}]}, {"author": "S_thyrsoidea", "id": "hb63lyh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "pfn7f6", "stickied": false, "body": "> Is your passion for others taking the vaccine because you are worried that they might get ill or die?\n\nNot the person you're responding to, but were you unaware that here in the US, there are areas in which now is a really, *really* terrible time to come down with cancer or get hit by a car because people who refused to get vaccinated are overwhelming the hospitals with their diseased gasping carcasses and there's no beds left for anyone else?\n\nNot getting vaccinated is a selfish and irresponsible choice because of what it can do to others.  I would be much more fine with people not getting vaccinated if it meant that when they got severe COVID, they kept to themselves and died in their homes.  If you want to take that gamble, then pay the price yourself.  Don't take hospital beds away from people who didn't choose to play Russian Roulette with their immune system.\n\nSecondarily, getting vaccinated reduces how much you are a transmission risk to others.  It doesn't work for all variants – delta, notoriously, may not have reduced transmission in the vaccinated – but it does for some and that's not nothing.  Vaccination isn't just for one's self, it's to try to reduce the chance you'll carry it into your home, your family, your work, your congregation.  Refusal to do that is mighty cold.", "is_submitter": false, "distinguished": null, "created_utc": 1630490520.0, "parent_id": "t1_hb60kw7", "replies": [{"author": "SybariteAussie", "id": "hb67ivp", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pfn7f6", "stickied": false, "body": "Emotional opinions are laudable, not valid debate points, however. Everyone is entitled to a opinion. 🔮The powers that be, are going to hold on to these powers for as long as they can. The new pariahs are given the dehumanising designation of antivaxers, I think? All world leaders are chanting in unison. Active resistance is futile. The virus will mutate this will justify the consumption of more vaccines. How much our mostly honest leaders paying for them? 🤔Where’s the $ going? If they pay me enough, I will take the vaccine delivered to my pecker. I tend to resist coercion.", "is_submitter": false, "distinguished": null, "created_utc": 1630493527.0, "parent_id": "t1_hb63lyh", "replies": [{"author": "S_thyrsoidea", "id": "hb86l9g", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "pfn7f6", "stickied": false, "body": "> Emotional opinions are laudable, not valid debate points, however\n\nNeither is insinuation that ethical points are mere emotion.\n\n> The powers that be, are going to hold on to these powers for as long as they can\n\nAnd what powers are those?  In my country, none of these \"powers\" people are complaining of are new.  They've been holding on to them for a couple of centuries now, and people are acting like it's a novel form of tyranny.\n\n> The new pariahs are given the dehumanising designation of antivaxers, I think?\n\nThey named themselves that.  If it's dehumanizing, take it up with them.\n\n> I tend to resist coercion.\n\nYou're not resisting coercion unless someone is forcing you to do something.  Are you in defiance of an actual vaccine mandate or requirement?  No?  Then all you're resisting is your own conscience and knowing what other people think of your sense of ethics.", "is_submitter": false, "distinguished": null, "created_utc": 1630525553.0, "parent_id": "t1_hb67ivp", "replies": [{"author": "SybariteAussie", "id": "hb8zgul", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pfn7f6", "stickied": false, "body": "I cannot reach you. I do not condemn you. Foreboding builds. I will try to dispose of all personal stuff, memorabilia, paperwork & things that are distinctly mine. Relatives or whoever will find it easier to prepare my dwelling for sale or someone else to live here. Regardless if I get a injection, i will not be utilising a passport of any description. I don’t think it matters who is in charge of government. Things will proceed & a new global government will step out of the shadows.I am against all demonstrations & demonstrators for anything. I am fond of absurdity. The idea of a demonstration against demonstrations & demonstrators has appeal. If I am permitted, I would choose hemlock tea. People are being arrested for even advocating demonstrations in Australia. “Better to die on your feet than to live on your knees”. I feel bad for the citizens & for the police. Better to use the army or army reserve for suppressing citizens/denizens. Living next to a desert. I could pack a nice last picnic & take the Fremen strategy for the elderly. Go & seek Shai Hulud in the desert. When authoritarian governments gain power. Fist ones against the wall are the febrile political activists. Have caution, fellow humans. Avaricious & ruthless people who seek power, can accept atrocities, as they feel it’s for the greater good. Active resistance is futile. Try to stay in the shadows. The only true bias is fiscal. I carry a face mask in my underwear when I leave the house. As I don’t consume domestic media, I don’t know when the masks & lockdowns are on. If requested I produce my mask & wear it, get a puzzled look occasionally. The mask I don is a dusting mask that house painters use when using sandpaper. Best to manscape & use talcum powder if you carry a mask in your trunks! It gets smelly after awhile. Peace 🖖", "is_submitter": false, "distinguished": null, "created_utc": 1630538558.0, "parent_id": "t1_hb86l9g", "replies": []}]}]}]}]}]}]}]}]}, {"author": "logoyahoo", "id": "hb6317b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #80", "submission": "pfn7f6", "stickied": false, "body": "Exactly", "is_submitter": false, "distinguished": null, "created_utc": 1630490034.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "Golden-Snowflake", "id": "hb6niq7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pfn7f6", "stickied": false, "body": "gatekeeping has been a part of humanity for eons.\n\nThe fact that we aren't gatekeeping those who attempt to harm us, through either sheer stupidity, or malicious aims, at this point is insanity...\n\nWe should not only censor, those whom use misinformation as a tool, we should cause Harm to them, either physical (Jailtime) or fiscal in nature, to discourage this behavior.\n\nbeing wrong, is one thing.  \nStarting misinformation, so you can sell magical radioactive bracelets, is not acceptable.", "is_submitter": false, "distinguished": null, "created_utc": 1630502726.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "Floognoodle", "id": "hb6s2hd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #232", "submission": "pfn7f6", "stickied": false, "body": "I *strongly* agree, and this comes from someone who is extremely pro-vaccine *but* anyone threatening using harmful chemicals on themselves or others are threatening violence.\n\nI don't see why r/conspiracy, which is threatening ethnic Jews half the time, should get to exist but these morons don't get to - not that I don't despise either group of conspiracy theorists.\n\nCensoring misinformation only makes crazy people crazier.", "is_submitter": false, "distinguished": null, "created_utc": 1630504780.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "Sendarra_x", "id": "hb6sjt3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #371", "submission": "pfn7f6", "stickied": false, "body": "THANK YOU! Yes, blackout days are ridiculously dumb and low-effort \"activism.\"", "is_submitter": false, "distinguished": null, "created_utc": 1630504996.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "SuperfluousApathy", "id": "hbb5wfv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #492", "submission": "pfn7f6", "stickied": false, "body": "Censorship has existed for as long as the printing press has. Perhaps even longer. We just keep coming up with more and more advanced tools of censorship. The internet may be the apex. Who knows. Maybe one day they can actually censor thoughts. Its all so tiresome.", "is_submitter": false, "distinguished": null, "created_utc": 1630587019.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "roguezebra", "id": "hbbcsv2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #15", "submission": "pfn7f6", "stickied": false, "body": "In 2016 a movie was released & accepted for Tribeca film festival. Then removed. And Angelica theatre stepped in & showed the film, now subtitled \"The film they don't want you to see.\" The bad publicity only increased film exposure to a broader audience. \n\nMost AVs vaxxed their kids and paid with lifetime of  injury, autism, or death. You will not change our minds; for we watched the reveal & live daily with consequences of our decisions. That is until we can sue Pharma & have true safety studies. Remove liability protections and then we will know Pharma is sincere about health.", "is_submitter": false, "distinguished": null, "created_utc": 1630590246.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "FalconRelevant", "id": "hbbirr5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "pfn7f6", "stickied": false, "body": "Is the second paragraph the summary of the movie?", "is_submitter": true, "distinguished": null, "created_utc": 1630592828.0, "parent_id": "t1_hbbcsv2", "replies": [{"author": "roguezebra", "id": "hbbl5aw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #15", "submission": "pfn7f6", "stickied": false, "body": "No.", "is_submitter": false, "distinguished": null, "created_utc": 1630593823.0, "parent_id": "t1_hbbirr5", "replies": [{"author": "FalconRelevant", "id": "hbbla8w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "pfn7f6", "stickied": false, "body": "So what is it about?", "is_submitter": true, "distinguished": null, "created_utc": 1630593885.0, "parent_id": "t1_hbbl5aw", "replies": [{"author": "roguezebra", "id": "hbc5rmm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #15", "submission": "pfn7f6", "stickied": false, "body": "Sorry for delay,  headed into webinar meeting & had unexpected phone call from college board. \n\nMovie: In 2014, biologist Dr. Brian Hooker received a call from a Senior Scientist at the U.S. Centers for Disease Control and Prevention (CDC) who led the agency’s 2004 study on the Measles-Mumps-Rubella (MMR) vaccine and its link to autism. The scientist, Dr. William Thompson, confessed that the CDC had omitted crucial data in their final report that revealed a causal relationship between the MMR vaccine and autism. Over several months, Dr. Hooker records the phone calls made to him by Dr. Thompson who provides the confidential data destroyed by his colleagues at the CDC. Dr. Hooker enlists the help of Dr. Andrew Wakefield, the British gastroenterologist falsely accused of starting the anti-vax movement when he first reported in 1998 that the MMR vaccine may cause autism. Wakefield directs this documentary examining the evidence behind an appalling cover-up committed by the government agency charged with protecting the health of American citizens. Interviews with pharmaceutical insiders, doctors, politicians, and parents of vaccine-injured children reveal an alarming deception that has contributed to the skyrocketing increase of autism and potentially the most catastrophic epidemic of our lifetime", "is_submitter": false, "distinguished": null, "created_utc": 1630602178.0, "parent_id": "t1_hbbla8w", "replies": []}]}]}]}]}, {"author": "R5Cats", "id": "hb7zeyb", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pfn7f6", "stickied": false, "body": "In my Province (Manitoba) the SJWs and Karens have been screaming for lockdowns, masks, forced vaccinations this entire time.  \nObey the Experts! Trust the science! *Silence the unbelievers* (Canada has 'Covid Camps' in place across the country).  \n\nWhen the mask mandate was lifted by the very same Expert they demanded we trust unconditionally? They screamed in unison: Don't believe him! He's an idiot! Force everyone to wear a mask! He's part of a vast right-wing conspiracy to murder Grandma!!!   \n>!That last one may be my interpretation of it 😙 but essentially their argument!<", "is_submitter": false, "distinguished": null, "created_utc": 1630522640.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "bmichell21", "id": "hb5pza2", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #8", "submission": "pfn7f6", "stickied": false, "body": "It's either too late or too early to have this discussion, regardless of context.", "is_submitter": false, "distinguished": null, "created_utc": 1630478693.0, "parent_id": "t3_pfn7f6", "replies": []}, {"author": "Quartersharp", "id": "hb71atb", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #366", "submission": "pfn7f6", "stickied": false, "body": "I 100% agree with the contents of that post. Whenever I see people in other subs say anything about a vaccine side effect, they always prefix it with “I’m definitely pro-vaxx” because that’s the dog whistle they have to use to signal that they are in line with the correct narrative. Whatever the truth of the matter is, the amount of censorship going on is way more than enough to remind the casual observer of Newspeak and thought crimes. And that pushes anti-vaxxers further away and gives them more evidence for their position, not less.\n\nWhat we need is frankly less Internet fighting and more real, honest, reasonable face-to-face conversations about this stuff. People are nicer and that’s where minds are more likely to be changed and consensus reached.", "is_submitter": false, "distinguished": null, "created_utc": 1630508697.0, "parent_id": "t3_pfn7f6", "replies": [{"author": "Psychological-Bee352", "id": "hb9jiak", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #455", "submission": "pfn7f6", "stickied": false, "body": "Your message was a breath of fresh air. Thank you!!!", "is_submitter": false, "distinguished": null, "created_utc": 1630548036.0, "parent_id": "t1_hb71atb", "replies": []}]}, {"author": "KuriousKhemicals", "id": "hb73pdv", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pfn7f6", "stickied": false, "body": "On the one hand, I think there's value in debunking. It's for observers, it's educational, and I commend people who take the time to do it and do it well.\n\nOn the other hand, I think it's foolhardy to take a position in favor of ONLY debunking and no ban-like actions. There is an infinite supply of bullshit available to people who don't care about or aren't convinced by reason. \"A lie can travel around the world before the truth gets its pants on,\" and all that. They can throw 10 pieces of crap at you, all of which are flimsy but take time to corral and dispose of; it's called the Gish Gallop. And of course in the final instance a conspiracist can come of with 5 ways every source you rely on is \"in on it.\"\n\nI will also note simply asking for a source does not always work. Often there IS a source that at least appears to support the BS; it's just that it's an unreliable source or they've misinterpreted something from the abstract. Now you're in an argument about what makes a reliable source or going on a technical explanation of something in the field the paper originates from - and you're still only on item number one. You run a significant risk of them successfully making it look like you're losing the argument.\n\nThere are simply not enough people with the time and ability to convincingly debunk the infinite cesspool. At some point social shaming needs to be considered as a tool.", "is_submitter": false, "distinguished": null, "created_utc": 1630509697.0, "parent_id": "t3_pfn7f6", "replies": []}]}