{"title": "religion is a literal virus to the human mind", "name": "t3_p4pzcu", "url": "/r/Antitheism/comments/p4mykj/religion_is_a_literal_virus_to_the_human_mind/", "selftext": "", "score": 9, "upvote_ratio": 0.65, "permalink": "/r/TheFlyingTree/comments/p4pzcu/religion_is_a_literal_virus_to_the_human_mind/", "id": "p4pzcu", "author": "FalconRelevant", "link_flair_text": null, "num_comments": 57, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629017432.0, "comments": [{"author": "bethcano", "id": "h910chm", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "p4pzcu", "stickied": false, "body": "I knew an evangelical Christian at university who studied geology. He spent four years puzzling how to explain that the millions of years old rocks he studied were still within the 6000 year age of the Earth as stated in the Bible.", "is_submitter": false, "distinguished": null, "created_utc": 1629033555.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "MisanthropicScott", "id": "h91c0ee", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "Do you know what conclusion he reached? I can think of multiple ways out of that.\n\n1. Bible is demonstrably false.\n\n2. Bible is not literal, especially the literal 7 days.\n\n3. Satan planted rocks that appear old to trick us.\n\n4. God planted rocks that appear old to test our faith (i.e. trick us).\n\n5. Reality is false and the Bible is true. (My bet's on this one.)\n\nThere may be many other options.", "is_submitter": false, "distinguished": null, "created_utc": 1629039288.0, "parent_id": "t1_h910chm", "replies": [{"author": "bethcano", "id": "h91ceaw", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "p4pzcu", "stickied": false, "body": "I don't think he ever reached one. He was very deep into religion but was also a smart guy, so I think remaining completely ignorant and ignoring the conflict between his beliefs and science ended up being easiest. \n\nI don't speak to him anymore anyway so can't find out. Like the other evangelicals I know, they never really considered me a friend - once they realised I wasn't interested in joining them, they let the friendships fizzle out once our reasons to interact were over.", "is_submitter": false, "distinguished": null, "created_utc": 1629039461.0, "parent_id": "t1_h91c0ee", "replies": []}, {"author": "Golden-Snowflake", "id": "h95dpks", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "p4pzcu", "stickied": false, "body": "the easiest one would simply write everything off, due to \"Satan\" appearing as an angel or whatever the bible says about him, being able to trick us, and the fact the bible itself is the trick.   \nwould solve tons of issues, and likely cause far less problems.   \n\n\nThere are a couple nice things in the bible, though honestly, so much isn't nice...", "is_submitter": false, "distinguished": null, "created_utc": 1629117093.0, "parent_id": "t1_h91c0ee", "replies": [{"author": "MisanthropicScott", "id": "h974nzp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "Agreed. And good point about Satan.\n\nJust based off of the links in the Skeptic's Annotated Bible, I compiled the following counts. I didn't classify the passages. The good folks who worked on the SAB did that. Admittedly, it is a skeptic's site, of course. So, there is some bias.\n\nThe Bible contains (The bullet points below are links; feel free to click any or all):\n\n* [1543 instances of injustice](http://skepticsannotatedbible.com/inj/long.html)\n\n* [1310 instances of cruelty](http://skepticsannotatedbible.com/cruelty/long.html)\n\n* [705 instances of intolerance](http://skepticsannotatedbible.com/cruelty/long.html)\n\n* [419 instances of horrific family values](http://skepticsannotatedbible.com/cruelty/long.html)\n\n* [392 instances of misogyny](http://skepticsannotatedbible.com/women/long.html)\n\n* [But only 344 objectively good verses](http://skepticsannotatedbible.com/good/long.html)", "is_submitter": false, "distinguished": null, "created_utc": 1629143181.0, "parent_id": "t1_h95dpks", "replies": [{"author": "Golden-Snowflake", "id": "h98w4lu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "p4pzcu", "stickied": false, "body": "I expected less than 344 objectively good verses, to be fair, I'm impressed there are so many. :p  \n\n\nhttps://biblia.com/bible/esv/2-corinthians/11/14", "is_submitter": false, "distinguished": null, "created_utc": 1629171344.0, "parent_id": "t1_h974nzp", "replies": []}]}]}]}]}, {"author": "QuatroDoesGood", "id": "h914n77", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #55", "submission": "p4pzcu", "stickied": false, "body": "This is a pretty big generalization of religion. Speaking as an agnostic, religion is what you make of it. Who honestly gives a fuck if you believe in a bearded dude sitting in a cloud or if you abstain from eating pork. As long as you don't use it to justify asshole behavior. Cause when people use religion as a shield for their behavior, it's usually not because of the religion but because of the fact that they are an asshole. In the same way an atheist could be a destructive influence on his community, and at the same time not.", "is_submitter": false, "distinguished": null, "created_utc": 1629035836.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "MisanthropicScott", "id": "h91cny7", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "> religion is what you make of it.\n\nBut, only by mostly not reading the scripture. Or, I guess one could pretend that \"leave nothing alive that breaths\" actually means \"buy everyone a croissant\". But, it doesn't.", "is_submitter": false, "distinguished": null, "created_utc": 1629039582.0, "parent_id": "t1_h914n77", "replies": [{"author": "QuatroDoesGood", "id": "h91e38s", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #55", "submission": "p4pzcu", "stickied": false, "body": "When you have 50 different denominations of the same God, it gives the opportunity to exempt whatever you want from scriptures. At least the religious people I interact with realize holy texts have been rewritten so many times that you really can take the text with a grain of salt and take whatever you find valuable from it.", "is_submitter": false, "distinguished": null, "created_utc": 1629040215.0, "parent_id": "t1_h91cny7", "replies": [{"author": "MisanthropicScott", "id": "h91fmmb", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "Yeah. I understand that. Though, I think literalists are solidly on the rise in the U.S. By my calculation based on 2 different but similarly timed studies (both from 2019), about 60% of the Christians in the U.S. today are young earthers.\n\n[40% of U.S. adults believe God created humans in our present form within roughly the last 10,000 years](https://news.gallup.com/poll/261680/americans-believe-creationism.aspx) -- A pretty good proxy for young earth creationism, IMHO.\n\n[65% of the U.S. identifies as Christian](https://www.pewforum.org/2019/10/17/in-u-s-decline-of-christianity-continues-at-rapid-pace/)\n\nIf we were to assume that every young earther was Christian:\n\n((40 / 65) * 100.0) = 61.5%\n\nAllowing for some percentage of the 2% of the U.S. who are Jews and 1% who are Muslims to be young earthers too, we can just round down and say that approximately 60% of U.S. Christians are young earth creationists. We can assume some small but reasonable error bars on that.", "is_submitter": false, "distinguished": null, "created_utc": 1629040893.0, "parent_id": "t1_h91e38s", "replies": []}, {"author": "MisanthropicScott", "id": "h91g8y1", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "Oh, and a second point I'd make is that with no source of any other information to corroborate the scriptures, there really isn't a good algorithm for guessing which bits may have been rewritten so many times that they're no longer accurate and which bits are accurate.\n\nSo, there's insufficient information other than just picking what we like and don't like. At some point, just throwing out the whole damned thing and going with a more philosophical approach to ethics is better. Even just the same gut feel one is using to determine that genocide and slavery are now bad despite being perfectly acceptable in the bible can be used to come up with the same ethics by which one is throwing out large swaths of the Bible and just ignore the book anyway.\n\nMy point, I guess, is that if one is getting their morals from that book, they will be a horrible person. If one is applying their morals to pick and choose from the book and is being a good person, why is the book needed at all?", "is_submitter": false, "distinguished": null, "created_utc": 1629041165.0, "parent_id": "t1_h91e38s", "replies": [{"author": "QuatroDoesGood", "id": "h91vvov", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #55", "submission": "p4pzcu", "stickied": false, "body": "I agree with a lot of your points\n\nAt least with my Catholic family, their reasoning for continuing to follow the faith is more for the community aspect than anything else. Being a member of a church gives you a support group. The book isn't all too relevent to the reason they follow the faith. I switched from being catholic to agnostic around when our priest died, at that point I just really didn't enjoy the sermons. Didn't feel like I was getting anything substantial out of it anymore and I wanted to look in other places for philosophical meaning\n\nBut I can't shame my family either from being able to continue to find some kind of value in the church either. For the most part we follow the same ethics.", "is_submitter": false, "distinguished": null, "created_utc": 1629047691.0, "parent_id": "t1_h91g8y1", "replies": []}]}]}]}, {"author": "Paul_Thrush", "id": "h91lrzi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p4pzcu", "stickied": false, "body": ">Who honestly gives a fuck if you believe in a bearded dude sitting in a cloud or if you abstain from eating pork as long as you don't use it to justify asshole behavior?\n\nSo many of them use it to justify asshole beavior, religion is ruining the quality of life for the rest of us.", "is_submitter": false, "distinguished": null, "created_utc": 1629043486.0, "parent_id": "t1_h914n77", "replies": [{"author": "Golden-Snowflake", "id": "h95dgln", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "p4pzcu", "stickied": false, "body": "If god, is used as a win condition, to an argument.   \n\n\nYou just need to teach that person, that that is what they are doing.   \nit can be a challenge, certainly, though, if they are so arrogant that they have to use \"God\" himself, to win their arguments for them, they are prideful, arrogant sinners, and obviously going to \"Hell\" for their \"Blasphemous\" ways...   \n\n\nJust have to train them to have a critical mind, and they won't be assholes anymore.   \nMaybe...", "is_submitter": false, "distinguished": null, "created_utc": 1629116955.0, "parent_id": "t1_h91lrzi", "replies": []}]}]}, {"author": "MisanthropicScott", "id": "h91aes1", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "I was lucky never to have been deeply indoctrinated into any religion. I was raised only weakly Jewish. But, the stories of people having difficulty getting over religion, especially Christianity (or Islam?) with vivid  imagery of hellfire and damnation are absolutely horrifying.\n\nThere's even a term now for this. It's called [Religious Trauma Syndrome](https://www.salon.com/2014/11/01/the_sad_twisted_truth_about_conservative_christianitys_effect_on_the_mind_partner/) and is similar in some ways to PTSD.\n\nI don't think it's as bad for the less virulent sects of religion that do not include this deep indoctrination with imagery of hell. And, it's obviously much less bad if one's family is not such strong believers. \n\nSo, for example, in my case, all I ended up with was less sensitivity during sex. I have no idea why my early iron age ancestors thought this amazingly big^* god would create us with a foreskin and then demand that it be removed. But, ....\n\n\\* I sometimes laugh reading the prayer books if I actually attend synagogue, which I sometimes do for either family functions or to keep my promise to my father to say Yizkor for him. Very often, the English will say great wonderful spectacular (not truly the right superlatives, but they use many) to describe God. Then I look over at what little Hebrew I can actually read and less that I can understand and it says gadol gadol gadol. It just means big. Big God. Big big God. Whoa big God!", "is_submitter": false, "distinguished": null, "created_utc": 1629038570.0, "parent_id": "t3_p4pzcu", "replies": []}, {"author": "nugdealr", "id": "h90hsrc", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #126", "submission": "p4pzcu", "stickied": false, "body": "agreed, bringing religion into everything\nand somehow justifying your asshole behaviour saying GoD WAnTeD yOu tO traumatize people", "is_submitter": false, "distinguished": null, "created_utc": 1629020011.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "HolisticHolograms", "id": "h90ispz", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p4pzcu", "stickied": false, "body": "The voices, I mean..god.. said it was righteous.", "is_submitter": false, "distinguished": null, "created_utc": 1629020916.0, "parent_id": "t1_h90hsrc", "replies": []}]}, {"author": "DELETED", "id": "h90fc0u", "score": 10, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p4pzcu", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1629017767.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "MisanthropicScott", "id": "h91b9yv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "Given some of the content, yeah. I mean there are things there that if they made the stories into porn flicks, I'm hopeful that they'd be banned on reputable porn sites.\n\nThis sub does not allow anything too NSFW. So, maybe I can't even post links to the relevant Bible segments that I'm talking about. But, I doubt anyone really wants to read an account (or two) of gangbang snuff porn or father daughter porn that my early iron age ancestors managed to make sound mostly boring despite the highly graphic content.\n\nSide question: If they managed to just make all of those stories boring despite the aforementioned porn plus all of the genocides and slavery and sex slaves and rape and all the rest, does that mean that the authors were probably the worst writers in history? I think so.", "is_submitter": false, "distinguished": null, "created_utc": 1629038960.0, "parent_id": "t1_h90fc0u", "replies": []}, {"author": "HolisticHolograms", "id": "h90gc8g", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p4pzcu", "stickied": false, "body": "Nero and Constantine really shit the bed didn’t they.", "is_submitter": false, "distinguished": null, "created_utc": 1629018685.0, "parent_id": "t1_h90fc0u", "replies": [{"author": "roundearthervaxxer", "id": "h9141ka", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4pzcu", "stickied": false, "body": "Explain?", "is_submitter": false, "distinguished": null, "created_utc": 1629035531.0, "parent_id": "t1_h90gc8g", "replies": []}]}]}, {"author": "DragonFromHell", "id": "h90i7fz", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #22", "submission": "p4pzcu", "stickied": false, "body": "Extremely edgy, super offensive, very mean, but I kind of agree anyway.", "is_submitter": false, "distinguished": null, "created_utc": 1629020378.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "Flesh_Bag", "id": "h9116dy", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #95", "submission": "p4pzcu", "stickied": false, "body": "I mean I agree that being edgy and offensive isnt very constructive or useful, but to be fair, ive been told that I will burn for all eternity in hell when I die soooo...", "is_submitter": false, "distinguished": null, "created_utc": 1629034014.0, "parent_id": "t1_h90i7fz", "replies": []}, {"author": "NoSuchKotH", "id": "h90kjva", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p4pzcu", "stickied": false, "body": "I'd rather say the ramblings of a teenager who has not seen anything of the world but the small town he lives in.... and what Fox shows him.\n\nReligion is much more faceted than that. In Europe, religion is practiced in your own home... on weekends... maybe... Going around and telling others about your believes is extremely bad form. Invading other people's lives because you think you have to lead them to the light? That can lead to some nasty public backlash.\n\nMeanwhile, the USians are so indoctrinated that they make everything into a religion. Just roam the hobby sub-reddits here. In all and each of them I've been, people either expect you to go full messiah the moment you start with it, or you are not a true believer and should leave the hobby and go back to you heathen ways. Fuck that! I just wanted to enjoy doing something for a few days maybe weeks. Maybe I would have done it for longer, maybe not? Why do people care? And why is anyone with a different opinion that goes against \"common wisdom\" (even if said \"wisdom\" is wrong) demonized and called names?\n\nThat said, we have people who use religion as an excuse for their bullshit. And it's a constant uphill battle against them. Though, sofar, the cool headed people seem to be winning.", "is_submitter": false, "distinguished": null, "created_utc": 1629022420.0, "parent_id": "t1_h90i7fz", "replies": [{"author": "MisanthropicScott", "id": "h91cejr", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "> Religion is much more faceted than that.\n\nIndeed. But, most of those facets are arrived at by deliberately either ignoring large swaths of the Bible, or never having read it in the first place.\n\nThe scripture on which any sect of the Abrahamic religion is based is absolutely horrifying.", "is_submitter": false, "distinguished": null, "created_utc": 1629039464.0, "parent_id": "t1_h90kjva", "replies": []}, {"author": "craftycontrarian", "id": "h930bxm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #125", "submission": "p4pzcu", "stickied": false, "body": "Americans did not invent proselytizing. Unless you want to ignore pretty much the entire history of Europe and western Asia. Which it seems you did.\n\nBut yeah, teenagers. All atheists are just angry teenagers.", "is_submitter": false, "distinguished": null, "created_utc": 1629065074.0, "parent_id": "t1_h90kjva", "replies": [{"author": "NoSuchKotH", "id": "h93cbt9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p4pzcu", "stickied": false, "body": ">Americans did not invent proselytizing. Unless you want to ignore pretty much the entire history of Europe and western Asia. Which it seems you did.\n\nNo, the US did not invent it. But while it is mostly gone in Europe, the US clings to this old tradition.\n\n&#x200B;\n\n>But yeah, teenagers. All atheists are just angry teenagers.\n\nDude...", "is_submitter": false, "distinguished": null, "created_utc": 1629070724.0, "parent_id": "t1_h930bxm", "replies": []}]}]}, {"author": "HolisticHolograms", "id": "h90jb3g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p4pzcu", "stickied": false, "body": "They live with green up on the surface but they ain't deep.", "is_submitter": false, "distinguished": null, "created_utc": 1629021353.0, "parent_id": "t1_h90i7fz", "replies": []}]}, {"author": "karlovilla", "id": "h91022h", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #3", "submission": "p4pzcu", "stickied": false, "body": "If one postulates that a thing is \"literally\" something, one should be prepared to receive criticism for overstatements or shortsighted attribution of properties beyond what could be reasonably defended.\n\nSure, religions or religiousity have some attributes that are generally similar to those of viruses and analogous to the \"environment\" where they exist.", "is_submitter": false, "distinguished": null, "created_utc": 1629033394.0, "parent_id": "t3_p4pzcu", "replies": []}, {"author": "roundearthervaxxer", "id": "h915b96", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4pzcu", "stickied": false, "body": "Yes, for a few reasons. \n\n1) it gives people a false sense of doing good in the world by going to church. \n\n2) it allows them to demonize others of different faiths. \n\n3) it breeds cultish fanaticism.\n\nThere was a time when religion was science, our best guess based on the evidence. That time has long since passed.", "is_submitter": false, "distinguished": null, "created_utc": 1629036169.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "MisanthropicScott", "id": "h91da5v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "> There was a time when religion was science, our best guess based on the evidence. That time has long since passed.\n\nWhich religion? Remember that both the Christian Bible and the Quran specify a flat earth.\n\nThis may have been excusable in the Hebrew Bible which may have been written before we knew the earth was round. But, after [Eratosthenes went to the trouble of measuring the size of the earth](https://en.wikipedia.org/wiki/Eratosthenes#Measurement_of_Earth's_circumference) using geometry and getting the circumference correct within 10%, one might think that this could have been corrected in the Christian Bible or Quran.", "is_submitter": false, "distinguished": null, "created_utc": 1629039857.0, "parent_id": "t1_h915b96", "replies": [{"author": "Btankersly66", "id": "h91hwo3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "p4pzcu", "stickied": false, "body": "Religion has its roots in two cognitive traits. Agency detection and intention detection. The majority of ancient religions are tied to observations of natural phenomenon and imaginary speculation that adds agency and intention to the phenomenon. Monotheism is an evolution of the ancient religions that combine all these observations into a single anthropomorphic god. Contemporary science is the natural evolution from religion.", "is_submitter": false, "distinguished": null, "created_utc": 1629041871.0, "parent_id": "t1_h91da5v", "replies": [{"author": "MisanthropicScott", "id": "h91l6mf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p4pzcu", "stickied": false, "body": "First, you didn't address my observation that religion continued to ignore well-established facts even when they were rewriting their texts. So, truth was not a goal.\n\n> Religion has its roots in two cognitive traits. Agency detection and intention detection.\n\nAgreed.\n\n> The majority of ancient religions are tied to observations of natural phenomenon and imaginary speculation that adds agency and intention to the phenomenon.\n\nYes. But, there's no indication that this was actually an attempt to learn anything. It could just as easily have been that <blah happened> and someone came up with a wild explanation, especially one that was attributed to supernatural forces to whom that person alone possesses the key to negotiate, that's power!\n\nSo, why assume the motivation was knowledge rather than power and influence?\n\nThere's no evidence of anyone attempting to confirm their answers or to continue questioning them.\n\n> Monotheism is an evolution of the ancient religions that combine all these observations into a single anthropomorphic god.\n\nWhere did you get this from?\n\nYou make it sound as if monotheism comes closer to truth than polytheism or animism. Do you think so and if so, why?\n\nYou also seem to think that one god is inherently better than many gods. Do you think so and if so, why?\n\nWhat religions would you consider to be truly monotheistic as opposed to being forms of [monolatry](https://www.dictionary.com/browse/monolatry) or [henotheism](https://www.dictionary.com/browse/henotheism)?\n\n> Contemporary science is the natural evolution from religion.\n\nWhat? Why do you think this?\n\nThe fact that Francis Bacon was religious does not imply that he was thinking about religion when he came up with the scientific method.\n\nMore than likely, he was thinking philosophically and realized that philosophy cannot answer questions about the physical world because it has no test for correctness.\n\nThere is quite literally nothing in the Christian religion that would point toward the scientific method. And, very often, Christians actively opposed science as soon as it came up with answers that differed from the Bible, such as a heliocentric view of the solar system.\n\nI don't see how your logic is working here.", "is_submitter": false, "distinguished": null, "created_utc": 1629043241.0, "parent_id": "t1_h91hwo3", "replies": [{"author": "Btankersly66", "id": "h93d0gy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "p4pzcu", "stickied": false, "body": "First I'm a Naturalist. Second a Humanist, third I'm an atheist, and all that is wrapped up in Nihilism. So what ever assumptions you projected about my identity, into your reply, you've gotten tragically wrong. \n\nThat being said I'm not going to debate with you. And that being said, the information I posted is from my limited knowledge of religious history and social evolution. If it's wrong then thanks for the new information. \n\nHave a good day.", "is_submitter": false, "distinguished": null, "created_utc": 1629071055.0, "parent_id": "t1_h91l6mf", "replies": []}]}]}]}]}, {"author": "whymepphard", "id": "h90sukv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #26", "submission": "p4pzcu", "stickied": false, "body": "yikes", "is_submitter": false, "distinguished": null, "created_utc": 1629028945.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "FalconRelevant", "id": "h90tenx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p4pzcu", "stickied": false, "body": "What?", "is_submitter": true, "distinguished": null, "created_utc": 1629029327.0, "parent_id": "t1_h90sukv", "replies": []}]}, {"author": "prajnadhyana", "id": "h919rw1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "p4pzcu", "stickied": false, "body": "Religion is literally *not* a virus.", "is_submitter": false, "distinguished": null, "created_utc": 1629038278.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "Btankersly66", "id": "h91gk1y", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "p4pzcu", "stickied": false, "body": "Religion is literally a meme. Which is defined as a virus of the mind. The concept was introduced by Dr. Richard Dawkins and further studied by Dr. Susan Blackmore. From there a new school of science was founded to study memes, called Memetics.", "is_submitter": false, "distinguished": null, "created_utc": 1629041299.0, "parent_id": "t1_h919rw1", "replies": []}, {"author": "FalconRelevant", "id": "h91ay8m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p4pzcu", "stickied": false, "body": "What do you mean?", "is_submitter": true, "distinguished": null, "created_utc": 1629038817.0, "parent_id": "t1_h919rw1", "replies": [{"author": "prajnadhyana", "id": "h91b1mx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "p4pzcu", "stickied": false, "body": "Religion might metaphorically be a virus to the human mind, but literally it's not a virus.", "is_submitter": false, "distinguished": null, "created_utc": 1629038859.0, "parent_id": "t1_h91ay8m", "replies": [{"author": "FalconRelevant", "id": "h91b71k", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p4pzcu", "stickied": false, "body": "Virus is also used as a term for computer viruses, and the human mind is a computer, so.", "is_submitter": true, "distinguished": null, "created_utc": 1629038924.0, "parent_id": "t1_h91b1mx", "replies": []}]}]}]}, {"author": "Wafflebot3500", "id": "h91cdz0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #135", "submission": "p4pzcu", "stickied": false, "body": "I’m an atheist, but I’m not sure religion is all that bad. I’m looking at this from the perspective of humans, in general, being too selfish to care about anything but themselves. Religion at least gives people a reason to think about the morality of their actions. Humans aren’t “good” by default, and one could argue that religion might help curb some of the bad behavior, at least for some.\n\nBut then you have the folks on the other side of that who use religion to actually justify their bad behavior… which then gives religion a bad name even though those people are really just assholes.", "is_submitter": false, "distinguished": null, "created_utc": 1629039457.0, "parent_id": "t3_p4pzcu", "replies": []}, {"author": "Paul_Thrush", "id": "h91kbiz", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p4pzcu", "stickied": false, "body": "Thatboyivanhoe's anti-theism seems to be a virus also. Why would you choose this unstructured, rambling rant to share with us?", "is_submitter": false, "distinguished": null, "created_utc": 1629042881.0, "parent_id": "t3_p4pzcu", "replies": []}, {"author": "AndrewIsOnline", "id": "h913tzp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4pzcu", "stickied": false, "body": "“We have forgotten that a society progresses only to the extent that it produces leaders that are capable of guiding and inspiring progress.  And we cannot develop such leaders unless our standards of education are geared to excellence instead of mediocrity. “\n\n“Mark my word, if and when these preachers get control of the [Republican] party, and they're sure trying to do so, it's going to be a terrible damn problem. Frankly, these people frighten me. Politics and governing demand compromise. But these Christians believe they are acting in the name of God, so they can't and won't compromise. I know, I've tried to deal with them.”", "is_submitter": false, "distinguished": null, "created_utc": 1629035424.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "Btankersly66", "id": "h91i4dw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "p4pzcu", "stickied": false, "body": "Who?", "is_submitter": false, "distinguished": null, "created_utc": 1629041962.0, "parent_id": "t1_h913tzp", "replies": [{"author": "Paul_Thrush", "id": "h91l7fc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p4pzcu", "stickied": false, "body": "Barry Goldwater. Also known for, \"Extremism in the defense of liberty is no vice\"", "is_submitter": false, "distinguished": null, "created_utc": 1629043249.0, "parent_id": "t1_h91i4dw", "replies": []}]}]}, {"author": "iceman694", "id": "h919ja0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #61", "submission": "p4pzcu", "stickied": false, "body": "Agreed", "is_submitter": false, "distinguished": null, "created_utc": 1629038169.0, "parent_id": "t3_p4pzcu", "replies": []}, {"author": "TonTon1N", "id": "h91a3gg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4pzcu", "stickied": false, "body": "I would venture to say that it is not religion but people that are the issue. Most religious documents are about peace and love but are taken out of context to fuel agendas of hate and violence. I don’t think believing in a deity is ever inherently a bad thing, but when you use that deity to justify all of the evil and awful things inside of you then there’s a problem. It’s not just religion either. Think about the worst parts of religion: blind ignorant fervor, discrimination against anyone who doesn’t agree or is different, and a “I’m better than you” mindset. Literally all of those can also be associated with cancel culture. I think people just generally suck and religion is used as an enabler because it’s more or less a social club where people get together and talk shit about everyone else. Idk that’s just my take", "is_submitter": false, "distinguished": null, "created_utc": 1629038427.0, "parent_id": "t3_p4pzcu", "replies": []}, {"author": "FreeBiskit", "id": "h92n7e2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "p4pzcu", "stickied": false, "body": "The problem is education. Plenty of religious/educated people out there that don’t strike you as “infected with a thought virus” or whatever buzz phrase. \n\nWhen you start teaching scripture to a 70IQ alcoholic who sleeps with his cousin Mary and has never read a book in their life then you get problems.", "is_submitter": false, "distinguished": null, "created_utc": 1629059391.0, "parent_id": "t3_p4pzcu", "replies": []}, {"author": "TrickyLemons", "id": "h92tac4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #85", "submission": "p4pzcu", "stickied": false, "body": "Edgy", "is_submitter": false, "distinguished": null, "created_utc": 1629061963.0, "parent_id": "t3_p4pzcu", "replies": []}, {"author": "zoharel", "id": "h949t0f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p4pzcu", "stickied": false, "body": "It can only possibly be a figurative virus, unless you're literally positing that an infection by some viral agent or another can explain religion, in which case I look forward to the discussion.", "is_submitter": false, "distinguished": null, "created_utc": 1629087850.0, "parent_id": "t3_p4pzcu", "replies": [{"author": "FalconRelevant", "id": "h94lfsv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p4pzcu", "stickied": false, "body": "Are computer viruses figurative viruses?", "is_submitter": true, "distinguished": null, "created_utc": 1629095796.0, "parent_id": "t1_h949t0f", "replies": [{"author": "zoharel", "id": "h94m8dc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p4pzcu", "stickied": false, "body": "Yes they are.  They are certainly not literal viruses.", "is_submitter": false, "distinguished": null, "created_utc": 1629096391.0, "parent_id": "t1_h94lfsv", "replies": [{"author": "FalconRelevant", "id": "h94n44g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p4pzcu", "stickied": false, "body": "Language evolves okay?", "is_submitter": true, "distinguished": null, "created_utc": 1629097068.0, "parent_id": "t1_h94m8dc", "replies": [{"author": "zoharel", "id": "h94ptbs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p4pzcu", "stickied": false, "body": "Sure, but until that happens, if religion isn't an acellular organism of some sort with either DNA or RNA, is probably not a literal virus.", "is_submitter": false, "distinguished": null, "created_utc": 1629099241.0, "parent_id": "t1_h94n44g", "replies": [{"author": "FalconRelevant", "id": "h94pzco", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p4pzcu", "stickied": false, "body": "That has happened I'd argue. Virus now refers to both the tiny pathogens as well as software, both can be said to be literal meanings.", "is_submitter": true, "distinguished": null, "created_utc": 1629099376.0, "parent_id": "t1_h94ptbs", "replies": [{"author": "zoharel", "id": "h94r1m7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p4pzcu", "stickied": false, "body": "I wouldn't say it has yet, though I understand your argument.  Still, the computer virus is so called because it behaves in a similar way, relatively speaking, to an actual virus.  There are -- you likely know -- other things which can be said to be as much or more comparable, prions, for example, which aren't generally seen as being the same kind of thing at all.  I'm not sure why we should be content to muddle the definition of virus by including these things, myself.  I'm on the losing side of this argument, I'm pretty sure.  Sooner or later, anything self-replicating will be a \"virus.\"  It's not yet, but it will be.  I take some comfort in the fact that by then, anything that makes an electronic device behave badly and perhaps any software you don't like will also be a virus, and nobody who thought this was a good idea in the first place will have any idea what everyone else is saying.", "is_submitter": false, "distinguished": null, "created_utc": 1629100240.0, "parent_id": "t1_h94pzco", "replies": []}]}]}]}]}]}]}, {"author": "Golden-Snowflake", "id": "h95cy86", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "p4pzcu", "stickied": false, "body": "Well said mate.   \n\n\nhttps://youtu.be/k1BneeJTDcU", "is_submitter": false, "distinguished": null, "created_utc": 1629116664.0, "parent_id": "t3_p4pzcu", "replies": []}]}