{"title": "The Economy/Market.", "name": "t3_ow8sq7", "url": "https://www.reddit.com/r/TheFlyingTree/comments/ow8sq7/the_economymarket/", "selftext": "Do you prefer the free-market, centralized planning, or something in between?\n\nI prefer private sector and government run corporations competing fairly, with sensible regulations imposed.\n\nPrivate sector corporations may exist in a variety of types, like private companies (SpaceX), public companies(Tesla), syndicalist cooperatives(AMUL) etc.\n\nGovernment run corporations would exist to set a fair minimum standard against which the private sector could compete, this would ensure that corporations don't enter shady deals with each other instead of competing like they should.\n\nWhat are your views?", "score": 13, "upvote_ratio": 0.93, "permalink": "/r/TheFlyingTree/comments/ow8sq7/the_economymarket/", "id": "ow8sq7", "author": "FalconRelevant", "link_flair_text": "Discussion", "num_comments": 47, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1627884803.0, "comments": [{"author": "DELETED", "id": "h7gs7or", "score": 6, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "ow8sq7", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627933465.0, "parent_id": "t3_ow8sq7", "replies": [{"author": "TopHatGuy413", "id": "h7hs8i6", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #18", "submission": "ow8sq7", "stickied": false, "body": "What are you, some kind of commie? (/s)", "is_submitter": false, "distinguished": null, "created_utc": 1627949889.0, "parent_id": "t1_h7gs7or", "replies": [{"author": "gabrielesilinic", "id": "h7ops68", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #59", "submission": "ow8sq7", "stickied": false, "body": "You don't get what the problem is, some things cannot be handled in an efficient way by the free market, the free market has one and only one objective, make money, and to make money they are going to possibly fuck you really badly\n\nSome stuff has to at least be heavily regulated or be public, just looked at America's healthcare\n\nTotally unregulated and private and takes up a goof chunk of money for the Americans while they usually don't get a really wonderful healthcare, also the fact you have to pay an ambulance and to hold your child is mind boggling ^(in a bad way)", "is_submitter": false, "distinguished": null, "created_utc": 1628090177.0, "parent_id": "t1_h7hs8i6", "replies": [{"author": "TopHatGuy413", "id": "h7q824c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #18", "submission": "ow8sq7", "stickied": false, "body": "I know, that's why I put the **/s** at the end.", "is_submitter": false, "distinguished": null, "created_utc": 1628112749.0, "parent_id": "t1_h7ops68", "replies": [{"author": "gabrielesilinic", "id": "h7q8aw2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #59", "submission": "ow8sq7", "stickied": false, "body": "Ups, i didn't say that", "is_submitter": false, "distinguished": null, "created_utc": 1628112855.0, "parent_id": "t1_h7q824c", "replies": []}]}]}]}]}, {"author": "MisanthropicScott", "id": "h7f5ygm", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ow8sq7", "stickied": false, "body": "Given our current mock-science of economics, I'm probably most closely aligned with Keynesian economics and a very strong social safety net. I believe in fair market capitalism rather than free market capitalism. Unbridled unregulated capitalism is a disaster.\n\nI also think there are certain basic necessities of life and of society that should be at least minimally provided by the government. We can discuss what these are. But, my examples would be clean air and clean drinking water, a decent level of health coverage (regardless of whether it's single payer or socialized medicine), infrastructure, police, firefighters, etc.\n\nThis should probably also include at least a basic level of housing for those who cannot afford it and a basic level of food so that no one is starving.\n\nBeyond that, I don't know.\n\nThe problem I see with economics that causes me to call it a mock-science rather than a real science is that it is founded on at least two utterly false assumptions, the second of which is seriously problematic.\n\n1. People make rational choices.\n\n   This is clearly bullshit as can be shown easily by the types of goods that sell better if they are *more* expensive. These could be things like cars. But, they could be things like Sasson blue jeans in the 1970s. When dungarees were just the old Levis or Wrangler and cost about $15, people wore them as work clothes. With a slight change to the cut and a bit of stitching on the back pockets, they became $40 Sasson jeans. They sold like crazy and were quickly followed by Jordache and others almost putting Levis out of business.\n\n   When something costs more, people can show off that they have it and it sells better. This is not rational.\n\n2. Only a growing economy is healthy.\n\n   Infinite growth on a finite planet is a physical impossibility. This is what causes government to worry if birthrates drop. This is what causes ever increasing consumption.\n\n   This one just might kill us.\n\n   We desperately need to find a science of economics that allows for a steady state economy to be healthy, or even a slowly shrinking one, since we're so far past the limits of what the planet can provide today. [We're already stealing from our children to feed ourselves.](https://en.wikipedia.org/wiki/Earth_Overshoot_Day) This cannot continue indefinitely.\n\nOur economy also needs to change pretty radically to be a deep economy without externalities. Externalities reward bad behavior and mean that we're paying less for things than they are truly worth. Oil subsidies are an obvious example. But, there are numerous others.\n\nAnd finally, we need [cradle to cradle design and manufacturing](https://en.wikipedia.org/wiki/Cradle-to-cradle_design). We can't become sustainable without it.", "is_submitter": false, "distinguished": null, "created_utc": 1627906552.0, "parent_id": "t3_ow8sq7", "replies": [{"author": "ms0124", "id": "h7fv2v7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #76", "submission": "ow8sq7", "stickied": false, "body": "Very well said! I agree completely!", "is_submitter": false, "distinguished": null, "created_utc": 1627919159.0, "parent_id": "t1_h7f5ygm", "replies": []}, {"author": "freddyPowell", "id": "h7g6xs5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #52", "submission": "ow8sq7", "stickied": false, "body": "Why do you call economics a 'mock-science'? Where does that come from?", "is_submitter": false, "distinguished": null, "created_utc": 1627924229.0, "parent_id": "t1_h7f5ygm", "replies": [{"author": "Cregaleus", "id": "h7h9033", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "ow8sq7", "stickied": false, "body": "I can only guess that it comes from a common misunderstanding of what it means for something to be a science. Contrary to popular belief, the determinant of whether or not a discipline is scientific isn't how winning the predictions of the discipline's models are, or whether or not the models include hard fundamentals laws; if this were so there would only be one science - physics.\n\nAny discipline in-which the scientific method is applied in order to expand a body of knowledge is inherently scientific. It doesn't matter how bad that science's predictions are, it doesn't matter how inconsistent the various models of that science are. Science is the application of its method, and it is a good thing revolutionary scientists have recognized it as such else we'd have never gotten past Aristotle.\n\nEconomics is notorious for coming up with bad predictions and shoddy models. I totally understand why someone would want to distance this sort of discipline from other sciences like physics or chemistry, but economics is still a science. The greatest aspect of the scientific method is how flexible it is; that it can be applied to furthering any body of knowledge that is testable.", "is_submitter": false, "distinguished": null, "created_utc": 1627940905.0, "parent_id": "t1_h7g6xs5", "replies": []}, {"author": "MisanthropicScott", "id": "h7i7ezz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ow8sq7", "stickied": false, "body": ">> **The problem I see with economics that causes me to call it a mock-science rather than a real science is that it is founded on at least two utterly false assumptions**, the second of which is seriously problematic.\n\n>> 1. People make rational choices.\n\n>>     This is clearly bullshit as can be shown easily by the types of goods that sell better if they are more expensive. These could be things like cars. But, they could be things like Sasson blue jeans in the 1970s. When dungarees were just the old Levis or Wrangler and cost about $15, people wore them as work clothes. With a slight change to the cut and a bit of stitching on the back pockets, they became $40 Sasson jeans. They sold like crazy and were quickly followed by Jordache and others almost putting Levis out of business.\n\n>>     When something costs more, people can show off that they have it and it sells better. This is not rational.\n\n>> 2. Only a growing economy is healthy.\n\n>>     Infinite growth on a finite planet is a physical impossibility. This is what causes government to worry if birthrates drop. This is what causes ever increasing consumption.\n\n>>     This one just might kill us.\n\n>>     We desperately need to find a science of economics that allows for a steady state economy to be healthy, or even a slowly shrinking one, since we're so far past the limits of what the planet can provide today. We're already stealing from our children to feed ourselves.\n\n>>   This cannot continue indefinitely.\n\n> Why do you call economics a 'mock-science'? Where does that come from?\n\nI hope that explains my opinion on the subject.", "is_submitter": false, "distinguished": null, "created_utc": 1627957174.0, "parent_id": "t1_h7g6xs5", "replies": [{"author": "freddyPowell", "id": "h7kquak", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #52", "submission": "ow8sq7", "stickied": false, "body": "While I get your point of view, I don't agree with it (I'm also sorry for having failed to read your full post before asking my question). The idea that people are rational is one that may be used to simplify the system: if one were always to consider all the ways that people might act, it would be very difficult to make useful prediction. Equally however that assumption is not always used, for example when considering veblen goods, which I believe is exactly the example you cited.\nThese come idea you claim as an assumption is also not so. As a science, economics is not about that kind of value judgement. It is often applied to helping grow the economy however by those in a position to implement policy. A comparable statement would be: 'because biology is used by doctors to preserve human life, it is a founding assumption of biology that human life is valuable'. While it is often felt by most humans that it is good for economies to grow and for value to be created, it is not a founding assumption of economics, which only studies how the economy may grow and shrink over time under various conditions.", "is_submitter": false, "distinguished": null, "created_utc": 1628011981.0, "parent_id": "t1_h7i7ezz", "replies": [{"author": "MisanthropicScott", "id": "h7l07iz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ow8sq7", "stickied": false, "body": "> veblen goods\n\nYes. That is exactly what I am thinking of. Thank you! I've never heard the name for these goods before.\n\nAs for economics not making value judgments, I have a friend who keeps haranguing me about that as well.\n\nAnd yet, we never ever hear economists talking about how to stabilize or shrink our economy to help prevent the enormous overuse of our planetary resources or to work towards reducing human overpopulation as a means to give everyone a bigger piece of our finite pie.\n\nIt's always about growth growth and more growth.\n\nIf a country has a declining population, everyone gets paranoid that the retirees will not be taken care of. But, no one ever seems worried about how the new children will be taken care of. It's just assumed we can find money for children but not for old people. And, that's because the real goal is always growth, growth of population, growth of the economy, growth of the GDP, even when it includes the cleanup of environmental disasters as a plus.\n\nIf you're right about economics not making value judgments why don't we hear from more economists talking about the fact that infinite growth on a finite planet is physically impossible?", "is_submitter": false, "distinguished": null, "created_utc": 1628015889.0, "parent_id": "t1_h7kquak", "replies": [{"author": "freddyPowell", "id": "h7lvibb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #52", "submission": "ow8sq7", "stickied": false, "body": "If you would allow me to continue my biology analogy, you rarely hear doctors talking about how infinite lifespans are impossible. Economics itself is not built on the assumption that growth is good, but it is generally used to try to create optimal conditions in the economy for growth. No part of economics would fail if you changed your assumptions about what is good. Parts might become inapplicable if you assumed that individual actors did not seek growth, but that is not a value judgement. That is just the result of a simplification for the sake of simplicity. If you know what different actors want, you can understand how they act at least to some extent by means of economics no matter what it is that they want.", "is_submitter": false, "distinguished": null, "created_utc": 1628029162.0, "parent_id": "t1_h7l07iz", "replies": [{"author": "MisanthropicScott", "id": "h7lzm1c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ow8sq7", "stickied": false, "body": "I do understand what you're saying. But, it would be a lot easier to agree if you could point me at some schools of economic thought on how to shrink the economy (and population) in order to actually survive on this finite planet instead of making a fast buck and partying while the bus goes over the cliff.", "is_submitter": false, "distinguished": null, "created_utc": 1628031066.0, "parent_id": "t1_h7lvibb", "replies": []}]}]}]}]}]}, {"author": "CemeteryWind213", "id": "h7g7jii", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #175 | Classis Veritatus", "submission": "ow8sq7", "stickied": false, "body": ">utterly false assumptions\n\nI would add that all people involved have full and relevant information and play fairly within the system, which is unrealistic.", "is_submitter": false, "distinguished": null, "created_utc": 1627924488.0, "parent_id": "t1_h7f5ygm", "replies": []}]}, {"author": "Theo0033", "id": "h7g83yt", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ow8sq7", "stickied": false, "body": "The private sector shouldn't deal in necessities (such as food, water, shelter, electricity, heating/cooling, and internet (more essential than ever)), but it's the most efficient way to develop stuff.", "is_submitter": false, "distinguished": null, "created_utc": 1627924732.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "DELETED", "id": "h7ehn1k", "score": 7, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "ow8sq7", "stickied": false, "body": "Free market with regulations in place to prevent fraud, malfeasance, and to protect contracts and property rights (which would include environmental negligence).\n\nHow you could ever achieve it without the regulators becoming compromised I don't know, probably need a superhuman and highly ethical AI like a Culture Mind.", "is_submitter": false, "distinguished": null, "created_utc": 1627886221.0, "parent_id": "t3_ow8sq7", "replies": [{"author": "Pwngulator", "id": "h7fxrz7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "ow8sq7", "stickied": false, "body": "Regulatory capture is such a big threat to any system. \n\nPeople seem to forget how powerful corporations are as a concept; and since they are legally obligated to act selfishly, the only check to their power and growth is regulation.", "is_submitter": false, "distinguished": null, "created_utc": 1627920326.0, "parent_id": "t1_h7ehn1k", "replies": []}]}, {"author": "Niskanen204", "id": "h7exgjv", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "ow8sq7", "stickied": false, "body": "I've long been a 'reform' liberal (i.e. free market basis, allowances made for welfare state, publicly-owned companies) due to the Lockean notion of property - if you put your labour into chopping down a tree, sawing it into lumber, and then crafting a chair, then that chair is 'yours'.\n\nI still believe that concept to solid at a personal, individual level, but I can no longer square it with the so called 'late stage' capitalism of global mega cap corporations. It's a different beast entirely, and one I can no longer ideologically defend. Moreover, as capitalist societies we continually fail the invisible hand's best application - think of the toilet paper crisis early into the pandemic, or any shortage of any good in a regional emergency.\n\nSince a lot of our political and economical organization seems a result of historical technology - representative democracy arising in a technological context where a horse rider was the fast method of communication - I think there's a valid continuum between the free market and planned economy that can be defined by technology.\n\nI'd probably start with certain goods with high market penetration like our aforementioned toilet paper. You could narrow it down to one product and model its fluctuation of supply and demand relatively easily and with little social unrest (people really only shit a set amount, let's be honest). For other products that might have more choice pressure, a state manufacturer could roll out several models or effectively brand the appearance of choice for one (which happens now with, say, Costco's Kirkland products - people love it). \n\nOperating in this way would ensure similar levels of commodity quality and secure access, and free up a lot of labour to other endeavours such that instead of our best minds designing Charmin marketing ads they could be progressing medical research, or designing rockets or carbon scrubbers, or planting forests - whatever activity we define as better furthering the human project.\n\nEdit: Oh, and an actual accounting of supply and demand would also track labour which would mean whatever university major or career you chose to get into you'd never have to worry about finding work or experience the Sisyphusian hell of sending out 300 resumes for a $20/hr job.", "is_submitter": false, "distinguished": null, "created_utc": 1627900171.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "Stand_kicker", "id": "h7exznm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "ow8sq7", "stickied": false, "body": "I believe in **competition and a free market**. That is how we ensure businesses with the best ideas, that innovative, that produce the best products, that provide the best experiences, etc. survive and thrive.\n\n**The government should not be in the business of buying and selling or creating jobs or building houses**.\n\nThe government has 3 branches. Legislative, executive, and judicial. The legislative makes the laws. The executive, executives them, and the judiciary resolves disputes. Oversimplified and glancing over a whole bunch of things, I know.\n\nTo protect small and local businesses have the government set regulations. Have them   \nrequire big corporations employ and contract smaller or local businesses for services, without any investment or shares in them. **I do not favor 100% protectionism, but protectionism is necessary**.\n\n**Minimum government, maximum governance. Minimum taxes, maximum and proper utilization of funds. Privatize as much as possible**.\n\nAutomate, but retain human touch and interaction (whatever this means).", "is_submitter": false, "distinguished": null, "created_utc": 1627900654.0, "parent_id": "t3_ow8sq7", "replies": [{"author": "Espumma", "id": "h7kru3f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #12", "submission": "ow8sq7", "stickied": false, "body": "Regulations aren't only there to protect small businesses. It's also to prevent the tragedy of the commons and protect citizens and the environment (and whatever other stakeholder can't represent itself).", "is_submitter": false, "distinguished": null, "created_utc": 1628012391.0, "parent_id": "t1_h7exznm", "replies": []}]}, {"author": "MatthewofFinance", "id": "h7ezz2t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #204 | Ordo Cognitus", "submission": "ow8sq7", "stickied": false, "body": "I sure as heck dislike central planning", "is_submitter": false, "distinguished": null, "created_utc": 1627902298.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "Alpha-Charlie-Romeo", "id": "h7ff1l4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "ow8sq7", "stickied": false, "body": "Free market. I don't really care what happens and I'm the kind of idiot that thinks that if you get scammed it's your own fault for being dumb enough to get scammed. So naturally I forget morals and pick the option that improves the economy the most regardless of how corporations and businesses can and will abuse people and the markets.", "is_submitter": false, "distinguished": null, "created_utc": 1627911708.0, "parent_id": "t3_ow8sq7", "replies": [{"author": "Pwngulator", "id": "h7fyvt3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "ow8sq7", "stickied": false, "body": "If corporations are allowed to abuse the market, how does that lead to an improvement of the overall economy?", "is_submitter": false, "distinguished": null, "created_utc": 1627920804.0, "parent_id": "t1_h7ff1l4", "replies": [{"author": "Alpha-Charlie-Romeo", "id": "h7g3hct", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "ow8sq7", "stickied": false, "body": "It was entirely a satirical comment devoid of logic. Please pay it no mind.", "is_submitter": false, "distinguished": null, "created_utc": 1627922755.0, "parent_id": "t1_h7fyvt3", "replies": [{"author": "Pwngulator", "id": "h7g4ij8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "ow8sq7", "stickied": false, "body": "What a sad state of affairs that I didn't immediately recognize it as satire", "is_submitter": false, "distinguished": null, "created_utc": 1627923196.0, "parent_id": "t1_h7g3hct", "replies": []}]}]}]}, {"author": "DragonFromHell", "id": "h7et7os", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #22", "submission": "ow8sq7", "stickied": false, "body": "Something different from the US atleast. More public institutions that private will have to compete with and regulations that prevent private hospitals for example from scamming clients legally.\n\nOh and giving government support to largest companies as a bribe is a stupid corrupt thing. When Activision-Blizzard got a government support package without paying any taxes, Bobby Kotic took the money as a bonus. His immense wealth is directly being added to by the government. And he doesn't pay taxes.\n\nMan, these were way more fun when you used aliens in imaginary scenarios.", "is_submitter": false, "distinguished": null, "created_utc": 1627896534.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "DELETED", "id": "h7eyggw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "ow8sq7", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627901064.0, "parent_id": "t3_ow8sq7", "replies": [{"author": "Pwngulator", "id": "h7fyl8t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "ow8sq7", "stickied": false, "body": "What about \"years away\" threats, such as the climate crisis?\n\nDo you not feel the government should also step in to protect the free market, eg to prevent formation of monopolies/duopolies, collusions such as price flooring, or the destruction of small and local businesses?", "is_submitter": false, "distinguished": null, "created_utc": 1627920678.0, "parent_id": "t1_h7eyggw", "replies": [{"author": "Zealousideal_Mix_629", "id": "h7fzoz6", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "ow8sq7", "stickied": false, "body": ">immediate and direct\n\nEverything else is left up to the free market.\n\nEdit: Once a threat has subsided, a strong examination possible deregulations to implement. To prevent over correction.", "is_submitter": false, "distinguished": null, "created_utc": 1627921150.0, "parent_id": "t1_h7fyl8t", "replies": [{"author": "Pwngulator", "id": "h7g4b3c", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "ow8sq7", "stickied": false, "body": "Well it seems pretty clear to me that the free market is unable to address long-term externalities such as the climate crisis.\n\nA system whose solution to the tragedy of the commons is \"ignore it\" has already failed, IMO.", "is_submitter": false, "distinguished": null, "created_utc": 1627923105.0, "parent_id": "t1_h7fzoz6", "replies": [{"author": "Zealousideal_Mix_629", "id": "h7g5xxk", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "ow8sq7", "stickied": false, "body": "The solution to tragedy of the common is simple. A focus on small regional government. People are instinctively programed for tribal style communities. So we use that as a template and modernize it. People will respect communal spaces more if they feel accountable to their neighbors/fellow tribe members", "is_submitter": false, "distinguished": null, "created_utc": 1627923802.0, "parent_id": "t1_h7g4b3c", "replies": [{"author": "Pwngulator", "id": "h7gdez7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "ow8sq7", "stickied": false, "body": "A large cap corporation cares not a lick for your small regional government and will simply trample it.\n\nPeople seem to forget that the earliest corporations (the East India Companies) were basically their own governments, with their own militaries, that committed genocides with basically no oversight.", "is_submitter": false, "distinguished": null, "created_utc": 1627927016.0, "parent_id": "t1_h7g5xxk", "replies": [{"author": "Zealousideal_Mix_629", "id": "h7gg94o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "ow8sq7", "stickied": false, "body": "But they kept their tribe happy. They increased jobs in the private security sector and provide products the people of England wanted at a reasonable price.", "is_submitter": false, "distinguished": null, "created_utc": 1627928268.0, "parent_id": "t1_h7gdez7", "replies": [{"author": "Pwngulator", "id": "h7gm1zs", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "ow8sq7", "stickied": false, "body": "Uhh sure, I guess we can justify what-would-now-be-considered-war-crimes with that....\n\nYikes", "is_submitter": false, "distinguished": null, "created_utc": 1627930779.0, "parent_id": "t1_h7gg94o", "replies": [{"author": "Zealousideal_Mix_629", "id": "h7gml18", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "ow8sq7", "stickied": false, "body": "Morality is relative", "is_submitter": false, "distinguished": null, "created_utc": 1627931010.0, "parent_id": "t1_h7gm1zs", "replies": [{"author": "Pwngulator", "id": "h7gqw5c", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "ow8sq7", "stickied": false, "body": "It ain't *that* relative, bro", "is_submitter": false, "distinguished": null, "created_utc": 1627932889.0, "parent_id": "t1_h7gml18", "replies": []}]}]}]}]}, {"author": "MisanthropicScott", "id": "h7i8lxy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ow8sq7", "stickied": false, "body": "We only have one atmosphere for the whole planet. How will you divide that up so that each locale is responsible for it's own atmosphere without influence from things like the jet stream?", "is_submitter": false, "distinguished": null, "created_utc": 1627957774.0, "parent_id": "t1_h7g5xxk", "replies": []}]}]}]}]}]}, {"author": "pine_ary", "id": "h7f2usy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "ow8sq7", "stickied": false, "body": "Mixed socialist economy. State-owned enterprises for the essentials (water, electricity, essential food, public transportation, internet, basic housing, etc.) so that everyone has the basics guaranteed and coops for everything else (commodities, luxuries, etc.). Private property is fazed out and eventually outlawed. It‘s pretty clear that capitalism has run its course and needs to be replaced. A modern socialist economy would fix most of its issues.", "is_submitter": false, "distinguished": null, "created_utc": 1627904470.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "finance_controller", "id": "h7jb31w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #27", "submission": "ow8sq7", "stickied": false, "body": "Centralized planning. /s\n\nI'm looking for alternatives and progress, I dislike status quo particularly the current situation. On paper I consider both free market and centralized planning as equivalent but... only in theory, main problem for both is some sort of \"compentency\" notion, doing things right.\n\nFree market isn't bad but I haven't seen much progress on the system since... like ever.", "is_submitter": false, "distinguished": null, "created_utc": 1627985113.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "AndrewIsOnline", "id": "h7jx59c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "ow8sq7", "stickied": false, "body": "I think we need UBI, free college, legal weed, gun restrictions but you can still own small caliber and hunting weapons, remove money from politics, fully fund the irs, send kids to 2 years of military post high school, but it’s more like they get rigorous testing for possible jobs, then work one job for a year and then their runner up job for a year, while learning discipline, how to clean, how to shop, how to bank, how to plan, how to save. \n\nThe military is used for its command structure and these year long vocation jobs are structured to build and enrich infrastructure in the US and build interconnected high speed rail, and give back to the country, with specialists from the military overseeing the grunt labor of the recent grads.\n\nEvery student comes out at 20 with two years of full work experience, pay, references, qualifications and certificates related to their vocational choices, and a strong sense of teamwork and civic duty. \n\nSchools are no longer funded by local area taxes. Private and charter schools are outlawed, and everyone is forced to go to public school, which is fully funded. \n\nWe take the top 100 lecturers for each grade and subject and they film high quality lectures and each student in the county learns from the best teachers in every subject, and local teachers become more like mentors and tutors. They would look after 10-12 students and make sure they don’t have any questions from lectures and go into things more, while teaching good habits and manners and life skills. \n\nEach student will have their learning measured by AI, and will be placed in topics and classes based on their individual competency level per subject, and have an AI custom tailored education plan that reinforces their weak subjects while challenging them with the subjects they are good at. Grades lose meaning, and it becomes more personalized progress. \n\nParts of school is revamped to teach group skills and tasks so people learn to critically think and how to problem solve in a group, and how to find, research, and learn on their own. \n\n\nAll corporations are stripped of their ability to donate and are not citizens.\n\nThe gerrymandering  process is removed, and AI and a team of neutrally political people redraw the districts every 2 years with perfect neutrality in mind.\n\nDonating to politicians becomes non existent, and if it does happen it’s displayed to the public, plainly. \n\nPoliticians are given competency tests in a myriad of subjects and the scores are shown plainly to the public. \n\nCampaigning is broadcast specially with more fact based, intense questioning on tv. \n\nPoliticians are held more responsible to their constituents and if they vote against the constituency’s majority, there is a method to veto their vote and flip it in place for the public to enact.", "is_submitter": false, "distinguished": null, "created_utc": 1627998958.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "atlasgaveup", "id": "h7ki13f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "ow8sq7", "stickied": false, "body": "There are things that benefit society and that which benefit the individual. Neither system balances that well. Healthcare, education, clean drinking water, basic shelter, and basic food are important to society to help provide to individuals. Accumulation of wealth is something that individuals should be able to strive for. Unbridled capitalism in free markets creates as many problems as it solves. Unfortunately, it is the best system that the world has at this point.", "is_submitter": false, "distinguished": null, "created_utc": 1628008365.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "FreeBiskit", "id": "h7l5hrs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "ow8sq7", "stickied": false, "body": "I agree fully with you OP except I find it difficult to imagine one day we have a fair system for people using government services. \n\nI suppose the unfairness, is somewhat of the point of having private entities. \n\nAlso what defines fair? Equal or equitable? Right now we have a mix. I feel as long as something better exists, the people will be too blinded by what they don’t have to be grateful for what they do. \n\nHowever, I’ve seen friends use their free healthcare services and it’s a joke. I didn’t realize healthcare could be so rushed, ignored and minimized since I grew up in a family with private... everything, fortunately. \nAnyway, these inequalities, even if set up to be fair would still be perceived as unfair. This arises in forms of protests, riots, boycotts and unemployment. Things generally considered bad for the country. \n\nI look at 1984 (Yes, cringe. I know) and think about the proletariats roles in the new government. \n\nThe proles were kept happy with cigarettes, alcohol and sex. I suppose IRL we do this in some form today. Feed the farmers opiates to keep them happy and to keep food on our tables, a little over dramatic, I know. \n\nI suppose if government run services are to exist, there must exist several tiers of private services that one can plan to achieve so that the lower classes of people can at least have the drive and motivation to accomplish something *attainable.*  \n\nThis is all under the assumption that government entities will be far inferior, like it is today. Hell, if the government starts to update their systems and get a new paint job then I’ll eat my words.", "is_submitter": false, "distinguished": null, "created_utc": 1628018085.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "SoyTuTocayo69", "id": "h7md5qg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #105", "submission": "ow8sq7", "stickied": false, "body": "I think the free market is dumb but I gotta say, there are a lot of things in between those two options. \n\nHow about this: capitalism is good, but billionaires are wildly unnecessary and need to pay proportionately more than everyone else. Bezos is way to rich, for one example... Fuck em. He doesn't need it. Nor did he necessarily earn it, when you consider how unnatural that amount of wealth actually is. Does this guy really do that much more work than a janitor at one of his warehouses to justify that much wealth? Fuck offfff. And, if left to his own devices, that money will never enter the economy ever again, or at least not nearly enough of it. Fuck 'em. Charge 'em, give him a bill, but he could lose 3/4 of his shit and still have the lifestyle that he does. We do this with every billionaire. Millionaires are OK 👌\n\nLots of that money should go to good will and well being. Subsidize Healthcare, build infrastructure, social safetynets, affordable housing, feeding the poor. Everyone's lives will still suck but at least it will suck way less.", "is_submitter": false, "distinguished": null, "created_utc": 1628037613.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "ItsJustAnAdFor", "id": "h7me88s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #73", "submission": "ow8sq7", "stickied": false, "body": "If I say socialism, can I define how the government operates?", "is_submitter": false, "distinguished": null, "created_utc": 1628038140.0, "parent_id": "t3_ow8sq7", "replies": []}, {"author": "armahillo", "id": "h7tytk8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ow8sq7", "stickied": false, "body": "The Free Market is great, and probably ideal, for luxury goods, commodities, etc.\n\nThe Free Market is AWFUL for inelastic markets (public health, water, even housing and food, really).\n\nI want the private sector to make cars and movies and fancy clothes and jewelry. I want the public sector to ensure I have the things I need to survive / participate in society. I also want the public sector to have the ability to step in when there is a moral hazard that the private sector is unwilling to avoid. (basically any situation where profits can be maximized at the expense of humanity)", "is_submitter": false, "distinguished": null, "created_utc": 1628184762.0, "parent_id": "t3_ow8sq7", "replies": []}]}