{"title": "A megacorp government is not so different compared to a communist government.", "name": "t3_oxlmhv", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oxlmhv/a_megacorp_government_is_not_so_different/", "selftext": "Whether the state owns all the means of production, or whether the means of production own the state, it's kinda the same thing.", "score": 2, "upvote_ratio": 0.54, "permalink": "/r/TheFlyingTree/comments/oxlmhv/a_megacorp_government_is_not_so_different/", "id": "oxlmhv", "author": "FalconRelevant", "link_flair_text": "Debate", "num_comments": 81, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1628054001.0, "comments": [{"author": "zephyrsong888", "id": "h7ove89", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #140", "submission": "oxlmhv", "stickied": false, "body": "Not true. Corporations are very different from governments. People who have never worked in public sector are the types who say this. Those who have done *both* recognize that businesses are more efficient for local problems but they are very limited in scope. Government is the opposite - their scope is massive but they can't handle local issues easily.\n\nFor example - if you work in textbooks, working in a business and working as the government, you would have very different goals. I'll leave it as an exercise to the reader to discern what are the different, non-overlapping goals of private and public sectors with respect to textbooks.", "is_submitter": false, "distinguished": null, "created_utc": 1628092498.0, "parent_id": "t3_oxlmhv", "replies": []}, {"author": "TrueNinjafrog", "id": "h7nii0r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #146 | Legio Virtus", "submission": "oxlmhv", "stickied": false, "body": "This pretty much enters the realm and argument of libertarianism vs authoritarianism. More freedom and power to the individuals, or to the government. I've always held a more centrist-libertarian type of view in that regard, in which I believe that each person should be able to achieve more for themselves and others based on how much work ethic they have in whatever it is they're doing, but at the same time, people shouldn't be forced to live in absolute shithood if they aren't an entrepreneur (exaggeration) nor forced down to a shitty position.", "is_submitter": false, "distinguished": null, "created_utc": 1628062610.0, "parent_id": "t3_oxlmhv", "replies": []}, {"author": "milo-trujillo", "id": "h7q4tqu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #89", "submission": "oxlmhv", "stickied": false, "body": "The structure might be similar, but the incentives are not. Corporations are profit-driven, and make decisions to further their profit, ultimately at the expense of the environment, employee health, personal freedom, and on and on if their authority is unbounded. A communist government doesn't need to share those end-goals. A government (ideally, theoretically) run for public benefit can pursue outcomes like public health, education, and cultural preservation or development, even when those outcomes would be antithetical to profit-maximization.", "is_submitter": false, "distinguished": null, "created_utc": 1628111356.0, "parent_id": "t3_oxlmhv", "replies": []}, {"author": "Natural-Sun-8613", "id": "h7n8ihj", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "Welcome to a big perspective, freedoms transcend all. I’d rather be monitored all day in a free country than be forced into some bullshit in a society that is detached from the government. The people cannot govern themselves as they do not know what they truly want. If you don’t guide them along a set path then where would they end up?", "is_submitter": false, "distinguished": null, "created_utc": 1628054647.0, "parent_id": "t3_oxlmhv", "replies": [{"author": "FalconRelevant", "id": "h7n8nzy", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oxlmhv", "stickied": false, "body": "So what are you trying to say?", "is_submitter": true, "distinguished": null, "created_utc": 1628054753.0, "parent_id": "t1_h7n8ihj", "replies": [{"author": "Natural-Sun-8613", "id": "h7n9p68", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "I’m agreeing with you. I take it most people don’t like communism but it’s really just another order of operations to achieve the same goal as another government. The main issue I have is how these ideas show themselves in their modern day examples.", "is_submitter": false, "distinguished": null, "created_utc": 1628055469.0, "parent_id": "t1_h7n8nzy", "replies": []}]}, {"author": "AlternativeMint", "id": "h7nyd8k", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oxlmhv", "stickied": false, "body": "\"The people cannot govern themselves\"\n\nAnd you want the people to govern over others????", "is_submitter": false, "distinguished": null, "created_utc": 1628076130.0, "parent_id": "t1_h7n8ihj", "replies": [{"author": "FnchWzrd314", "id": "h7qhf39", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oxlmhv", "stickied": false, "body": "I think he means that an individual cannot govern themselves, there need to be standards that apply to everybody", "is_submitter": false, "distinguished": null, "created_utc": 1628116950.0, "parent_id": "t1_h7nyd8k", "replies": [{"author": "AlternativeMint", "id": "h7qixat", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oxlmhv", "stickied": false, "body": "The standards that might apply to everybody are universal and not so many. And reflected again and again first in many religions, or in human rights declaration for example. And being universal is not a coincidence, almost everyone follow that same moral.\n\nExcept those interested in govern the rest, they usually think they are above the rest.", "is_submitter": false, "distinguished": null, "created_utc": 1628117641.0, "parent_id": "t1_h7qhf39", "replies": [{"author": "FnchWzrd314", "id": "h7qjck8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oxlmhv", "stickied": false, "body": "I'm sorry, I don't see your point", "is_submitter": false, "distinguished": null, "created_utc": 1628117839.0, "parent_id": "t1_h7qixat", "replies": [{"author": "AlternativeMint", "id": "h7r1ewm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oxlmhv", "stickied": false, "body": "But without my point, we might get involved in lives controlled to a point we couldn't even discuss it\n\nTyranny and dictatorships have been the most common forms of government in history and they are rampant nowadays.\n\nAll because that funny concept that people can't govern themselves.", "is_submitter": false, "distinguished": null, "created_utc": 1628126383.0, "parent_id": "t1_h7qjck8", "replies": [{"author": "FnchWzrd314", "id": "h7r1sp2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oxlmhv", "stickied": false, "body": "You're saying you honestly trust everyone to be able to hold themselves to the standards enforced by society when there is no punishment for not doing so? That anarchy is not equally, if not more dangerous than tyranny?", "is_submitter": false, "distinguished": null, "created_utc": 1628126564.0, "parent_id": "t1_h7r1ewm", "replies": [{"author": "AlternativeMint", "id": "h7r252g", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oxlmhv", "stickied": false, "body": "No, I am saying that I naturally distrust anyone that want to tell people how to life and enforce it on them.\n\nNow, since some order is needed because we don't want another Wild West... Few and fair laws based on human rights and a small organization to enforce them is the best bet.\n\nSadly governments keep concentrating all the power over the individuals.", "is_submitter": false, "distinguished": null, "created_utc": 1628126724.0, "parent_id": "t1_h7r1sp2", "replies": [{"author": "FnchWzrd314", "id": "h7r2rvw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oxlmhv", "stickied": false, "body": "I agree, and I believe that the people who want to rule shouldn't, because they are the most likely to become power hungry.\n\nI'd also like to make a case for the 'philosopher king' proposed by Plato, or at the very least a system where the ruler is selected at birth and trained to rule for their entire life.", "is_submitter": false, "distinguished": null, "created_utc": 1628127022.0, "parent_id": "t1_h7r252g", "replies": [{"author": "AlternativeMint", "id": "h7romfi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oxlmhv", "stickied": false, "body": "That is literally a monarchy. And it had very irregular results, that is a heavy burden for anyone too.\n\nWell, having people as judges, another group making laws and another one elected to take the practical decisions creates a system where different powers keep checking on each other.\n\nWashington et al. knew things when they signed the Constitution of the USA.", "is_submitter": false, "distinguished": null, "created_utc": 1628138538.0, "parent_id": "t1_h7r2rvw", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "GreyShuck", "id": "h7nbbcx", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #201", "submission": "oxlmhv", "stickied": false, "body": "Yes - as long as everyone was both an employee and shareholder of the corporation, with equal numbers of shares.", "is_submitter": false, "distinguished": null, "created_utc": 1628056658.0, "parent_id": "t3_oxlmhv", "replies": [{"author": "FalconRelevant", "id": "h7nbpwo", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oxlmhv", "stickied": false, "body": "That's what communist governments claim to be, however they are authoritarian dystopias where the top few party members hold power. Not that different from one megacorp and its board running a nation.", "is_submitter": true, "distinguished": null, "created_utc": 1628056966.0, "parent_id": "t1_h7nbbcx", "replies": [{"author": "GreyShuck", "id": "h7nc7av", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #201", "submission": "oxlmhv", "stickied": false, "body": "Yes - and insofar as they do this, they cease to be communist.", "is_submitter": false, "distinguished": null, "created_utc": 1628057326.0, "parent_id": "t1_h7nbpwo", "replies": [{"author": "TrueNinjafrog", "id": "h7ni1nd", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #146 | Legio Virtus", "submission": "oxlmhv", "stickied": false, "body": "I guess this enters the issue as to what communism is defined *as*, in terms of the intent and what it is in practice (which in this case, is not even the same at all).\n\nIt's for this reason that I generally hold a negative opinion towards communism as a whole (not only because I'm half North Korean), because of this ambiguity and inconsistency as to what it is supposed to be in conversation. Is it just another word for socialism, or beliefs stemming from that type of belief? Is it referring to a regime that manipulates people under a government they have no control over, under the guise of what I mentioned prior? IDK.", "is_submitter": false, "distinguished": null, "created_utc": 1628062217.0, "parent_id": "t1_h7nc7av", "replies": []}, {"author": "R5Cats", "id": "h7u0zk8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "\"No True Scotsman\" fallacy 😑  \n\nCommunism on paper = utopia.  \nCommunism in reality = death camps. Every single time.", "is_submitter": false, "distinguished": null, "created_utc": 1628185652.0, "parent_id": "t1_h7nc7av", "replies": []}]}, {"author": "Cheomesh", "id": "h7r7kut", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "oxlmhv", "stickied": false, "body": "Yeah the kinda guys who thrive in a revolution tend to be hardasses who don't let go easily.", "is_submitter": false, "distinguished": null, "created_utc": 1628129287.0, "parent_id": "t1_h7nbpwo", "replies": []}, {"author": "R5Cats", "id": "h7u0n5x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "I agree. If it's a select few \"board members\" running the government OR the business? The end result will eventually be the same: totalitarian dictatorship and complete disconnection from the populous.  \nA cabal of businesses with total monopolies over critical industries would eventually run the nation (or the world) like a 1984 nightmare. Same as socialism.", "is_submitter": false, "distinguished": null, "created_utc": 1628185509.0, "parent_id": "t1_h7nbpwo", "replies": []}, {"author": "Kweldulf", "id": "h7nuqnv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "oxlmhv", "stickied": false, "body": "That is not exactly true. The communist states are not as authoritarian as one might think. The power is distributed in a circular manner creating an intricate net of checks and balances - meaning that almost noone hold actual power.\n\nThe simplest example is the prominance of state security agencies - KGB in USSR. KGB did not exactly answer to the priminister, and could cause their downfall, while also technically answering to the party committee. In essence most communist states have governments based of the idea of mutually assured destruction - if anyone does not follow the party line they are austed.\n\nIt is easy to think of Xi Jinpeng or Gorbachev as authoritarian leaders who inflicted harm on the people they governed. The truth is in many ways they were but figure heads. This can go for any official in a comminist state - everyone is checked, everyone is controlled, there is no central authority per se. That's also why these systems are so resistant to change. \n\nThe board of a corporation is much smaller and more centralised in terms of decision making, as well as they don't answer to anyone. That's where the difference is.", "is_submitter": false, "distinguished": null, "created_utc": 1628073358.0, "parent_id": "t1_h7nbpwo", "replies": [{"author": "FalconRelevant", "id": "h7o44ab", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oxlmhv", "stickied": false, "body": "Communist states are indeed authoritarian, you are probably using a different definition of authoritarianism than I am. \n\nThe board answers to shareholders.", "is_submitter": true, "distinguished": null, "created_utc": 1628079867.0, "parent_id": "t1_h7nuqnv", "replies": [{"author": "R5Cats", "id": "h7u24a3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "In theory they answer to shareholders, in reality they answer to themselves.  \nWhen a certain Canadian company (whose name eludes me) was falsifying profit futures to boost stock prices? The board voted themselves (iirc) 120 million in 'bonuses' and resigned. Bankrupting the company, stocks fell from (iirc) $120 to under 10. They'd sold off most of their stocks already, of course.  \nNothing they did was \"illegal\" and shareholders got pennies on the dollar in the end.\n\nOne could say the stock market controls a company, I'd buy that! Of course the company has to have stocks in an open market...", "is_submitter": false, "distinguished": null, "created_utc": 1628186102.0, "parent_id": "t1_h7o44ab", "replies": []}]}, {"author": "R5Cats", "id": "h7u1i1n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "Lenin, Stalin, Mao, Pol Pot, Mugabe, Castro, Chavez? They were not \"figureheads\" they ruled with absolute authority causing millions of their own people to suffer and die. \n\nIn theory Communism has 'checks and balances' but in reality one man can appoint ALL those who should be checking & balancing to be his stooges.", "is_submitter": false, "distinguished": null, "created_utc": 1628185859.0, "parent_id": "t1_h7nuqnv", "replies": [{"author": "Kweldulf", "id": "h7u37cr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "oxlmhv", "stickied": false, "body": "Pretty much everyone you mentioned with the notable exception of Stalin (who got his power only because he followed the majority opinion of the party, and was very much controlled by it, as opposed to Torcki the designated by Lenin next in line) were revolutionaries who estabilished communism in their states. In theory communism does not have checks and balances - it created them in order to self preserve after the revolutionaries ceded the power. I am talking about the way the states were operated after the initial estabilishment.", "is_submitter": false, "distinguished": null, "created_utc": 1628186535.0, "parent_id": "t1_h7u1i1n", "replies": [{"author": "R5Cats", "id": "h7u7thi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "Stalin got his power that way yes, mostly. Once in power he simply purged *anyone* who even remotely disagreed with him. After a while, he purged anyone who *didn't agree enough* too.  \nThe 'party' was filled with people with unquestioning obedience to Stalin or who lived in abject terror of Stalin. One wrong step would wipe out your entire family.\n\nThat's \"in theory\" and all the ones I mentioned were \"in reality\". The revolutionaries never cede the power, they abuse it.", "is_submitter": false, "distinguished": null, "created_utc": 1628188390.0, "parent_id": "t1_h7u37cr", "replies": []}]}]}]}]}]}, {"author": "YLASRO", "id": "h7nrpp9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "Except not. Communism is supposed to wither the state away over time. The goal is a stateless, classless society. Meanwhile corperations would never let the puppetstate wither away. Its too usefull for them.", "is_submitter": false, "distinguished": null, "created_utc": 1628070831.0, "parent_id": "t3_oxlmhv", "replies": [{"author": "FalconRelevant", "id": "h7ntc5z", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oxlmhv", "stickied": false, "body": "We're talking about how they are in practice, not what their ideals are.", "is_submitter": true, "distinguished": null, "created_utc": 1628072215.0, "parent_id": "t1_h7nrpp9", "replies": [{"author": "YLASRO", "id": "h7nv6by", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "considdering the spanish civil war saw a highly functional anarchocommunist society emerge (republican spain) that was then destroyed by the fascist side of the civil war because they got support form hitler and mussoulini while the socialist side got no support from anyone but the USSR. id say if you stay away from stalinism and similarly authoritarian doctrines it is realistic to wither away the state and endup with a better society. \n\ntribal societys also demonstrate a governance system with similarly anarchist structure so if you switch bartering and moneybased systems for a socialist economy with things like workers coops running all industry its not hard to reason that this mode of operation is very doable for humans. \n\ntldr: communism works but only if its interwoven with anarchism. any attempt to make a communist governmnet exist as a perpetual state will end in tyranny like the soviet union. the state is a tool of opression.", "is_submitter": false, "distinguished": null, "created_utc": 1628073713.0, "parent_id": "t1_h7ntc5z", "replies": []}]}, {"author": "Kweldulf", "id": "h7nv3fb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "oxlmhv", "stickied": false, "body": "Except not. Communism as understood under most popular Marxist-Leninist doctrine and its derivatives (seen in e.g. in China and NK) is inherently bound to the notion of state, and as such implemented. It is true that \"pure\" Marxist comminism is opposed to the idea of state, as are many other more liberal communist doctrines, but it is a false claim to say that Communism is inherently stateless - simply because a number of doctrines considered \"communism\" fully endorse the idea of state.", "is_submitter": false, "distinguished": null, "created_utc": 1628073649.0, "parent_id": "t1_h7nrpp9", "replies": [{"author": "YLASRO", "id": "h7nwx45", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "if you only adhere to marxes early works yes. but marx changed his views on the state overtime. also marx is not the sole authority to view communism through. there is plenty of anarchists who made valid modifications to marxism like rosa louxembourg, peter kropotkin etc. the idea that a classless moneyless society can be upheld by a state is pure authleft delusion. the state is an instrument of violence and opression.\n\nanarcho communist thought might not be the dominant doctrine buts its clearly the most coherent one.", "is_submitter": false, "distinguished": null, "created_utc": 1628075055.0, "parent_id": "t1_h7nv3fb", "replies": [{"author": "Kweldulf", "id": "h7o16ud", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "oxlmhv", "stickied": false, "body": "Yes that's what I said. There are stateless communist doctrines, but they are not what is primarly understood by communism.\n\nRe: anarcho-communism being even somewhat coherent - no. As every anarchist doctrine it utimately would result in a creation of state or para-state. For the simplest proof of that: say an anarcho-communist society emerges, and say that there is a small percentage of people in this society who e.g. hoard property and use the means of production for personal benefits primarly. Such individuals will need to be somehow taken care of, in the simplest case by forceful removal. Such forceful removal can be of course carried out by any member of society, but assuming that there is a probobility of resistance it makes forceful removal dangerous - thus requiring skill. Therefore it would be optimal to delegate a group of individuals willing to risk health and possesing necessary skills to remove the unwilling to participate from the society. Then you have came up with police - a sure mark of state.\n\nSimilair processes will always lead to emergance of other marks of state such as law, wealth redistribution etc. No anarchist doctrine can be coherent as any anarchist society will evolve into a state at some point. Anarchism is not viable as a permanent doctrine within a society. The emergance of statehood is inevitable, therefore instead of arguing how to abolish the state we should focus on how to create a good state.", "is_submitter": false, "distinguished": null, "created_utc": 1628078057.0, "parent_id": "t1_h7nwx45", "replies": [{"author": "YLASRO", "id": "h7o5jnq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "Im not saying there would ve no laws and no organization. There would be. But fundamentally more horizontal abd democratic than traditional states", "is_submitter": false, "distinguished": null, "created_utc": 1628080687.0, "parent_id": "t1_h7o16ud", "replies": [{"author": "Kweldulf", "id": "h7o6zl3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "oxlmhv", "stickied": false, "body": "Well then you are not describing anarchism, but minarchism - a doctrine of minimal state, which I agree is the optimal route for the society", "is_submitter": false, "distinguished": null, "created_utc": 1628081489.0, "parent_id": "t1_h7o5jnq", "replies": [{"author": "YLASRO", "id": "h7oguem", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "that may be a more accurate wird (i never heard it) bt it still leans more towards anarchism than traditional statist ideology. there is also freedoms id not grant to the \"state\"", "is_submitter": false, "distinguished": null, "created_utc": 1628086284.0, "parent_id": "t1_h7o6zl3", "replies": []}]}]}]}]}]}]}, {"author": "MelchiorBarbosa", "id": "h7ncnbi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #76 | Legio Virtus", "submission": "oxlmhv", "stickied": false, "body": "No its not, the state is the people. It matters if the people are governing themselves or be governed by bigcorp who only serves itself.\n\nThe problem is with communism is that when people think about communism they think of the USSR. The USSR was as corrupt as the US government is right now. SO yeah if you are saying that the USSR and the US are not so different then on some level I agree.\n\nBut if we look at the fundamentals of what those systems are supposed to be they are structurally different.", "is_submitter": false, "distinguished": null, "created_utc": 1628057666.0, "parent_id": "t3_oxlmhv", "replies": [{"author": "Stand_kicker", "id": "h7nf1mi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "oxlmhv", "stickied": false, "body": "One assumes people are all honest, will contribute to the best of their abilities, and will share losses equally. Truth is people are lazy, want to do the bare minimum while getting maximum rewards without inheriting any risks.", "is_submitter": false, "distinguished": null, "created_utc": 1628059634.0, "parent_id": "t1_h7ncnbi", "replies": [{"author": "Movpasd", "id": "h7nk1kt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "I think it is far too simplistic to say that \"people are lazy\". People are people, and their motivations are as complex as yours or mine or anyone's. It's also important to note that the social structures within which we live affect people's motivations as much as their motivations shape the structure. Is it surprising to see yourself surrounded by selfish people, if they are encouraged to, even *must* act selfishly, due to the economic system in which they are born, in order to obtain the means of their subsistence?", "is_submitter": false, "distinguished": null, "created_utc": 1628063970.0, "parent_id": "t1_h7nf1mi", "replies": [{"author": "Stand_kicker", "id": "h7nkuqc", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "oxlmhv", "stickied": false, "body": "You are right. Social welfare, handouts, etc. do encourage people to become lazy.\n\nHardworking people become less hardworking. Ambitious and driven less ambitious and driven. And lazy people even lazier.", "is_submitter": false, "distinguished": null, "created_utc": 1628064671.0, "parent_id": "t1_h7nk1kt", "replies": [{"author": "Movpasd", "id": "h7nl6kd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "Yours is a common perspective, but one that I disagree with.\n\nDid you downvote me because you disagree with me?", "is_submitter": false, "distinguished": null, "created_utc": 1628064966.0, "parent_id": "t1_h7nkuqc", "replies": [{"author": "Stand_kicker", "id": "h7nobbj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "oxlmhv", "stickied": false, "body": "Yes. But also because I think you are:\n\n- making excuses for the lazy\n\n- trying to justify laziness \n\n- going against the narrative for the sake of going against it\n\n- over thinking or over analyzing the topic to where you have convinced yourself of the opposite\n\nBut mostly because I disagree with you. Which is why the down vote button exists.", "is_submitter": false, "distinguished": null, "created_utc": 1628067799.0, "parent_id": "t1_h7nl6kd", "replies": [{"author": "Movpasd", "id": "h7npmsy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxlmhv", "stickied": false, "body": "It's a well-understood part of reddit etiquette to not downvote something because you disagree with it. The downvote button exists to express that a comment is irrelevant or not up to par with the community's standards. Of course, in practice, it is not always used correctly. This is why I haven't downvoted your comments, even though I disagree with them, and even though I think they're excessively polemical in tone; it would be polite of you to do the same.\n\nI ask because I'm not interested in the all-too-common format of internet debates which are just a back and forth of overused political talking points. Everyone is made to feel defensive, which clouds their judgement, and makes them ungenerous to their interlocutor's perspective. Nothing is learned, and the only thing that is accomplished is everyone getting riled up. Case in point: you've made a huge amount of assumptions about what I believe and why. It takes effort to set aside one's tribalistic tendencies and engage in actual discussion.\n\nSo I'm not really interested in continuing this conversation. I hope you may take this all on board as constructive criticism.", "is_submitter": false, "distinguished": null, "created_utc": 1628068994.0, "parent_id": "t1_h7nobbj", "replies": [{"author": "Stand_kicker", "id": "h7nq0n2", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "oxlmhv", "stickied": false, "body": "The criticism is not valid. So. No.\n\nAnd I'm not willing to continue this conversation till you face facts and see the truth.\n\nThis is the internet not a debate club. It's personal opinions. If you want to pick sides and debate it out, I'm sure there is a subreddit for that.", "is_submitter": false, "distinguished": null, "created_utc": 1628069341.0, "parent_id": "t1_h7npmsy", "replies": [{"author": "zephyrsong888", "id": "h7rg2bt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #140", "submission": "oxlmhv", "stickied": false, "body": "I'm relatively certain your perspective only applies on a macro-scale and not an individual one. This is usually the problem with the rhetoric where you state \"facts and truths\" without any qualifying statements. Absent of those qualifiers and context, *you* are incorrect.", "is_submitter": false, "distinguished": null, "created_utc": 1628133656.0, "parent_id": "t1_h7nq0n2", "replies": [{"author": "Stand_kicker", "id": "h7rip7r", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "oxlmhv", "stickied": false, "body": "If that's your opinion. Sure. I'm sure what you are talking about. Makes it hard when you don't add context.", "is_submitter": false, "distinguished": null, "created_utc": 1628135086.0, "parent_id": "t1_h7rg2bt", "replies": []}]}]}]}]}]}, {"author": "StopBanningMeGDIT", "id": "h7pd8sd", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "oxlmhv", "stickied": false, "body": "I've been working primarily with people in poverty in Appalachia the last ~6 years and my views on this have changed a lot. But anecdotal evidence is useless, so here's some research that says that this is not accurate. \n\nhttps://epod.cid.harvard.edu/article/dispelling-myth-welfare-dependency\n\nLet me guess Havarad is a leftist whatever whatever. How about oxford?\n\nhttps://academic.oup.com/wbro/article/32/2/155/4098285\n\nOkay another school that's a communist whatever. So I'll use NPR, one of the most renowned sources of journalism in the world:\n\nhttps://www.npr.org/sections/goatsandsoda/2017/08/09/542357298/cash-handouts-could-solve-poverty-but-theres-a-catch\n\nI just think it's reductive, and very much American, to say that people are in poverty because they don't work hard or that everyone is lazy and will just mooch off of the state if their allowed. Truth is that investment drives innovation, and that includes investment in everyone including the poor.", "is_submitter": false, "distinguished": null, "created_utc": 1628099761.0, "parent_id": "t1_h7nkuqc", "replies": [{"author": "Stand_kicker", "id": "h7pit5x", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "oxlmhv", "stickied": false, "body": "It is not just America. It is the fact. You can look at what's happening in Germany and the UK. People have kids because the state gives them money to take care of the children. Enough money where you don't have to work.\n\nIn Germany, you get enough money from the government (and subsidized housing, not sure about this) where people don't need to work and they don't. They refuse to work.\n\nThe reason a lot of people don't go to universities and pursue higher education in Germany is because a trade school graduate earns almost at much as a graduate at the start. They also spend lesser time studying. Education is almost free in Germany. Surplus of trade school graduates. Not enough people to innovate.\n\nI don't need to talk about America. It is there for the world to see. No one's wants to put in any effort. They feel entitled for no reason.  They want higher wages despite there being higher supply than demand for minimum wage workers. The free money means they don't have to work. Unemployment benefits means they don't ever have to work. People don't want to put in the effort even when they get a job. They'd much rather slack off or get high (bit of an exaggeration but needed to drive home the point).\n\nPeople are lazy by nature. It is just the facts.\n\nMedia, generally, favors or writes in favor of the poor or underdog. Western media reporting on third world countries is ludicrous. What is reported and reality or the opinion of the masses are totally different.\n\nMedia echoes the sentiments of a small vocal population. The plight of the common person who doesn't have time or energy to be vocal is ignored.\n\nMedia echoes these sentiments because it has to give its readers what they want to read. Tell them what they want to hear. That's why Fox News reports what it does. The same applies to most media.\n\nPeople, in turn, echo what media has to say so they can feel accepted, feel like they belong, and don't alienate anyone. They say these things or agree with these sentiment to feel like they are contributing positively to society and feel better about themselves.\n\nPeople are lazy by nature. They will also do pretty much anything to feel better about themselves.\n\nMaybe your 6 years of work has skewed your views. Your opinions are biased.", "is_submitter": false, "distinguished": null, "created_utc": 1628102089.0, "parent_id": "t1_h7pd8sd", "replies": [{"author": "StopBanningMeGDIT", "id": "h7plhj6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "oxlmhv", "stickied": false, "body": "I don't think you understand what a fact is. You're literally stating your belief as a fact and offering no outside sources of information on why what you believe is established fact. Calling Germans as a whole lazy is evidence of your biases and ignorance as evidenced by a very low rate of unemployment (https://tradingeconomics.com/germany/unemployment-rate). Germany actually has very high quality of life (https://www.google.com/amp/s/www.euronews.com/travel/amp/2021/03/25/revealed-these-are-the-top-10-happiest-countries-in-the-world-in-2021) and it has a significant amount of social programs. \n\nAnd media is literally owned by billionares (https://www.google.com/amp/s/www.forbes.com/sites/katevinton/2016/06/01/these-15-billionaires-own-americas-news-media-companies/amp/) and mainly functions as a way to get revenue, but journalism has integrity (even Fox) when they aren't presenting opinion pieces. The media and wealthy class have long perpetuated the poor as lazy (https://www.jstor.org/stable/3078840 paywall) as a way to dehumanize in order to exploit. \n\nPresenting your opinion and long-held beliefs as fact don't make it so.", "is_submitter": false, "distinguished": null, "created_utc": 1628103206.0, "parent_id": "t1_h7pit5x", "replies": [{"author": "Stand_kicker", "id": "h7pnuw9", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "oxlmhv", "stickied": false, "body": "Like I said, what's reported and reality are different.\n\nI didn't say Germany didn't have a high quality of life. It does however have a lot of young people who don't want to work. And that's the problem and will be a bigger problem in the future.\n\nWhen the purpose of media is to generate revenue, it makes sense for them to play to their readers, doesn't it? Tell them what they want to hear.\n\nPresenting your opinion and long-held beliefs as fact don't make it so.", "is_submitter": false, "distinguished": null, "created_utc": 1628104197.0, "parent_id": "t1_h7plhj6", "replies": [{"author": "smbell", "id": "h7pv35x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #158", "submission": "oxlmhv", "stickied": false, "body": "> Presenting your opinion and long-held beliefs as fact don't make it so.\n\nPhysician heal thyself!! lol", "is_submitter": false, "distinguished": null, "created_utc": 1628107254.0, "parent_id": "t1_h7pnuw9", "replies": []}, {"author": "StopBanningMeGDIT", "id": "h7pvhry", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "oxlmhv", "stickied": false, "body": "All I can see when I read your replies is Michael Scott yelling \"I DECLARE BANKRUPTCY\" because you're just saying these things without actually offering countering evidence other than trust me bro everyone is corrupt but me.", "is_submitter": false, "distinguished": null, "created_utc": 1628107432.0, "parent_id": "t1_h7pnuw9", "replies": [{"author": "Stand_kicker", "id": "h7py6ef", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "oxlmhv", "stickied": false, "body": "I'm not say everyone but me is corrupt. You are inferring that.\n\nYou want evidence. Figure out a way to be born and grow up in each country as a lower middle class person.", "is_submitter": false, "distinguished": null, "created_utc": 1628108556.0, "parent_id": "t1_h7pvhry", "replies": []}]}]}]}]}, {"author": "R5Cats", "id": "h7u4lze", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "NPR has finished its long slide to the hard left. It is now \"all in\" for Democrats and \"socialism\" (GND, SJW, BLM & etc). Individual reports must be judged on their merits, one cannot trust anything the NPR says any longer, they're a taxpayer-funded NYT now.", "is_submitter": false, "distinguished": null, "created_utc": 1628187101.0, "parent_id": "t1_h7pd8sd", "replies": [{"author": "StopBanningMeGDIT", "id": "h7u6bfa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "oxlmhv", "stickied": false, "body": "What have they lied about?", "is_submitter": false, "distinguished": null, "created_utc": 1628187786.0, "parent_id": "t1_h7u4lze", "replies": [{"author": "R5Cats", "id": "h7u7267", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "Everything for the past 10 years? Just about.  \nThere's still some actual (unbiased) journalism going on, but that will be weeded out shortly.  \nIt's not about \"do I agree or not\" it's about spreading Fake News exactly like CNN and the rest. The 'mistakes' in truth and accuracy always favor one side: Democrats.  \nFox News is gone as well.", "is_submitter": false, "distinguished": null, "created_utc": 1628188085.0, "parent_id": "t1_h7u6bfa", "replies": [{"author": "StopBanningMeGDIT", "id": "h7u8nx3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "oxlmhv", "stickied": false, "body": "I can tell you listen to them and read them a lot by your personal opinion you claim as fact. Fact is they have a bias that caters to the people that listen to them, and that their standard of journalism is world-renown. Every major institution rates them as credible around the world. \n\nIf you claim they spread fake news withput providing specific evidence of such, that's literally just your opinion. And it's an opinion just founded on ignorance. \n\nThe truth is that the far right has been claiming that everything left of them is fake news (lugenpresse) for the last decade without actually providing evidence and the platform of the right has shifted so far right that they think anything from right of center on is fake news, communist, whatever platitudes you all hate.", "is_submitter": false, "distinguished": null, "created_utc": 1628188727.0, "parent_id": "t1_h7u7267", "replies": [{"author": "R5Cats", "id": "h7ub7pg", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "> Every major MAINSTREAM MEDIA institution rates them as credible around the world.\n\nFify.\n\nI'm not sifting through thousands of headlines over the past 10 years to find the fake crap *for your lazy ass*. It's my OPINION. Deal with it.  \nADDED: You won't like them, and probably won't even glance at the content, but:  \n[One](https://lies.news/2020-05-11-pbs-and-npr-ultimate-fake-news-duo.html)  \n[Two](https://redstate.com/sister-toldjah/2020/06/22/defundnpr-trends-after-npr-caught-spreading-fake-news-about-louisville-incident-involving-car-and-protesters-n244151)", "is_submitter": false, "distinguished": null, "created_utc": 1628189745.0, "parent_id": "t1_h7u8nx3", "replies": []}]}]}]}]}]}]}]}, {"author": "R5Cats", "id": "h7u42or", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "Capitalism: people are all so greedy they'll destroy anything to make a buck.  \nCommunism: people are so kind and generous they'll work tirelessly for the good of the proletariat! \n\nIt's really a mix of both of course, but IDK how socialists (and others, like Anarchists) can believe both things are absolutely true at the same time.", "is_submitter": false, "distinguished": null, "created_utc": 1628186885.0, "parent_id": "t1_h7nf1mi", "replies": []}]}]}, {"author": "Traditional_Meat1299", "id": "h7na6ah", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seer", "submission": "oxlmhv", "stickied": false, "body": "I agree with this thought. I think most forms of government are shitty.", "is_submitter": false, "distinguished": null, "created_utc": 1628055812.0, "parent_id": "t3_oxlmhv", "replies": []}, {"author": "pine_ary", "id": "h7nxjrn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "oxlmhv", "stickied": false, "body": "Communist government is an oxymoron.", "is_submitter": false, "distinguished": null, "created_utc": 1628075533.0, "parent_id": "t3_oxlmhv", "replies": [{"author": "FalconRelevant", "id": "h7o4dly", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oxlmhv", "stickied": false, "body": "The eventual goal of communism is a stateless society, not how they actually are when they exist.", "is_submitter": true, "distinguished": null, "created_utc": 1628080020.0, "parent_id": "t1_h7nxjrn", "replies": [{"author": "IsNowReallyTheTime", "id": "h7qcsq4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #220", "submission": "oxlmhv", "stickied": false, "body": "Some of the like super ancient tribes in Israel/Palestine/Lebanon area where actual pure communal entities. \nI wish I’d had time to do more research into it, but I ran out of time doing the stuff I actually focus on so I didn’t go much farther.", "is_submitter": false, "distinguished": null, "created_utc": 1628114848.0, "parent_id": "t1_h7o4dly", "replies": []}, {"author": "pine_ary", "id": "h7o4hao", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "oxlmhv", "stickied": false, "body": "No. The eventual goal of marxian socialism is communism. Communism is the goal and is always stateless.", "is_submitter": false, "distinguished": null, "created_utc": 1628080080.0, "parent_id": "t1_h7o4dly", "replies": [{"author": "R5Cats", "id": "h7u4v22", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "You'd be better off wishing for the Moon on a plate: it's more likely to happen. 🙁", "is_submitter": false, "distinguished": null, "created_utc": 1628187202.0, "parent_id": "t1_h7o4hao", "replies": [{"author": "pine_ary", "id": "h7u59zj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "oxlmhv", "stickied": false, "body": "What else is there to do, but to do your best and hope? Things always seem impossible, until they happen.", "is_submitter": false, "distinguished": null, "created_utc": 1628187370.0, "parent_id": "t1_h7u4v22", "replies": [{"author": "R5Cats", "id": "h7u79gh", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oxlmhv", "stickied": false, "body": "Try to support something that might actually work, even if it only works at 50%? That's better than 0%.", "is_submitter": false, "distinguished": null, "created_utc": 1628188165.0, "parent_id": "t1_h7u59zj", "replies": []}]}]}]}]}]}, {"author": "SCP-5156", "id": "h7pavnd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #30", "submission": "oxlmhv", "stickied": false, "body": "No just no", "is_submitter": false, "distinguished": null, "created_utc": 1628098795.0, "parent_id": "t3_oxlmhv", "replies": [{"author": "FalconRelevant", "id": "h7rmy1n", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oxlmhv", "stickied": false, "body": "Such succinct genius.", "is_submitter": true, "distinguished": null, "created_utc": 1628137533.0, "parent_id": "t1_h7pavnd", "replies": []}, {"author": "zephyrsong888", "id": "h7sbivt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #140", "submission": "oxlmhv", "stickied": false, "body": "Tbh, the thing killing me this week has been the increase in libertarian ideology crap.", "is_submitter": false, "distinguished": null, "created_utc": 1628156195.0, "parent_id": "t1_h7pavnd", "replies": []}]}, {"author": "zoharel", "id": "h7nneen", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "oxlmhv", "stickied": false, "body": "Well, most every nominally communist government is actually a totalitarian socialist government, and all totalitarianism is basically the same.", "is_submitter": false, "distinguished": null, "created_utc": 1628066960.0, "parent_id": "t3_oxlmhv", "replies": []}, {"author": "BuccaneerRex", "id": "h7omujm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "oxlmhv", "stickied": false, "body": "The problem isn't with the structure of the authority. The problem is with the components of authority.\n\nAll governments, regardless of ideology, are made out of the worst possible material: a bunch of fucking monkeys who for the most part have to be taught how not to throw shit at people.", "is_submitter": false, "distinguished": null, "created_utc": 1628088927.0, "parent_id": "t3_oxlmhv", "replies": []}, {"author": "gabrielesilinic", "id": "h7onsnq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #59", "submission": "oxlmhv", "stickied": false, "body": "Yesn't\n\nIt depends how mega the corp is and also the corp usually wants money in order to make you buy their stuff", "is_submitter": false, "distinguished": null, "created_utc": 1628089331.0, "parent_id": "t3_oxlmhv", "replies": []}, {"author": "DELETED", "id": "h7qo1am", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "oxlmhv", "stickied": false, "body": "Reject industrial society return to monke", "is_submitter": false, "distinguished": null, "created_utc": 1628120027.0, "parent_id": "t3_oxlmhv", "replies": []}, {"author": "Arisdoodlesaurus", "id": "h7rk38x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #102", "submission": "oxlmhv", "stickied": false, "body": "Well just take a look at how Romania functioned under corporatist rule and communist rule", "is_submitter": false, "distinguished": null, "created_utc": 1628135869.0, "parent_id": "t3_oxlmhv", "replies": []}]}