{"title": "Why can't we get more nuclear power?", "name": "t3_pido2h", "url": "https://i.redd.it/kr1qbqbwanl71.png", "selftext": "", "score": 17, "upvote_ratio": 0.92, "permalink": "/r/TheFlyingTree/comments/pido2h/why_cant_we_get_more_nuclear_power/", "id": "pido2h", "author": "FalconRelevant", "link_flair_text": null, "num_comments": 21, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630850652.0, "comments": [{"author": "PBlague", "id": "hbp04u7", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "pido2h", "stickied": false, "body": "As always it's because of the wrong public perception... they don't understand what statistics mean and how they are used and the media always is like gasoline on the fire; that is the uneducated people...\n\nKurgesagt made a great video about this: [https://youtu.be/EhAemz1v7dQ](https://youtu.be/EhAemz1v7dQ)\n\nI love nuclear power especially thorium nuclear reactors because they are just so good in every aspect, I just don't have the knowledge to know why exactly they don't actually use it.", "is_submitter": false, "distinguished": null, "created_utc": 1630854516.0, "parent_id": "t3_pido2h", "replies": [{"author": "Koksny", "id": "hbpgjd3", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #641", "submission": "pido2h", "stickied": false, "body": ">I just don't have the knowledge to know why exactly they don't actually use it.\n\nBecause setting up new plant takes 15 - 25 years and billions of dollars, while dropping some solar panels on ground and wiring them up is now an common industry job. Sure, it's clean and much more efficient, but there is hardly \"global market\" for it, and solving any part of energy deficit by 2050 isn't very helpful in 2021. \n\nAlso it's simply risky investment. If i put half a billion dollars now into molten salt plant, it'll be operational in 5 years and pay itself in next 10. Setting up a bunch of reactors and hoping no new breakthrough technology will render them non-competitive in next 50 years might no be worth it, so the big money avoids it. It really isn't political issue (unless we want to subsidy the new plants).", "is_submitter": false, "distinguished": null, "created_utc": 1630861776.0, "parent_id": "t1_hbp04u7", "replies": [{"author": "_RedditMan69", "id": "hbq8ssq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #446", "submission": "pido2h", "stickied": false, "body": "Well there are SMRs , but unfortunately they're still a concept.", "is_submitter": false, "distinguished": null, "created_utc": 1630874362.0, "parent_id": "t1_hbpgjd3", "replies": []}, {"author": "PBlague", "id": "hbsc2cb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "pido2h", "stickied": false, "body": "Yes, that is true now that I think about it. As always things happen because \"MONEY\".\n\nThanks for explaining it to me :)", "is_submitter": false, "distinguished": null, "created_utc": 1630915931.0, "parent_id": "t1_hbpgjd3", "replies": []}]}]}, {"author": "Cognizant_Psyche", "id": "hbpd48h", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pido2h", "stickied": false, "body": "Think Mark, solar power is just diluted nuclear power with extra steps in the way to make it usable!", "is_submitter": false, "distinguished": null, "created_utc": 1630860262.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "Concrete_Grapes", "id": "hbq5qul", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pido2h", "stickied": false, "body": "The #1 reason why, is without a doubt, it's not profitable.   \n\n\nThat's it.   \n\n\nThe ONLY way it turns a profit is with MASSIVE government handouts to get it started. Those handouts come with regulations to make sure that they're not stuck with the tens of billions of dollars of maintenance and cleanup.   \n\n\nIn fact, all the people whining about government regulations being in the way, are ALSO the same people that claim because of those regulations nuclear is 'super safe.' The entire time they're screaming both of those, they forget that the largest superfund site in the US is, in fact, a nuclear site in the US--Hanford, Washington will take a TRILLION dollars to clean up--all paid for by tax payers, all of it the result of LEARNING how to make this nuclear thing happen in a clean way.   \n\n\nBut the cost--it will take 10-15 years to build the plant, and another 25-30 before it turns a SINGLE PENNY of profit, so 40-45 years.   \n\n\nDo you know any billionaires that invest (and it has to be billionaires), who wont see a single penny of profit on their investment in their lifetime? No. No one does. That's why no one's doing Nuclear. That's why the government doesn't do it either, they would have a hell of a time trying to tell people that, for the next 50 years you have to pay high taxes and high electric prices so that they could get a Nuclear power plant online, so that in 50 years they could MAYBE reduce the electric rates to be cheaper (spoiler, they're not cheaper--they've got to plan and pay for and maintain the storage of their waste for the next million years).   \n\n\nThis is before we get to the problem that NO ONE has agreed to, or found a way to store or dispose the waste these monsters create. This isnt simply 'toxic' waste, like Coal plants, that you can sort of get around or clean up after a few decades. This is the sort of waste that will render hundreds of square miles at a time totally uninhabitable for humans for a thousand generations.   \n\n\nand that's assuming EVERYTHING WORKS AS INTENDED.   \n\n\nWhen it's vastly cheaper, and vastly more profitable to use wind or solar, why would you ever even consider nuclear?  \n\n\nIt's not unreasonable to look at this like buying cars. Nuclear is a nice ass fucking 1959 Chevy impala convertible. Chrome, goddamned beautiful, rides like a dream, has everything you want--AC, electric seats, heated mirrors, gorgeous paint--it's 55k. Every time it drips, you stop EVERYTHING and fix it, no matter the cost, or you cant drive it to shows or use it. OR--you could just buy a toyota corolla (solar/wind), it's cheap, it works, it costs less in gas (so you dont have to pick up a second job to afford to drive it to the first), and you dont have to worry if it gets a few dings and dents, or has a few spills.   \n\n\nSure, the corolla's not getting handed to your grandson, like the Impala, but the Corolla saved you so much money, and kept the air so much cleaner, that your grandson can have a fucking ferrari anyway.", "is_submitter": false, "distinguished": null, "created_utc": 1630872987.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "NoSuchKotH", "id": "hbouk24", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pido2h", "stickied": false, "body": "Because nuclear has become the new bogeyman.", "is_submitter": false, "distinguished": null, "created_utc": 1630852017.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "Weak_Astronomer2107", "id": "hbpfkqm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #569", "submission": "pido2h", "stickied": false, "body": "People are afraid of it. They don’t realize that 1 kg of an enriched source can power a city for years and then the byproduct used for tons of other useful applications. \nMost just think of bombs or radiation sickness leading to baby arms growing out of your face or something.", "is_submitter": false, "distinguished": null, "created_utc": 1630861349.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "SWCesq", "id": "hbpzf1i", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #311", "submission": "pido2h", "stickied": false, "body": "You need water for nuclear power..  There's no water in the dessert and no one is living there its just empty space no one wants. Why not put solar cells there...", "is_submitter": false, "distinguished": null, "created_utc": 1630870188.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "LT125", "id": "hbpwopb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #210", "submission": "pido2h", "stickied": false, "body": "Because people pretend they know everything about stuff they don’t understand. They’re just afraid of the unknown - a big part of the public that is.", "is_submitter": false, "distinguished": null, "created_utc": 1630868974.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "NepoMi", "id": "hbqcd68", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #170", "submission": "pido2h", "stickied": false, "body": "Because some \"people\" are afraid of it.\n\nThe only true problem with nuclear powerplants is the nuclear waste. Even though we have ways to process it, and it is more than useful, a lot of it still ends up in storages.\nI mean, I live in the Czech Republic (cca 10,7 mil people) and we have 2 nuclear powerplants, but not even that is enough. You'd still need quite a few of them, but the benefits would still be bigger than the disadvantages.\n\nThere is also research on mini nuclear reactors. Ones that could fit inside just 3-4 shipping containers, and it would supply up to 25000 people (I think that was the number, I might be wrong). Super efficient, quite cheap, easy to maintain, and super small.", "is_submitter": false, "distinguished": null, "created_utc": 1630875980.0, "parent_id": "t3_pido2h", "replies": [{"author": "Stfudeal", "id": "hbqiaas", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #114", "submission": "pido2h", "stickied": false, "body": "yes, SMRs small modular reactors.", "is_submitter": false, "distinguished": null, "created_utc": 1630878731.0, "parent_id": "t1_hbqcd68", "replies": [{"author": "NepoMi", "id": "hbqli6k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #170", "submission": "pido2h", "stickied": false, "body": "Thank you. I would've put a link to the project, but I am at work, so I can't really look into the phone that much. Now everybody can just look it up.", "is_submitter": false, "distinguished": null, "created_utc": 1630880273.0, "parent_id": "t1_hbqiaas", "replies": []}]}]}, {"author": "ObserverOfVoid", "id": "hbqi3rh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #416", "submission": "pido2h", "stickied": false, "body": "| Series | Episode | Time |\n| :- | :-: | :-: |\n| Invincible | 8 | 7:58 |", "is_submitter": false, "distinguished": null, "created_utc": 1630878647.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "floofandmemes", "id": "hbr9sjm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "pido2h", "stickied": false, "body": "Because the carbon fuel industry slandered it into oblivion and nobody is allowed to compete on power, not that it would be feasible if they could. To make matters worse there's a lot of premature nuclear plants closures thanks to carbon fuel lobbies and idiots who don't know they're safe.", "is_submitter": false, "distinguished": null, "created_utc": 1630892226.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "pine_ary", "id": "hbpyt6o", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "pido2h", "stickied": false, "body": "Where do you wanna store the garbage? And how is the company running it gonna pay for 100000s of years of storage? These things are barely profitable in comparison to other energy sources. They need constant maintenance, are hella expensive, and tax payers will pay for the cleanup and take all the risks (both in storage and operation). \n\nThere‘s a reason energy companies push nuclear energy propaganda so much. Because they can apply tremendous pressure on the government to give them handouts basically forever.\n\nAs an example, take Germany. We‘ve tried for decades to find a safe storage facility. By now the costs of looking for a safe way to store the waste has overtaken the costs it would have taken to build suitable renewable energy facilities + infrastructure for transport and storage. And we‘ve had dangerous spills, corruption, many many millions paid to private corporations who take 0 responsibility for the waste they produced. \n\nAnd the waste isn‘t just the fuel itself. It‘s all the equipment that is contaminated, everything that had to be replaced, etc.\n\nIf you factor in _all_ the costs, nuclear is way too expensive on top of being unsafe (either natural disaster strikes or you mess up the complicated maintenance process).", "is_submitter": false, "distinguished": null, "created_utc": 1630869919.0, "parent_id": "t3_pido2h", "replies": [{"author": "RiderHood", "id": "hbrkijs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "pido2h", "stickied": false, "body": "New technologies exist that require significantly less nuclear fuel, and even ones that use the already existing waste from our current nuclear power plants.", "is_submitter": false, "distinguished": null, "created_utc": 1630897613.0, "parent_id": "t1_hbpyt6o", "replies": [{"author": "pine_ary", "id": "hbscois", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "pido2h", "stickied": false, "body": "Fuel waste. But if you read my post instead of regurgitating talking points you‘d know that the majority of waste is not from fuel.", "is_submitter": false, "distinguished": null, "created_utc": 1630916463.0, "parent_id": "t1_hbrkijs", "replies": []}]}]}, {"author": "FreeBiskit", "id": "hbplb8h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "pido2h", "stickied": false, "body": "It’s solar or nothing. Don’t you know humans are incapable of nuanced thinking? \n\nNuclear bad, sunlight happy ~20 year old redditor who is very concerned about our Earth but hasn’t left home yet.\n\nEven if we could prove nuclear power to the public, you’d have a bunch of radical/clueless environmentalists complaining about fuel rods or some shit and how their solar panels powered their refrigerator all last year.", "is_submitter": false, "distinguished": null, "created_utc": 1630863883.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "SuperfluousApathy", "id": "hbpoxdq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #492", "submission": "pido2h", "stickied": false, "body": "Everybody here saying public option. Which is right. But why? Well. Look at big oil. They pushed the narrative, greased the pockets of journalists, and the media. Just like everything else follow the money.", "is_submitter": false, "distinguished": null, "created_utc": 1630865477.0, "parent_id": "t3_pido2h", "replies": []}, {"author": "rafael54321r", "id": "hbt84eu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #611", "submission": "pido2h", "stickied": false, "body": "Fission, hydroelectric, solar and eoilic are all heroes.", "is_submitter": false, "distinguished": null, "created_utc": 1630938360.0, "parent_id": "t3_pido2h", "replies": []}]}