{"title": "Taxation: how should the government acquire funds?", "name": "t3_or92g1", "url": "https://www.reddit.com/r/TheFlyingTree/comments/or92g1/taxation_how_should_the_government_acquire_funds/", "selftext": "Individuals should not be taxed on their income or the properties they hold, the second one especially I find to be outrageous theft.\n\nJust increase VAT and taxes on big businesses.", "score": 0, "upvote_ratio": 0.4, "permalink": "/r/TheFlyingTree/comments/or92g1/taxation_how_should_the_government_acquire_funds/", "id": "or92g1", "author": "FalconRelevant", "link_flair_text": "Discussion", "num_comments": 107, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1627208265.0, "comments": [{"author": "NoSuchKotH", "id": "h6gltvn", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "or92g1", "stickied": false, "body": "Why should individuals not be taxed on their income or their property? Why do you think it's theft? Why do you think VAT is better? On what basis do you want to tax businesses? What makes a business big?", "is_submitter": false, "distinguished": null, "created_utc": 1627208740.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6gmikn", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "It's criminal behavior to charge money for something one fully owns, what if someone's income dries up? They have no choice other than selling their longtime home because they can't pay the \"tax\". How is that different than living on rent on a property you are supposed to own? This is outrageous thug like behavior.\n\nVAT is better than income tax because you pay more the more you spend, and takes off responsibility from the shoulders to ordinary people to have to manage their taxes.\n\nBig businesses have the capability to manage and pay taxes, and the government needs money from somewhere. We can categorize businesses based on their profits.", "is_submitter": true, "distinguished": null, "created_utc": 1627209388.0, "parent_id": "t1_h6gltvn", "replies": [{"author": "Kweldulf", "id": "h6gughu", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "or92g1", "stickied": false, "body": "> Takes of the responsibility from the shoulders to ordinary people to have to manage their taxes.\n\nYeah that's not a tax problem, that's America-specific, IRS stupid problem. In Europe your income tax is deducted from your paycheck by your employer, and you are given a slip saying that the tax was properly paid. If you have multiple jobs you submit multiple slips to the tax authority, but other than that you do nothing. If as a result of this you earned less than tax-free treshhold you'll get your money back from the tax authority. It takes five minutes and requires almost no thought.\n\nThe fact that in America something is done in a stupid way does not mean that the thing itself is stupid.", "is_submitter": false, "distinguished": null, "created_utc": 1627216089.0, "parent_id": "t1_h6gmikn", "replies": []}, {"author": "s1gnalZer0", "id": "h6h7ssb", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": ">Big businesses\n\nWhere do you draw the line?\n\n>VAT is better than income tax because you pay more the more you spend\n\nTransaction taxes like VAT or sales tax are far more regressive and have a much higher impact on low income people.", "is_submitter": false, "distinguished": null, "created_utc": 1627224134.0, "parent_id": "t1_h6gmikn", "replies": []}, {"author": "NoSuchKotH", "id": "h6gr14y", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "or92g1", "stickied": false, "body": "But cost should be paid by those who cause it. If your property is creating cost by its very existence, then it is only fair that you pay for that.\n\nIncreasing VAT enough such that other forms of taxes could be abolished is difficult. Not because it would cause people to spend less, but rather because people would look at other countries, see they are paying less and demand the same, completely ignoring that it balances out. Additionally, the rich people could afford to buy things elsewhere, without the VAT and thus legally stop paying tax.... But then, when have the rich paid their taxes in the first place.", "is_submitter": false, "distinguished": null, "created_utc": 1627213432.0, "parent_id": "t1_h6gmikn", "replies": [{"author": "FalconRelevant", "id": "h6grklc", "score": -4, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "If it is creating cost by it's very existence? Then maybe we should harvest the organs of everyone who isn't contributing enough, if you insist that the government act like thugs.", "is_submitter": true, "distinguished": null, "created_utc": 1627213871.0, "parent_id": "t1_h6gr14y", "replies": [{"author": "NoSuchKotH", "id": "h6gv4ii", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "or92g1", "stickied": false, "body": "If you own a house, you need a road, a sewer system, utilities, etc. All these are cost. Even if the house is empty and you don't need those, they will still create cost. That money has to come from somewhere.\n\nI don't see how you made the mental jump from taxes to cover cost to harvesting humans, but this is not the level of discussion I got used to here and came to like.", "is_submitter": false, "distinguished": null, "created_utc": 1627216564.0, "parent_id": "t1_h6grklc", "replies": [{"author": "FalconRelevant", "id": "h6gvboc", "score": -5, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Again, I'm talking about thug like behavior by the government. Property tax is just like the \"protection money\" goons go around taking from people in less developed nations.", "is_submitter": true, "distinguished": null, "created_utc": 1627216705.0, "parent_id": "t1_h6gv4ii", "replies": [{"author": "NoSuchKotH", "id": "h6gwhma", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "or92g1", "stickied": false, "body": "How is it protection money? Is there someone, knocking at your door, telling you to pay up or they'll shoot your wife and children? And once you are successful, the amount you pay increases beyond proportion until you bleed dry?\n\nBefore you buy property, you know what amount of money you will pay and you can decide whether it's worth it or not. You can always just rent or move somewhere where you don't have to pay property taxes.", "is_submitter": false, "distinguished": null, "created_utc": 1627217503.0, "parent_id": "t1_h6gvboc", "replies": [{"author": "FalconRelevant", "id": "h6gx4ua", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "A house isn't something that you just use and throw away, it is something you make your home in, spend decades inside. Out of nowhere the property price rises and you have to pay up or risk losing the house you were born and raised in. If this isn't what thugs do then what is?", "is_submitter": true, "distinguished": null, "created_utc": 1627217934.0, "parent_id": "t1_h6gwhma", "replies": [{"author": "NoSuchKotH", "id": "h6gy37p", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "or92g1", "stickied": false, "body": ">Out of nowhere the property price rises\n\nThis seems to be a very US problem. I've not heard that happening in any of the countries I lived in sofar. Property taxes, if they exist, are always tied to the worth of the property, which gradually decreases with age. The only way to increase property tax is to increase the value of the property, by either renovating it or extending the building.", "is_submitter": false, "distinguished": null, "created_utc": 1627218553.0, "parent_id": "t1_h6gx4ua", "replies": [{"author": "SleepySuper", "id": "h6j110c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #188", "submission": "or92g1", "stickied": false, "body": "Property value tends to increase over time in countries with stable economies, not the other way around.  That is one reason why people invest in real estate.", "is_submitter": false, "distinguished": null, "created_utc": 1627256477.0, "parent_id": "t1_h6gy37p", "replies": []}]}]}]}]}]}]}]}, {"author": "Walking_the_Cascades", "id": "h6hersd", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #68", "submission": "or92g1", "stickied": false, "body": ">VAT is better than income tax because you pay more the more you spend,\n\nThis is problematic for a low income family that lives paycheck to paycheck, spending 100% of their income on food and other necessities, and it is a boon to the ultra-rich who spend maybe 0.000002 percent of their income on necessities. More than 99% of the tax burden is shifted to the poor.", "is_submitter": false, "distinguished": null, "created_utc": 1627227732.0, "parent_id": "t1_h6gmikn", "replies": [{"author": "FalconRelevant", "id": "h6hgalb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Then just increase VAT on luxuries and reduce it on basic necessities.", "is_submitter": true, "distinguished": null, "created_utc": 1627228490.0, "parent_id": "t1_h6hersd", "replies": [{"author": "s1gnalZer0", "id": "h6hhc2t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "What do you consider a luxury vs a basic necessity?\n\nLook at clothing: if I'm low income and can only afford to get my clothes at a thrift store, it would be a luxury to go to a proper clothing store to get something. If I am middle income, I probably get most of my clothes at a department store, but it would be a luxury to get something nice to wear for a special occasion. Where do you draw the line on what's luxury clothing vs basic necessity?\n\nTransportation is another hard one to define. If I live in New York City, a bike would be enough for most people and a car would be a luxury. If I live on a farm in the middle of nowhere, a car is a necessity. How would you apply luxury tax in this situation?", "is_submitter": false, "distinguished": null, "created_utc": 1627228994.0, "parent_id": "t1_h6hgalb", "replies": [{"author": "FalconRelevant", "id": "h6hhly0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Cheap cars vs expensive cars. Cheap food vs expensive food. Cheap clothes vs expensive clothes.", "is_submitter": true, "distinguished": null, "created_utc": 1627229123.0, "parent_id": "t1_h6hhc2t", "replies": [{"author": "s1gnalZer0", "id": "h6hiifh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "Cheap is relative. What do you consider cheap? Based on your post about a one world government, goods that would be considered cheap in places like The United States or Europe would be prohibitively expensive in places like Indiaor Africa.", "is_submitter": false, "distinguished": null, "created_utc": 1627229560.0, "parent_id": "t1_h6hhly0", "replies": [{"author": "FalconRelevant", "id": "h6hjdcx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "In a one world government goods would be cheaper and the price more consistent because of lack of import/export duties and world trade politics.", "is_submitter": true, "distinguished": null, "created_utc": 1627229978.0, "parent_id": "t1_h6hiifh", "replies": [{"author": "hydrospanner", "id": "h6l4fzo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #46", "submission": "or92g1", "stickied": false, "body": "That's one possibility.\n\nAnother possibility is that in a one world government, goods wouldn't be any cheaper, and the money saved by these companies in not having to pay duties would simply go into their pockets rather than passing those savings on to the customer.\n\nIn fact we see similar tactics used now.\n\nThis also gets to a larger issue with your tax scheme as well: shifting the entire tax burden into a combination of a usage tax and a corporate tax means that consumers on the low end, living paycheck to paycheck will be hit hardest. Both by having 100% of their income taxed at this higher rate (while wealthier people will be able to save more of their larger income, avoiding taxes on it) *and* because increased costs of these corporate taxes are likely to be passed on to their consumers in the form of higher prices, meaning the consumer gets to pay those taxes too, albeit indirectly.\n\nTax policy is a complicated business and I'm not saying I completely disagree with your thoughts. I do feel the current system is broken, but if I were in charge, before taking such extreme measures as you suggest, my first steps would be to add several brackets to the top of the current code, create/expand taxes on profits from financial investments above a certain threshold, and revamp the corporate tax system to be better targeted and designed to keep American dollars in America though a tax based on revenue vs labor, where the tax was based primarily on how much business you do with American consumers, but with breaks and incentives based on how many jobs you create for Americans and how good those jobs are. This would be designed to make sure companies paid a fair tax to access the American market and labor pool, but would be rewarded for reinvesting in their American workforce.", "is_submitter": false, "distinguished": null, "created_utc": 1627307510.0, "parent_id": "t1_h6hjdcx", "replies": []}, {"author": "s1gnalZer0", "id": "h6hqwpb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "Has the European Union accomplished this between western and eastern Europe?", "is_submitter": false, "distinguished": null, "created_utc": 1627233613.0, "parent_id": "t1_h6hjdcx", "replies": [{"author": "FalconRelevant", "id": "h6hr6sm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Seems better than it was before.", "is_submitter": true, "distinguished": null, "created_utc": 1627233749.0, "parent_id": "t1_h6hqwpb", "replies": []}]}]}]}]}]}]}]}, {"author": "chocol8cek", "id": "h6gqzeo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #107 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "I agree! Especially about income tax. Why is it okay for the government to take someone's hard earned income? So many people don't get paid enough to match the cost of living of their city and on top of that they need to pay a portion of it to the government.", "is_submitter": false, "distinguished": null, "created_utc": 1627213392.0, "parent_id": "t1_h6gmikn", "replies": [{"author": "NoSuchKotH", "id": "h6gw1t3", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "or92g1", "stickied": false, "body": "That's why income tax is usually relative to income and, in all civilized countries, has a progression that taxes those with large income more than those with low income.", "is_submitter": false, "distinguished": null, "created_utc": 1627217208.0, "parent_id": "t1_h6gqzeo", "replies": []}]}, {"author": "s1gnalZer0", "id": "h6hek7c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "Is it criminal for me to have to pay to renew the registration on my car's license plate tabs every year? That's a perpetual tax on something I own as well.", "is_submitter": false, "distinguished": null, "created_utc": 1627227624.0, "parent_id": "t1_h6gmikn", "replies": [{"author": "FalconRelevant", "id": "h6hez15", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Yes, you shouldn't have to do that.", "is_submitter": true, "distinguished": null, "created_utc": 1627227833.0, "parent_id": "t1_h6hek7c", "replies": [{"author": "s1gnalZer0", "id": "h6hg7go", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "How do you propose paying for road construction and maintenance? Increase the gas tax? Increase income tax? Make \"big businesses\" pay for it?", "is_submitter": false, "distinguished": null, "created_utc": 1627228447.0, "parent_id": "t1_h6hez15", "replies": [{"author": "FalconRelevant", "id": "h6hghmx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Yes, you can increase the VAT on fuel, and new cars.", "is_submitter": true, "distinguished": null, "created_utc": 1627228584.0, "parent_id": "t1_h6hg7go", "replies": []}]}]}]}]}]}, {"author": "kubigjay", "id": "h6gqo1m", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #64", "submission": "or92g1", "stickied": false, "body": "The problem is that are taxes are complicated with the goal of taxing rich more than the poor.   Income tax doesn't affect someone making less than a certain threshold.  The rate is higher the income.  \n\nThe tax on possessions is interesting. Bill Gates has billions of dollars and doesn't need to take income.  His expenses are paid by corporate account that claim it as expenses to offset income.  So should he pay taxes?\n\nVAT is great but it places a higher burden on the poor.", "is_submitter": false, "distinguished": null, "created_utc": 1627213122.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "Chepi_ChepChep", "id": "h6gm1fz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "or92g1", "stickied": false, "body": "income and properties both are largely dependent on structures the state provides.\n\ntaxes are like a membership fee to have access to these commodity's. be they police, firefighters or healthcare, be they streets, administration, the rule of law, education you received or your children are receiving etc. pp.\n\nas such taxes on income and property are both very reasonable.\n\nhowever, the many ways of avoiding taxes, especially for the rich and corporations, should be closed and any form of organised tax dodging should be treated as organized crime with long prison sentences for everyone involved, not just some slap on the wrist.\n\nbut of course that wont happen, because its the 0.1% that would be subject to these laws.", "is_submitter": false, "distinguished": null, "created_utc": 1627208941.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6gmt79", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Even if you can make an argument for income tax, it is still criminal behavior to charge money for something one fully owns, what if someone's income dries up? They have no choice other than selling their longtime home because they can't pay the \"tax\". How is that different than living on rent on a property you are supposed to own? This is outrageous thug like behavior.", "is_submitter": true, "distinguished": null, "created_utc": 1627209664.0, "parent_id": "t1_h6gm1fz", "replies": [{"author": "YLASRO", "id": "h6gqwjx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "or92g1", "stickied": false, "body": "housing should be free to begin with. taxes shoudl be levied on other things like beeing rich, buying luxury goods etc. basic nessecitys should be granted as a human right", "is_submitter": false, "distinguished": null, "created_utc": 1627213324.0, "parent_id": "t1_h6gmt79", "replies": []}, {"author": "Chepi_ChepChep", "id": "h6grjac", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "or92g1", "stickied": false, "body": "again, its the payment for the services the state provides and, more importantly, is a tax aimed at the rich.\n\nand criminal behavior? why would it be? its the law. thats pretty much the opposite of criminal behvior", "is_submitter": false, "distinguished": null, "created_utc": 1627213841.0, "parent_id": "t1_h6gmt79", "replies": [{"author": "FalconRelevant", "id": "h6grpcn", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "So I see you say Nazis were no criminals, since they followed their nation's law.", "is_submitter": true, "distinguished": null, "created_utc": 1627213976.0, "parent_id": "t1_h6grjac", "replies": [{"author": "Chepi_ChepChep", "id": "h6gt2jy", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "or92g1", "stickied": false, "body": "nazis broke quite a lot of laws. \nand comparing \"i have to pay tax\" with \"lets do some genocide boys\"\n\nlike.. seriously?", "is_submitter": false, "distinguished": null, "created_utc": 1627215051.0, "parent_id": "t1_h6grpcn", "replies": [{"author": "FalconRelevant", "id": "h6gux1r", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "I see you are extremely proficient at dodging the point.", "is_submitter": true, "distinguished": null, "created_utc": 1627216421.0, "parent_id": "t1_h6gt2jy", "replies": [{"author": "Chepi_ChepChep", "id": "h6gv7zl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "or92g1", "stickied": false, "body": "the one who brings up nazis is the one that looses the conversation\n\ninternet rule number xyz", "is_submitter": false, "distinguished": null, "created_utc": 1627216632.0, "parent_id": "t1_h6gux1r", "replies": [{"author": "FalconRelevant", "id": "h6gvg92", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "They're a useful illustration when people imply that laws are inherently good.", "is_submitter": true, "distinguished": null, "created_utc": 1627216795.0, "parent_id": "t1_h6gv7zl", "replies": [{"author": "Chepi_ChepChep", "id": "h6gw88x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #71", "submission": "or92g1", "stickied": false, "body": "na. they are a good argument when you dont have any arguments :)", "is_submitter": false, "distinguished": null, "created_utc": 1627217328.0, "parent_id": "t1_h6gvg92", "replies": [{"author": "FalconRelevant", "id": "h6gwfqx", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Everything cannot be generalized by simple rules like that, even if it is true in general in this case it was a useful example.", "is_submitter": true, "distinguished": null, "created_utc": 1627217467.0, "parent_id": "t1_h6gw88x", "replies": []}]}]}]}]}]}, {"author": "milo-trujillo", "id": "h6h87ca", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #89", "submission": "or92g1", "stickied": false, "body": "I think this is mostly nitpicking terminology, but \"criminal\" generally implies \"law-breaking\", and frames what's allowed from the perspective of the state. The Nazis were monsters, but not because of which laws they broke. Taxes created by the government that are consistent with their legal framework can't possibly be criminal since that same government defines criminality, but they can certainly be immoral.", "is_submitter": false, "distinguished": null, "created_utc": 1627224347.0, "parent_id": "t1_h6grpcn", "replies": []}]}]}, {"author": "dogs_like_me", "id": "h6hf5q6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "or92g1", "stickied": false, "body": "If you are not making an income, you're non income doesn't get taxed. What are you talking about?", "is_submitter": false, "distinguished": null, "created_utc": 1627227926.0, "parent_id": "t1_h6gmt79", "replies": [{"author": "FalconRelevant", "id": "h6hg6ug", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "I'm talking about property tax, which you have to pay regardless of your income.", "is_submitter": true, "distinguished": null, "created_utc": 1627228439.0, "parent_id": "t1_h6hf5q6", "replies": []}]}]}]}, {"author": "Stand_kicker", "id": "h6glvpu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "or92g1", "stickied": false, "body": "Increase tax on big businesses. They move very out of the country. Now you are not getting tax money and have an unemployment problem. \n\nIncrease VAT is a decent idea. But, increasing VAT would mean more people would prefer to do business off the books and deal in cash. It could work if everything is digitized and was online.\n\nThe truth is most tax money (at least a lot) comes from individuals paying taxes.", "is_submitter": false, "distinguished": null, "created_utc": 1627208790.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6gm1tv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Another reason why we need one world government.", "is_submitter": true, "distinguished": null, "created_utc": 1627208951.0, "parent_id": "t1_h6glvpu", "replies": [{"author": "Stand_kicker", "id": "h6gmez7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "or92g1", "stickied": false, "body": "People are too diverse for that. Everyone not only wants to protect their culture, they also want to see it thrive and be the only culture.\n\nI don't want to give mine up. Everyday I see it dilute and get lost. It saddens me.", "is_submitter": false, "distinguished": null, "created_utc": 1627209294.0, "parent_id": "t1_h6gm1tv", "replies": [{"author": "FalconRelevant", "id": "h6gmmez", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "A nation can be multicultural.", "is_submitter": true, "distinguished": null, "created_utc": 1627209489.0, "parent_id": "t1_h6gmez7", "replies": []}, {"author": "NoSuchKotH", "id": "h6gq66i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "or92g1", "stickied": false, "body": ">People are too diverse for that\n\nNo, people think too much everyone is like themselves. Thus everyone should, naturally, come to the same conclusions. And everyone who doesn't is an idiot and wrong.\n\nDiversity is only the factor that makes this visible.", "is_submitter": false, "distinguished": null, "created_utc": 1627212708.0, "parent_id": "t1_h6gmez7", "replies": []}]}]}]}, {"author": "Kelyaan", "id": "h6helhc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "or92g1", "stickied": false, "body": "Yes they should but it should be a mutual thing which one can opt out of - You accept to pay these things in exchange for government services, if you want out then you don't get any of them. It's a fairly easy change.", "is_submitter": false, "distinguished": null, "created_utc": 1627227643.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6hewoi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "That is pretty stupid, and I'm talking about shifting taxes, not cancelling them.", "is_submitter": true, "distinguished": null, "created_utc": 1627227800.0, "parent_id": "t1_h6helhc", "replies": [{"author": "Kelyaan", "id": "h6hl1t6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "or92g1", "stickied": false, "body": "Then as always I say this - You're terrible at this, word it correctly so people know what the fuck your on about. Mention shifting taxes so it's not down to personal interpretation as to what you actually mean.", "is_submitter": false, "distinguished": null, "created_utc": 1627230792.0, "parent_id": "t1_h6hewoi", "replies": []}]}]}, {"author": "MisanthropicScott", "id": "h6hmafv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "or92g1", "stickied": false, "body": "I don't agree that taxation is theft. But, I understand the logic of taxing consumption. The problem is that it becomes a highly regressive tax.\n\nThose who have already amassed enormous wealth that is always subsidized through externalities such as government built roads, rails, airports, police to stop theft, etc., etc., etc., on the numerous services businesses receive from government should have some obligation to pay for the things from which they've benefited.\n\nConsumption taxes such as VAT do not affect them very much. It's not as if someone with a billion dollars buys a million times more pairs of pants than someone with a thousand dollars.\n\nIt may be good in theory to say that all of these externalities should have been paid for. But, they already weren't. We don't have a deep economic system where all costs are paid by the businesses that consume resources.\n\nSo, we do need to think about how to go forward from where we are instead of just saying that income is good and should not be taxed while consumption is bad and should be taxed. That's fine in theory. But, it's not going to help from where we are now.", "is_submitter": false, "distinguished": null, "created_utc": 1627231390.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "gmacc21", "id": "h6hra51", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "or92g1", "stickied": false, "body": "Have their own companies that compete against private ones perhaps. Would need some supplementation by taxing billionaires and other companies", "is_submitter": false, "distinguished": null, "created_utc": 1627233793.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "ItsJustAnAdFor", "id": "h6j4g9y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #73", "submission": "or92g1", "stickied": false, "body": "I’ve recently come to the conclusion that taxing income is a dis-incentive I’d prefer my govt to do away with. We want people to work. Why punish them other than out of pure spite because they’re poor and have no other choice?", "is_submitter": false, "distinguished": null, "created_utc": 1627258311.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "haz_mat_", "id": "h6jhzn1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "or92g1", "stickied": false, "body": "I totally agree. The system is pretty screwed up when a given dollar is taxed at least three times in a typical life cycle.\n\nSales tax is paid on the items my company distributes, corporate income tax is applied to our profits, and personal income tax is applied to employee salaries. Taxes are also applied on various other costs of doing business.\n\nSomething needs to change. The government keeps going further into debt and the wealth gap continues to grow. This kind of trend historically doesn't end well.", "is_submitter": false, "distinguished": null, "created_utc": 1627265655.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "dogs_like_me", "id": "h6hextd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "or92g1", "stickied": false, "body": "I completely disagree. Individuals absolutely should be taxed on their income and properties. It's not theft because we live in a society and the government provides us with services. Taxes on big businesses aren't effective because the businesses often find legal loopholes, e.g. incorporating in a different country with more lax tax laws. The companies effectively get taxed by imposing taxes on their employees income and benefits.", "is_submitter": false, "distinguished": null, "created_utc": 1627227816.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "Arisdoodlesaurus", "id": "h6grny2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #102", "submission": "or92g1", "stickied": false, "body": "Tax is not just a means for governments to gain funds. Tax is also a way to regulate money in a market and act as a means to reduce negative externalities like a social cost tax. The idea that tax on income(which cannot be gained without a stable government) and tax on private property(income you gain through exploitation) is theft, is false. Not to mention the idea that tax also acts or should act as a way to reduce inequality", "is_submitter": false, "distinguished": null, "created_utc": 1627213946.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6grrxy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "How is owning your own house exploitation?", "is_submitter": true, "distinguished": null, "created_utc": 1627214035.0, "parent_id": "t1_h6grny2", "replies": [{"author": "Arisdoodlesaurus", "id": "h6jvkeq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #102", "submission": "or92g1", "stickied": false, "body": "Not the fact that you own it but how private property is generated. This, of course, does not include personal property which is yours", "is_submitter": false, "distinguished": null, "created_utc": 1627273604.0, "parent_id": "t1_h6grrxy", "replies": []}]}]}, {"author": "Walking_the_Cascades", "id": "h6he2r5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #68", "submission": "or92g1", "stickied": false, "body": ">Individuals should not be taxed on their income ***or the properties they hold***\n\nEmphasis added.\n\nOP - Atheist or not, ***Pray with all your might this never happens.***\n\nYou will find out all too quickly why it is an instant disaster. Once a land owner has property they have no incentive to ever sell it. OP, do you want to buy a house someday? Sure, I'll sell you my house. ***But not the land on which it resides***. *THAT* you can only use if you pay me rent. Free money for me, and sucks to be you.\n\nNo one who owns land would ever have a reason to sell, as the land, once acquired, would be free to keep forever, passing it down generation to generation.", "is_submitter": false, "distinguished": null, "created_utc": 1627227379.0, "parent_id": "t3_or92g1", "replies": [{"author": "milo-trujillo", "id": "h6hfap9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #89", "submission": "or92g1", "stickied": false, "body": "There may be alternative solutions to this problem. Two that come to mind:\n\n1. Heavy estate and sales tax for property. _You_ can keep the property indefinitely, but you can't pass it to the next generation without paying taxes each generational hop.\n\n2. No permanent property ownership. Do something like Hawaii's leasehold system, where you can buy property for a 50 or 100 year term, but not indefinitely. At the expiration of the leasehold, let the property revert ownership to the city/county/state, who will sell it out again.\n\nThere are certainly problems with both of the above solutions, but property tax isn't the _only_ means of preventing indefinite inter-generational wealth through land-ownership.", "is_submitter": false, "distinguished": null, "created_utc": 1627227995.0, "parent_id": "t1_h6he2r5", "replies": []}, {"author": "FalconRelevant", "id": "h6hfmti", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Except they do? Can't they just need/want money instead of a source of income? And rent prices would go down if that happens, making them not such a great source of income anyways, increasing incentive to sell. \n\nAnd do remember that there is a lot of undeveloped land available, this would also push people to go buy that and build new homes, which would would fix the housing crisis so many western nations face.", "is_submitter": true, "distinguished": null, "created_utc": 1627228162.0, "parent_id": "t1_h6he2r5", "replies": []}]}, {"author": "TommyWiseau22", "id": "h6hmle6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "or92g1", "stickied": false, "body": "you're a weeb lol fight me.", "is_submitter": false, "distinguished": null, "created_utc": 1627231536.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6hmnn8", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Yes, I am a weeb.", "is_submitter": true, "distinguished": null, "created_utc": 1627231566.0, "parent_id": "t1_h6hmle6", "replies": []}]}, {"author": "Kweldulf", "id": "h6gvmf2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "or92g1", "stickied": false, "body": "Calling taxation a fraud basing it of the idea that you somehow \"own\" the money you make, just because it says so on your agreement is not exactly true.\n\nYou are a member of a society, which can be thought of as a big ass company - the society which is operated by the government. The government provides you with systems allowing you to develop yourself - roads, education, legal frameworks for estabilishing and operating a company, as well as interaction with other companies and individuals. You having a company is nothing more than producing goods for the benefit of the society, but the sheer fact of production is not enough to fulfill the intrinsict contract between individual and society. The remainder is what you pay in taxes to fulfill the contract.\n\nNow of course you might think that you are working for yourself. That is of course an idea which is much more motivating to be a productive member of the society than the factual state - you are working for the common benefit of humanity. Your gains are a byproduct of that, but you don't matter. Society matters, a unit is nothing. And a productive unit is to be utilisied to maximum - this is why we should have increased taxation, the higher the wealth. Individuals wellbeing is affected less due exponential nature of wealth, thus their input to the society can and should by utilised to the fullest.\n\nYou having a company or a job and the resultant economic prosperity is only the result of the society around you. Your wealth doesn't matter, what matters is the development of society as a whole.", "is_submitter": false, "distinguished": null, "created_utc": 1627216915.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6gw4j7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "I'm not against taxation in general, and can accept income tax if it isn't too high. Property tax is straight up criminal.", "is_submitter": true, "distinguished": null, "created_utc": 1627217259.0, "parent_id": "t1_h6gvmf2", "replies": [{"author": "Kweldulf", "id": "h6gyudt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "or92g1", "stickied": false, "body": "Well yeah property tax is a weird thing, fully agreed on that point. As well as fully agree with the need to tax companies on the basis of their annual revenue (not income), as companies would then have to calculate tax into their costs, rather than avoiding it by buying a crapload of pens just to increase their \"operating\" costs and dump the tax value to 0. (Amazon paying 0 taxes is a problem). A tax should be an obligation for any business.", "is_submitter": false, "distinguished": null, "created_utc": 1627219029.0, "parent_id": "t1_h6gw4j7", "replies": []}, {"author": "s1gnalZer0", "id": "h6h7g9h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "Property tax is what funds local services, like city and county services, parks, schools, etc.", "is_submitter": false, "distinguished": null, "created_utc": 1627223947.0, "parent_id": "t1_h6gw4j7", "replies": [{"author": "FalconRelevant", "id": "h6h94tc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Income tax can do that too.", "is_submitter": true, "distinguished": null, "created_utc": 1627224835.0, "parent_id": "t1_h6h7g9h", "replies": [{"author": "s1gnalZer0", "id": "h6h9khd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "It could. But good luck convincing people to increase their income tax as a tradeoff for decreasing their property tax. In the end, the amount of tax collected would be the same.", "is_submitter": false, "distinguished": null, "created_utc": 1627225065.0, "parent_id": "t1_h6h94tc", "replies": [{"author": "milo-trujillo", "id": "h6hfpu6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #89", "submission": "or92g1", "stickied": false, "body": "> In the end, the amount of tax collected would be the same\n\nBut not from the same people. Income tax effects all citizens with income, while property tax only effects those that own property, not renters. Would landlords suddenly charge their renters less because their property tax has gone down? Ideally, but probably not proportionally.", "is_submitter": false, "distinguished": null, "created_utc": 1627228203.0, "parent_id": "t1_h6h9khd", "replies": []}]}]}]}]}]}, {"author": "dogs_like_me", "id": "h6hfdya", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "or92g1", "stickied": false, "body": ">  it is still criminal behavior to charge money for something one fully owns\n\nyou have  repeated this assertion throughout this discussion. I'd like to see you expand on this, at the very least with some kind of rational argument. The majority of comments, mine included, are outright rejecting your premise. Why don't you backtrack a little and set a framework in which we can actually talk about this assertion you're making rather than just hand-waving it away and fundamentally disagreeing on everything.", "is_submitter": false, "distinguished": null, "created_utc": 1627228040.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6hg3ym", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "If you have to pay money yearly to have something, that does not mean that you truly \"own\" it. Do you pay an yearly smartphone tax? A PC tax? Cloth tax?", "is_submitter": true, "distinguished": null, "created_utc": 1627228398.0, "parent_id": "t1_h6hfdya", "replies": [{"author": "s1gnalZer0", "id": "h6hpq4r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "I pay sales tax on my phone plan. The use of my clothing doesn't require services provided by the government for me to be able to use them. For my computer, I paid sales tax when I bought it, and depending on my service, may have to pay sales tax on electricity and internet. There is no sales tax on the purchase of a home.", "is_submitter": false, "distinguished": null, "created_utc": 1627233046.0, "parent_id": "t1_h6hg3ym", "replies": [{"author": "FalconRelevant", "id": "h6hq3il", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Then add sales tax on purchase of a home and remove yearly property tax.", "is_submitter": true, "distinguished": null, "created_utc": 1627233226.0, "parent_id": "t1_h6hpq4r", "replies": [{"author": "s1gnalZer0", "id": "h6hrrqh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "So I would have to roll the sales tax into my mortgage instead of property tax? Either way, if I lose my income, I wouldn't be able to afford my mortgage.", "is_submitter": false, "distinguished": null, "created_utc": 1627234025.0, "parent_id": "t1_h6hq3il", "replies": []}]}]}, {"author": "dogs_like_me", "id": "h6i0wm3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "or92g1", "stickied": false, "body": "Considering the kinds of taxes you're describing as \"self-evidently theft\" are actually commonplace in literally every contemporary society/country, you need to do a better job arguing that this is actually theft than just analogizing. If it's theft, why is it so popular? Why do you think governments not only \"get away\" with it, but their citizens often *demand* it? \n\n> If you have to pay money yearly to have something, that does not mean that you truly \"own\" it.\n\nYou're right. I don't \"truly own\" the land my property is on. At any moment, the government could swoop in and take it from me claiming imminent domain. I'm also subject to a lot of constraints on how I use my property. I can't just dig arbitrary holes, I need to check that there aren't underground utilities first (utilities which are owned or licensed by the government). Depending on where I live, there may even be a town-level agreements like HOAs that could constrain what I can do to my lawn. Zoning ordinances also limit how high my house can or needs to be, and even what I can do on my property. If I want to operate a business from my residence, I would be violating my zoning agreement unless I get some kind of special permit. And I certainly don't control the airspace above my land, and depending on where I live it might not even be legal to hover a quadcopter a foot of the ground on \"my own property,\" because that's not how property works. It's not my own private fiefdom.\n\nNone of what I just described are \"taxes,\" and there's nothing wrong with any of this either. I own my property, but I'm also a member of a community. The community as a group has a right to define certain parameters around what kind of community they want to be, and encourage/discourage certain property uses that are outside of what they want their community to be. These parameters are defined through regulations, ordinances, and laws. As a member of this community, I can influence these and my voice is now part of the decision making process that determines what my community will look like. Enacting and enforcing these regulations costs money, and that's what taxes are for. As a member of this community, I am agreeing to pay taxes in support of the structures that allow the community to exist. \n\nYou might say that this is unfair because you personally don't \"agree\" and are being forced into that contract, but you are also \"forced\" into citizenship. If you want to renounce your citizenship and leave the country, I'm sure there's a process for that and you will no longer be subject to those taxes you so abhor. But people live in communities, and communities evolve governments for some of the reasons I described earlier, so unless you are planning on forming your own country by buying an isolated island or something like that, you're going to be hard pressed to find habitable land that isn't subject to the kinds of governmental structures I described, because they are fundamental to maintaining communities. \n\nEven small communities like co-ops and kibutzes generally have some kind of community rule-making process that everyone is subject to and likely also some sort of sharing economy that permits the accomplishment of large projects that would otherwise be infeasible without the support and involvement of the broader community, like installing and maintaining sanitation or power infrastructure.\n\nYour liberties are limited and certain demands can be made of you. That doesn't mean you don't \"own\" anything. \n\nI challenge you to define \"ownership\" clearly. If paying money yearly means I don't \"own\" it, clarify for me what \"ownership\" means so you can concretize exactly how paying taxes on the thing violates my ownership of it.", "is_submitter": false, "distinguished": null, "created_utc": 1627238410.0, "parent_id": "t1_h6hg3ym", "replies": []}]}]}, {"author": "PurpleDevilR", "id": "h6hfpel", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "or92g1", "stickied": false, "body": "If they just tax business then that means goods are more expensive here, thus purchasing materials and constructing the goods overseas is more profitable, the less done at home the better. It pushed industry out of the country thus jobs too thus people can’t afford as much.\n\nThat and cheaper goods are better for poorer people. If you’re poor you want income taxes over company taxes as goods are cheaper for you while the wealthy who can afford it are still fine.", "is_submitter": false, "distinguished": null, "created_utc": 1627228197.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h6hghh7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "Tax payers should get a direct say on how their money is allocated.  For example a pacifist should have the option to request their tax dollars do not fund the Military–industrial complex, or on the flip side not fund wasteful socal programs.", "is_submitter": false, "distinguished": null, "created_utc": 1627228582.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6hgnro", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "That could under-fund many necessary services though.", "is_submitter": true, "distinguished": null, "created_utc": 1627228666.0, "parent_id": "t1_h6hghh7", "replies": [{"author": "Zealousideal_Mix_629", "id": "h6hh1yk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "If the majority people see them as wasteful and choose to not allocate their funds towards them, then they need to be cut, or drastically restructured.  That's pure democracy.", "is_submitter": false, "distinguished": null, "created_utc": 1627228857.0, "parent_id": "t1_h6hgnro", "replies": [{"author": "FalconRelevant", "id": "h6hhf6m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "The general public doesn't have the skill to decide that.", "is_submitter": true, "distinguished": null, "created_utc": 1627229035.0, "parent_id": "t1_h6hh1yk", "replies": [{"author": "Zealousideal_Mix_629", "id": "h6hhoo0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "They vote in the people who currently make those decisions.  This plan would just cut out the middle man.", "is_submitter": false, "distinguished": null, "created_utc": 1627229159.0, "parent_id": "t1_h6hhf6m", "replies": [{"author": "FalconRelevant", "id": "h6hhtii", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "That's wrong as well, the people who make those decisions should be the experts, not crowd-pleasing sycophants.", "is_submitter": true, "distinguished": null, "created_utc": 1627229224.0, "parent_id": "t1_h6hhoo0", "replies": [{"author": "Zealousideal_Mix_629", "id": "h6hjzzx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "That is what I'm proposing, we get rid of the crowd pleasing middle man, and let the people decide for themselves. As opposed to the totalitarian system you are suggesting.", "is_submitter": false, "distinguished": null, "created_utc": 1627230283.0, "parent_id": "t1_h6hhtii", "replies": [{"author": "FalconRelevant", "id": "h6hkbqh", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "The blind masses must be led down the path of science.", "is_submitter": true, "distinguished": null, "created_utc": 1627230445.0, "parent_id": "t1_h6hjzzx", "replies": [{"author": "Zealousideal_Mix_629", "id": "h6hldj8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "Then science, which is arguably a very broad term, needs to deliver results if they want their funding. Which honestly is not that different from how grant applications work now. Except there would be a lot less pet projects that go nowhere since more people would need to be convinced.", "is_submitter": false, "distinguished": null, "created_utc": 1627230950.0, "parent_id": "t1_h6hkbqh", "replies": []}]}]}]}]}]}, {"author": "s1gnalZer0", "id": "h6hq5fr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "Then we end up with people like former US Energy Secretary Rick Perry, who during the primary debates said he wanted to eliminate the Department of Energy without realizing what it actually did. Once he was in the job, he learned that it manages things like the US nuclear weapons arsenal. People don't realize the value that some of the government programs provide, and would eliminate programs without thinking about the effects. Most people think programs that don't directly benefit them are wasteful.", "is_submitter": false, "distinguished": null, "created_utc": 1627233252.0, "parent_id": "t1_h6hh1yk", "replies": [{"author": "Zealousideal_Mix_629", "id": "h6humc6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "That is the failure of the US department of energy. They needs to do a better job informing individuals as to why they are worth funding, and what they really do. This new system would dramatically increase accountability and transparency.", "is_submitter": false, "distinguished": null, "created_utc": 1627235384.0, "parent_id": "t1_h6hq5fr", "replies": [{"author": "s1gnalZer0", "id": "h6huv1a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "or92g1", "stickied": false, "body": "That would require increasing the size of the bureaucracy. Every program would have to have a public relations department to continually sell the public on why it should exist.\n\nMy state has an office of pipeline safety. It's fairly clear from the name what they do. The majority of people in my state don't live near a pipeline. If the majority decide that since they don't live near a pipeline, they don't need an office of pipeline safety, does that mean the people that do live near a pipeline are just screwed and need to accept the fact that pipeline safety isn't important to the majority?", "is_submitter": false, "distinguished": null, "created_utc": 1627235499.0, "parent_id": "t1_h6humc6", "replies": [{"author": "Zealousideal_Mix_629", "id": "h6hvnj2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "Better then the current system where the citizens are kept in the dark for the most part on where their tax dollars are being spent. \n\nMabey the department of pipeline safety needs to explain their value for the entire state instead of just focusing on the handful that live around the pipeline.", "is_submitter": false, "distinguished": null, "created_utc": 1627235878.0, "parent_id": "t1_h6huv1a", "replies": [{"author": "Skastrik", "id": "h6i2bxn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "or92g1", "stickied": false, "body": "Citizens aren't being kept in the dark, most of the info is readily available. There are mountains of pamphlets and websites there.\n\nMost citizens do not have the time, opportunity nor the inclination to get informed. \n\nThe whole concept of the republic and the representative system is to vote in a person that you trust to get informed and to take those decisions for you.", "is_submitter": false, "distinguished": null, "created_utc": 1627239094.0, "parent_id": "t1_h6hvnj2", "replies": [{"author": "Zealousideal_Mix_629", "id": "h6i39bf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "or92g1", "stickied": false, "body": "Then it's that department's job to know their audience and speak to them in a way in which their message will be understood. It's marketing 101. The only reason the republic system was implemented is because true democracy was too impractical before the age of information. The limitations that forced the adoption of this system no longer exist.", "is_submitter": false, "distinguished": null, "created_utc": 1627239544.0, "parent_id": "t1_h6i2bxn", "replies": [{"author": "Skastrik", "id": "h6i7ulc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "or92g1", "stickied": false, "body": "You want to move all the responsibility over to a government entity that then sees more profit in spending its budget on PR than what it is actually supposed to be doing just to justify their existence to the voter?\n\nThere are issues there.", "is_submitter": false, "distinguished": null, "created_utc": 1627241777.0, "parent_id": "t1_h6i39bf", "replies": []}]}]}]}]}]}]}]}]}, {"author": "Skastrik", "id": "h6i1v1l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "or92g1", "stickied": false, "body": "Voters should exactly never get a direct say in taxes and public spending.\n\nNo raising of taxes would ever pass, never ever.\n\nThat would lead to the underfunding of essential things. And the eventual collapse of government.\n\nThere are plenty of local governmental examples that experimented with this if you Google enough.", "is_submitter": false, "distinguished": null, "created_utc": 1627238871.0, "parent_id": "t1_h6hghh7", "replies": []}]}, {"author": "arnitdo", "id": "h6hlsvh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #194", "submission": "or92g1", "stickied": false, "body": "TBH, teach the younger generation taxes well. Add incentives for paying taxes early or on time. Invest in big businesses the same or 50 % of the amount they pay in taxes. Have a 6 month no-tax period for startups and micro industries. It'll help to start businesses easily without having to immediately get stuck in a financial hellhole.\n\nAnd for god's sake, write laws in plain English.", "is_submitter": false, "distinguished": null, "created_utc": 1627231155.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "lordpenner", "id": "h6hvlqq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "or92g1", "stickied": false, "body": "Yes.", "is_submitter": false, "distinguished": null, "created_utc": 1627235856.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "AlternativeMint", "id": "h6ipqdf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "or92g1", "stickied": false, "body": "If at least we were in a feudal system... They only taxed your income.\n\n10% for king and country\n10% for royalty\n10% for church\n\nWhat a dream...", "is_submitter": false, "distinguished": null, "created_utc": 1627250630.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "BluudLust", "id": "h6j7he4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #6", "submission": "or92g1", "stickied": false, "body": "If only it were simple. I have no clue how to create a fair tax system.", "is_submitter": false, "distinguished": null, "created_utc": 1627259963.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "bogon64", "id": "h6jdx7f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #77", "submission": "or92g1", "stickied": false, "body": "I remember a discussion on the nature of property tax in James Michener’s book Hawaii. The crux of the discussion was that there were some large landowners who had little incentive to be productive with their land, and the wasted land was detrimental to society. Property tax was a “shit or get off the pot” kind of incentive- either be productive with the land or sell it to somebody else who will.  \n\nI always thought it was an interesting way of looking at the issue e.g. the goal wasn’t theft, but rather productivity.", "is_submitter": false, "distinguished": null, "created_utc": 1627263449.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "sarini11", "id": "h6jj3lc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #56 | Ordo Cognitus", "submission": "or92g1", "stickied": false, "body": "You have capitalism to thank for that. Imagine what kind of laws we have when governments are capitalists' slaves.", "is_submitter": false, "distinguished": null, "created_utc": 1627266263.0, "parent_id": "t3_or92g1", "replies": []}, {"author": "zephyrsong888", "id": "h6k38sv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #140", "submission": "or92g1", "stickied": false, "body": "Some things you \"fully own\" don't exist in a vacuum. Land for example doesn't float in space and connects to a network of other pieces of land and even requires connection to things like the local water sources in order to operate. Unless you intend to move all pooping off property for everyone, connection to a maintained pipeline is required.\n\nThis means that a VAT is not appropriate for what you're doing if any part of this system is government maintained or operated. There's no \"value added\", there's \"inherent value\" decided by the municipality.", "is_submitter": false, "distinguished": null, "created_utc": 1627279062.0, "parent_id": "t3_or92g1", "replies": [{"author": "FalconRelevant", "id": "h6k3bjk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Then charge for water supply and whatever else ffs.", "is_submitter": true, "distinguished": null, "created_utc": 1627279123.0, "parent_id": "t1_h6k38sv", "replies": [{"author": "zephyrsong888", "id": "h6k3i8s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #140", "submission": "or92g1", "stickied": false, "body": "How about you be specific? You want VAT for everything and you know what all charges by the government get labelled: taxes.", "is_submitter": false, "distinguished": null, "created_utc": 1627279268.0, "parent_id": "t1_h6k3bjk", "replies": [{"author": "FalconRelevant", "id": "h6k440d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "or92g1", "stickied": false, "body": "Yeah my main gripe is about property taxes.", "is_submitter": true, "distinguished": null, "created_utc": 1627279744.0, "parent_id": "t1_h6k3i8s", "replies": []}]}]}]}, {"author": "WalkingTheSixWays", "id": "h6j6cgc", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "or92g1", "stickied": false, "body": "In whatever way the proletariat decides.", "is_submitter": false, "distinguished": null, "created_utc": 1627259341.0, "parent_id": "t3_or92g1", "replies": []}]}