{"title": "A billion isn't really that much.", "name": "t3_oqnmu7", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oqnmu7/a_billion_isnt_really_that_much/", "selftext": "Some people here have weird hatred for the word \"billionaire\", like that suddenly transforms someone into Hitler except enslaving instead of killing. \n\nNow, there are a lot of shitbags among them, yes, and that is because there are a lot of shitbags in humanity in general, and money just acts as a shine upon it.\n\nAlso do realize that even the richest among them are worth a few hundred billion, most of which is really the valuation of the companies they control, not hard assets. Meanwhile the US spends **700 billion per year** on defence budget alone.\n\nReally barking up the wrong tree.", "score": 0, "upvote_ratio": 0.26, "permalink": "/r/TheFlyingTree/comments/oqnmu7/a_billion_isnt_really_that_much/", "id": "oqnmu7", "author": "FalconRelevant", "link_flair_text": "Debate", "num_comments": 116, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1627123336.0, "comments": [{"author": "Pwngulator", "id": "h6dm19l", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "oqnmu7", "stickied": false, "body": "What's the difference between a million dollars and a billion dollars?\n\nRoughly a billion dollars.", "is_submitter": false, "distinguished": null, "created_utc": 1627143025.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "TheCanadianGame", "id": "h6fx4aw", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Cringe argument\n\nWhat's the difference between a thousand and one?\n\nRoughly a thousand. I mean you're comparing three orders of magnitude what math are you expecting\n\nThis just in: Big number minus a really small number is roughly equal to big number! More news at 5", "is_submitter": false, "distinguished": null, "created_utc": 1627187617.0, "parent_id": "t1_h6dm19l", "replies": [{"author": "Pwngulator", "id": "h6h6jzp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "oqnmu7", "stickied": false, "body": "That's exactly the point. People hear \"a million dollars\" and \"a billion dollars\" and put them in the same cognitive bucket of \"that's a lot of money\", not realizing they are vastly different amounts. And then when people get pissed at billionaires, they think they are also pissed about millionaires, when that's not at all the case.", "is_submitter": false, "distinguished": null, "created_utc": 1627223464.0, "parent_id": "t1_h6fx4aw", "replies": []}]}]}, {"author": "DDumpTruckK", "id": "h6cs86o", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqnmu7", "stickied": false, "body": "A billion is enough to live comfortably and never have to work for an entire life while still having lots left over.  Given that the core mechanic of capitalism is that having capital generates more capital, a billion is quite a lot considering how few people actually get to have it.", "is_submitter": false, "distinguished": null, "created_utc": 1627125518.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "R5Cats", "id": "h6fqand", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "And as long as that billion is \"invested\" in the economy? It will continue to generate thousands of jobs. Most of the \"billionaires\" wealth is in companies, not cold hard cash. Those companies are the driving engines of national and global economies. (Aside from small business! Of course.) Cutting them out is like slitting your own throat.", "is_submitter": false, "distinguished": null, "created_utc": 1627183174.0, "parent_id": "t1_h6cs86o", "replies": [{"author": "DDumpTruckK", "id": "h6frsbs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqnmu7", "stickied": false, "body": ">It will continue to generate thousands of jobs.\n\nIt's not as simple as the libertarians want you to believe.  You could invest infinite money into your spaghetti business and if no one wants to buy spaghetti then there's no business and then there's no jobs.  Investing money doesn't create jobs.  Demand does.  And demand goes away when people don't have their own money to spend on things.", "is_submitter": false, "distinguished": null, "created_utc": 1627184109.0, "parent_id": "t1_h6fqand", "replies": [{"author": "R5Cats", "id": "h6fuxwp", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "What do you think the BILLIONS of wealth are doing? Sitting there in a vault like Scrooge McDuck's swimming pool? NO! They are in companies and corporations: risks! Invested with the hope of a profit. Or loss if they invested in spaghetti too much. This is \"intro-economics 105\" stuff here, dude!\n\nIf you take away all the jobs? Who's going to buy anything? $30 an hour minimum wage is meaningless if 50% of all jobs are lost...\n\nOr there's socialist Zimbabwe, where everyone's a billionaire! Isn't that wonderful?", "is_submitter": false, "distinguished": null, "created_utc": 1627186150.0, "parent_id": "t1_h6frsbs", "replies": [{"author": "DDumpTruckK", "id": "h6fzuy0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqnmu7", "stickied": false, "body": ">What do you think the BILLIONS of wealth are doing? Sitting there in a vault like Scrooge McDuck's swimming pool?\n\nI didn't say it was doing nothing.  I said it wasn't creating jobs.\n\n>They are in companies and corporations: risks!\n\nWhat risk?  When a company spends irresponsibly and gets caught out by a economic downturn from a pandemic what happens?  The government bails them out.  When a company, encouraged by lowered regulations, makes irresponsible moves and consolidates debt into packages and sells it and then gets caught out by their own ineptitude what happens?  The government bails them out.  There's no risk.  Don't bother using that word to describe our private businesses; it doesn't apply and everyone already knows it.\n\n>Or loss if they invested in spaghetti too much. This is \"intro-economics 105\" stuff here, dude!\n\nYep, which is why it's weird that you're making my point here while pretending like you've said something profound in counter. Money invested does not create jobs.  A market that is profitable to exploit must exist first.  Money doesn't create markets or jobs.  You just said so yourself.  Maybe you should retake Economics 101.\n\n>If you take away all the jobs? Who's going to buy anything? $30 an hour minimum wage is meaningless if 50% of all jobs are lost...\n\nNo one's taking the jobs away, bro.  You beat up that straw man though.  Just be careful, it might fall on you and you'll be embarrassed then.", "is_submitter": false, "distinguished": null, "created_utc": 1627189545.0, "parent_id": "t1_h6fuxwp", "replies": [{"author": "R5Cats", "id": "h6hnj0l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "> I didn't say it was doing nothing. I said it wasn't creating jobs.\n\nPick one or the other.\n\nGovernment bailouts are because of bad government. You think no companies have gone under in the past 30 years? What? \n\nLook at any place in America where they've installed $15 minimum wage: the jobs are lost as the small businesses shut down. Large business just increases prices and/or cuts services. Prices rise hurting the poor the most.   \n\nWhy get training for a $17/hr career when you'll get $15 for a zero skill job?", "is_submitter": false, "distinguished": null, "created_utc": 1627231981.0, "parent_id": "t1_h6fzuy0", "replies": [{"author": "DDumpTruckK", "id": "h6hwag7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqnmu7", "stickied": false, "body": ">Pick one or the other.\n\nI did.  It's not creating jobs.  Are you really having a hard time following that?\n\n>Government bailouts are because of bad government.\n\nDude.  I didn't say they were bad.  I said they remove the risk that you think exists.  Why is it so hard for you to comprehend the things I write?  I'm very specific and clear, yet every time you come back and argue against a point I didn't make.  Are you doing this on purpose?\n\n>You think no companies have gone under in the past 30 years? What?\n\nAre you denying the massive bailouts that we've seen practically every president give corporations over the last 30 years?\n\n>Look at any place in America where they've installed $15 minimum wage: the jobs are lost as the small businesses shut down. Large business just increases prices and/or cuts services. Prices rise hurting the poor the most.\n\nLol, you recognize most companies offer $15/hr now anyway, right?  Raising the minimum would only impact a small portion of the job market, all but the most exploitative of companies are already doing it.  It's like you live on a another planet or something.\n\n>Why get training for a $17/hr career when you'll get $15 for a zero skill job?\n\nYou answered that question in your question.  It's the difference between a career and a dead end job at McDonalds.", "is_submitter": false, "distinguished": null, "created_utc": 1627236186.0, "parent_id": "t1_h6hnj0l", "replies": [{"author": "R5Cats", "id": "h6i0z6b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "You said you *didn't say* it was doing nothing, then you repeatedly say it's doing nothing (that's what 'not creating jobs' means). \n\nMassive bailouts yes, but I didn't ask you that, I asked if NO companies went under in the past 30 years. If they folded, losing lots of money doing so, that's risk. Not *every single* company got bailouts, although I'm sure they tried!\n\nSo if all those companies *are already paying over minimum* (which is what I said all along) then why is there a sudden need to raise it so much?   \nCan you be ruder? Go on, give it a try.\n\nFunny you claim there'd be no loss of jobs, yet the very company you mention has *already cut* jobs in anticipation of increased minimum wages.   \nAnd when minimum wages go up? So does the prices of everything a company (large or small) that pays minimum wage offers. I've seen this with my own eyes here for the past 4 \"wage hikes\", every single time. And my own job? Which used to pay more than minimum? Now is barely higher, and my employer won't give us raises because the next scheduled 'hike' will do that anyhow 😒", "is_submitter": false, "distinguished": null, "created_utc": 1627238443.0, "parent_id": "t1_h6hwag7", "replies": [{"author": "DDumpTruckK", "id": "h6i4jqg", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqnmu7", "stickied": false, "body": ">You said you didn't say it was doing nothing, then you repeatedly say it's doing nothing (that's what 'not creating jobs' means).\n\nSo I'm not sure how this is difficult for you, but if its not creating jobs, it can still be doing something else.  I mean, we could say the money does nothing *to create jobs* but I didn't even go that far.  I'm perfectly willing to accept that money plays some factor in job creation, it's just not the most significant factor.  It's probably one of the last things that contribute to job creation.\n\n>Massive bailouts yes, but I didn't ask you that, I asked if NO companies went under in the past 30 years.\n\nI know you did, but your acting like that's some kind of relevant counter point to what I said when in reality is has nothing to do with what I said.\n\n>If they folded, losing lots of money doing so, that's risk. Not every single company got bailouts, although I'm sure they tried!\n\nSure.  Some companies didn't get bailouts.  But those companies also aren't the several billion dollar companies that we were talking about, so they're quite off topic.\n\n>So if all those companies are already paying over minimum (which is what I said all along) then why is there a sudden need to raise it so much?\n\nWhat do you mean?  We wouldn't be raising it noticeably.  15 isn't higher than 15, dude.  All raising the minimum wage does is make it so that those few who are behind in following the times have to keep up instead of undercut the value of labor.\n\n>Can you be ruder? Go on, give it a try.\n\nAll I'm doing is stating the obvious and demonstrable fact that you seem incapable of extracting the very crystal clear point I'm making, and instead would rather build and fight a strawman that holds a position I do not.  If there's someone being rude its the person who keeps putting words in my mouth.\n\n>I've seen this with my own eyes here for the past 4 \"wage hikes\", every single time.\n\nPlease, look up 'anecdotal evidence' and write me a paragraph on what you've learned.  This is conservative grandpa logic *at best.*\n\nYou'll be interested in these articles.\n\n[https://equitablegrowth.org/research-shows-raising-the-minimum-wage-does-not-spell-job-loss/](https://equitablegrowth.org/research-shows-raising-the-minimum-wage-does-not-spell-job-loss/)\n\n[https://prospect.org/labor/reframing-minimum-wage-debate/](https://prospect.org/labor/reframing-minimum-wage-debate/)\n\n[https://www.americanprogress.org/issues/economy/reports/2021/02/25/496355/small-businesses-get-boost-15-minimum-wage/](https://www.americanprogress.org/issues/economy/reports/2021/02/25/496355/small-businesses-get-boost-15-minimum-wage/)", "is_submitter": false, "distinguished": null, "created_utc": 1627240169.0, "parent_id": "t1_h6i0z6b", "replies": [{"author": "R5Cats", "id": "h6jwilw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "> in reality is has nothing to do with what I said.\n\nYou said there's \"no risk\" to investors because companies always get \"bailed out\". It has everything to do with what you said, you're just refusing to answer.  \n\nOf course you change what you said when caught up in a fib. What sort of nonsense is this?  \n>but if its not creating jobs, it can still be doing something else.\n\nEither it (billions) is invested in something... or it isn't. Anything it gets invested in creates jobs eventually. Money is the *last thing* that creates jobs? Money is the ONLY thing that creates jobs! What jobs do you know of, even government jobs, that don't require money to create?  \nBuilding a house creates jobs.  \nBuying a fancy painting creates jobs.  \nStuffing your money in a mattress doesn't. Nor does Scrooge McDuck's pool. That's money that is \"doing nothing\".\n\n>the obvious and demonstrable fact that you seem incapable of extracting the very crystal clear point I'm making,\n\nGo play with yourself some more.", "is_submitter": false, "distinguished": null, "created_utc": 1627274238.0, "parent_id": "t1_h6i4jqg", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "0s_and_1s", "id": "h6cqphj", "score": 16, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "I don’t think the issue is that billionaires exist but rather the disparity between the rich and the poor and there are MANY poor people even in developed countries like USA. The money that they have accumulated didn’t come from a vacuum it was gathered by depriving somebody in the chain. When you’ve got someone working a full time job and still needing to claim benefits because their employer doesn’t pay enough for the person to survive, that’s the sort of shit that makes people angry. Often it is cheaper to keep politicians on payroll than it is to pay people a decent wage. Ultimately this accumulation of wealth and avoidance of taxes hurts the citizens and country in the long term. Worth googling how under invested the American infrastructure is such as highways etc. It’s not just limited to the US, same shit in the U.K. but folks have been brainwashed into thinking it’s good to have billionaires and to avoid paying taxes.\n\nEdit: typos", "is_submitter": false, "distinguished": null, "created_utc": 1627124217.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "FalconRelevant", "id": "h6dnwdr", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "The problem is that the government isn't performing well, and some people are blaming the incompetence of the voting public onto those who have money.", "is_submitter": true, "distinguished": null, "created_utc": 1627143921.0, "parent_id": "t1_h6cqphj", "replies": [{"author": "DracoLunaris", "id": "h6duei2", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "If we're talking the USA, then a. the general public have a grand total of 2 options to vote for because of how the system is set up and b. When it comes to policy it doesn't matter that much who is in charge anyway, as what get implemented is the stuff popular among the rich because lobbying is a thing.", "is_submitter": false, "distinguished": null, "created_utc": 1627147053.0, "parent_id": "t1_h6dnwdr", "replies": []}, {"author": "Pwngulator", "id": "h6eebkb", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "oqnmu7", "stickied": false, "body": "There's a huge difference between \"those who have money\" and billionaires.", "is_submitter": false, "distinguished": null, "created_utc": 1627156951.0, "parent_id": "t1_h6dnwdr", "replies": []}]}, {"author": "maxime7567", "id": "h6cy1p5", "score": -8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #83", "submission": "oqnmu7", "stickied": false, "body": "Ok one of the main reasons people aren't \"paid enough\" is because of taxes. They are super high. The billionaires earned it through hard work. They pay much more than people realize. It's just that the taxes are ridiculously high. I don't know the rates of America, but ib Belgium it's more than 50% for something like an accountant, which than results in them still needing 2 working parents for decent living quality while without taxes 1 would be enough. And. Yes, Belgiums tax rates are some of the highest, but 30% still makes a huge difference. And what do you get in return? A government which does jack shit. Which spends money on things that the populus doesn't want. They than complain that they don't have enough of them to give to the homeless. Taxes are the main issues here. The tax rates are way too high. Yes many companies are scummy but you have more power than you realize. If it truly is horrible then stop working. Tell them. But considering that giant refusals aren't happening it is not that bad. The government is way worse than the billionaires.", "is_submitter": false, "distinguished": null, "created_utc": 1627129977.0, "parent_id": "t1_h6cqphj", "replies": [{"author": "Paul_Thrush", "id": "h6dm69k", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": ">They pay much more than people realize.\n\nThey don't pay their fair share. They pay a much smaller perentage of their income than the working class.\n\n[THE SECRET IRS FILES](https://www.propublica.org/series/the-secret-irs-files)\n\nInside the Tax Records of the .001%\n\n>A massive trove of tax information obtained by ProPublica, covering thousands of America’s wealthiest individuals, reveals what’s inside the billionaires’ bag of tricks for minimizing their personal tax bills — **sometimes to nothing**.", "is_submitter": false, "distinguished": null, "created_utc": 1627143092.0, "parent_id": "t1_h6cy1p5", "replies": [{"author": "maxime7567", "id": "h6dwt23", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #83", "submission": "oqnmu7", "stickied": false, "body": "They pay their employees more than you realize is what I mean. If someone has 20 000 dollars a year, the company has to pay 40 000$ a year or more. Because the government takes the rest. That is my point. If the government didn't take our money most people would earn more than enough money. Enough to live comfortably. Without needing benefits from the government. This is the problem.\nAnd yes I know that companies pay way less taxes than the working class but that was never what I meant. What I meant is that taxes in general suck. That the blame for the low salary does not lie with the employers, but with the government. And all this does is give the government power. Because people become dependent on the government, and that is incredibly dangerous.", "is_submitter": false, "distinguished": null, "created_utc": 1627148216.0, "parent_id": "t1_h6dm69k", "replies": [{"author": "Paul_Thrush", "id": "h6ed1z8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": "> the blame for the low salary does not lie with the employers\n\nYes it does. They make enough to share more, but they're greedy. They're the ones holding the minimum wage to $7.25 when they could easily pay $20 like they should.\n\nWe saw it during the lockdowns. The low-wage workers had to keep the economy going while the owners stayed home and did nothing. The work done by the low-wage workers deserves more pay and the owners deserve less.", "is_submitter": false, "distinguished": null, "created_utc": 1627156306.0, "parent_id": "t1_h6dwt23", "replies": []}, {"author": "0s_and_1s", "id": "h6edexb", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Those taxes in many European countries goes to pay for things like socialised medical care, infrastructure, defence, maintenance, policing and yes in the unfortunate case that you are unemployed a safety net amongst many other things. If not taxes how do you intend to finance these things? Would you prefer for everything to be privatised? Phone around to get quotes for a fire service while your house burns down perhaps? Even if you abolished taxes you’d still need to pay for these services so you’ll end up paying anyway.\n\nI find your position on billionaires to be logically inconsistent. You say they worked hard for it but when wages don’t go up it’s the governments fault for taxes instead of the employers fault for not increasing your wage. Where do you think their billions came from if not depriving people of benefits and well paid salaries?\n\nThere’s a saying in my country, those with the broadest shoulders should carry the greatest burden.", "is_submitter": false, "distinguished": null, "created_utc": 1627156491.0, "parent_id": "t1_h6dwt23", "replies": []}]}, {"author": "R5Cats", "id": "h6fpzdu", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "Then why do the 1% pay 20% of all income tax?  \nAnd the top-10% pays half? \n\nWhen they claimed Trump paid \"$500\" one year? It simply ignored the many millions he'd already had deducted. He was able to carry forward losses *thanks to Obama's breaks* and thus not pay more at the end of the year.   \nIt isn't rocket surgery: rich people pay.   \nAnd: try to tax them more and they'll stop paying entirely.", "is_submitter": false, "distinguished": null, "created_utc": 1627182976.0, "parent_id": "t1_h6dm69k", "replies": []}]}, {"author": "0s_and_1s", "id": "h6dbnpp", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Seems like two separate issues that you are merging into one. An incompetent government that is spending money on dumb shit does not negate the fact that companies are abusing workers and their benefits whether that be through offering zero hour contracts that leave you unable to plan or take a second job not claim any benefits if they give you no work or the gig economy that’s killing businesses that would otherwise have paid holiday pay sick pay and a retirement. These things benefit the company but rarely the worker.", "is_submitter": false, "distinguished": null, "created_utc": 1627137941.0, "parent_id": "t1_h6cy1p5", "replies": []}]}, {"author": "R5Cats", "id": "h6fsexo", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": ">the disparity between the rich and the poor\n\nPuerile nonsense.  \nThe Pharaohs and the slaves making bricks (OR the ones gathering the straw!).  \nThe Caesar and the commoners?  \nLouis XVI and Les Misérables?  \nCzar Nicolas and the serfs?  \nThe Emperor of China and the vast majority of his subjects? \n\nNeed I go on? Not even Moses, Jesus, Vishnu, Mohammed, Buddha or all the rest could \"solve\" the poverty \"problem\".  \n\nPoor people in America got phones, sneakers, colour TV, hot and cold running water, 3 round meals a day (often from McDonalds) and a whole lot more: education! Health care! Security.   \n\nThese are the days of miracles and wonders.", "is_submitter": false, "distinguished": null, "created_utc": 1627184509.0, "parent_id": "t1_h6cqphj", "replies": [{"author": "dcnairb", "id": "h6g0zot", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "please don’t take this the wrong way but I have not a fuckin clue what you’re trying to say or what the point is \n\nclass warfare has been a struggle since the dawn of civilization? that’s the point, right?", "is_submitter": false, "distinguished": null, "created_utc": 1627190377.0, "parent_id": "t1_h6fsexo", "replies": [{"author": "R5Cats", "id": "h6hmzvh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "The point is that \"disparity\" is just a meaningless buzzword. It has always existed and always will.   \nThe \"poor people\" in America have a higher standard of living than 99% of history's poor. In fact there's far less abject poverty in the world today than ever before, in spite of our gigantic population.  \n\nOf course individuals, groups and societies struggle to better themselves, that's human nature. Punishing the successful isn't a great idea though.", "is_submitter": false, "distinguished": null, "created_utc": 1627231730.0, "parent_id": "t1_h6g0zot", "replies": [{"author": "dcnairb", "id": "h6hp8h4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "so because poor people will always exist and because their standard of living is better than past poor people, it's totally fine to exploit them? because the original point is about these workers being exploited for the money to flow up the chain to the billionaires", "is_submitter": false, "distinguished": null, "created_utc": 1627232807.0, "parent_id": "t1_h6hmzvh", "replies": [{"author": "R5Cats", "id": "h6hrrcn", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "Exploit me harder Daddy! My TV is only 50 inches wide, I need another one!   \n\nIt's up to individuals to better themselves, the government *cannot do it for them* ok? Taking all the wealth away from the 1% won't do a thing except kill many thousands of jobs. Taxing them even more does the same: they'll invest their money elsewhere.", "is_submitter": false, "distinguished": null, "created_utc": 1627234020.0, "parent_id": "t1_h6hp8h4", "replies": [{"author": "dcnairb", "id": "h6j46u2", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "Ah yes, the parents working 2-3 jobs and living paycheck to paycheck just need to work harder, got it. The current system of course has no flaws and treats everyone perfectly equally. If you get in a car accident you'll be bankrupt, jeff bezos gets to go into space because he is much smarter and a much harder worker than anyone else. At least you have a 50\" TV... which probably cost only a fraction of your monthly rent but is somehow still seen as an extreme luxury good and a sign you have a wonderful quality of life.", "is_submitter": false, "distinguished": null, "created_utc": 1627258169.0, "parent_id": "t1_h6hrrcn", "replies": [{"author": "R5Cats", "id": "h6jvvdi", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "> The current system of course has no flaws and treats everyone perfectly equally.\n\nWell now you're just being stupid. Shame on you. Bye.", "is_submitter": false, "distinguished": null, "created_utc": 1627273808.0, "parent_id": "t1_h6j46u2", "replies": []}]}]}]}]}]}]}]}, {"author": "Niskanen204", "id": "h6crrxe", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "oqnmu7", "stickied": false, "body": "Nonsense. A billion is far more than one person can personally effect in a lifetime. It only becomes sufficient when employed collectively. Thus, as a measure of personal wealth, a billion 'is really that much'.", "is_submitter": false, "distinguished": null, "created_utc": 1627125133.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "BelowAvgPhysicist_02", "id": "h6csr5o", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #267", "submission": "oqnmu7", "stickied": false, "body": "If you earn 2000 per hour since the day Jesus was born, u wouldn't be richer than Bezos", "is_submitter": false, "distinguished": null, "created_utc": 1627125958.0, "parent_id": "t1_h6crrxe", "replies": [{"author": "Paul_Thrush", "id": "h6dmd5v", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": "You should pick an actual event or time as your measure.", "is_submitter": false, "distinguished": null, "created_utc": 1627143184.0, "parent_id": "t1_h6csr5o", "replies": [{"author": "EarlMarshal", "id": "h6do9sj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Man... this was just a fancy way of saying 0 a.d.\n\nLet them people be creative.", "is_submitter": false, "distinguished": null, "created_utc": 1627144099.0, "parent_id": "t1_h6dmd5v", "replies": [{"author": "Paul_Thrush", "id": "h6dpd9d", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": "There is no year zero. It goes from 1 BC to 1 AD.", "is_submitter": false, "distinguished": null, "created_utc": 1627144626.0, "parent_id": "t1_h6do9sj", "replies": [{"author": "EarlMarshal", "id": "h6dpqcb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "https://youtu.be/GF8aaTu2kg0", "is_submitter": false, "distinguished": null, "created_utc": 1627144801.0, "parent_id": "t1_h6dpd9d", "replies": []}]}]}, {"author": "dcnairb", "id": "h6g14cr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "I know you’re being that guy but religion or not jesus was an actual historical figure", "is_submitter": false, "distinguished": null, "created_utc": 1627190474.0, "parent_id": "t1_h6dmd5v", "replies": [{"author": "Mathgeek007", "id": "h6g1kzz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Whether he was Holy or the Messiah or what is definitely up for debate, but we know Jesus of Nazareth was an actual individual, born roughly around where we marked the transition for 1BC to 1AD.", "is_submitter": false, "distinguished": null, "created_utc": 1627190824.0, "parent_id": "t1_h6g14cr", "replies": []}, {"author": "Paul_Thrush", "id": "h6h7qvz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": "No, not really. The definition of Jesus is that he's the son of a god who grants eternal life to his followers. That person clearly did not exist. There's a debate over whether some of the story was based on an actual preacher. I'm on the  mythicist's side of the debate. But again Mark made up most of the gospel. None of the miracles happened. Mark re-wrote Moses's story and changed it to match his philosophy. People who think they're following Jesus are actually following Mark. See this:\n\nDid Jesus Even Exist? | Richard Carrier\r  \n[https://www.youtube.com/watch?v=WUYRoYl7i6U](https://www.youtube.com/watch?v=WUYRoYl7i6U)\n\nIt's about 45 minuteds before the Q&A.\n\nOr see these web articles:\n\nEvidence for the historical existence of Jesus Christ\r  \n[https://rationalwiki.org/wiki/Evidence\\_for\\_the\\_historical\\_existence\\_of\\_Jesus\\_Christ](https://rationalwiki.org/wiki/Evidence_for_the_historical_existence_of_Jesus_Christ)\n\n\r[https://www.atheists.org/activism/resources/did-jesus-exist/](https://www.atheists.org/activism/resources/did-jesus-exist/)", "is_submitter": false, "distinguished": null, "created_utc": 1627224105.0, "parent_id": "t1_h6g14cr", "replies": [{"author": "dcnairb", "id": "h6hpqdj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "I literally said \n\n>religion or not\n\nhttps://en.wikipedia.org/wiki/Jesus\n\n>Virtually all modern scholars of antiquity agree that Jesus existed historically\n\nlike I said, I get it, you're being *that guy*. I'm not even religious and so you're missing the point I'm trying to make", "is_submitter": false, "distinguished": null, "created_utc": 1627233049.0, "parent_id": "t1_h6h7qvz", "replies": [{"author": "Paul_Thrush", "id": "h6hrj8r", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": ">Virtually all modern scholars of antiquity agree that Jesus existed historically\n\nA lot of \"biblical scholars\" are untrained hobbyists and Christians. They are biased. And because there is no contemporary evidence for Jesus and no extra-biblical evidence for Jesus, they believe in Jesus's existence based on faith, not evidence. That's why I tried to point you to historians. No historian beleives in a miracle-performing Jesus. Some believe there was an actual preacher, but his name definitely was not Jesus.", "is_submitter": false, "distinguished": null, "created_utc": 1627233914.0, "parent_id": "t1_h6hpqdj", "replies": [{"author": "dcnairb", "id": "h6ikf3v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "holy shit i don't know if you're purposefully misreading what i'm writing or what but \n\ni\n\nam literally not\n\nclaiming jesus performed any magic\n\nhistorians believe in jesus the figure, not jesus the son of god.\n\ni am literally citing historians, researchers who are academics whose job is to research this stuff. i am not citing any churches or faith or hobbyists. when i mean \"scholars\" i mean like literal scholars, not people who assume the title because they read the bible\n\nagain, i will say it for the fifteenth time, I'm not talking about jesus as god, i'm just talking about the ordinary human who existed.\n\nwhether his name was jesus or fucking mark or rumpelstiltskin it doesn't change the point because it's still referring to him as the figure who was later referred to as jesus, who as a human had a birthdate, hence referring to his date of birth is referencing an actual event, which is the original point I was trying to make", "is_submitter": false, "distinguished": null, "created_utc": 1627247943.0, "parent_id": "t1_h6hrj8r", "replies": [{"author": "Paul_Thrush", "id": "h6izn35", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": "You're not citing historians, you are citing self-proclaimed scholars. I'm very familiar with this. Among actual historians there is an actual debate over the existence of regular guy Jesus. His birthday was not December 25. It was moved around by the Church many times for different reasons. No one knows what year he would have been born. The consensus among scholars now who believe he existed is that he was born in 3 BC, not 1AD. But the Bible also says Jesus was born during the time of Herod who died before 3 BC.", "is_submitter": false, "distinguished": null, "created_utc": 1627255742.0, "parent_id": "t1_h6ikf3v", "replies": [{"author": "dcnairb", "id": "h6j534q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "I never claimed to know the exact day or even year, much less that the experts do. But if he existed, then he had a date of birth, which means it's an even that happened which you can reference\n\n> Jesus existed:\nStanton (2002, p. 145): **Today nearly all historians, whether Christians or not, accept that Jesus existed** and that the gospels contain plenty of valuable evidence which has to be weighed and assessed critically. There is general agreement that, with the possible exception of Paul, we know far more about Jesus of Nazareth than about any first or second century Jewish or pagan religious teacher.  \nEhrman (2012b, p. 4–5): \"Serious historians of the early Christian movement—all of them—have spent many years preparing to be experts in their field. Just to read the ancient sources requires expertise in a range of ancient languages: Greek, Hebrew, Latin, and often Aramaic, Syriac, and Coptic, not to mention the modern languages of scholarship (for example, German and French). And that is just for starters. Expertise requires years of patiently examining ancient texts and a thorough grounding in the history and culture of Greek and Roman antiquity, the religions of the ancient Mediterranean world, both pagan and Jewish, knowledge of the history of the Christian church and the development of its social life and theology, and, well, lots of other things. **It is striking that virtually everyone who has spent all the years needed to attain these qualifications is convinced that Jesus of Nazareth was a real historical figure.**\"  \n\n-----\n\n> **The Christ myth theory is rejected by mainstream scholarship**:\nRobert E. Van Voorst, referring to G.A. Wells: \"The nonhistoricity thesis has always been controversial, and it has consistently failed to convince scholars of many disciplines and religious creeds... **Biblical scholars and classical historians now regard it as effectively refuted\"**.[4]  \nWhile discussing the \"striking\" fact that \"we don't have any Roman records, of any kind, that attest to the existence of Jesus,\" Ehrman dismisses claims that this means Jesus never existed, saying, **\"He certainly existed, as virtually every competent scholar of antiquity, Christian or non-Christian, agrees, based on clear and certain evidence.\"**[27]  \nRobert M. Price, a former fundamentalist apologist who is now a Christian atheist, says the existence of Jesus cannot be ruled out, but is less probable than non-existence, agrees that his perspective runs against the views of the majority of scholars.[28]    \nMichael Grant, a classicist, states:  **\"In recent years, 'no serious scholar has ventured to postulate the non historicity of Jesus,' or at any rate very few, and they have not succeeded in disposing of the much stronger, indeed very abundant, evidence to the contrary.\"**[29]  \n\"There are those who argue that Jesus is a figment of the Church’s imagination, that there never was a Jesus at all. **I have to say that I do not know any respectable critical scholar who says that any more.\"** [30]    \nMaurice Casey, an irreligious Emeritus Professor of New Testament Languages and Literature at the University of Nottingham, concludes in his book Jesus: Evidence and Argument or Mythicist Myths? that \"the whole idea that Jesus of Nazareth did not exist as a historical figure is verifiably false. **Moreover, it has not been produced by anyone or anything with any reasonable relationship to critical scholarship. It belongs to the fantasy lives of people who used to be fundamentalist Christians. They did not believe in critical scholarship then, and they do not do so now. I cannot find any evidence that any of them have adequate professional qualifications.\"**[31]    \nBockmuel: \"[F]arfetched theories that Jesus' existence was a Christian invention are highly implausible.\"[32]\n\nlet me know if you want the links/citations", "is_submitter": false, "distinguished": null, "created_utc": 1627258653.0, "parent_id": "t1_h6izn35", "replies": []}]}]}]}]}]}]}]}]}, {"author": "AlternativeMint", "id": "h6dqhzg", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oqnmu7", "stickied": false, "body": "Personal wealth 1 billion created through a business that employs thousands of people = too much for your measure.\n\n1 guy making a budget for 20 billion created mr. President and the Federal Reserve typed a lot of zeroes in a computer each day = collective effort\n\n:_)", "is_submitter": false, "distinguished": null, "created_utc": 1627145171.0, "parent_id": "t1_h6crrxe", "replies": []}, {"author": "Mathgeek007", "id": "h6g1hvx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Plus - one of the richest countries in the world, known for ridiculous overspending, only spends... 700 times more than a billion? When you contrast that a billion is 30 MILLION times more what most people make, I'm unimpressed. The comparison is super weak.", "is_submitter": false, "distinguished": null, "created_utc": 1627190760.0, "parent_id": "t1_h6crrxe", "replies": []}]}, {"author": "Brohozombie", "id": "h6dznd9", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "If billionaires became billionaires while also providing a fair wage to all employees and paying all their taxes without using loopholes such as offshore accounts then I don't think people would have a problem with them. You are also creating this weird comparison of \"since the US spends all this money on things like defense, we shouldn't care about billionaires.\" People are capable of more than 2 thoughts at a time. I am able to be disgusted by the US spending so much money on defense and disgusted by billionaires who treat their country and workers like shit. Are you not able to have 2 separate thoughts at once? Maybe you should be more concerned about that.", "is_submitter": false, "distinguished": null, "created_utc": 1627149604.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "Eyesyt", "id": "h6dpbqx", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Because the people on top have set themselves up as gods and practically control the government.", "is_submitter": false, "distinguished": null, "created_utc": 1627144606.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "FalconRelevant", "id": "h6dpuwg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "Whoops didn't realize I sent the post to Ancient China, my bad.", "is_submitter": true, "distinguished": null, "created_utc": 1627144862.0, "parent_id": "t1_h6dpbqx", "replies": [{"author": "Eyesyt", "id": "h6ds2hk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "You mean modern China? Maybe you mean North Korea?", "is_submitter": false, "distinguished": null, "created_utc": 1627145929.0, "parent_id": "t1_h6dpuwg", "replies": []}]}]}, {"author": "YLASRO", "id": "h6cxuva", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "How the fuck do you think its reasonable for a single person to have a budget that operates in MULTIPLE MILLIONS? Do you realize an average middleclass person earns around 2 million throghout their entire working live tp live a comfortable average life? These people have more money then any reasonable person could fathomably need. And yet they still hoard it instead of beeing productive with it by foung things like raising wages and benefits for their subordinate workers. and thats the bare minimum. They could do far more with such funds.", "is_submitter": false, "distinguished": null, "created_utc": 1627129844.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "FalconRelevant", "id": "h6dnlml", "score": -5, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "Not everyone hoards their wealth, Bill Gates spends a lot on philanthropy, Elen Musk has risked his entire fortune multiple times to start ventures that benefit humanity.", "is_submitter": true, "distinguished": null, "created_utc": 1627143778.0, "parent_id": "t1_h6cxuva", "replies": [{"author": "YLASRO", "id": "h6e3tku", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "billgates also lobbied against the covid vaccine beeing open source because itd hurt his profit margines. these people are not our friends. they are opposed to the working class even if they do some charity from tim to time. its emptry gestures when you realizes they could solve homlessness or worldhunger easily with the mindboggeling funds at their disposal. not to mention pay their workers better wages. all billionairs derrive their wealth from exploiting the workers by paying the minimum ammounto of wages they can get away with so that they can pocket most of the profits themselves and sink them into gambeling in the stockmarkets via large hedgefunds.\n\nall billionairs are where they are because they cheated others out of a fair share at some point or all points along the way.", "is_submitter": false, "distinguished": null, "created_utc": 1627151659.0, "parent_id": "t1_h6dnlml", "replies": []}]}, {"author": "R5Cats", "id": "h6fqkrd", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "Invest 100 million into a project, get a reasonable return? Repeat for 50 years. That's how. \n\nIf they dissipated their wealth? It would simply be gone, the jobs would vanish and thousands would be unemployed. Nice!\n\nRaising wages lowers profits, ending businesses (especially small business!) and they either shutter or move overseas. Then what have you gained? (Hint: it's a negative number) \n\nOnly a small % of people actually earn minimum wage. It isn't supposed to be a \"living wage\" it's for *entry-level jobs* duh!", "is_submitter": false, "distinguished": null, "created_utc": 1627183348.0, "parent_id": "t1_h6cxuva", "replies": [{"author": "YLASRO", "id": "h6g4sxx", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Not true. The rich arent the only people who can create jobs. Look up workers coops. Also: jeff bezos giving up half his fortune to increase wages and benefits of his near-slave workers wont let amazon go under. Its not like hes taking that money out of amazons budget.\n\nBillionairs are not essential to an economy. Germany is proof of this. And minimum wage does not collapse econonys either. Europe has plebty of minimum wage laws and we arent living in ruins with soaring unemployment.\n\nAlso: if a buisness cant pay minimum wage then the buisness isnt viable. A buisness should be able to pay minimum wage to be viable. If the only way you can keep the lights on is by giving unfair wages then your buisness shouldn't exist and be replaced vy a viable one. \n\nAgain: billionairs are not your friends. Them becoming less rich is not to our detriment.", "is_submitter": false, "distinguished": null, "created_utc": 1627193343.0, "parent_id": "t1_h6fqkrd", "replies": [{"author": "R5Cats", "id": "h6hmi0f", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "It is true, the middle class and small businesses create the most jobs. However? Huge businesses can do things that small business cannot. Weather it's 1 rich owner or pooled resources (investment or retirement funds) doesn't matter all that much.  \nOnly a small % of people make minimum wage, it was never intended to be a \"living wage\" at all. It's an entry-level wage that prevents exploitation of the young people entering the workforce with no job experience.   \n\nOnce \"they\" take all the money away from the billionaires, then the millionaires, who will be next? And after that?", "is_submitter": false, "distinguished": null, "created_utc": 1627231491.0, "parent_id": "t1_h6g4sxx", "replies": [{"author": "YLASRO", "id": "h6hpbur", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Except thats not at all what minimum wage is. Minimum wage is not just for entrylevel people. There is shittons ov valid and relevant jobs that are stuck at minimum wages firever like cashiers. Also alot of handicapped people are relegated to only be able to work basic jobs that never pay beyond minimum wage.\n\nIf minimum wage usnt livable wage its actively cruwl and sabotaging the geberationally poor and weak.\n\nAlso: the german model of the mittelstand disproves the idea rhat large industry is nessecary for a large modern industry.\n\nTo answer that last question: its less about the ammount of money its more about class, ownership and power. The fact that people who have all 3 if these are also rich is the result of this system beeing rigged for them.\n\nSo the main point of attack is not wealth itself. Its the reasons why this wealth exists. Sole ownership, dictatorlike control, and generational wealth and pampering of the rich by the state.\n\nThis problem isnt just about numbers. Its about systemic disease.", "is_submitter": false, "distinguished": null, "created_utc": 1627232853.0, "parent_id": "t1_h6hmi0f", "replies": []}]}]}]}]}, {"author": "ciaomoose", "id": "h6f25u5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Whether or not the money is “hard assets” is entirely irrelevant. The person has access to resources/power/influence proportional to their valuation. Which, at $1B is absolutely insane. No individual is personally capable of adding that much value to society legitimately. Not to mention it is *extremely implausible* for any person to accumulate such wealth via ethical means, even if we give them the benefit of the doubt and assume they’re a once-in-a-lifetime super-genius (a generous assumption).", "is_submitter": false, "distinguished": null, "created_utc": 1627169386.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "CamelBorn", "id": "h6cu7h5", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #186", "submission": "oqnmu7", "stickied": false, "body": "A billion seconds is 31 years, 9 weeks.\n\nA million seconds is 11 days 13 hours.\n\nNo one should be a billionaire", "is_submitter": false, "distinguished": null, "created_utc": 1627127143.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "Kelyaan", "id": "h6d9n94", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "oqnmu7", "stickied": false, "body": "That didn't seem right when I first read it but fuck it actually is", "is_submitter": false, "distinguished": null, "created_utc": 1627136881.0, "parent_id": "t1_h6cu7h5", "replies": [{"author": "CamelBorn", "id": "h6dtttm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #186", "submission": "oqnmu7", "stickied": false, "body": "Yes, the actual difference is massive", "is_submitter": false, "distinguished": null, "created_utc": 1627146778.0, "parent_id": "t1_h6d9n94", "replies": [{"author": "R5Cats", "id": "h6fqt5c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "Like... 1000 times!", "is_submitter": false, "distinguished": null, "created_utc": 1627183494.0, "parent_id": "t1_h6dtttm", "replies": []}]}]}, {"author": "Alatain", "id": "h6f925v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "oqnmu7", "stickied": false, "body": "This means that you could make $3,600 dollars an hour and it would still take you over 31 years to make a cumulative one billion dollars.\n\n-Edit- And that is if you were working 24/7. If you were working 8 hours a day, 7 days a week, it would take over 90 years.", "is_submitter": false, "distinguished": null, "created_utc": 1627173236.0, "parent_id": "t1_h6cu7h5", "replies": []}]}, {"author": "shig23", "id": "h6dp0do", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "oqnmu7", "stickied": false, "body": "When you hear about billions of dollars in conjunction with billionaires, it’s generally about how much they *have.* \n\nWhen you hear it regarding governments, it’s about how much they *spend.* \n\nGovernments use wealth to accomplish things, like health care and space programs. With billionaires, it just sits there, accruing more wealth.", "is_submitter": false, "distinguished": null, "created_utc": 1627144454.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "FalconRelevant", "id": "h6dqc3d", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "Exactly, so we agree that we should be blaming the government for our problems instead of billionaires?", "is_submitter": true, "distinguished": null, "created_utc": 1627145092.0, "parent_id": "t1_h6dp0do", "replies": [{"author": "shig23", "id": "h6drn47", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "oqnmu7", "stickied": false, "body": "How is this an either/or question to you? It’s the government that set the policies that allowed the billionaires to remove most of the world’s wealth from the economy and just sit on it. Government is a tool, and right now it’s being used by the moneyed classes to benefit themselves.", "is_submitter": false, "distinguished": null, "created_utc": 1627145724.0, "parent_id": "t1_h6dqc3d", "replies": []}]}, {"author": "AlternativeMint", "id": "h6dreoy", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oqnmu7", "stickied": false, "body": "Like health care, US government is one of the top countries of the world in health care spending vs GDP. And so far all they accomplished making insurance companies and medical providers more rich.\n\n100% private systems with free market work way better at zero cost for the tax-payer.\n\nSpace programs, ask Bezos, Richard Garriot or Elon Musk, they are able to do better than NASA in a lot of aspects nowadays at a fraction of the cost.", "is_submitter": false, "distinguished": null, "created_utc": 1627145610.0, "parent_id": "t1_h6dp0do", "replies": [{"author": "shig23", "id": "h6ds0m9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "oqnmu7", "stickied": false, "body": "> 100% private systems with free market work way better at zero cost for the tax-payer.\n \nWhat does that mean? Better in what way?", "is_submitter": false, "distinguished": null, "created_utc": 1627145904.0, "parent_id": "t1_h6dreoy", "replies": [{"author": "AlternativeMint", "id": "h6dt66t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oqnmu7", "stickied": false, "body": "Any private system, like, for example, food industry is based into competence among different business. That makes them more efficient and offering better prizes and advantages for the user.\n\nI don't know who thought spending 17% of the GDP and throwing it into the medical systems was a good idea at all. Based in the current state of healthcare systems it looks like a joke.\n\nIn my country is not much better, I am paying public health 3 times. First by high taxes, to receive nothing. 10 days waiting for a general practitioner consult. For a public specialist you have to wait months. So I pay a private assurance company. And the 3rd time I am paying is taxes, VAT and others for spending my money on private health.\n\nThe system is broken. And it feeds on people asking for more public expense.", "is_submitter": false, "distinguished": null, "created_utc": 1627146460.0, "parent_id": "t1_h6ds0m9", "replies": [{"author": "olkver", "id": "h6gcm3t", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #279 | Legio Virtus", "submission": "oqnmu7", "stickied": false, "body": "Sounds like Sweden", "is_submitter": false, "distinguished": null, "created_utc": 1627200031.0, "parent_id": "t1_h6dt66t", "replies": [{"author": "AlternativeMint", "id": "h6gdd01", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oqnmu7", "stickied": false, "body": "Sweden is doomed, but it is not the worst yet...", "is_submitter": false, "distinguished": null, "created_utc": 1627200705.0, "parent_id": "t1_h6gcm3t", "replies": []}]}]}]}]}]}, {"author": "Paul_Thrush", "id": "h6dlnux", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": "It's immoral to be a billionaire. Their gains are ill-gotten and at the suffering of others. You've been deluded into thinking \"they deserve it\" because \"they work hard.\" They influence the media and distort the message you get. You're buying into their propaganda.", "is_submitter": false, "distinguished": null, "created_utc": 1627142841.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "FalconRelevant", "id": "h6dn5vs", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "Depends on the billionaire in question, and luck plays a big part, yes, and some really have made money by exploiting people. To make blanket statements however is a bit too much, and the last sentence makes you sound like a conspiracy nut.", "is_submitter": true, "distinguished": null, "created_utc": 1627143570.0, "parent_id": "t1_h6dlnux", "replies": [{"author": "Paul_Thrush", "id": "h6dp780", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "oqnmu7", "stickied": false, "body": ">the last sentence makes you sound like a conspiracy nut.\n\nYou are very under-informed. The last sentence is just true. Bezos owns the Washington Post, Murdoch owns Fox. Other wealthy people get interviewed regularly or contribute money to think tanks that publish articles pushing the propaganda of the rich. It's their one fucking job. They don't make profits, they live off the contributions of their patreons.", "is_submitter": false, "distinguished": null, "created_utc": 1627144545.0, "parent_id": "t1_h6dn5vs", "replies": [{"author": "FalconRelevant", "id": "h6dq4pq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "All that means is that they avoid saying anything bad about their owners, and promote their views when possible. There isn't any united effort to make all billionaires look good in eyes of the general public.", "is_submitter": true, "distinguished": null, "created_utc": 1627144994.0, "parent_id": "t1_h6dp780", "replies": []}]}]}, {"author": "AlternativeMint", "id": "h6dqsgd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "oqnmu7", "stickied": false, "body": "Each passing day the federal reserve is creating billions out of nothing and handling them to banks and friends alike.\n\nInmoral, who?", "is_submitter": false, "distinguished": null, "created_utc": 1627145310.0, "parent_id": "t1_h6dlnux", "replies": []}]}, {"author": "zephyrsong888", "id": "h6d4bre", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #140", "submission": "oqnmu7", "stickied": false, "body": "Humans aren't designed to operate on numbers this large.  The fact that people can abstract it to work with it means they have devalued the individual in order to work with larger sums more directly. Billionaires can't understand what $30 is and be a successful billionaire.", "is_submitter": false, "distinguished": null, "created_utc": 1627133936.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h6ejdhn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oqnmu7", "stickied": false, "body": "It's just \"Sour Grapes.\"\n\n>One afternoon a fox was walking through the forest and spotted a bunch of grapes hanging from over a lofty branch.\n\n>“Just the thing to quench my thirst,” he thought.\n\n>Taking a few steps back, the fox jumped and just missed the hanging grapes. Again the fox took a few paces back and tried to reach them but still failed.\n\n>Finally, giving up, the fox turned up his nose and said, “They’re probably sour anyway,” and proceeded to walk away.\n\n>Moral: It’s easy to despise what you cannot have.  Nothing comes easy without a hard work.  So, Work Hard and reach your goals.", "is_submitter": false, "distinguished": null, "created_utc": 1627159524.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "areyouseriousdotard", "id": "h6d1cmp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "oqnmu7", "stickied": false, "body": "I feel sorry for them.  They are not role models.  They are not even mentally well...\n\nhttps://www.cnbc.com/2019/04/08/the-science-behind-why-so-many-successful-millionaires-are-psychopaths-and-why-it-doesnt-have-to-be-a-bad-thing.html\n\nhttps://www.psychologytoday.com/us/blog/dangerous-ideas/201910/psychology-s-dark-triad-and-the-billionaire-class\n\nhttps://xlauren-mx.medium.com/yes-billionaires-are-sociopaths-54daf719387b", "is_submitter": false, "distinguished": null, "created_utc": 1627132125.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "Kelyaan", "id": "h6d9j3a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "oqnmu7", "stickied": false, "body": ">A billion isn't really that much.\n\nCompletely subjective. A billion to a homeless person is an unfathomable amount, A Billion to me is generational changing amounts.  \n\n\nJust because a billion isn't that much to you does not make it so for everyone.", "is_submitter": false, "distinguished": null, "created_utc": 1627136819.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "FalconRelevant", "id": "h6dljgm", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "It's not much to governments, who people should be blaming for their problems.", "is_submitter": true, "distinguished": null, "created_utc": 1627142782.0, "parent_id": "t1_h6d9j3a", "replies": [{"author": "Kelyaan", "id": "h6dpwsi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "oqnmu7", "stickied": false, "body": "Again - Completely subjective.", "is_submitter": false, "distinguished": null, "created_utc": 1627144887.0, "parent_id": "t1_h6dljgm", "replies": [{"author": "FalconRelevant", "id": "h6dqrwb", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "The fact that even if you take Bezos's entire fortune it wouldn't fund the US military for even half an year is not really a subjective fact. If you want to complain about not having money for healthcare, then do it to the government, not private individuals who struck gold.", "is_submitter": true, "distinguished": null, "created_utc": 1627145303.0, "parent_id": "t1_h6dpwsi", "replies": [{"author": "Kelyaan", "id": "h6duwio", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "oqnmu7", "stickied": false, "body": "You're not good at this are you, the fallacies you spout out constantly in your posts amuses the fuck out of me.  \n\n\nAvoid the red herring bullshit.  \n\n\nIt is a factual statement that this is completely subjective.", "is_submitter": false, "distinguished": null, "created_utc": 1627147294.0, "parent_id": "t1_h6dqrwb", "replies": [{"author": "R5Cats", "id": "h6fr465", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "Are you claiming Bezos's fortune can fund the US Military for longer than 1 year then?  \nShow me the math!  \n\nHint: you are wrong. And Bezos employs thousands of people, as does the US Military btw. What happens when you cut the head off a snake?  \n- The snake is healthier  \n- The snake dies \n\nIt's literally that simple. Unless you believe the US Government is *better at handling money* than the Billionaires? 🙄", "is_submitter": false, "distinguished": null, "created_utc": 1627183690.0, "parent_id": "t1_h6duwio", "replies": [{"author": "Kelyaan", "id": "h6fsfgq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "oqnmu7", "stickied": false, "body": ">Are you claiming Bezos's fortune can fund the US Military for longer than 1 year then?  \n>  \n>Show me the math!\n\nEither you replied to the wrong person or you're trying to red herring as I didn't claim that at all.  \n\n\n>It's literally that simple. Unless you believe the US Government is better at handling money than the Billionaires?\n\nAgain did you reply to the wrong person as I never mentioned anything like that.  \n\n\nIf you did mean to reply to me than this is just a huge red herring and has nothing to do with what I said.", "is_submitter": false, "distinguished": null, "created_utc": 1627184517.0, "parent_id": "t1_h6fr465", "replies": [{"author": "R5Cats", "id": "h6fufkm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "You claimed what the OP said are fallacies, thus I replied to the correct person.   \nOP: if you take Bezos's entire fortune it wouldn't fund the US military for even half an year  \nYou: the fallacies you spout & etc.\n\nNice try. Any honest reply now?", "is_submitter": false, "distinguished": null, "created_utc": 1627185811.0, "parent_id": "t1_h6fsfgq", "replies": [{"author": "Kelyaan", "id": "h6hes8d", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "oqnmu7", "stickied": false, "body": "Oh so you did mean it - Ok then yeah your reply is a hella red herring.  \n\n\nThe fallacy claim is completely factual and so is the claim of a red herring.  \n\n\nNice try. Want to make a real response that doesn't rely on fallacious arguments to try and make an incorrect post?", "is_submitter": false, "distinguished": null, "created_utc": 1627227738.0, "parent_id": "t1_h6fufkm", "replies": []}]}]}]}]}]}]}, {"author": "dcnairb", "id": "h6g1fe2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "You aren’t required to only blame one or the other… most people blaming billionaires are blaming both", "is_submitter": false, "distinguished": null, "created_utc": 1627190706.0, "parent_id": "t1_h6dljgm", "replies": [{"author": "FalconRelevant", "id": "h6g3978", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "Why blame billionaires though?", "is_submitter": true, "distinguished": null, "created_utc": 1627192104.0, "parent_id": "t1_h6g1fe2", "replies": [{"author": "dcnairb", "id": "h6g46qz", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oqnmu7", "stickied": false, "body": "Show me billionaires, who have earned an average of more than $1000/minute throughout the course of their lifetime, who have gotten to where they are ethically and without exploiting any legal loopholes or anything of the like. These billionaires are part of the problem because their hoarding of wealth actively worsens the income gaps at the expensive of the lowest workers they exploit to do so, and they try their damndest to avoid all the taxes and fees they can because they care about profit above all else\n\nThey are to blame because they are actively perpetuating and creating problems in society, exploiting workers, and breaking laws to increase their already-unimaginable wealth. it’s reprehensible and I have no problems blaming them for the problems they contribute to", "is_submitter": false, "distinguished": null, "created_utc": 1627192845.0, "parent_id": "t1_h6g3978", "replies": []}]}]}]}]}, {"author": "TheCanadianGame", "id": "h6ddrcz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "I think objectively, it's really difficult to visualize numbers.\n\nRegardless, if someone has accomplished the task of accumulating that much wealth, that person is pretty based", "is_submitter": false, "distinguished": null, "created_utc": 1627139021.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "germz80", "id": "h6d1z8b", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "oqnmu7", "stickied": false, "body": "I don't get people who hate Bill Gates and Elon Musk for being so wealthy. They've given tons of their money to good causes; not all but a huge portion.\n\nI would like to see more money taxed from millionaires. All that said, I think a lot of people misunderstand the implications of a wealth tax: if the CEO owns millions in shares of their company, do you want them to sell those shares in order to pay taxes? People seem to demonize paying CEOs in shares, but I think it is potentially a bad deal for them if they mess up, and I think it makes sense for them to have such a large incentive to make the company do well. I think it also makes sense when companies give employees rebates on buying their stocks, good incentives to make the company profitable.\n\nI think we need government-funded healthcare in the US like what works so well in so many other countries. If the government can ensure that people have healthcare, housing, food, education, etc, then the wealth gap probably doesn't really matter because everyone has what they need and aren't setting up go-fund-me campaigns to pay medical bills.", "is_submitter": false, "distinguished": null, "created_utc": 1627132516.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "R5Cats", "id": "h6frbyx", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "Sadly, this is the LEAST intelligent discussion I've seen in my brief time here in The Tree.  \nEdit: NOT the fault of the OP! Just thought I'd add that, and props for the \"wrong tree\" reference 😁 \n\nBillionaires are not \"evil\" they're just rich. It's their *after taxes* money. Their money, not yours, not the government's, theirs. They invested wisely and got rich, or their ancestors did, is that a crime? After taxes!\n \nGovernments spend TRILLIONS every year, of YOUR money. Foolishly, with graft and corruption you cannot even imagine. Ok? Deal with reality.", "is_submitter": false, "distinguished": null, "created_utc": 1627183826.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "JPZV", "id": "h6d5r1q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "Well, for me, a Spanish speaker, a [billion](https://manuherran.com/wp-content/uploads/2018/04/numbers-million-billion-trillion.png) (*Billón* in Spanish) is a lot.", "is_submitter": false, "distinguished": null, "created_utc": 1627134756.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "AndrewIsOnline", "id": "h6dgq1f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "oqnmu7", "stickied": false, "body": "Where image?", "is_submitter": false, "distinguished": null, "created_utc": 1627140466.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "DylanowoX", "id": "h6dnlh7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #10", "submission": "oqnmu7", "stickied": false, "body": "https://www.reddit.com/r/dataisbeautiful/comments/o81xjc/wealth_inequality_shown_to_scale_a_rare_sight_not/?utm_source=share&utm_medium=ios_app&utm_name=iossmf go crazy", "is_submitter": false, "distinguished": null, "created_utc": 1627143776.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "TommyWiseau22", "id": "h6e89mg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "oqnmu7", "stickied": false, "body": "fugg yeah gimme a billion dollars.", "is_submitter": false, "distinguished": null, "created_utc": 1627153876.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "R5Cats", "id": "h6hqees", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "[Here you go!](https://static.standard.co.uk/s3fs-public/thumbnails/image/2015/06/12/10/Zimbabwe-dollar.jpg) Keep the change eh? 😊", "is_submitter": false, "distinguished": null, "created_utc": 1627233371.0, "parent_id": "t1_h6e89mg", "replies": [{"author": "TommyWiseau22", "id": "h6hqzqe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "oqnmu7", "stickied": false, "body": "thank you i am now a billionaire. take that weebs.", "is_submitter": false, "distinguished": null, "created_utc": 1627233652.0, "parent_id": "t1_h6hqees", "replies": []}]}]}, {"author": "Rhobulis", "id": "h6ecbbi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #246", "submission": "oqnmu7", "stickied": false, "body": "Well if it's so small, could I trouble you for a small loan of a billion dollars?", "is_submitter": false, "distinguished": null, "created_utc": 1627155934.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "FalconRelevant", "id": "h6g3ejd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "oqnmu7", "stickied": false, "body": "It's small for governments is what I'm saying.", "is_submitter": true, "distinguished": null, "created_utc": 1627192217.0, "parent_id": "t1_h6ecbbi", "replies": []}]}, {"author": "theawesomenachos", "id": "h6eyg5v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqnmu7", "stickied": false, "body": "insert that tom scott video about a million vs a billion here", "is_submitter": false, "distinguished": null, "created_utc": 1627167368.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "Barisaxgod", "id": "h6eyk1c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #57", "submission": "oqnmu7", "stickied": false, "body": "I could hear this argument for a million, but it’s a ridiculous assertion for a billion. Tom Scott did a really good visualization of how different they are that I would highly recommend. With a billion dollars, you could live very comfortably ($200k a year) for five thousand years. The US does spend too much on the military, and some of those funds would probably be better used elsewhere, but that doesn’t mean that we shouldn’t also worry about the massive wealth inequality in the world.", "is_submitter": false, "distinguished": null, "created_utc": 1627167427.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "Alatain", "id": "h6fapjp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "oqnmu7", "stickied": false, "body": "At my current, very comfortable middle-class lifestyle, it would take me over 11,000 years to spend a billion dollars.\n\nA billion to an average citizen is most certainly more than they would ever need. It would not be a problem if all their wealth were reinvested into something that benefits humanity, but it is not. Their need to have a lavish lifestyle ties up massive amounts of money every year that has nothing to do with their importance to society. Bezos alone spent 165 million dollars on one residence. That alone would fund a modest lifestyle for over 1800 years. Then he bought another adjacent property for another 10 million. \n\nAnd that's not even going off of the average income of Americans. Those figures are for almost triple the average income in the US. If he lived anything even close to an average life, it would be a different story. But billionaires do not live a life anywhere close to what 99% of the planet could even really dream.", "is_submitter": false, "distinguished": null, "created_utc": 1627174171.0, "parent_id": "t3_oqnmu7", "replies": [{"author": "R5Cats", "id": "h6hq242", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "oqnmu7", "stickied": false, "body": "Are you blaming him for not spending money... then blaming him for spending money?  \nHis house just built itself? No workers were hired, no products purchased, the money never went back into the economy?   \n\nYes rich people live a fabulous lifestyle, it's the perks of being rich! If he gave away 10 billion to all Americans? They'd each get $30 (and the gov't would want to tax that, I'm sure). That would provide a brief spark in the economy, but not much else.", "is_submitter": false, "distinguished": null, "created_utc": 1627233208.0, "parent_id": "t1_h6fapjp", "replies": [{"author": "Alatain", "id": "h6hrwmx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "oqnmu7", "stickied": false, "body": "The problem is not with how he uses or does not use his money. The problem is with how he got it and how he continues to get it. The current system is set up to exploit people working for you by paying them literally as little as you can get away with and then funnel as much of the profits they make you up to the people at the top. \n\nAgain, his level of wealth is unimaginably unequal compared with what he pays his employees. My estimation above that I could live at my current level for 11,000 years was for *one* billion dollars. Bezos has 200 times that in wealth and is still collecting more. At some point you should really just stop trying to milk more money out of the system and start paying your workers a decent wage. He could literally stop collecting profits from his companies and he would still be able to spend 4 billion dollars a year for the next 50 years on what he has accumulated so far. \n\nTo put it into context, he could spend more than I would make in 44,000 years, every year until he dies and he still is nickeling and diming his workers to minimize their profits and maximize his. That is just pure greed.", "is_submitter": false, "distinguished": null, "created_utc": 1627234090.0, "parent_id": "t1_h6hq242", "replies": []}]}]}, {"author": "areyouseriousdotard", "id": "h6g1ph5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "oqnmu7", "stickied": false, "body": "The common good vs individualism speaks for itself and really should not have to be explained.", "is_submitter": false, "distinguished": null, "created_utc": 1627190917.0, "parent_id": "t3_oqnmu7", "replies": []}, {"author": "MysticTheMeeM", "id": "h6dkyu0", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Druid #16", "submission": "oqnmu7", "stickied": false, "body": "A billion isn't much, but it's a lot more than most of us will ever get.\n\nWith that in mind, the fact that a billion isn't much should speak more about average wealth. If the richest are so rich that a level of wealth that is nigh unobtainable for average people is considered \"not much\", then there's probably a problem somewhere.", "is_submitter": false, "distinguished": null, "created_utc": 1627142506.0, "parent_id": "t3_oqnmu7", "replies": []}]}