{"title": "What is your opinion of Warhammer 40,000 universe compared to Star Wars or Star Trek? Not talking about the table-gaming hobby, just the setting.", "name": "t3_p2aoby", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p2aoby/what_is_your_opinion_of_warhammer_40000_universe/", "selftext": "It is the 41^st millennium. For more than a hundred centuries the Emperor has sat immobile on the Golden Throne of Earth. He is the master of mankind by the will of the gods, and master of a million worlds by the might of his inexhaustible armies. He is a rotting carcass writhing invisibly with power from the Dark Age of Technology. He is the Carrion Lord of the Imperium for whom a thousand souls are sacrificed every day, so that he may never truly die.\n\nYet even in his deathless state, the Emperor continues his eternal vigilance. Mighty battlefleets cross the daemon-infested miasma of the warp, the only route between distant stars, their way lit by the Astronomican, the psychic manifestation of the Emperor’s will. Vast armies give battle in his name on uncounted worlds. Greatest amongst His soldiers are the Adeptus Astartes, the Space Marines, bio-engineered super-warriors. Their comrades in arms are legion: the Astra Militarum and countless planetary defence forces, the ever-vigilant Inquisition and the tech-priests of the Adeptus Mechanicus to name only a few. But for all their multitudes, they are barely enough to hold off the ever-present threat from aliens, heretics, mutants – and worse.\n\nTo be a man in such times is to be one amongst untold billions. It is to live in the cruellest and most bloody regime imaginable. These are the tales of those times. Forget the power of technology and science, for so much has been forgotten, never to be re-learned. Forget the promise of progress and understanding, for in the grim dark future there is only war. There is no peace amongst the stars, only an eternity of carnage and slaughter, and the laughter of thirsting gods.", "score": 0, "upvote_ratio": 0.42, "permalink": "/r/TheFlyingTree/comments/p2aoby/what_is_your_opinion_of_warhammer_40000_universe/", "id": "p2aoby", "author": "FalconRelevant", "link_flair_text": "Discussion", "num_comments": 27, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1628679143.0, "comments": [{"author": "Zealousideal_Mix_629", "id": "h8irpeg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p2aoby", "stickied": false, "body": "The starwars prequel are probably the most realistic with the senate and  treaties. The movies from the 70's are just wish fulfillment. Star Trek is impossible. Warhammer has cool character design, but also unrealistic for the exact opposite reason as Startrek. Startrek is overy optimistic and 40k pessimistic. Politics in the future will most likey be like Politics have always been, kind of boring.", "is_submitter": false, "distinguished": null, "created_utc": 1628680170.0, "parent_id": "t3_p2aoby", "replies": [{"author": "areyouseriousdotard", "id": "h8iu0qp", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "p2aoby", "stickied": false, "body": "That's great think.\n\nWarhammer is worst case scenario, star trek best case scenario and star wars is most likely.\n\nI like the Fallout universe because I don't think we are getting off this rock before we destroy it.", "is_submitter": false, "distinguished": null, "created_utc": 1628681826.0, "parent_id": "t1_h8irpeg", "replies": [{"author": "Zealousideal_Mix_629", "id": "h8iujja", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p2aoby", "stickied": false, "body": "When thinking about the future I like to look at the past because you know the old saying \"learn your history or you're doomed to repeat it.\"\n\n If you look at Julius Caesar's journals about the goddess wars the same political shit that was going on back then is going on today.  And I think back to the 1400s in the age of sail. I think we're very close to getting off of this planet but it's not gonna be pretty. There will be a rush to grab anything that's valuable within a reasonable distance.  And morality will go out the window in the name of profits.", "is_submitter": false, "distinguished": null, "created_utc": 1628682179.0, "parent_id": "t1_h8iu0qp", "replies": []}, {"author": "TopHatGuy413", "id": "h8lj6c6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #18", "submission": "p2aoby", "stickied": false, "body": "If we ever do become a spacefaring civilization, I agree with you thinking that a Stars Wars style future will be most likely. It'll probably be a more low-tech, less fantastical version of Star Wars though, which is basically Firefly.", "is_submitter": false, "distinguished": null, "created_utc": 1628725091.0, "parent_id": "t1_h8iu0qp", "replies": []}]}, {"author": "FalconRelevant", "id": "h8irvsm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2aoby", "stickied": false, "body": "Warhammer is unrealistic because of the immaterium, overall it's not pessimistic considering that they have literal daemons and evil gods to deal with.\n\nI like the prequel trilogy of Star Wars too, it's better that the OT.", "is_submitter": true, "distinguished": null, "created_utc": 1628680303.0, "parent_id": "t1_h8irpeg", "replies": [{"author": "Zealousideal_Mix_629", "id": "h8isuk2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p2aoby", "stickied": false, "body": "It's not super familiar with 40 k's complete story so, forgive me if I get some details wrong. From what I saw 40K is about human stagnation due to war, and having to rely on technology from previous generations.  Just based off of that I'd say that right there, Is enough to take it out the running. \n\n There's one that often gets forgotten that I think is actually very realistic is Enders game, the first book, after that the series kind of gets nuts. It shows what humans are willing to do when faced with an outside threat.", "is_submitter": false, "distinguished": null, "created_utc": 1628681011.0, "parent_id": "t1_h8irvsm", "replies": []}]}, {"author": "FalconRelevant", "id": "h8iustu", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2aoby", "stickied": false, "body": "I don't like how in Star Trek they refuse to have a proper military fleet even though there are so many threats that they have to face.", "is_submitter": true, "distinguished": null, "created_utc": 1628682350.0, "parent_id": "t1_h8irpeg", "replies": [{"author": "Zealousideal_Mix_629", "id": "h8ivbci", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p2aoby", "stickied": false, "body": "I agree with you completely I mean if the romulans and Borg actually existed,  Humans would be actively trying to get rid of them.", "is_submitter": false, "distinguished": null, "created_utc": 1628682683.0, "parent_id": "t1_h8iustu", "replies": [{"author": "FalconRelevant", "id": "h8ivgwy", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2aoby", "stickied": false, "body": "Also, Vulcans tend to be bigots.", "is_submitter": true, "distinguished": null, "created_utc": 1628682785.0, "parent_id": "t1_h8ivbci", "replies": [{"author": "Zealousideal_Mix_629", "id": "h8ivlhg", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p2aoby", "stickied": false, "body": "That's one of the few realistic things in Star Trek.", "is_submitter": false, "distinguished": null, "created_utc": 1628682868.0, "parent_id": "t1_h8ivgwy", "replies": []}]}]}]}]}, {"author": "DragonFromHell", "id": "h8ivkld", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #22", "submission": "p2aoby", "stickied": false, "body": "In 40k, the Inquisition's use of authoritarian force is actually justified, given the reality destroying daemons and the people they corrupt. Better treat people as guilty until proven innocent, rather than letting men, women and children be flayed alive by horrors that feed on pain.\n\nIn Star Wars, the Empire is authoritarian just for the sake of control. I wish there was more depth to it, but the writing works well from the rebels' perspective, so that doesn't really need to change.", "is_submitter": false, "distinguished": null, "created_utc": 1628682853.0, "parent_id": "t3_p2aoby", "replies": []}, {"author": "YLASRO", "id": "h8j3h7t", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2aoby", "stickied": false, "body": "well 40k is the preferrable setting if you wanna have a weapon from that setting. however starwars is the preferrable setting if you wanna live in it.", "is_submitter": false, "distinguished": null, "created_utc": 1628687438.0, "parent_id": "t3_p2aoby", "replies": [{"author": "FalconRelevant", "id": "h8jcu12", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2aoby", "stickied": false, "body": "I think Star Trek would make for a better living experience.", "is_submitter": true, "distinguished": null, "created_utc": 1628691921.0, "parent_id": "t1_h8j3h7t", "replies": [{"author": "YLASRO", "id": "h8jlrr0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2aoby", "stickied": false, "body": "oh right i overlooked startrek inthere", "is_submitter": false, "distinguished": null, "created_utc": 1628695748.0, "parent_id": "t1_h8jcu12", "replies": []}]}]}, {"author": "Prior_Technology_868", "id": "h8ivqsp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p2aoby", "stickied": false, "body": "Its coolwr", "is_submitter": false, "distinguished": null, "created_utc": 1628682964.0, "parent_id": "t3_p2aoby", "replies": []}, {"author": "dashingThroughSnow12", "id": "h8iy139", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p2aoby", "stickied": false, "body": "I'll start with Warhammer Fantasy. I don't particularly like the grimdark style of story-telling and world building. Fantasy is a purer example of this but 40K suffers from this too.\n\nNorscans live in a frozen wasteland that tries to kill them. And they try to kill eachother. Irregularly go down south to the Empire and regularly to Kislev to kill a bunch of them and have a bunch of themselves die. Often on the order of tens of thousands to hundreds of thousands.\n\nKislev and its cities gets sacked 200 years before the End Times. Northern raiders, trolls, vampires, and goblins fill in the power vaccum. Somehow, by the End Times, Kislev is actually in the upward trajectory.\n\nSkaven have millions (billions?) die in some campaigns. Still ever present. Demons and chaos spawn number in the hundreds of thousands in some battles. And die. Still ever present. I can understand this, it is justifiable. What is odd is how there are still men, dwarves, and elves around to keep killing them. After awhile, death rates eclipsing birth rates mean the populace will die out.\n\nSpeaking of which, Mannfred, Settra, and Nagash can sustain constant fighting for days because they can seemingly perpetually resurrect their troops. \n\nMorghur. Morghur. Apparently everything the guy touches is permanently tainted and cannot be purified? Including the path he walks? He spends three millenia alive and moving about. I don't care how big the Empire or Athel Loren is, the place would be a chaos waste before the point they finally find a way to actually kill Morghur and purify the corruption. Apparently beastman regularly go crazy or have their bodies break at the mere sight of him? How do common wood elves or men in an opposing army survive? How do his own troops survive?\n\nAnything that levels the field, say magic or elite troops that kill thousands regularly each, makes the regular gigantic size of the battles vestigial.\n\nSome people like the gigantic, gory battles in grimdark stories. How even after one massacre, the next one is just the next corner over. How planets or cities or empires get sacked, later win, and just in time have to do it all over with even bigger odds against them. To me this all is severely immersion breaking.", "is_submitter": false, "distinguished": null, "created_utc": 1628684397.0, "parent_id": "t3_p2aoby", "replies": []}, {"author": "dashingThroughSnow12", "id": "h8j0mo5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p2aoby", "stickied": false, "body": "I did a big comment. I'll actually answer the question now.\n\nStar Trek > Star Wars > 40K.\n\nStar Wars is an odd duckling. In the backdrop, the empire or republic comprises thousands of worlds. Yet somehow the fate of battles and the galaxy rests in the hands of a half dozen people and their conflict. (Vader, Palpatine, Leia, Luke, Han Solo, and Chewbacca in the original trilogy.)\n\nWhen one just looks at the story being presented, it is pretty good. But Star Wars does not lend itself to deep inspection. Some stories are best off as a single movie/book or small series. Where adding to it compromises the foundation.\n\nBecause of how Star Trek is set up, they do have longevity. The federation is 350 member species with a number of planets (puny compared to SW's thousands and 40Ks millions). They don't have that many battleships, or galaxy cruising ships, and usually our ship of the series is the flagship of the entire fleet or at least the most cutting edge. This helps scope the adventure; it isn't odd that this one ship experiences so many odd events because from the very beginning the ship is marked as being a novelty in its own world.\n\nOur ship of focus in a particular series is often on an exploration game. They help ships that send out distress beacons, they investigate strange planets and nebula, they \"boldly go where no one has gone before\", they may participate in wars but we are shown they aren't the sole combatants, etcetera. Because the stakes on most episodes or movies is low, relative to the galaxy and federation, it gives the series more creative freedom and design space.", "is_submitter": false, "distinguished": null, "created_utc": 1628685900.0, "parent_id": "t3_p2aoby", "replies": []}, {"author": "Kelyaan", "id": "h8j1pq2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p2aoby", "stickied": false, "body": "40k universe is too Grimderp, It's got to a point where it is no longer grimdark, it's just torture porn levels of violence and death with little to keep it in the genre it wants to be. Not to mention the face no one sticks to the canon when it comes to power in that bloody universe.", "is_submitter": false, "distinguished": null, "created_utc": 1628686496.0, "parent_id": "t3_p2aoby", "replies": [{"author": "Insominus", "id": "h8jh223", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #282", "submission": "p2aoby", "stickied": false, "body": "I find 40k very *thematically* interesting but I gotta agree, as someone who reads a lot of the books, a solid 70% of the actual nitty-gritty of the universe is just bolter porn and could be summarized as:\n\n*good guy kills bad guy*\n\n*bad guy kills good guy (gory)*\n\nDon’t get me wrong, I’m still sticking around for the other stuff (the character writing is usually done well, for example), but there’s only so many ways you can write about a contingent of space marines turning xenos scum into chopped hamburger with their guns.", "is_submitter": false, "distinguished": null, "created_utc": 1628693755.0, "parent_id": "t1_h8j1pq2", "replies": [{"author": "Kelyaan", "id": "h8jhook", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p2aoby", "stickied": false, "body": "Thematically it's good, I have a lot of the Black library book and some of them are great, A lot of them are just \"Bad guy kills thousands of people, single good guy kills bad guy\"  \n\n\nSpace marines make a lot of it so dull with their mary sue like aspects", "is_submitter": false, "distinguished": null, "created_utc": 1628694021.0, "parent_id": "t1_h8jh223", "replies": []}]}]}, {"author": "Immelmaneuver", "id": "h8jo1jt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #20", "submission": "p2aoby", "stickied": false, "body": "They're all super silly in their own ways.\n\nStar Trek is stupidly optimistic, but the history before everything getting utopian makes sense.  \n\n40k is excessive for the sake of being excessive but gets the inherent nihilism of such a universe just right, but would be better with a different Official Titles model than the dead horse that is latin.  \n\nStar Wars is comically unrealistic in so, so many ways and the single-biome planet schtick is nauseous, but gets the 'Religious Conflict Ruins Everything' cycle of history spot on \n\nWhat would be great is a 3-way crossover where the Jedi and Sith put aside their mutual genocidal tendencies to fight off the Imperium which just squished the Federation with it's linky toe, then the Tyrannids eat everything.", "is_submitter": false, "distinguished": null, "created_utc": 1628696705.0, "parent_id": "t3_p2aoby", "replies": [{"author": "FalconRelevant", "id": "h8jrh43", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "p2aoby", "stickied": false, "body": "The Federation's plot armour is too thick for even the grimdark warpfuckery to easily penetrate.", "is_submitter": true, "distinguished": null, "created_utc": 1628698130.0, "parent_id": "t1_h8jo1jt", "replies": []}]}, {"author": "Cognizant_Psyche", "id": "h8iuzl5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "p2aoby", "stickied": false, "body": "Honestly I think the WH40K universe is the most likely route humanity would take.  That is of course dependent on the condition of should we get off this rock in time before we doom ourselves and the existence of those “sci-fi” elements. If nothing else because of the religious fanaticism and eternal power struggle leading to untold destruction and warfare.\n\nFull disclosure though - I have a very superficial understanding of said franchise so I could be missing important details that would invalidate this, but it’s badass if nothing else.", "is_submitter": false, "distinguished": null, "created_utc": 1628682473.0, "parent_id": "t3_p2aoby", "replies": []}, {"author": "BuccaneerRex", "id": "h8j5k2p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p2aoby", "stickied": false, "body": "Eh. Never got into Warhammer. I have no opinions on the quality of the writing, as I never read it. The setting is appealing for grimdark, but I've always liked something a little bit nicer, or at least with a hopeful tone to the end.", "is_submitter": false, "distinguished": null, "created_utc": 1628688510.0, "parent_id": "t3_p2aoby", "replies": []}, {"author": "ssssssahshsh", "id": "h8junpq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p2aoby", "stickied": false, "body": "40k universe is more diverse in terms of lore, and has more \"blank\" spaces in the galaxy, which makes it way friendlier towards \"homebrewn\" content(unofficial content created by fans)such as custom armies, sectors, subfactions, etc than other two franchises.(in fact actively encourages creating it) It is also less consistent due to somewhat poor communication between authors of novels, codexes, short stories etc.", "is_submitter": false, "distinguished": null, "created_utc": 1628699491.0, "parent_id": "t3_p2aoby", "replies": []}, {"author": "TopHatGuy413", "id": "h8leum3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #18", "submission": "p2aoby", "stickied": false, "body": "I'm not too familiar with WH40K, but from what I know it sounds like a horrible universe to live in and that matches up with your description. Star Wars would also be a terrible universe to live in, but nowhere near as bad as WH40K. Star Trek seems like the complete opposite of WH40K in most respects and a much nicer universe.", "is_submitter": false, "distinguished": null, "created_utc": 1628723100.0, "parent_id": "t3_p2aoby", "replies": []}, {"author": "Abject_Hall7810", "id": "h8zvzym", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #176", "submission": "p2aoby", "stickied": false, "body": "It is the coolest shit I’ve ever seen. I’ve never done the deep dive, but will occasionally look up things about 40k and everything i find is just the coolest thing ever. Big fan of the chaos gods.", "is_submitter": false, "distinguished": null, "created_utc": 1629002832.0, "parent_id": "t3_p2aoby", "replies": []}]}