{"title": "The Future.", "name": "t3_ougq7l", "url": "https://www.reddit.com/r/TheFlyingTree/comments/ougq7l/the_future/", "selftext": "Do you look forward to it or do you dread it?\n\nWhat about future of civilization vs your personal future? How much different are they and what effect do they have on each other?\n\nWhat were your views of future in the past and how have they changed as it unfolded to the present?", "score": 8, "upvote_ratio": 0.79, "permalink": "/r/TheFlyingTree/comments/ougq7l/the_future/", "id": "ougq7l", "author": "FalconRelevant", "link_flair_text": "Discussion", "num_comments": 28, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1627633939.0, "comments": [{"author": "luciana_proetti", "id": "h729qfc", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "I am looking forward to my personal future. I am decently good at doing something I enjoy and can make money off it. What more could I ask from life. As far as civilization is concerned I think we all know that unless some messiah comes and undoes climate change, civilization as we know it is on borrowed time.", "is_submitter": false, "distinguished": null, "created_utc": 1627635655.0, "parent_id": "t3_ougq7l", "replies": [{"author": "FalconRelevant", "id": "h72ax9a", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "ougq7l", "stickied": false, "body": "Put me in-charge and I'll fix the trajectory in short order. Nationalize all the fossil-fuel industries, confiscate their assets and use that wealth to subsidize research into cheaper electric vehicles. Nuclear power plants and solar panels wherever you can put'em. Algae plants and aeroponic farms. Increase taxes on polluting industries and fund research into more greener methods.", "is_submitter": true, "distinguished": null, "created_utc": 1627636715.0, "parent_id": "t1_h729qfc", "replies": [{"author": "luciana_proetti", "id": "h72e8v6", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "That's also the sad part about it. People know what needs to be done to stop climate change but short term gain always wins against sustainable development.", "is_submitter": false, "distinguished": null, "created_utc": 1627639639.0, "parent_id": "t1_h72ax9a", "replies": []}, {"author": "theomniexperience", "id": "h779jrc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "If you were a billionaire or dictator of the world this might be possible. What you're proposing is the disruption of trillions of dollars (or more?) of current energy industries. \n\nI agree with you, but the oil industry would probably rather see the world die from climate change just to get more money.", "is_submitter": false, "distinguished": null, "created_utc": 1627739172.0, "parent_id": "t1_h72ax9a", "replies": []}, {"author": "metalhev", "id": "h7ey89b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "The big sock puppet up there is hardly in charge of anything, and not bulletproof.", "is_submitter": false, "distinguished": null, "created_utc": 1627900872.0, "parent_id": "t1_h72ax9a", "replies": []}]}]}, {"author": "ATR2400", "id": "h72ztnl", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "ougq7l", "stickied": false, "body": "Why’s there always some jerk downvoting all the new posts? \n\nAnyways I’m feeling a little optimistic. It seems that finally things are starting to ramp up. Solar has reached record low prices, nuclear is slowly losing its bad reputation and innovation is resuming. Electric cars aren’t garbage anymore. The mere existence of nuclear weapons as well as globalization has prevented another large scale war. \n\nI’m proud to say I’m not a downer like 90% of reddit now.", "is_submitter": false, "distinguished": null, "created_utc": 1627653173.0, "parent_id": "t3_ougq7l", "replies": [{"author": "R5Cats", "id": "h73wmqc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "ougq7l", "stickied": false, "body": "> Why’s there always some jerk downvoting all the new posts?\n\nGood question, looks like several of them, or Bots...", "is_submitter": false, "distinguished": null, "created_utc": 1627667244.0, "parent_id": "t1_h72ztnl", "replies": []}]}, {"author": "areyouseriousdotard", "id": "h72kxvw", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "ougq7l", "stickied": false, "body": "I am looking forward to watching my kids grow up.\nCivilization is heading in the wrong direction and I have to prepare them for that.\nPersonally, I just got KDE plasma to run on my pi4 so the near future is looking up...", "is_submitter": false, "distinguished": null, "created_utc": 1627644825.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "Reverical", "id": "h72clzv", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "I look forward to this December (full Cave Update) and dread anything after.", "is_submitter": false, "distinguished": null, "created_utc": 1627638216.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "BuccaneerRex", "id": "h72viqt", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "ougq7l", "stickied": false, "body": "The 'future' is a conceptual placeholder. It serves as the variable for the outputs of your current mental model of reality. How will the current state evolve over time? \n\nWhen I was younger I had big plans about the course I would take.  I really invested a lot of my mental energy into the future. \n\nAnd of course since I don't have admin rights over reality, the future did what it does and gave no fucks about my plans. \n\nSince I had pinned a lot of hopes on those plans, I found myself fairly aimless and lost until I realized the problem wasn't with the future, but with my attitude towards it.\n\nThese days I try to be more zen and accepting about things. There's no such thing as fate or destiny. You will get somewhere, but you can't know where. All you can do is steer and plan and hope for the best while knowing that your hopes are not taken into consideration.", "is_submitter": false, "distinguished": null, "created_utc": 1627651064.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "roundearthervaxxer", "id": "h72e4td", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "ougq7l", "stickied": false, "body": "Even money we survive the century, it will be a hell of a ride.", "is_submitter": false, "distinguished": null, "created_utc": 1627639539.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "Weareadamnednation", "id": "h72moyr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #26", "submission": "ougq7l", "stickied": false, "body": "Both. I look forward with a sense of wonder and also dread what my children will have to live through. I have one starting high school and the reality check of adulthood is looming for him. He’s a good kid and well adjusted but i’m still nervous for him.", "is_submitter": false, "distinguished": null, "created_utc": 1627645997.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "Movpasd", "id": "h732o86", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "I think a lot about the far, far future, long after I'm gone. I wonder what humans will look like in a hundred years, a thousand, a million, a billion. Humans live at most in the past and following decade (though let's be honest, it's usually the past and following hour), and humanity in the past and following century. What astoundingly different cultural, social, or even biological landscapes might we explore if only given the time? The weight of history is heavy enough with only a few tens of thousands of years of practice; what will it feel like to carry billions?", "is_submitter": false, "distinguished": null, "created_utc": 1627654512.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "MisanthropicScott", "id": "h73onug", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ougq7l", "stickied": false, "body": "Honestly, the future looked pretty bleak to me by the late 80s and early 90s. Climate change was definitely a thing but could have been handled by gradual changes that would not have had an enormous impact on our lives. It would have improved our lives in a lot of ways, in fact.\n\nUnfortunately, we did not do a fucking thing then.\n\nAll current data shows us at or worse than the worst case scenarios of the models made back then. I don't know whether we're already too late to do anything about it. If we're not too late already, we need strong and decisive action now. We do not have time for gradual changes. We need to do everything we can all at once starting yesterday.\n\nStill, I see no such changes forthcoming.\n\nI don't actually think we have much of a future. For my insignificant part in that, I am deeply sorry.\n\nRegarding my own personal future, I'm already in it. I'm 57 now. This is the future I had hoped for decades ago. It's going quite well on a personal level. Now, I just hope to maintain my ability to do the things I love doing. \n\nBack and knee pain have been having more of an impact on my life than my 32 years of type 1 diabetes ever did. I'm hoping to be able to hike again and possibly even ski again. But, my current recovery from minor knee surgery is going much slower than I was led to believe it would.\n\nAnd, of course, in the back of my mind is always the hope that we'll either solve the problems caused by overpopulation, including climate change as our most immediate problem, or that the worst effects will wait until my wife and I live out our life expectancies. I'm actually not sure we have that long. I do worry about the possibility of collapse within my lifetime, even at my age.\n\nI would love to be wrong about all of this.", "is_submitter": false, "distinguished": null, "created_utc": 1627663853.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "CallMeMalice", "id": "h73qtmj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "I'm a bit indifferent. Not sure if there's a lot to look forward to. Not sure if that's a problem.", "is_submitter": false, "distinguished": null, "created_utc": 1627664768.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "LeastAction_", "id": "h7473di", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #130", "submission": "ougq7l", "stickied": false, "body": "I try not to think about the future too much, it gets overwhelming very quickly. I try to focus on my interests, like \"hey, next month that videogame I've been looking forward to comes out!\" or stuff like that, rather than \"what job will I be doing in 5 years?\". \n\nThe \"present me\" is waaaay less optimistic than the \"past me\"", "is_submitter": false, "distinguished": null, "created_utc": 1627671673.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "weeb2000", "id": "h74bro7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #121 | Legio Virtus", "submission": "ougq7l", "stickied": false, "body": "the future is the future. i’m indifferent towards it. whatever happens happens.", "is_submitter": false, "distinguished": null, "created_utc": 1627673622.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "kemperus", "id": "h753tyz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #134", "submission": "ougq7l", "stickied": false, "body": "I like to believe we’ll be alright past the 21st century, will have a human presence on the Moon and Mars, and hopefully solved fusion and have it widespread by 2050s. If we get fusion in time we got a shot in surviving climate change", "is_submitter": false, "distinguished": null, "created_utc": 1627686347.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "Alatain", "id": "h758pz5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "ougq7l", "stickied": false, "body": "I look forward to both my personal future and the potential future of humanity with the possibility of getting into space and finally building actual space-based infrastructure. \n\nWhether life-extension technology gets off the ground in my lifetime or not, it is going to be an interesting ride. Just the advancements in computer science, virtual reality, and brain-computer interfaces is going to be amazing. \n\nWe will see where we go though.", "is_submitter": false, "distinguished": null, "created_utc": 1627688826.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "Skastrik", "id": "h75deun", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "ougq7l", "stickied": false, "body": "Civilizations rise and fall, I'm pretty sure the current civilizational cycle is on the downward slope and has already peaked.\n\nWe won't become an interstellar race this time around I'm afraid. We won't \"cure\" death and hardly even Cancer. Maybe in another 5000 years after we've recovered from the massive chaos that climate change will cause.\n\nMy personal future is to be an overworked person that does rather little to directly contribute to the big picture except help others in my personal life on my own expense since I'm not going to use my life productively. I didn't plan this, my anxieties and conditions kinda directed this development. I had ambitions, I wanted to leave my mark and somehow be remembered, even if just for a little bit. We were going to be a space faring people with permanent Lunar colonies and manned Mars expeditions regularly.", "is_submitter": false, "distinguished": null, "created_utc": 1627691287.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "CheezMeister__", "id": "h75jvs1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #25", "submission": "ougq7l", "stickied": false, "body": "Im just waiting and seeing how things go", "is_submitter": false, "distinguished": null, "created_utc": 1627694690.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "boringlesbian", "id": "h75vs1n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "ougq7l", "stickied": false, "body": "Every day that I wake up still alive is a surprise. I keep living out of habit. Hope, to me, is painful. I try to enjoy the present. \n\nMy speculative mind feels that we will reach the singularity in about 2030-2032. If I'm alive then, it will be interesting.\n\nMy PTSD/Developmental Trauma brain throws me back into the past too often. I would really rather forget it.", "is_submitter": false, "distinguished": null, "created_utc": 1627701222.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "ciaomoose", "id": "h75ynno", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "I look forward to my personal future. I’ve only become happier over time so far, and I project the trend will continue as I become even more secure in my career, relationships, and finances. I really look forward to gaining the wisdom that comes with old age.\n\nCivilization doesn’t look too promising for the future, with climate change and increasingly complex international relations. But I’ll probably have lived most of my life before it gets really bad, I think. Not sure if I feel ok about the idea of having kids though, for that reason.", "is_submitter": false, "distinguished": null, "created_utc": 1627702918.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "clovepod", "id": "h763v1g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "ougq7l", "stickied": false, "body": "i am always curious to see what will happen, and remain optimistic.", "is_submitter": false, "distinguished": null, "created_utc": 1627706146.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "ShadowLibra_98", "id": "h7679yr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ougq7l", "stickied": false, "body": "I learned young to just accept things as they come and stand up for what I believe. There are things in life that alot of people dread like bills, socializing, death, etc. But all of those are certain so why would I worry about the future when I can just have fun in the moment. Lifes greatest lessons come from the biggest fuck ups.\nI do in fact look forward to the age of AI and different types of virtual realities. Unnecessarily a curious person.\nComing out of highschool I had a seven year plan(senior essay to make us think about the future) and for the first 3 years after highschool, everything was spot on. Then shit that I would've never expected happened and shit got real, did a no no, went to psych ward, now I'm gucci. The point is that life is simply all changing. Kinda like someone is spinning a wheel of fate at our every decision.(beautiful creature series reference btw 😊) 6 years ago when I decided to join some online chats one night, I never would've imagined that I would've met them let alone currently live with them and we are all more of a family than my own. \nI seriously rambled on this my b😅 but yeah :3", "is_submitter": false, "distinguished": null, "created_utc": 1627708481.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "banana_kiwi", "id": "h76cfas", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "ougq7l", "stickied": false, "body": "I don't see a reason to think about whether I dread the future. It is unproductive and I'm better off having a more positive mindset", "is_submitter": false, "distinguished": null, "created_utc": 1627712327.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "zoharel", "id": "h76hup8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "ougq7l", "stickied": false, "body": "Honestly, I'm doing well enough myself for the moment.  On the other hand, humanity is in serious trouble, in many ways.  Yes, the environmental problems have already been mentioned, but we also have a budding fascist insurgency here in the US, and similar problems in many parts of Europe, at least.  None of that can end well.  It's likely to be close enough to literal hell if they manage even a little pull, and while those perpetrating fascism are welcome to go to hell, I wish they'd stop trying to carry the rest of us along.", "is_submitter": false, "distinguished": null, "created_utc": 1627716811.0, "parent_id": "t3_ougq7l", "replies": []}, {"author": "Mr--Elephant", "id": "h773cuf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #72 | Ordo Cognitus", "submission": "ougq7l", "stickied": false, "body": "Any idea of the future or times changing absolutely terrifies me even if I know I'll personally be fine", "is_submitter": false, "distinguished": null, "created_utc": 1627735437.0, "parent_id": "t3_ougq7l", "replies": []}]}