{"title": "What were your \"friends\" in school like?", "name": "t3_ouicrp", "url": "https://www.reddit.com/r/TheFlyingTree/comments/ouicrp/what_were_your_friends_in_school_like/", "selftext": "Back in school I was friends with some _[insert expletive to showcase their lack of intellect and shitty personality]_ for 7 years, one on my fondest memories with him is beating him up in front of a few other students and a lab technician. There were a few other _[insert expletive to showcase their lack of intellect and shitty personality]_ too who I didn't get a chance to beat up, don't know why I ever hung out with them. Luckily got rid of most by 11^th grade though.\n\nOne of the few people I stayed in contact with after graduation is someone who I actually built animosity with in 10^th grade yet ended up befriending the next year. \n\nMy current self is baffled and disgusted at my younger self for being such a twat.", "score": 4, "upvote_ratio": 0.65, "permalink": "/r/TheFlyingTree/comments/ouicrp/what_were_your_friends_in_school_like/", "id": "ouicrp", "author": "FalconRelevant", "link_flair_text": "Discussion", "num_comments": 17, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1627642501.0, "comments": [{"author": "DDumpTruckK", "id": "h72in9l", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "ouicrp", "stickied": false, "body": "I think your use of the word retard is probably insulting to people who have actual mental disabilities.  If I'm judging your story correctly, you used to hang out with pieces of shit, not retards.  I know you want to describe them as the immoral idiots they were, but calling them retard only propagates a negative connotation for people who are actually mentally handicapped, yet aren't the kinds of degenerates that you apparently had as friends.\n\nI only suggest you find a better word for the sake of all the peaceful, polite, friendly, mentally challenged people out there, rather than using a word that implies they're all crappy people.", "is_submitter": false, "distinguished": null, "created_utc": 1627643193.0, "parent_id": "t3_ouicrp", "replies": [{"author": "FalconRelevant", "id": "h72j0uj", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "ouicrp", "stickied": false, "body": "That's actually hard, can't say \"shitbags\" or related because there were several others shitbags who I hated back then and now.\n\nI'll just put a placeholder then.", "is_submitter": true, "distinguished": null, "created_utc": 1627643476.0, "parent_id": "t1_h72in9l", "replies": []}, {"author": "whymepphard", "id": "h7ccq6b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #26", "submission": "ouicrp", "stickied": false, "body": "\"retard\" is just an insult among the others.", "is_submitter": false, "distinguished": null, "created_utc": 1627844061.0, "parent_id": "t1_h72in9l", "replies": [{"author": "DDumpTruckK", "id": "h7cdkjx", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "ouicrp", "stickied": false, "body": "But not everyone reads it that way.  I appreciate that you might not be intending to imply anything about mentally challenged people, but that's not how everyone is going to read it.  Using the word like such in public presents a hostile atmosphere for people who have, or know mentally challenged people.  Just like how it would create this hostile atmosphere if you were to use the word 'faggot' casually.  \n\nEven if you don't mean anything derogatory by it, using the word to refer to negative things implies a certain negative belief about the word.  \"Why are you only calling bad traits retarded?  Why are you only calling things you don't like 'gay'?\"  I understand in common parlance (or at least in my day they were) these things aren't intentionally invoking anything derogatory, but not everyone knows and understands your intent and its quite easy to read that language as quite a bigoted one.  I don't care about what you say in the privacy of your own home.", "is_submitter": false, "distinguished": null, "created_utc": 1627844465.0, "parent_id": "t1_h7ccq6b", "replies": []}]}]}, {"author": "sarini11", "id": "h72ll9f", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #56 | Ordo Cognitus", "submission": "ouicrp", "stickied": false, "body": "I was friends with the ones who just followed along, otherwise I was just on my own. Also, the fact that I had to frequently change schools didn't help to maintain these friendships.", "is_submitter": false, "distinguished": null, "created_utc": 1627645267.0, "parent_id": "t3_ouicrp", "replies": [{"author": "FalconRelevant", "id": "h72lt60", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "ouicrp", "stickied": false, "body": "For some reason the wrong people followed me, and since I spent all except pre-kindergarten in the same school, it was hard to get rid of them.", "is_submitter": true, "distinguished": null, "created_utc": 1627645416.0, "parent_id": "t1_h72ll9f", "replies": []}]}, {"author": "usernames_suck_ok", "id": "h73lfqg", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "ouicrp", "stickied": false, "body": "I'm an old woman. So, the way friendships seemed to work between girls back in the day was there were these assholes who chronically smiled in your face and talked behind your back, told lies about you, tried to turn other girls against you, etc. Today, it's basically known as \"frenemies.\" Drama central and faux bitches.\n\nWhen I started to realize that's just kind of how girls were and that dynamic was going to keep repeating, I started hanging with boys more. I remember hanging with these two boys in the 7th grade, and all we talked about was music. So much nicer. \n\nUnfortunately, these two things are a big part of the reason why I don't have friends today. Women hate when other women talk about how difficult it can be to be friends with women, but, to me, there's just no benefit to being friends with most women...and now that I'm old, most guys my age are in relationships or married. So, I try not to be friends with guys anymore because I don't want to deal with drama from the women they're with, i.e. the women thinking something is going on between us.", "is_submitter": false, "distinguished": null, "created_utc": 1627662500.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "Snark__Lover31", "id": "h72nnhg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ouicrp", "stickied": false, "body": "I've always been friends with people who don't really fit anywhere", "is_submitter": false, "distinguished": null, "created_utc": 1627646624.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "DoglessDyslexic", "id": "h72p2z4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "ouicrp", "stickied": false, "body": "Fellow geeks for the most part.", "is_submitter": false, "distinguished": null, "created_utc": 1627647511.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "BuccaneerRex", "id": "h72u2g4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "ouicrp", "stickied": false, "body": "I was moved around a lot as a kid. Never spent more than one or two school years in any one place. So I was literally always the new kid. This meant my friends were the outcasts and the weirdos and the ones who didn't use social status as criteria. \n\nI would have been bully fodder except that I got tall early, could take a punch and give it back better than most, and never rose to the bait. \n\nI got along with everyone, but didn't get close with anyone. Ony of my favorite anecdotes from elementary school was in sixth grade when one of the gangbanger kids (Los Angeles, CA) just to be a dick, slapped me on the back really hard in that fake friendly way. I immediately spun and socked him in the face. As he started to react with anger and violence and his friends closed in, I turned and lifted my shirt so he could see his big handprint on my badly sunburned back. He immediately went 'Oh shit, ese. I didn't know. That sucks.' And while we weren't friends after that, we were respectful and I was off limits for bullying.\n\nI didn't speak to anyone I went to school with ever again after leaving that school. Except for the girl in high school that I married. And I didn't speak to her after we got divorced. So it's been 25 years since I have spoken to anyone I went to any kind of school with.", "is_submitter": false, "distinguished": null, "created_utc": 1627650298.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "LeastAction_", "id": "h747rpf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #130", "submission": "ouicrp", "stickied": false, "body": "I didn't have that many friends when I was a kid, but I remember this guy who wasn't particularly smart. His mother forced him to hang out with me and be my friend because I had good grades, and she hoped his grades could improve (by osmosis?). Only recently I realized how toxic our \"friendship\" was.\n\nAnyway, I was told he's in prison now", "is_submitter": false, "distinguished": null, "created_utc": 1627671963.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "Cheomesh", "id": "h72vnuk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "ouicrp", "stickied": false, "body": "Barely remember most of them anymore.  Didn't really have any until \\~7th grade, and it was kind of a revolving door until I became a bit of a toxic person in like 11th or 12th grade and kept up this revolving door for a few more years until I got my shit sorted.  Now I'm a man in my 30s and, true to it, don't really have any.  Even in my better years I was 3rd wheel at best though.", "is_submitter": false, "distinguished": null, "created_utc": 1627651138.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "a_planet_", "id": "h72w7sj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #98", "submission": "ouicrp", "stickied": false, "body": "I actually had a great class and feel lucky for it. Most of us were weird gamers and would hang out on skype after class. Those people are really great friends, we don't talk as much but have a strong bond. \n\nBut my best friend is also someone who, like your example, I had animosity with. Actually, we met because he came over to beat me up but realized I'm not that bad in the process. It's been over fifteen years since then, we play chess and hang out almost every day. He's like a brother :)", "is_submitter": false, "distinguished": null, "created_utc": 1627651411.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "Alirezahjt", "id": "h73vho1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "ouicrp", "stickied": false, "body": "Well, I went to a private school so my friends were all *selected* for me, which is not an issue in and of itself. But there was a lack of intellectual and cultural diversity which bugged me in the later years of high school.\n\nI stayed in contact with some of them but the friendships faded away. They were all good people though, I'm not being smug and act like I was better than them. No, they were great people. But later in life I could find my own friends and some of my best friends cannot be more different than who I am!", "is_submitter": false, "distinguished": null, "created_utc": 1627666756.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "mellowsout", "id": "h73y5oc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #205", "submission": "ouicrp", "stickied": false, "body": "I found the show Freaks and Geeks relatable/recognizable.", "is_submitter": false, "distinguished": null, "created_utc": 1627667899.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "koboldkiller", "id": "h74m7dh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #17 | Legio Virtus", "submission": "ouicrp", "stickied": false, "body": "I'm still friends with them, 4 years later. They were all gamers, most of them not the toxic ones you'd find on Xbox though. We used to regularly hang out as a group and just chill. We cut out the people who were negative influences. We were all pretty much straight-edge back in the day, but we're all stoners with jobs and relationships now. I don't think any of us qualify as gamers as much as we used to, except for the one who plays videogames even when people are over and does MDMA like 4 times a month. Ironically, he may have had the most potential and squandered it away.\n\nI wouldn't have become friends with them if they were a negative in my life.", "is_submitter": false, "distinguished": null, "created_utc": 1627678099.0, "parent_id": "t3_ouicrp", "replies": []}, {"author": "zoharel", "id": "h75qkex", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "ouicrp", "stickied": false, "body": "Well, before college, they were mostly misfits and even they kind of treated me poorly.  Couldn't tell you why.  I didn't go to school with my few actual friends.  During college, they were also mostly the misfits, but they were friendly ones.", "is_submitter": false, "distinguished": null, "created_utc": 1627698287.0, "parent_id": "t3_ouicrp", "replies": []}]}