{"title": "Debate: culture and traditions should not be preserved.", "name": "t3_ort1no", "url": "https://www.reddit.com/r/TheFlyingTree/comments/ort1no/debate_culture_and_traditions_should_not_be/", "selftext": "", "score": 0, "upvote_ratio": 0.43, "permalink": "/r/TheFlyingTree/comments/ort1no/debate_culture_and_traditions_should_not_be/", "id": "ort1no", "author": "FalconRelevant", "link_flair_text": "Debate", "num_comments": 52, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": "moderator", "created_utc": 1627280876.0, "comments": [{"author": "TesseractToo", "id": "h6kb6ay", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "ort1no", "stickied": false, "body": "Growing up in a society is preserving a culture. Enjoying things created by others (eg a white person in Canada going for sushi) is helping preserve other cultures. Different cultures add variety and flavour to places, I wouldn't want to be in a city with no Chinatown or other ethnic districts and you can really expend your horizons that way. I definitely want to celebrate other cultures and ethnicities and respect them.\n\nI love visiting cultural districts and celebrating their ethnicities.\n\nQuestion: if you try and prevent historical ethnicities, cultures, whose are we deciding on? Who was there first? In the US will everyone have to start being in the cultures of the Native Americans? Would I suddenly switch to the Kuringai Aboriginal Nation? I mean I;d be ok with that if they'd have me but I'm disabled so I'd be more if a basket weaver than a wallaby hunter anyway.\n\nI mean obviously it would have to stay but then what are the rules? Who is in and who is out? Can we still have sushi? Won Ton Soup? Pizza? Will the lovely Morroccan restauarnt down the street be closed? The cool place that sells Egyptian stuff? What about museums?\n\nAlso to freeze culture is to freeze time. No more anime, no more K-pop, in Australia we'd have to get rid of rap and hip hop.... and now more new music, art or technology from \"other cultures\". That would have a sad world and the policing would be stifling.\n\nIt sounds like going back to the '50's.\n\nThere are two caveats here:1: restricting the freedom of others to the point where it gets dangerous- in Canada I almost has a collision with a women backing her huge Bronco truck out, she couldn't see my small Toyota because she was in full burkah and didn't have good (or maybe any (I don't know how translucent the fabric is at the sides)) peripheral vision. Conversely if someone wants to and it's not in danger I support them wearing it if they want and if I was in France I might even wear a hijab to support people who want to wear those (how do they even support that anyway, can you just tell the hijab cops it's not a hijab it's a babushka?) And a \"burkini\" (which looks like excellent jellyfish protection if you ask me, I might get one).\n\n2: Surgically modifying people who cannot consent. Male and female circumcision is out except for medical reasons, and then it's done in a hospital by doctors with anesthetic. Otherwise no and this needs regulation as strong as they are going after child pron IMO.", "is_submitter": false, "distinguished": null, "created_utc": 1627285695.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "MisanthropicScott", "id": "h6k79ok", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ort1no", "stickied": false, "body": "I'm genuinely curious because the title alone doesn't make an argument for this.\n\nWhat is your reasoning?\n\nWhy do you think that whatever culture wins is automatically best?\n\nWill you still feel this way when it is your own culture being overrun by a conquering nation?", "is_submitter": false, "distinguished": null, "created_utc": 1627282293.0, "parent_id": "t3_ort1no", "replies": [{"author": "FalconRelevant", "id": "h6k9bzd", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "ort1no", "stickied": false, "body": "I mean preservation of culture and traditions in general should not be an agenda by itself. I never liked or fit in the culture and traditions of my parents, and I don't want to practice the culture of neighbouring nations either, so I prefer that individuals be allowed to do whatever they want from whichever culture they want without being restrained by their regional cultural practices.", "is_submitter": true, "distinguished": null, "created_utc": 1627284056.0, "parent_id": "t1_h6k79ok", "replies": [{"author": "MisanthropicScott", "id": "h6k9qt3", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ort1no", "stickied": false, "body": "> I prefer that individuals be allowed to do whatever they want from whichever culture they want without being restrained by their regional cultural practices.\n\nI agree with that. Individuals should always be able to choose their own path in life, provided that one person's freedom ends where another's begins.\n\nBut, there are people trying to preserve their own culture. I see no reason not to allow or support their ability to do so. Actively attempting to destroy a culture has been done many times with disastrous effects.", "is_submitter": false, "distinguished": null, "created_utc": 1627284419.0, "parent_id": "t1_h6k9bzd", "replies": [{"author": "FalconRelevant", "id": "h6k9vik", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "ort1no", "stickied": false, "body": "The problem is that most people try to preserve their culture by enforcing it upon others, especially their own children.", "is_submitter": true, "distinguished": null, "created_utc": 1627284537.0, "parent_id": "t1_h6k9qt3", "replies": [{"author": "Alatain", "id": "h6m7riu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "ort1no", "stickied": false, "body": "Eh... Some specific cultures have the ideal of spreading their culture at the expense of others, but those are not the only cultures out there. The problem is that the cultures that do not value forcefully spreading your own culture get wiped out by those that do. \n\nA very good example of this would be some of the more extreme versions of Christianity and Islam. But there are other cultures that just want to be left alone. Those should be protected against the more aggressive cultures out there.", "is_submitter": false, "distinguished": null, "created_utc": 1627325055.0, "parent_id": "t1_h6k9vik", "replies": []}, {"author": "MisanthropicScott", "id": "h6ka69i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ort1no", "stickied": false, "body": ">> I agree with that. Individuals should always be able to choose their own path in life, provided that one person's freedom ends where another's begins.\n\n> The problem is that most people try to preserve their culture by enforcing it upon others, especially their own children.\n\nI wouldn't know about that. I'm not even trying to preserve my own genes. My children are all safe and warm behind my severed tied and cauterized vasa deferentia.\n\nBut, aside from that, I think that would be covered under the comment about one person's freedom ending where another person's freedom begins.", "is_submitter": false, "distinguished": null, "created_utc": 1627284805.0, "parent_id": "t1_h6k9vik", "replies": []}]}]}, {"author": "Arjun_Dhama", "id": "h6kph6c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ort1no", "stickied": false, "body": "That is very different from what the title says", "is_submitter": false, "distinguished": null, "created_utc": 1627298396.0, "parent_id": "t1_h6k9bzd", "replies": []}]}]}, {"author": "wh0-am-l", "id": "h6k7kiw", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #19", "submission": "ort1no", "stickied": false, "body": "It depends on the specific instance. Things like traditional gender roles shouldn’t remain, but things like wearing cloths or sanitation should obviously remain.", "is_submitter": false, "distinguished": null, "created_utc": 1627282544.0, "parent_id": "t3_ort1no", "replies": [{"author": "LilamJazeefa", "id": "h6ktry3", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "ort1no", "stickied": false, "body": "Wearing clothes is something I can go without.  It's a waste of resources and nudist societies are actually cleaner and healthier.  Public showers are available and contact-borne diseases are not very common.  If someone is too concerned about transmission on things like chairs then just wear a cape.", "is_submitter": false, "distinguished": null, "created_utc": 1627301456.0, "parent_id": "t1_h6k7kiw", "replies": [{"author": "PlsGiveMeBetterName", "id": "h6lkg18", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #91 | Consortii Concordus", "submission": "ort1no", "stickied": false, "body": "contact-borne diseases could become quite common very quickly in high population density areas", "is_submitter": false, "distinguished": null, "created_utc": 1627314942.0, "parent_id": "t1_h6ktry3", "replies": [{"author": "LilamJazeefa", "id": "h6lqhff", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "ort1no", "stickied": false, "body": "Nah.  Public showers and the heightened social non-acceptance of low hygiene.", "is_submitter": false, "distinguished": null, "created_utc": 1627317587.0, "parent_id": "t1_h6lkg18", "replies": [{"author": "Alatain", "id": "h6m85aj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "ort1no", "stickied": false, "body": "Fix the hygiene problem first. Then we can talk about not wearing clothes. Until then, it is a public health risk.", "is_submitter": false, "distinguished": null, "created_utc": 1627325223.0, "parent_id": "t1_h6lqhff", "replies": []}]}]}, {"author": "BArrowsmith0702", "id": "h6kztsh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #7", "submission": "ort1no", "stickied": false, "body": "Okay try living in the UK without wearing at least a coat", "is_submitter": false, "distinguished": null, "created_utc": 1627305102.0, "parent_id": "t1_h6ktry3", "replies": [{"author": "dashingThroughSnow12", "id": "h6l1vmh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "ort1no", "stickied": false, "body": "Where I live, some immigrants start wearing their jackets in September.", "is_submitter": false, "distinguished": null, "created_utc": 1627306206.0, "parent_id": "t1_h6kztsh", "replies": []}]}, {"author": "MisanthropicScott", "id": "h6oqhae", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "ort1no", "stickied": false, "body": "> Wearing clothes is something I can go without.\n\nI'm absolutely fine with that, if you choose.\n\nI suspect it would be rather difficult walking around naked in a NYC winter, even on the warmer winter days we've had in recent years (absent polar vortexes).\n\nFor me personally, I find sun on my skin actively unpleasant. I want to wear light clothing to protect my skin in sunny weather and warm clothes in colder weather.\n\nAs a type 1 diabetic, I definitely need a place to clip my insulin pump and pockets to carry all of the normal stuff I need even for a short outing as well as a backpack for any outing longer than a couple of hours or so. Backpack on bare skin would also be rather uncomfortable.\n\nLastly, as a man, I really don't want to be dangling around in the open. It's actually unpleasant. Perhaps if had internal plumbing.", "is_submitter": false, "distinguished": null, "created_utc": 1627376103.0, "parent_id": "t1_h6ktry3", "replies": []}]}]}, {"author": "TheDeadMonument", "id": "h6k8iba", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "ort1no", "stickied": false, "body": "I disagree. Culture and traditions should be preserved. The caveat being knowing their context. We can remember where we've been, but we don't have to continue it where we're going. So to speak.", "is_submitter": false, "distinguished": null, "created_utc": 1627283335.0, "parent_id": "t3_ort1no", "replies": [{"author": "FalconRelevant", "id": "h6k938y", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "ort1no", "stickied": false, "body": "Yeah, so we should record them, however when people usually say \"preserve our culture\", they're talking about continuing to practice it, and often resisting progress.", "is_submitter": true, "distinguished": null, "created_utc": 1627283843.0, "parent_id": "t1_h6k8iba", "replies": [{"author": "TheDeadMonument", "id": "h6k95u9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "ort1no", "stickied": false, "body": "I agree.", "is_submitter": false, "distinguished": null, "created_utc": 1627283908.0, "parent_id": "t1_h6k938y", "replies": []}, {"author": "Stand_kicker", "id": "h6kedhp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "ort1no", "stickied": false, "body": "Preserving culture and resisting progress are 2 different things. A lot of people confuse them.\n\nYou can preserve culture and tradition while making progress. For example, you can observe the sabbath, go to your place of worship on your chosen day, pray 5 times a day, wear traditional clothing, celebrate your festivals, cook traditional food, learn about your heritage, etc. without it stalling progress. \n\nPersonally, I want to know where my people came from, I want to know my religious heritage, I want to preserve my language (and speak it as often and with as many people as possible), I want to preserve monuments, buildings, parks, etc. all of which are part of my culture. I would be against getting rid of the Eiffel Tower or the Vatican  and replacing it with a car park.", "is_submitter": false, "distinguished": null, "created_utc": 1627288644.0, "parent_id": "t1_h6k938y", "replies": [{"author": "FalconRelevant", "id": "h6kevx3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "ort1no", "stickied": false, "body": "However the Catholic Church should be abolished, and Vatican City integrated into the municipality of Rome.", "is_submitter": true, "distinguished": null, "created_utc": 1627289125.0, "parent_id": "t1_h6kedhp", "replies": [{"author": "Stand_kicker", "id": "h6kfmae", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "ort1no", "stickied": false, "body": "I am all for getting rid of people who force their beliefs on you or use it as an excuse to deny science or personal choices. But I am not for abolishing any religious institute or belief. \n\nTradition and culture plays an important part in bringing people together. It builds communities. The feeling of togetherness is important, especially now and going forward.", "is_submitter": false, "distinguished": null, "created_utc": 1627289805.0, "parent_id": "t1_h6kevx3", "replies": [{"author": "FalconRelevant", "id": "h6khp0l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "ort1no", "stickied": false, "body": "Even if it is based upon falsehood? There are lots of ways to build communities.", "is_submitter": true, "distinguished": null, "created_utc": 1627291748.0, "parent_id": "t1_h6kfmae", "replies": [{"author": "Stand_kicker", "id": "h6kpzve", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "ort1no", "stickied": false, "body": "Why not? As long as it doesn't cause anyone any harm. Your idea to not preserve culture and traditions is not based on science. It is your opinion and could be more detrimental then preserving it.\n\nWho are you to question someone's beliefs, as long as it isn't causing anyone any harm?\n\nWhat are your ideas to build communities?", "is_submitter": false, "distinguished": null, "created_utc": 1627298791.0, "parent_id": "t1_h6khp0l", "replies": []}]}]}]}]}]}]}, {"author": "shig23", "id": "h6kbonm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "ort1no", "stickied": false, "body": "If a culture is in danger of dying out because its members are dying en masse, then it should be preserved at all costs—by stopping whatever it is that’s killing them.\n\nBut if it’s simply a matter of people losing interest in the styles or practices of a culture, or intentionally discarding certain values as outdated and harmful, I’m all for letting a culture die a natural death.", "is_submitter": false, "distinguished": null, "created_utc": 1627286158.0, "parent_id": "t3_ort1no", "replies": [{"author": "Stand_kicker", "id": "h6ketbg", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "ort1no", "stickied": false, "body": "> people losing interest in the styles or practices of a culture, or intentionally discarding certain values as outdated and harmful\n\nPeople naturally losing interest is different from people being influenced to discard it. When the British colonized, they got people to discard their traditions. Either by force or influencing (directly or indirectly). I see a similar thing happening. Social media influences people to adopt an American (western) culture because it is cool. \n\nA lot of people do not really know and understand their cultural and traditions. It is something they do and that's it. They understand it (because no one took the time to explain it to them), don't relate to it, and discard it (especially when you are young).\n\nThis is one of the reasons why it is important to preserve culture and tradition. You might want to come back to it someday.", "is_submitter": false, "distinguished": null, "created_utc": 1627289054.0, "parent_id": "t1_h6kbonm", "replies": [{"author": "shig23", "id": "h6kw7ru", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "ort1no", "stickied": false, "body": "If someone is actively working to destroy a culture, that would hardly make it a natural death, now, would it?\n\nBut if young people aren’t being taught about their culture, they can hardly be blamed for getting distracted by the shiny and new. If their parents didn’t think it was important enough to teach, or only taught it as \"the way things are done,\" without explanation or context, then who’s fault is that?", "is_submitter": false, "distinguished": null, "created_utc": 1627302997.0, "parent_id": "t1_h6ketbg", "replies": [{"author": "Stand_kicker", "id": "h6ld3ua", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "ort1no", "stickied": false, "body": "Fair. I wouldn't want to waste time figuring out who to blame. Rather focus the time and effort on how to do a better job at making people (parents and kids) understand.", "is_submitter": false, "distinguished": null, "created_utc": 1627311694.0, "parent_id": "t1_h6kw7ru", "replies": []}]}]}]}, {"author": "YLASRO", "id": "h6kdxbt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ort1no", "stickied": false, "body": "You can ceep the benign parts imo. But i agree that some things need to be abandoned. So for example here in germany we can drop christian elements of the culture but keep oktoberfest and breadculture", "is_submitter": false, "distinguished": null, "created_utc": 1627288231.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "Kweldulf", "id": "h6moiqv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "ort1no", "stickied": false, "body": "Yes. Absolutely and fully. Culture and traditions are things without inherent value in them. They should not be preserved at all, there is no inherent benefit to these concepts.\n\nIf a particular part of tradition is rational then it will be preserved as the rationale not as \"because the elders have said its good so\".", "is_submitter": false, "distinguished": null, "created_utc": 1627332460.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "gr13fy", "id": "h6myn27", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #223", "submission": "ort1no", "stickied": false, "body": "there is no *intrinsic* reason why cultures and treditions cannot be preserved. for their own sake \n\n(and because are pass down information through generetions that develops \"culture\" which is importent for humanity's continued existence as it currently is.)\n\nbut there are things that are wrong that exist within culture which are excused simply because they are \"how things are done.\" \n\nthat is what i do have a problem with.", "is_submitter": false, "distinguished": null, "created_utc": 1627337070.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "theomniexperience", "id": "h6sodvr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ort1no", "stickied": false, "body": "Agreed. It causes harm from what I've seen.", "is_submitter": false, "distinguished": null, "created_utc": 1627448490.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "I_Love_Rias_Gremory_", "id": "h6k9alr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #93", "submission": "ort1no", "stickied": false, "body": "Honestly, I don't give a shit about culture and traditions. Someone else can. I also don't give a shit as long as it doesn't affect me. You wanna do something weird in your own home? Go ahead. You wanna try and drag me into your shit? No thanks.", "is_submitter": false, "distinguished": null, "created_utc": 1627284021.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "zoharel", "id": "h6kamkm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "ort1no", "stickied": false, "body": "I agree.  If a tradition can't stand on its own merits -- and simply being a tradition is not merit -- then it should be destroyed.", "is_submitter": false, "distinguished": null, "created_utc": 1627285206.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "Niskanen204", "id": "h6kmq5i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "ort1no", "stickied": false, "body": "Certainly some shouldn't. The liberal ideal of cultural relativism is a fine aspiration but poor practice,", "is_submitter": false, "distinguished": null, "created_utc": 1627296201.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "TommyWiseau22", "id": "h6lenqy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "ort1no", "stickied": false, "body": "debate: falconrelevant is a goober and should not be preserved", "is_submitter": false, "distinguished": null, "created_utc": 1627312398.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "stupidmoth_", "id": "h6kgi29", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ort1no", "stickied": false, "body": "the thing is the word culture can become so hard to define that it's hard to state a point on the matter but if we're talking about indigenous cultures and traditions I think as long as it's not doing harm it's okay to preserve it since it gives you a nice understanding of how society used to work and that's always fascinating to study", "is_submitter": false, "distinguished": null, "created_utc": 1627290633.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "ATR2400", "id": "h6kik7o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "ort1no", "stickied": false, "body": "You always keep it interesting with the controversial debates I’ll give you that. \n\nI’d say it’s ok to practice culture but not when it’s detrimental to humanity. Want to celebrate a festival where you have some drinks and eat good food? Cool whatever? Want to do some extremely morally incorrect things. That’s not culture that’s monsterous.", "is_submitter": false, "distinguished": null, "created_utc": 1627292554.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "Alirezahjt", "id": "h6kkhzv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "ort1no", "stickied": false, "body": "If you do not preserve the culture and tradition, you will forget the mistakes your ancestors made and might be prone to making those mistakes again.", "is_submitter": false, "distinguished": null, "created_utc": 1627294302.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "BuccaneerRex", "id": "h6l3gx1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "ort1no", "stickied": false, "body": "OK, but they will be anyway. Like all human behaviors, culture and tradition are subject to evolutionary pressures, AND have the added inertia of human sentimentality or rejection. \n\nBad ones will fade out, and good or neutral ones will tend to stick around according to their individual appeal.", "is_submitter": false, "distinguished": null, "created_utc": 1627307022.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "iamnotroberts", "id": "h6l7stl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ort1no", "stickied": false, "body": "This is too general and too broad. There are good traditions and elements of culture and bad ones. Don't throw the baby out with the bathwater.", "is_submitter": false, "distinguished": null, "created_utc": 1627309162.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "thelma1907", "id": "h6lkl8w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #30", "submission": "ort1no", "stickied": false, "body": "True, but I think this sentiment should more be said as \"People should be free to live their lives as they chose\". If someone loves their culture and traditions and wants to carry them on, they can and if someone else want to live free of them, they can. If somewhere along time's way, less and less people carry them and eventually they disappear or evolve, at least the traditions will be looked back on without the taint of obligation and resentment.", "is_submitter": false, "distinguished": null, "created_utc": 1627315004.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "theascendedcarrot", "id": "h6lqzjy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #108", "submission": "ort1no", "stickied": false, "body": "When they are preserved simply for the sake of preservation, yes. Some traditions do make sense however.", "is_submitter": false, "distinguished": null, "created_utc": 1627317805.0, "parent_id": "t3_ort1no", "replies": [{"author": "Kweldulf", "id": "h6mnzv2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "ort1no", "stickied": false, "body": "Like what for example?", "is_submitter": false, "distinguished": null, "created_utc": 1627332227.0, "parent_id": "t1_h6lqzjy", "replies": [{"author": "theascendedcarrot", "id": "h6mqipy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #108", "submission": "ort1no", "stickied": false, "body": "Funerals offer the living a chance to grieve together and support one another. They allow you to face the physical manifestation of the deceased and make your peace. Some may not benefit from this, but they are outweighed by the many that do.", "is_submitter": false, "distinguished": null, "created_utc": 1627333344.0, "parent_id": "t1_h6mnzv2", "replies": [{"author": "Kweldulf", "id": "h6n6nb9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "ort1no", "stickied": false, "body": "The only reason some people find comfort in it is their cultural background - and many cultures do not have such funeral rites. It is very euro-centric to consider this to be a universal thing to human nature. And as such it is just another argument for cultural ritual being unnecessary.", "is_submitter": false, "distinguished": null, "created_utc": 1627340922.0, "parent_id": "t1_h6mqipy", "replies": [{"author": "theascendedcarrot", "id": "h6n94wo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #108", "submission": "ort1no", "stickied": false, "body": "You ask for an example of a tradition, to which I obliged, then you accuse me of implying that it is a universal idea when I made no such claim. Funerals are a tradition where I come from. Death rituals are commonplace around the world. They look different depending on the location, but they are present in nearly every (if not all) documented cultures in the world.", "is_submitter": false, "distinguished": null, "created_utc": 1627342149.0, "parent_id": "t1_h6n6nb9", "replies": []}]}]}]}]}, {"author": "Kelyaan", "id": "h6nhhmk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "ort1no", "stickied": false, "body": "No debate given, No rebuttal needed - Again you're fucking bad at this - As the initiator you are meant to give us a starting point for which the debate stems from.  \n\n\nYou've given nothing therefor I can simply say - yes it should. And there's the end of that.", "is_submitter": false, "distinguished": null, "created_utc": 1627346411.0, "parent_id": "t3_ort1no", "replies": [{"author": "Financial-Process-86", "id": "h6o70m8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #268", "submission": "ort1no", "stickied": false, "body": "This is dumb. He's not arguing against or for it. He's trying to gauge general audience sentiment. Obviously you are for it. Lol.\n\nSee. Null hypothesis versus alternate hypothesis.", "is_submitter": false, "distinguished": null, "created_utc": 1627360254.0, "parent_id": "t1_h6nhhmk", "replies": []}]}, {"author": "Financial-Process-86", "id": "h6o6ufg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #268", "submission": "ort1no", "stickied": false, "body": "I think you can make the argument for or against it quite well. I like specialty food. Cultures and traditions make intricate nuanced food. Hence I believe they should be presented.\n\nHowever from a practical order idealogy. Cultures/traditions have no place. Pure order would be pure efficiency. But many humans think that would be depressing.\n\nUltimately it doesn't matter cause u can't control people so cultures and traditions will persist untill the last one who maintains it dies.", "is_submitter": false, "distinguished": null, "created_utc": 1627360141.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "Arisdoodlesaurus", "id": "h6ozxw6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #102", "submission": "ort1no", "stickied": false, "body": "Culture should be preserved but tradition shouldn’t", "is_submitter": false, "distinguished": null, "created_utc": 1627384123.0, "parent_id": "t3_ort1no", "replies": []}, {"author": "metalhev", "id": "h6q09lt", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "ort1no", "stickied": false, "body": "That doesn't even make sense", "is_submitter": false, "distinguished": null, "created_utc": 1627402785.0, "parent_id": "t3_ort1no", "replies": []}]}