{"title": "A Fun Little Theory I Had...", "name": "t3_pjkonk", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pjkonk/a_fun_little_theory_i_had/", "selftext": "*I should clarify that I don’t really take any of this stuff seriously- it’s no more real to me than a comic book or any other conspiracy theory, but I understand some people may take this *VERY* seriously so like... don’t get offended. It’s not my intention to do so, and I’m not trying to make any statements about anyone’s religion- just goofing around with some ideas.*\n\nThink for a minute about what most Christian depictions if God is like; there’s the Old Testament which shows god as terrifying, wrathful, vengeful, and almost hating humans. Depicted as a tyrant I’d say, and with all the angels (and saints if you’re catholic) being these awful assholes of abstract rules and laws... then think about how they described these guys visually, almost Cthulhu-esque. Mortals were alleged to flee in terror, go insane, or worse when seeing their true forms.\n\nNow let’s look at Satan; depicted as Lucifer Morningstar, and Angel fallen from Heaven and either sent to rule he’ll as penance or willingly claiming that realm as his own (depending on the story). Chaotic, free, full of debauchery, and hedonistic by nature- it’s reminiscent of many deities in other religions, not evil ones though... usually tricksters or divine beings tied to nature and primality. \n\nSo on the one hand we have “God” who’s tyrannical, full of rules, wrathful, and then is associated with the Heavens; then you have “Satan” who’s chaotic, hedonistic, and wild, and is associated with the depths of Hell... it’s not hard then to see parallels they have to another concept...\n\nLet’s imagine Satan is a manifestation of nature; the primal, unpredictable, and wild aspects of the world. An embodiment of the Earth even, since his realm is often depicted being in the depths beneath us. Then God would be an Outsider, something from beyond. You could think of God as alien if that helped, or a rival deity- but God is not from here. God is essentially an invader.\n\nSo imagine it now; think about the story of God and Satan from that perspective instead... You are a tyrant, you invade and take over a world of people, and to make sure nobody questions you you’re going to disenfranchise your enemy and make them seem as if they were always beneath your control, that they were a traitor, and that they’re pure evil... that they were never a god to begin with. So now think about the New Testament, how the look of God has changed over time and how there’s essentially been a “rebranding” to something more palatable to humans over time. \n\nThat’s the theory; God is some foreign invader who overthrew Satan, the original “Gaia” in a sense, and sold a conspiracy to cover it up. It’s a fun thought experiment, and I don’t believe in any of that religious stuff- but it’s still pretty cool huh?", "score": 6, "upvote_ratio": 0.75, "permalink": "/r/TheFlyingTree/comments/pjkonk/a_fun_little_theory_i_had/", "id": "pjkonk", "author": "FlynnXa", "link_flair_text": "Idea", "num_comments": 9, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1631011860.0, "comments": [{"author": "DoglessDyslexic", "id": "hbx2lxq", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pjkonk", "stickied": false, "body": "Worth noting that Yahweh in Christianity is derivative of Elohim/El from the Semitic polytheistic pantheon which in turn derivative of the Babylonian and Canaanite polytheistic pantheons.  The Semitic religions didn't become monotheistic until about 560 BCE and was derivative of Persian monotheism.  Prior to that, Elohim actually had a consort goddess (Asherah) and a rival god (Baal) in those pantheons.\n\nSatan (or ha-Satan) arose during approximately the same time as the Semitic religions becoming monotheistic and the name itself means \"adversary\" and is a mix between the concept of opposing gods and the Persian Angra Mainyu, a being a pure chaos.  Essentially having removed a source of conflict from a polytheistic pantheon, the Semitic theologians of the time needed an opposition figure and a solution for the problem of evil, since otherwise there would be no explanation for why an unopposed Yahweh could not make the world a paradise.\n\nAlso worth noting that angels and demons used to be more along the lines of greater and lesser servants of the gods, but over time the demons were increasingly associated with evil, and in Milton's \"Paradise Lost\" (among other influences) cemented in the minds of the masses the notion of them and Satan being exiled to hell.", "is_submitter": false, "distinguished": null, "created_utc": 1631013350.0, "parent_id": "t3_pjkonk", "replies": []}, {"author": "Flesh_Bag", "id": "hbx0wj0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #95", "submission": "pjkonk", "stickied": false, "body": "Hmm, im listening.", "is_submitter": false, "distinguished": null, "created_utc": 1631012093.0, "parent_id": "t3_pjkonk", "replies": []}, {"author": "Buarg", "id": "hbx6sh7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pjkonk", "stickied": false, "body": "Well, from a comparative mythology point of view that's pretty much what happened. If you take a look at the different demon's names most of them are deities from other religions from the times of the old testament. (Beelzebub is a corruption of the canaanite Baal for example)", "is_submitter": false, "distinguished": null, "created_utc": 1631016158.0, "parent_id": "t3_pjkonk", "replies": []}, {"author": "SybariteAussie", "id": "hbx8rbe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pjkonk", "stickied": false, "body": "The Vatican decided to remove the book of Enoch from the bible in the 1200s ish. It’s available free on YouTube as a audiobook. It’s worth listening to at least once. There’s four parts.", "is_submitter": false, "distinguished": null, "created_utc": 1631017366.0, "parent_id": "t3_pjkonk", "replies": []}, {"author": "ARtEmiS_Oo", "id": "hbxec35", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "pjkonk", "stickied": false, "body": "I find that god is more an idea than a physical thing. Imagine the concept of a story today. It’s a message contained in a plot. The characters are fictional and represent values/types. \n\nWhy can’t be the bible like that? A fantasy story with a moral message. Do well onto other so that we may all live in heaven( decent society)\n\nPeople long ago were not imbeciles, they were just as sophisticated as us, just look at the great generals of history and you can’t deny it. \n\nThe more I look at it the more I tend to see it like this.", "is_submitter": false, "distinguished": null, "created_utc": 1631020443.0, "parent_id": "t3_pjkonk", "replies": [{"author": "Virtual_Pasts", "id": "hbxh01q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #264", "submission": "pjkonk", "stickied": false, "body": "It is important to note that the Bible can't actually be like that at all. It's an anthology that was assembled centuries after the various pieces were written. The Bible isn't a coherent narrative and it's certainly not a \"fantasy story\" since it predates fantasy as a genre and it includes a dozen different genres and styles of writing. Some part of some books of the Bible include mythology and cultural legends, but I think comparing works like those included in the Bible to genre fiction is inaccurate.", "is_submitter": false, "distinguished": null, "created_utc": 1631021772.0, "parent_id": "t1_hbxec35", "replies": [{"author": "ARtEmiS_Oo", "id": "hbxh7xi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "pjkonk", "stickied": false, "body": "Mythology is fantasy to me so you see how I would think that.\n\nAlso, it is not unheard of that someone finished another’s work (week of time)", "is_submitter": false, "distinguished": null, "created_utc": 1631021880.0, "parent_id": "t1_hbxh01q", "replies": []}]}]}, {"author": "ShaBa42", "id": "hbx1tlo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pjkonk", "stickied": false, "body": "The Flying Tree is real.", "is_submitter": false, "distinguished": null, "created_utc": 1631012777.0, "parent_id": "t3_pjkonk", "replies": []}, {"author": "keyless-hieroglyphs", "id": "hbx1sre", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #149", "submission": "pjkonk", "stickied": false, "body": "Let us pray for the one who needs it most.", "is_submitter": false, "distinguished": null, "created_utc": 1631012759.0, "parent_id": "t3_pjkonk", "replies": []}]}