{"title": "Have you guys heard of UBI?", "name": "t3_oz3avf", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oz3avf/have_you_guys_heard_of_ubi/", "selftext": "I find the concept interesting, but my knowledge of economics is little more than the idea of earning money to spend money, and interest.\n\nAnyone with a better understanding on this sub?", "score": 12, "upvote_ratio": 0.94, "permalink": "/r/TheFlyingTree/comments/oz3avf/have_you_guys_heard_of_ubi/", "id": "oz3avf", "author": "FnchWzrd314", "link_flair_text": "Question", "num_comments": 62, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628242322.0, "comments": [{"author": "Nothemagain", "id": "h7x1ltu", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #134", "submission": "oz3avf", "stickied": false, "body": "UBI is basically quantative easing applied on a global socio economic scale & an upgrade in standards of living for modern day society in some places more progressive countries have trialled UBI in regions as case studys the results were very positive in terms of the effect on the overall smaller societies they tested the scheme in.", "is_submitter": false, "distinguished": null, "created_utc": 1628243588.0, "parent_id": "t3_oz3avf", "replies": [{"author": "TSM-", "id": "h7x6t0h", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #39", "submission": "oz3avf", "stickied": false, "body": "While technically not \"UBI\", Spain has introduced a \"Minimum Living Income\". Basically, they will ensure you get about 1100 euros a month, and if you make less than that, they will top it off with the difference. \n\nIt is a quality of life thing, but one that allows people to change careers,                                  stay afloat through a disability, or get through a period of unempoyment, without all the overhead of employment insurance or being locked into a bad job without alternatives and those downsides. \n\nIt also keeps lower income communities' economies going, making it possible to open a shop or business, because people can actually afford to buy things sometimes. As long as there is some carefulness to avoid fraud or abuse, it just makes sense.\n\nUBI is a bit more extragant and maybe has more problems to it, but a \"minimum income\" totally makes sense to me. It's not like they are living in luxury on the minimum income. It is like the least they could do to keep people afloat and better than the patchwork of support systems like EI + hospitals + food banks, etc.", "is_submitter": false, "distinguished": null, "created_utc": 1628247829.0, "parent_id": "t1_h7x1ltu", "replies": [{"author": "Cheomesh", "id": "h7y3a47", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "oz3avf", "stickied": false, "body": "Might explain third long-standing unemployment issues.", "is_submitter": false, "distinguished": null, "created_utc": 1628264448.0, "parent_id": "t1_h7x6t0h", "replies": [{"author": "SoulWanderer", "id": "h7yco3a", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "oz3avf", "stickied": false, "body": "No, it does not.\nGovernment is not paying that basic income, they are using every paper, every excuse not to give it. Why? There is no money.\nIt was approved as a populist measure, with no economic plan behind.\nSource :know a lot of people having trouble requesting it...", "is_submitter": false, "distinguished": null, "created_utc": 1628268396.0, "parent_id": "t1_h7y3a47", "replies": [{"author": "Cheomesh", "id": "h7yp91t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "oz3avf", "stickied": false, "body": "Shocking.", "is_submitter": false, "distinguished": null, "created_utc": 1628273703.0, "parent_id": "t1_h7yco3a", "replies": []}]}]}]}]}, {"author": "amitym", "id": "h7yf1vj", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "oz3avf", "stickied": false, "body": "Basically the idea is that in a modern economy, everyone (whether poor, rich, or in between) does better the greater the fraction of society with a \"disposable income,\" meaning, you have met all your basic needs and have a little left over to do things like buy stuff that makes your life better, or travel places, or pursue a creative or entrepreneurial project, or be able to quit your job and study or retrain as something else and go to work in a new field in a few years.\n\nAll those things -- consumer goods, services, economic mobility, and so on -- lead to greater overall prosperity and, in general, greater income equality.\n\nNot a complicated concept, right?  But it requires that you not treat your population as a disposable workforce being paid an absolute minimum wage that the labor market will bear.  You have to ensure that everyone is going to get more than that.\n\nIt's a concept that is sometimes associated with the American industrialist Henry Ford, who hit on the idea of choosing to pay his many thousands of workers a much higher wage than the market rate, so that they could afford to buy the cars that he produced in his factories.  The idea is, if your workers can afford your goods, then you have created a new market for your goods.  The workers prosper more, you sell more cars, it is a pretty good deal.  Because of that association, it is sometimes called \"fordism.\"\n\nThe one thing it is bad at is creating or maintaining steep wealth differentials.  So if your goals are social control and lack of mobility, or if you measure success as having lots more money proportional to other people, who have very little compared to you... then you will not like these ideas of highly-paid workers or universal basic income.\n\nThe people who value those things are very good at packaging and marketing their message, so you will see a lot of people even on reddit who have been socially programmed to argue against anything that disrupts those goals, even if the arguments make no sense.  They don't have to make sense, they just have to generate lots of confusion and doubt, and drive you to passivity and apathy.  But basically what they all boil down to is, \"we should not have things like UBI because wealth inequaltiy and lack of social mobility are more important than prosperity.\"\n\nMost people -- even most rich people -- don't actually agree with that.  But, there is a lot of confusion anyway.", "is_submitter": false, "distinguished": null, "created_utc": 1628269387.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "PhilboBaggins111", "id": "h7ybby7", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "oz3avf", "stickied": false, "body": "If you don't know about it, you will in 10 years. UBI is coming. There is literally no other reasonable solution to deal with the coming automation of most jobs", "is_submitter": false, "distinguished": null, "created_utc": 1628267838.0, "parent_id": "t3_oz3avf", "replies": [{"author": "germz80", "id": "h7zpc1t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "oz3avf", "stickied": false, "body": "People have been saying that new technology would get rid of most jobs for over a hundred years. I do think modern technology has greatly reduced demand for factory jobs in the US, but I'm not convinced we're that close to a point where it will have a significant impact on unemployment.", "is_submitter": false, "distinguished": null, "created_utc": 1628289788.0, "parent_id": "t1_h7ybby7", "replies": [{"author": "Karrion8", "id": "h814fi7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oz3avf", "stickied": false, "body": "This is a more solid point than most people realize.  At the turn of the 20th century it was something like 40% of all jobs were in agriculture. With the addition of tractors and automation it became 8% in about 2 decades.  It was a huge change.  People still managed to get jobs in other sectors.  \n\nI would like UBI to be a thing, but I feel like we might be putting too much faith in people.  There's an old saying \"poor people have poor ways\".  Meaning that those that live in poverty make decisions that help keep them in poverty.  There are definitely systemic problems that contribute to that. Sometimes giving them money is the answer.\n\nAt the same time we should recognize that UBI is not a panacea.  There will be those that have it and still don't feed or clothe their kids.  There will be those that still choose to be homeless (free to wander).  There will be those that will use the money to feed their addiction.  The problem is people have their own perspective and their own desires and make irrational choices.  Rich people make irrational choices too, they are just more financially prepared to cope with the consequences.", "is_submitter": false, "distinguished": null, "created_utc": 1628319648.0, "parent_id": "t1_h7zpc1t", "replies": [{"author": "germz80", "id": "h81oaxt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "oz3avf", "stickied": false, "body": "I feel kind of neutral about UBI. I feel like there are a lot of bad arguments for and against. I just want to see how it actually plays out, but too many arguments seem dogmatic. I like the fact that there have been a lot of experiments, but it seems like there have been mixed results, so I'm not entirely convinced it will have good outcomes. I guess I hope some state or country other than mine can try it out to see if it really does have good outcomes and is sustainable, if so, I imagine more and more states and countries will naturally adopt it because it clearly works.", "is_submitter": false, "distinguished": null, "created_utc": 1628336720.0, "parent_id": "t1_h814fi7", "replies": [{"author": "Karrion8", "id": "h8393v8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oz3avf", "stickied": false, "body": "Under the current tax system in the US, it is untenable.  It would collapse in on itself.  \n\nWe need a tax system that will collect on all transactions and eliminate loopholes that allow the wealthy to escape paying anything.  Something like a value added tax system or even a consumption tax.  Basically, so one can have money without having paid taxes on it.  There are problems with these systems, but the gains are likely better than the problems.  \n\nThen, pay citizens 18 or older a dividend or stipend.  There should probably be a minimum and a maximum to weight it towards the poor.", "is_submitter": false, "distinguished": null, "created_utc": 1628365584.0, "parent_id": "t1_h81oaxt", "replies": [{"author": "germz80", "id": "h83elww", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "oz3avf", "stickied": false, "body": "My understanding of the arguments about its practicality is that UBI had the advantage of being able to get rid of current welfare systems, so you save money on tracking who needs welfare, so you have to deal with way more people in a more streamlined way. If you need to *keep* the systems that track who needs more money, it seems like you wouldn't get that savings, making it way more expensive.", "is_submitter": false, "distinguished": null, "created_utc": 1628368292.0, "parent_id": "t1_h8393v8", "replies": [{"author": "Karrion8", "id": "h84ggi5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oz3avf", "stickied": false, "body": "There may be some tracking, but it's not as much as it is now.  More importantly, it takes out any decision making.  Also, that scenario sort of assumed no or little change to the social security system.  That system still requires some tracking.  In other words that sort of data is tracked rather efficiently and without a lot of hands on work by the government systems.  \n\nIf we were to eliminate SS in favor of a straight non-weighted plan for everyone it would still be better than nothing.  More than likely there would still be some circumstances where someone has to get involved.  I.E a severe disability where a standard amount would be insufficient for quality of life.", "is_submitter": false, "distinguished": null, "created_utc": 1628387988.0, "parent_id": "t1_h83elww", "replies": []}]}]}]}]}, {"author": "PhilboBaggins111", "id": "h8403cy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "oz3avf", "stickied": false, "body": "While I beleive your point is valid, I disagree on the basis of the rate of societal change being much greater than it has been in the past 100 years. Specifically, due to new technologies like the internet that let us share information with each other, I beleive change is starting  to become much more exponential, rather than steady and gradual as it has been over the past 100 years or so.  In the past this gradual change has allowed people to adapt and learn new skills where they were needed. But the coming automation of jobs will require a much more skilled workforce than we currently have with much more specialized skills that we simply do not have the ability to nurture, especially with our shit educational system, in the US at least.\n\nHonestly, in the next 10 years or so I could see truck drivers (or ubers, delivery drivers, anything drivers), most fast food jobs, cashiers, farm workers, telemarketers, factory workers, warehouse workers, and many more i simply can't think of off the top of my head completely being taken over by bots. These workers will be displaced and forced to find other jobs that they may simply not have the skills for. They will need some form of UBI or they will all flounder and we will have major societal upheaval. We simply don't have enough time to convert all of our unskilled workers to the skilled workers we will need going into the future without some form of UBI. But feel free to disagree and poke holes in my theory.", "is_submitter": false, "distinguished": null, "created_utc": 1628379092.0, "parent_id": "t1_h7zpc1t", "replies": [{"author": "germz80", "id": "h84g962", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "oz3avf", "stickied": false, "body": "I think a lot of those jobs will take longer to replace than you suggest. Yes, some is already happening, but there's also currently massive demand for employees. And even the jobs that are being and will be replaced by bots don't really in even a 90% loss in employment at those companies because they will need people to maintain the bots, and I think do other things. Perhaps I'm just naive, but I really doubt we will see a fully automated McDonalds' within the next 30 years.\n\nI also think a lot of people already realize that we have to train young people for jobs that don't currently exist, which sounds impossible, but I think it's mainly about learning how to learn and adapt. I studied IT in college, and the professors emphasized that we need to approach our professions with the realization that we need to be able to adapt. So it will likely be more difficult for people who don't go to college, but I don't think lacking a university degree will be a dead end. But we'll see.", "is_submitter": false, "distinguished": null, "created_utc": 1628387876.0, "parent_id": "t1_h8403cy", "replies": [{"author": "PhilboBaggins111", "id": "h84j0gl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "oz3avf", "stickied": false, "body": "Those are good points as well. And really, nobody can say what the future holds, this is all speculation. I just happen to think, that especially for young people today, there is going to need to be some form of UBI. Especially if we expect any of them to pay their way through more and more complicated college educations. \n\nCall me pessimistic, but I feel like runaway capitalism where profit is the focus and the labor shortage in the US right now will only encourage companies to focus more on automation. If they aren't willing to pay employees more and there aren't enough workers who want these jobs, the obvious solution is to focus on creating workers who don't ask to be paid and don't screw up. Robots. Personally, I think in the next 30 years its a guarantee that we'll see a fully automated McDonald's. They're are literally already fully automated resturants. Many in Japan. From a capitalist standpoint its a no-brainer.", "is_submitter": false, "distinguished": null, "created_utc": 1628389376.0, "parent_id": "t1_h84g962", "replies": [{"author": "germz80", "id": "h84n29t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "oz3avf", "stickied": false, "body": "Huh, I didn't know that Japan had fully automated restaurants, that does sound like it could be a game changer if that proliferated in the US.", "is_submitter": false, "distinguished": null, "created_utc": 1628391685.0, "parent_id": "t1_h84j0gl", "replies": []}]}]}]}]}]}, {"author": "BuccaneerRex", "id": "h7xdke7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "oz3avf", "stickied": false, "body": "I like Red Red Wine, but I think Kingston Town is a better song.", "is_submitter": false, "distinguished": null, "created_utc": 1628252435.0, "parent_id": "t3_oz3avf", "replies": [{"author": "amitym", "id": "h7yfk25", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "oz3avf", "stickied": false, "body": "That's UB40, not UBI.\n\nUBI is an international press syndicate.", "is_submitter": false, "distinguished": null, "created_utc": 1628269601.0, "parent_id": "t1_h7xdke7", "replies": [{"author": "BuccaneerRex", "id": "h7yhxn5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "oz3avf", "stickied": false, "body": "That's UPI.\n\nYou're thinking of the 80s Sitcom production company.\n\nSit UBI, Sit. Good dog. *arf.*", "is_submitter": false, "distinguished": null, "created_utc": 1628270603.0, "parent_id": "t1_h7yfk25", "replies": [{"author": "blackcurry328", "id": "h7zgye1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #14", "submission": "oz3avf", "stickied": false, "body": "No, that’s Ubu.\n\nUBI is an infection of the bladder, kidneys, or urethra. You can prevent those by drinking cranberry juice, and going to the bathroom as soon as you feel the need to urinate.", "is_submitter": false, "distinguished": null, "created_utc": 1628285865.0, "parent_id": "t1_h7yhxn5", "replies": []}]}]}]}, {"author": "atlasgaveup", "id": "h7y78ov", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oz3avf", "stickied": false, "body": "Take from the wealthier to give to the poorer.", "is_submitter": false, "distinguished": null, "created_utc": 1628266112.0, "parent_id": "t3_oz3avf", "replies": [{"author": "FnchWzrd314", "id": "h7zi8xl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oz3avf", "stickied": false, "body": "Government approved Robin Hood", "is_submitter": true, "distinguished": null, "created_utc": 1628286455.0, "parent_id": "t1_h7y78ov", "replies": []}]}, {"author": "Happy_INTP", "id": "h7y911j", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #69", "submission": "oz3avf", "stickied": false, "body": "Yes and I think it is a wonderful idea.  :)", "is_submitter": false, "distinguished": null, "created_utc": 1628266871.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "dashingThroughSnow12", "id": "h7x78c6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "oz3avf", "stickied": false, "body": "I think many people who claim to like the idea of UBI actually want Guaranteed Minimum Income. In terms of GMI, we have a version of that with the different benefits and programs for the poor.", "is_submitter": false, "distinguished": null, "created_utc": 1628248172.0, "parent_id": "t3_oz3avf", "replies": [{"author": "SurprisedPotato", "id": "h7xef33", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #192", "submission": "oz3avf", "stickied": false, "body": "Not me.\n\nFor example, suppose the GMI was $1000/month. Then, if you earn $500/month, there's literally zero incentive to earn more money, unless you can jump all the way to $1000. A similar problem occurs with any means-tested welfare programme - for example, at one time, an Australian earning $50000/year, with a specific combination of children and partner's income, would have only kept about 15c on every extra dollar earned - an effective marginal tax rate of 85% or so.\n\nA UBI doesn't present the same disincentive to earn.", "is_submitter": false, "distinguished": null, "created_utc": 1628252927.0, "parent_id": "t1_h7x78c6", "replies": [{"author": "dashingThroughSnow12", "id": "h7xga4i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "oz3avf", "stickied": false, "body": "Where do you live?\n\nGMI is never implemented the way you describe it. Say if GMI was 1000$/month, they'd be a clawback of GMI. Say if you may 500$/month, perhaps GMI going down to 800$/month. Some GMI implementations have negative clawback, where if you made 200$/month, the amount of GMI would increase to 1100$/month.\n\n(All numbers are pedagogical.)", "is_submitter": false, "distinguished": null, "created_utc": 1628253968.0, "parent_id": "t1_h7xef33", "replies": [{"author": "SurprisedPotato", "id": "h7xkib8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #192", "submission": "oz3avf", "stickied": false, "body": "Yes, sure, but either it's clawed back very slowly (pennies on the dollar earned) or it can push low income effective marginal tax rates up to ridiculously high amounts.\n\nIn your example, increasing one's salary from $0 to $500 only increases one's actual nett income by $300. That's like a 40% marginal tax rate on people earning less than $6000/yr.", "is_submitter": false, "distinguished": null, "created_utc": 1628256144.0, "parent_id": "t1_h7xga4i", "replies": [{"author": "dashingThroughSnow12", "id": "h7xlrn7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "oz3avf", "stickied": false, "body": "You tire me out.\n\n> Yes, sure, but either it's clawed back very slowly (pennies on the dollar earned) or it can push low income effective marginal tax rates up to ridiculously high amounts.\n\nIt's 2021. We discovered decades ago this issue. We generally try to identify and eliminate those clawback cliffs. This is one reason why some GMI implementations have negative clawback on the low-end of the income spectrum.\n\nLet's ignore that. I get the feeling you aren't into much modern policy.\n\nI'm Canadian but I like using the USA since their numbers are highly available.\n\nOk, let's say UBI 12K/adult/year. 270M adults. That's 3.3TB/year. Whose paying for it?", "is_submitter": false, "distinguished": null, "created_utc": 1628256754.0, "parent_id": "t1_h7xkib8", "replies": [{"author": "dcnairb", "id": "h7yhjyv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oz3avf", "stickied": false, "body": ">whose paying for it?\n\nthere it is. pretty weird to chide someone for not being into “modern policy” and then drop this dinosaur of an argument", "is_submitter": false, "distinguished": null, "created_utc": 1628270444.0, "parent_id": "t1_h7xlrn7", "replies": []}, {"author": "SurprisedPotato", "id": "h7z1sfm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #192", "submission": "oz3avf", "stickied": false, "body": ">We generally try to identify and eliminate those clawback cliffs.\n\nTIL places exist where politicians and sensible tax policy coexist.", "is_submitter": false, "distinguished": null, "created_utc": 1628279115.0, "parent_id": "t1_h7xlrn7", "replies": []}]}]}]}]}]}, {"author": "idiotsonfire", "id": "h7zdxny", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oz3avf", "stickied": false, "body": "Yes.  UBI could totally replace virtually all government programs meant to help the poorest people just by providing them money.  There was a town in California, Stockton, that did a UBI trial of $500/mo, and the [overwhelming result](https://www.npr.org/2021/03/04/973653719/california-program-giving-500-no-strings-attached-stipends-pays-off-study-finds) was that it helped everyone who received the money.  It wasn't wasted.  People who needed money got it, and in at least one case, there was a guy who had an interview to get a better job, but if he took *one day* off to go to the interview, he would have been underwater with bills.  The $500 let him take the day off, he did the interview, and got the much higher paying job.  \n\nA UBI is just a direct payment to the taxpayers of what they have already paid into the government.  Its just a major expansion of social security, extend social security to everyone ages 18 and over, and make the child tax cut from the pandemic relief permanent, and you'll solve a fuckton of problems in the US.", "is_submitter": false, "distinguished": null, "created_utc": 1628284502.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "Skastrik", "id": "h7zz0xm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "oz3avf", "stickied": false, "body": "I think that the wider implications haven't been fully studied.\n\nThere have been a lot of pilot studies and they are promising. \n\nBut having a background in development and planning I'm really inclined to not take limited trials as gospel and always wait for the other shoe to drop.\n\nHonestly think we need to consider UBI for the massive automation and recently the likely permanent remote working culture to come out of covid. Just looking at the 2 year and 5 year plans that the company I work for has planned there will be some serious issues regarding employment in even that short window, let alone industry wide in the next 10 years.   \n\n\nSo lets say in 15 years time we need to have sorted this stuff out. People laid off by automation won't all find jobs. This is a new kind of industrial revolution.", "is_submitter": false, "distinguished": null, "created_utc": 1628294647.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "LoriLuckyHouse", "id": "h7x5cra", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oz3avf", "stickied": false, "body": "Rather than UBI I’ve always been a proponent of Universal Basic Services…medical care, childcare, public education, public housing, food banks, public transportation, internet access, legal aid, etc. My concern about UBI is that it could possibly lead to inflation.", "is_submitter": false, "distinguished": null, "created_utc": 1628246601.0, "parent_id": "t3_oz3avf", "replies": [{"author": "dcnairb", "id": "h7yh4pm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "oz3avf", "stickied": false, "body": "That’s assuming its new printed money specifically for the purpose of UBI right? If it was from taxes would it still lead to inflation? I feel like supplying money to the bottom would incentivize a lit of spending and respending which would boost the economy", "is_submitter": false, "distinguished": null, "created_utc": 1628270270.0, "parent_id": "t1_h7x5cra", "replies": []}, {"author": "haz_mat_", "id": "h7z47fe", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "oz3avf", "stickied": false, "body": ">My concern about UBI is that it could possibly lead to inflation.\n\n🤣 Have you been paying attention? They already print as much money as they want, they just give it to the wealthy.", "is_submitter": false, "distinguished": null, "created_utc": 1628280169.0, "parent_id": "t1_h7x5cra", "replies": []}, {"author": "cptnobveus", "id": "h7yaskr", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #35", "submission": "oz3avf", "stickied": false, "body": "Smartest answer here", "is_submitter": false, "distinguished": null, "created_utc": 1628267614.0, "parent_id": "t1_h7x5cra", "replies": []}]}, {"author": "Munnin41", "id": "h7x0ahx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #298", "submission": "oz3avf", "stickied": false, "body": "I know the basics (I think).", "is_submitter": false, "distinguished": null, "created_utc": 1628242487.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "sparant76", "id": "h7yqm67", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #51", "submission": "oz3avf", "stickied": false, "body": "Is that a venereal disease?", "is_submitter": false, "distinguished": null, "created_utc": 1628274291.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "floofandmemes", "id": "h7yzjaq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "oz3avf", "stickied": false, "body": "Ask an Alaskan, Alaska has a form of UBI for the state.", "is_submitter": false, "distinguished": null, "created_utc": 1628278118.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "haz_mat_", "id": "h7z4352", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "oz3avf", "stickied": false, "body": "They already print as much funny money as they want and give it to the wealthy *for free* to then loan it out and charge interest on everyone else. \n\nMight as well take out the middle man and print some of that into the pockets of people who need it. \n\nPeople against welfare and safety nets for the poor have no clue that we already have welfare and safety nets for the rich. If you screw up and end up on the streets, its your own fault - but when wall street and the corrupt banking establishment makes a bad bet, they get a bailout which goes to more bonuses and fluffing their already extravagant lifestyles. Might as well bail people out of the tent cities popping up across the country.", "is_submitter": false, "distinguished": null, "created_utc": 1628280117.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "pine_ary", "id": "h7zcyi0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "oz3avf", "stickied": false, "body": "If you want to read about UBI experiments I recommend \"Utopia for Realists\" by Rutger Bregman. Great guy", "is_submitter": false, "distinguished": null, "created_utc": 1628284057.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "mudbutt20", "id": "h80y809", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #37", "submission": "oz3avf", "stickied": false, "body": "Yes. It’s the future but probably not for a while.", "is_submitter": false, "distinguished": null, "created_utc": 1628314925.0, "parent_id": "t3_oz3avf", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h7x5fln", "score": -5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oz3avf", "stickied": false, "body": "It's just communism with a new coat of paint. Pass.", "is_submitter": false, "distinguished": null, "created_utc": 1628246667.0, "parent_id": "t3_oz3avf", "replies": [{"author": "cocobisoil", "id": "h7x6b5l", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #87", "submission": "oz3avf", "stickied": false, "body": "So you know nothing of either then.", "is_submitter": false, "distinguished": null, "created_utc": 1628247415.0, "parent_id": "t1_h7x5fln", "replies": [{"author": "1up_for_life", "id": "h7xqaf6", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #277", "submission": "oz3avf", "stickied": false, "body": "When I was young and naive I was a big supporter of paint. Now that I'm older and I understand the ways of the world I know it's mostly just a scam.", "is_submitter": false, "distinguished": null, "created_utc": 1628258867.0, "parent_id": "t1_h7x6b5l", "replies": []}]}, {"author": "FnchWzrd314", "id": "h7x6mkb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oz3avf", "stickied": false, "body": "Alright, trying to teach an American the difference between Stalinism and communism, let's do this.\n\nI'm going to assume by communism, you mean Marxism, which advocated for workers controlling the means of production. His argument was basically that the reason the modern world is so shit is because a labourer's products were owned by his boss, and not him, and thus reduced the amount of joy a worker could get from a job well done. \n\nUBI is just giving everyone enough money to not die, sounds different to me, but what would I know?", "is_submitter": true, "distinguished": null, "created_utc": 1628247684.0, "parent_id": "t1_h7x5fln", "replies": [{"author": "1up_for_life", "id": "h7xr4hy", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #277", "submission": "oz3avf", "stickied": false, "body": "A communist went to a nudist camp and was sitting out on the patio getting a tan. He leans over to the guy next to him and asks \"Have you read Marx?\". The man responds \"Yeah...I think it's these wicker chairs.\"", "is_submitter": false, "distinguished": null, "created_utc": 1628259244.0, "parent_id": "t1_h7x6mkb", "replies": [{"author": "FnchWzrd314", "id": "h7zicpo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oz3avf", "stickied": false, "body": "Ok, good one.", "is_submitter": true, "distinguished": null, "created_utc": 1628286503.0, "parent_id": "t1_h7xr4hy", "replies": []}]}, {"author": "Zealousideal_Mix_629", "id": "h7x8axp", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oz3avf", "stickied": false, "body": "By communism I mean citizens relying more or less completely on the government for all their needs.", "is_submitter": false, "distinguished": null, "created_utc": 1628248965.0, "parent_id": "t1_h7x6mkb", "replies": [{"author": "FnchWzrd314", "id": "h7xf1wy", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oz3avf", "stickied": false, "body": "That's not communism", "is_submitter": true, "distinguished": null, "created_utc": 1628253290.0, "parent_id": "t1_h7x8axp", "replies": [{"author": "Zealousideal_Mix_629", "id": "h7xgi2r", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oz3avf", "stickied": false, "body": "There is Communism, in theory AKA Marxism. And then there is real world Communism AKA the USSR. And we al know how that ended.\n\n(PS. Not an American, but I will let that one slide.)", "is_submitter": false, "distinguished": null, "created_utc": 1628254089.0, "parent_id": "t1_h7xf1wy", "replies": [{"author": "FnchWzrd314", "id": "h7xgkuk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oz3avf", "stickied": false, "body": "The USSR is known as Stalinism, and my apologies for assuming your nationality.", "is_submitter": true, "distinguished": null, "created_utc": 1628254128.0, "parent_id": "t1_h7xgi2r", "replies": [{"author": "Zealousideal_Mix_629", "id": "h7xgw2j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oz3avf", "stickied": false, "body": "No offense taken. Splitting hairs. Let me guess \"real Communism has never been tried\" or something to that affect.", "is_submitter": false, "distinguished": null, "created_utc": 1628254292.0, "parent_id": "t1_h7xgkuk", "replies": [{"author": "FnchWzrd314", "id": "h7xh01i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oz3avf", "stickied": false, "body": "Eh, I don't think communism could really work anyway, humans are inherently selfish I find, and communism is a bit too trusting", "is_submitter": true, "distinguished": null, "created_utc": 1628254352.0, "parent_id": "t1_h7xgw2j", "replies": [{"author": "Zealousideal_Mix_629", "id": "h7xh7fg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oz3avf", "stickied": false, "body": "That's why UBI is doomed to fail, human need a reason to try. Same reason Communism failed in practice.", "is_submitter": false, "distinguished": null, "created_utc": 1628254460.0, "parent_id": "t1_h7xh01i", "replies": [{"author": "FnchWzrd314", "id": "h7xhiy4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "oz3avf", "stickied": false, "body": "I think UBI could work, provided it wasn't super high, like, if you're garunteed to be earning a livable wage, but you still can a little extra money from other jobs, wouldn't you try and improve your station? The great capitalist promise is the ability for anyone to be anything if they work hard enough, isn't it? The problem is that most people are in too precarious a situation to risk it.", "is_submitter": true, "distinguished": null, "created_utc": 1628254632.0, "parent_id": "t1_h7xh7fg", "replies": []}]}]}]}]}]}]}]}]}]}]}