{"title": "So, I'm new here...", "name": "t3_piu2we", "url": "https://www.reddit.com/r/TheFlyingTree/comments/piu2we/so_im_new_here/", "selftext": ".. and from what I've read so far, many are in the same boat and wondering how and why we all wound up here.\n\nFor now, I will settle for this: https://i.imgur.com/o2aZB9D.jpeg\n\nBut my guess is as good as yours.\n\nGreetings and Salutations!", "score": 2, "upvote_ratio": 0.67, "permalink": "/r/TheFlyingTree/comments/piu2we/so_im_new_here/", "id": "piu2we", "author": "Germerican88", "link_flair_text": "Other", "num_comments": 4, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630910563.0, "comments": [{"author": "Seaofpain", "id": "hbs7nep", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "piu2we", "stickied": false, "body": "I just got invited too. I'm not 100% sure what's going on here, but I think I like it haha.", "is_submitter": false, "distinguished": null, "created_utc": 1630912241.0, "parent_id": "t3_piu2we", "replies": []}, {"author": "NotablyNugatory", "id": "hbs9n9v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #523", "submission": "piu2we", "stickied": false, "body": "Welcome. I was new last week. I don’t know a whole lot more, but it’s just kind of what you make it. You’ll either have fun with it or be culled.", "is_submitter": false, "distinguished": null, "created_utc": 1630913862.0, "parent_id": "t3_piu2we", "replies": []}, {"author": "Munnin41", "id": "hbsa17f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #298", "submission": "piu2we", "stickied": false, "body": "One of us one of us one of us", "is_submitter": false, "distinguished": null, "created_utc": 1630914183.0, "parent_id": "t3_piu2we", "replies": []}, {"author": "Walking_the_Cascades", "id": "hbsc97n", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #68", "submission": "piu2we", "stickied": false, "body": "Welcome! When I first landed here I was a bit unsure of what this sub was about. What follows (and precedes!) is a brief write-up for newbies, or Initiates as they are called here.\n\n  \nTheFlyingTree is a private sub, meaning you have to be invited to see it on Reddit. How people are selected for invitations is a bit of a mystery, but the consensus is that a bot (or perhaps a person) picks Reddit users from one of a number of subs (atheist, science/math, and others) and sends out invites.\n\n  \nThe stated purpose of this private community is “…to emulate a very filtered and curated microcosm of the Reddit experience.” Whatever that means.\n\n  \nYou are likely to see any number of jokes about TheFlyingTree being a cult. For some, the joke never gets old. You are also likely to see any number of posts from folks like yourself who are new and not sure what to make of the community.\n\n  \nFeel free to post anything you find interesting or think others might find interesting. As long as you post or simply comment on a post at least once a week you will remain in the community. If not you may be removed automatically from the sub. The removal process is called culling or The Cull. This seems to happen on Mondays. If you stick around for more than a week you get “promoted” via the ranking system. From the sidebar:  \n“Approved users are given ranks, there are druids, the 20 oldest members of the community, 300 Seekers, and the remaining are acolytes. New members are called initiates, and do not have a number next to their rank.”", "is_submitter": false, "distinguished": null, "created_utc": 1630916096.0, "parent_id": "t3_piu2we", "replies": []}]}