{"title": "Dealing with being infantilized. Vent.", "name": "t3_oqsfr9", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oqsfr9/dealing_with_being_infantilized_vent/", "selftext": " Is anyone else needing to deal with this in their life?\n\nI'd like to preface this by saying I love my partner a lot. I'm talking to her about this and I know it comes from a place of caring. But it is still annoying and quite frankly, disheartening. \n\nI was diagnosed a few months ago with ADHD. I now have medication for it and having the right treatment, plus knowing what is wrong with me, has improved the quality of my life a ton.\n\nBut around the time me and some people I'm close to (her included) first even started to suspect I wasn't exactly neurotypical, I noticed a shift in her behavior.\n\nYes, she was always supportive when I struggled with basic things. But suddenly when there was something *wrong*, every little thing became praise worthy. \n\nI did the dishes? *\"Oh my goodness! What a great job honey! I'm so proud of you!\"*\n\nI took out the trash? *\"Wonderful job! You're doing so good!\"*\n\nI paid the bills in time? *\"Wow! Amazingly done darling!!\"*\n\nThe shift from a simple thankyou to THAT felt horrible. I didn't feel like I was doing anything impressive but suddenly she was acting like everything I did was a great feat. I sometimes struggle with longer periods of unemployment but I still have had way more jobs than she has (and I'm currently employed full time). I'm still an adult capable of managing my life. \n\nShe confessed to me yesterday that it's why she doesn't share her issues with me these days. Just like a parent shouldn't burden their children with too many of their troubles, she feels the same. Towards me.\n\n....idk where I'm going with this. It's just horrible right now. I don't regard adhd as a disability.I have never considered myself any sort of disabled even if there have been struggles in my life that others generally didn't seem to have. I manage, and I'm completely cabable. I don't need assistance.\n\nYet, my partner, my fiancee, the person I grew up together with and who's been with me for the past 6 years, is the one person who suddenly doubts my abilities. \n\nShe makes me *feel* disabled.", "score": 18, "upvote_ratio": 0.92, "permalink": "/r/TheFlyingTree/comments/oqsfr9/dealing_with_being_infantilized_vent/", "id": "oqsfr9", "author": "Hjemi", "link_flair_text": "Discussion", "num_comments": 15, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1627141323.0, "comments": [{"author": "N0rthWind", "id": "h6dkk3i", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #74", "submission": "oqsfr9", "stickied": false, "body": "As a fellow non-neurotypical (of a very different kind) I understand the struggle somewhat. I also think that having as clear a picture as possible of what the issue is, exactly, makes you best equipped to handle it, and while it's nice of people around you to offer support if you ask for it, seeing this subtle sense of worry in their eyes makes me sick to my stomach.\n\nNot just that, but it also invalidates all of your achievements since you'll never be judged by the same fair standards as everyone else, for better or worse. Like, fuck off, have I not been doing well enough for myself all these years when not even I knew I had a disorder?", "is_submitter": false, "distinguished": null, "created_utc": 1627142310.0, "parent_id": "t3_oqsfr9", "replies": [{"author": "Hjemi", "id": "h6dmmh3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "oqsfr9", "stickied": false, "body": "YES! I think since being able to research and work towards self-improvement techniques etc specific to my diagnosis, plus the medication actually makes me *more* capable than I was before having any of this insight whatsoever. \n\nYet having a label for it somehow seems to make it so people view me as *less* able to do things than I was even at my worst. \n\nIt's kind of backwards if you think about it. :/", "is_submitter": true, "distinguished": null, "created_utc": 1627143309.0, "parent_id": "t1_h6dkk3i", "replies": [{"author": "N0rthWind", "id": "h6h41jd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #74", "submission": "oqsfr9", "stickied": false, "body": "So many people are terrified of the labels. Even my own therapist pretends like if we don't acknowledge that there's obviously something different about me, it'll be better. It's as if giving it a name makes it real, which is insane - it's already real, giving it a name means that it's something that science has identified and possibly can help manage.\n\nIn my case it's a little more complex and there's no medication, but still I don't understand why we're so afraid to talk about it. It's literally been my everyday existence ever since I knew myself, it's not like if we ignore it for long enough it'll go away, or if we talk about it it's going to get worse. What I need is self-comprehension and maybe some management methods, not to be fucking coddled.", "is_submitter": false, "distinguished": null, "created_utc": 1627222090.0, "parent_id": "t1_h6dmmh3", "replies": []}]}]}, {"author": "ducks_for_hands", "id": "h6dplf6", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #118", "submission": "oqsfr9", "stickied": false, "body": "Sorry to hear what's happening to you OP. And it truly saddens me that I know nothing about how to turn it around and prevent that from happening.\n\nKind regards from a member of the autistic gang.", "is_submitter": false, "distinguished": null, "created_utc": 1627144735.0, "parent_id": "t3_oqsfr9", "replies": [{"author": "Hjemi", "id": "h6dpxs5", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "oqsfr9", "stickied": false, "body": "I appreciate it. Honestly, just getting some of this off my chest in writing form helps a lot. \n\nThankyou for your kind comment. ♡", "is_submitter": true, "distinguished": null, "created_utc": 1627144901.0, "parent_id": "t1_h6dplf6", "replies": []}]}, {"author": "Barisaxgod", "id": "h6f0hj4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #57", "submission": "oqsfr9", "stickied": false, "body": "That really sucks. I have aspergers and I’m hesitant to tell people for similar reasons. I hope you can get this sorted out soon.", "is_submitter": false, "distinguished": null, "created_utc": 1627168472.0, "parent_id": "t3_oqsfr9", "replies": []}, {"author": "DylanowoX", "id": "h6f4qas", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #10", "submission": "oqsfr9", "stickied": false, "body": "I hope your wife will understand. How did she respond?\n\nAt least you’re capable, though. I’m getting evaluated for ADHD soon, and I’m the opposite. I can’t function at all, and my life is in shambles.", "is_submitter": false, "distinguished": null, "created_utc": 1627170804.0, "parent_id": "t3_oqsfr9", "replies": []}, {"author": "gr13fy", "id": "h6gll4a", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #223", "submission": "oqsfr9", "stickied": false, "body": "my husband can sometimes get into this kind of behavier. \n\nhe has learned over the years to reserve it for the times that i *am* truly feeling incapable and messy. and in those moments it does help. \n\ni would urge you to look into codependency. that's about the baseline of what we deal with as i was fairly vulnereble when i met G. and he was not. \n\nso it's been a process of both of us learning to share and take space and support one another equelly. you can get there. but you *both* have to commit to being aware of your selfs. my husband's codepenency did not spring out of nowhere. \n\nand i encoureged it many times without realizing. and some times i even like it. and then i have to examine what's going on and be like okay, no, we're adults.", "is_submitter": false, "distinguished": null, "created_utc": 1627208511.0, "parent_id": "t3_oqsfr9", "replies": []}, {"author": "AndrewIsOnline", "id": "h6dqg4l", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "oqsfr9", "stickied": false, "body": "Have you tried… telling her this in basic words and telling her how your actions make you feel?\n\nIf you can’t communicate clearly with your partner, I don’t think you should be venting on the Internet.\n\nIf there’s anyone in the world who you should be able to sit down and have an honest conversation with, without fear of judgement, shouldn’t it be her? Isn’t that the entire benefit of a marriage/relationship?", "is_submitter": false, "distinguished": null, "created_utc": 1627145146.0, "parent_id": "t3_oqsfr9", "replies": [{"author": "Hjemi", "id": "h6drad5", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "oqsfr9", "stickied": false, "body": "I had to re-read my own post and I just now realized I had forgotten to add that I *have* talked about this with her.\n\nThat's one reason I wanted to vent somewhere too. It's not that we're not talking,  but I also don't see this being instantly fixed (even though now she's aware of how I feel and I understand her perspective more.) \n\nPlus, sometimes it's just nice to get some outside perspectives on stuff. And I do agree, communication is the most important thing when it comes to relationships. There's a reason I proposed to her, she's someone I trust the most in the whole wide world. \n\nI guess that's one reason such a shift in behavior also hurt a whole lot. \n\nHope that makes sense? We're working on it, but I still wanted to vent a bit too.", "is_submitter": true, "distinguished": null, "created_utc": 1627145551.0, "parent_id": "t1_h6dqg4l", "replies": []}]}, {"author": "Slamberten", "id": "h6efmbh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqsfr9", "stickied": false, "body": "I would have a very clear conversation with her explaining how those comments make you feel.", "is_submitter": false, "distinguished": null, "created_utc": 1627157614.0, "parent_id": "t3_oqsfr9", "replies": []}, {"author": "DDumpTruckK", "id": "h6fu7fp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqsfr9", "stickied": false, "body": ">But around the time me and some people I'm close to (her included) first even started to suspect I wasn't exactly neurotypical\n\nI know it's not exactly what neurotypical means, but having ADHD is seemingly more normal than not having it.  I've never had a moment in my life where I had at *least* one friend with it *in every social circle I'm a part of.* And I don't keep very large social circles.  It's common and it's diagnosis is probably either too common, or we should just accept it as part of the human genome at this point.  It's *everywhere.*\n\nIt sounds like your partner is doing some pretty shitty stuff to be honest.  She shouldn't be acting to *anyone* that way, regardless of any neurotypical-ness or not.  It's just rude and offensive.  I may be an outlier on this, but I don't even treat *kids* that way.  I treat them as adults so they can get used to knowing what it feels like to be treated as one, rather than babied and infantilized until they're suddenly 'old enough'.\n\nMy advice is tell all this to your partner.  Tell her you don't want her pity, you don't want her to parent you, and you don't want her bullshit baby talk.  Tell her that a diagnosis isn't a change.  You're exactly the same person you were before.  Tell her she's being a disrespectful cunt.\n\nMaybe don't use words as harshly as I have, there's probably a reason I'm alone and totally disinterested in being in a relationship.  But all the same, you shouldn't have to put up with this and it's totally an awful thing for her to do this to you.  If this were me I'd give her several doses of my trademark brutal honesty.", "is_submitter": false, "distinguished": null, "created_utc": 1627185664.0, "parent_id": "t3_oqsfr9", "replies": [{"author": "Hjemi", "id": "h6git3f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "oqsfr9", "stickied": false, "body": ">It's common and it's diagnosis is probably either too common, or we should just accept it as part of the human genome at this point.\n\nThere's definitely been more diagnosis lately from what I've seen. I'm not sure if it's just that it's easier to diagnose or something. There was a whole generation of women with adhd for example where people generally just...didn't get diagnosed because they present differently than men for example. \n\nThis is not based on any proper stats, just my own experience and what I've seen discussed in different adhd groups (which I joined after getting diagnosed), but I believe a common occurance for example is that a child gets diagnosed first,  and a whole lot of the family follow, as adhd, add, and such DO have a hereditary element. I haven't done proper research to see how it works exactly but it's generally passed down.\n\nA common theory I see discussed and joked about is that people with adhd were just really useful in a hunter-gatherer society and it comes from all the way there.... but I also feel like a similar argument could be made for a plethera of things that we just don't really have that much evidence for. \n\nSorry for latching onto that one part in particular, I just find it interesting. Plus adhd does have a spectrum like a lot of disorders. To some people it's completely debilitating even with help and some folks don't require medication etc at all really. As said in the post, I personally feel that \"disability\" is too strong of a word for my experience, but I'm not denying it does affect me daily. \n\n#As for the rest...\n\nI have talked to her about it twice now. Both were longer conversations. I mentioned in another comment one reason for my vent is that while we do communicate, venting does make me feel better as I don't think this will be instantly fixed. She promised to be more mindful of it and I assured her I understand that she means well, but it might still take awhile to get \"back to normal\" so to say. \n\nShe actually didn't even recognize herself that there even was a \"shift\" in her behavior towards me, so that was interesting to hear and discuss. \n\n>I don't even treat kids that way. I treat them as adults so they can get used to knowing what it feels like to be treated as one, rather than babied and infantilized until they're suddenly 'old enough'.\n\nI agree to a point that this is how it should be. Obviously use language that they can understand if we're talking about very young children, and there are some boundaries to take with them, but it should be more common to treat them the same. \n\nA lot of my work is customer service, and in the training we were instructed to not just greet the parents, but to individually acknowledge the children as well if they're around. Basically treat them like they would be an adult friend/companion of the customer because it makes them feel nice. And I think that's a brilliant point.", "is_submitter": true, "distinguished": null, "created_utc": 1627205841.0, "parent_id": "t1_h6fu7fp", "replies": [{"author": "DDumpTruckK", "id": "h6gkcz2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqsfr9", "stickied": false, "body": ">A common theory I see discussed and joked about is that people with adhd were just really useful in a hunter-gatherer society\n\nYeah I mean, the guy who's what we call 'distracted' and always looking somewhere else for a second before switching his attention would be pretty valuable to spot the encroaching lion that's about to eat his family.  Meanwhile the person who's head down grinding away at their task of chopping wood might not notice the lion stalking up behind him.\n\n>I have talked to her about it twice now.\n\nAh ok.  Then I can't offer much more advice.  Honest conversation and communication is about my limit on giving relationship advice.  I hope everything works out for the better.", "is_submitter": false, "distinguished": null, "created_utc": 1627207336.0, "parent_id": "t1_h6git3f", "replies": [{"author": "Hjemi", "id": "h6gkifq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "oqsfr9", "stickied": false, "body": "I'm sure it will, we've had worse arguments throughout the years. I still appreciate all the input from everyone. Plus, all these interesting conversations! Really neat. :)\n\nThankyou ♡", "is_submitter": true, "distinguished": null, "created_utc": 1627207478.0, "parent_id": "t1_h6gkcz2", "replies": []}]}]}]}]}