{"title": "A small thing that feels so powerful", "name": "t3_p4g28o", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p4g28o/a_small_thing_that_feels_so_powerful/", "selftext": "I was out today with my fiancee, and while walking through the city we saw a stand with some disgruntled people and signs about homosexuality being wrong and how true marriage is only between man and a woman.\n\nJust a few years ago we were too scared to show affection publicly because we worried about this exact kind of attidute and what that could mean for us. Today, we decided to silently protest their little thing by getting extra close and holding hands while walking past them. \n\nI don't think any of them actually paid any attention to us, but it did feel pretty damn powerful. Like giving the middlefinger to them. It's not going to change anything,  it's not going to change anyone's mind, it's not going to be revolutionary at all.\n\nBut damn, if it doesn't feel good.", "score": 77, "upvote_ratio": 0.96, "permalink": "/r/TheFlyingTree/comments/p4g28o/a_small_thing_that_feels_so_powerful/", "id": "p4g28o", "author": "Hjemi", "link_flair_text": "Other", "num_comments": 70, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628974905.0, "comments": [{"author": "BasilDream", "id": "h8ygtcr", "score": 32, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #163 | Classis Veritatus", "submission": "p4g28o", "stickied": false, "body": "It actually changes everything.  It shows them that they are powerless.  It shows the world that you are just a normal couple like anyone else.  Nothing weird, nothing to protest, nothing wrong, just two people happy together.  It shows some kid that the way they feel is perfectly normal.  And I do believe, at least in *some* cases, simply seeing same sex couples together in every day life just being typical people does change minds.  Even if it only enlightens one person it is a big deal.", "is_submitter": false, "distinguished": null, "created_utc": 1628976265.0, "parent_id": "t3_p4g28o", "replies": [{"author": "Alpha-Charlie-Romeo", "id": "h8yzcv7", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p4g28o", "stickied": false, "body": "You're spot on. People tend to dislike things and hate on them because of a lack of understanding or exposure to it. This is a natural thing humans do because the unknown is potentially dangerous.\n\nSo by the OP just going about daily life proving through actions that they are perfectly normal and are no threat to anyone at all. It won't work immediately (or maybe it will) but it definitely does a great deal to changing people's minds.\n\nI read a couple of comments down below of how some people would be more aggressive towards the group. That however would result in the exact opposite reaction to which they desire. Not to mention the immaturity in the act itself. Getting violent just because of different beliefs. This world is getting pretty sad.", "is_submitter": false, "distinguished": null, "created_utc": 1628985315.0, "parent_id": "t1_h8ygtcr", "replies": []}]}, {"author": "Wafflebot3500", "id": "h8yfbsa", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #135", "submission": "p4g28o", "stickied": false, "body": "Good for you! While actually giving them the middle finger would have been nice too (at least IMO), doing what you did and not giving them the attention they seek is probably the best approach. I likely would not have reacted in such a civilized manner...", "is_submitter": false, "distinguished": null, "created_utc": 1628975589.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "floofandmemes", "id": "h8ynmt1", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p4g28o", "stickied": false, "body": "It doesn't affect their lives, why the fuck do they care?", "is_submitter": false, "distinguished": null, "created_utc": 1628979500.0, "parent_id": "t3_p4g28o", "replies": [{"author": "Alpha-Charlie-Romeo", "id": "h8yy9l1", "score": -13, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p4g28o", "stickied": false, "body": "Why the fuck do you care that they care?\n\nWhy the fuck do I care that you care about what they care?\n\nWhat's the point in asking this question altogether when ultimately they're not hurting anyone and can do whatever the fuck they want?\n\nAhhhhhhhhhhhhhhhhhhh", "is_submitter": false, "distinguished": null, "created_utc": 1628984762.0, "parent_id": "t1_h8ynmt1", "replies": [{"author": "dcnairb", "id": "h8z1o9i", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "p4g28o", "stickied": false, "body": "braindead take, even if they’re not physically harming anyone it is hurtful to the people whose existence they’re protesting. It’s probably hard for you to sympathize but just imagine anywhere you went you constantly got reminded that there are groups of people who think you’re an abomination for no reason other than the fact you were born how you were. that shit is not harmless", "is_submitter": false, "distinguished": null, "created_utc": 1628986493.0, "parent_id": "t1_h8yy9l1", "replies": [{"author": "Alpha-Charlie-Romeo", "id": "h8z3gcw", "score": -9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p4g28o", "stickied": false, "body": "Yes, but by dismissing their religion. The very thing that they believe the entire universe runs on. The thing that created them. Don't you think that you're harming them equally as much?\n\nTo make my point in a different way, religious people are harming homosexual people by saying that homosexuality is wrong. Homosexuals are harming religious people by saying that their religion is wrong. Now what I'm trying to say is that rather than picking a side, wouldn't it be better for both sides to be able to say what they want and harm each other in the process? After all words are just words. Sure words can be harmful, but preventing groups of people from being able to speak would be far more harmful. Because as we all know when a group's voice cannot be heard, actions will speak louder.\n\nIn shutting down religious people, all we're doing is driving them to action. Since that is not something we want, it would be far better to allow words to be said and for it to be up to each individual to not let the words harm them.", "is_submitter": false, "distinguished": null, "created_utc": 1628987409.0, "parent_id": "t1_h8z1o9i", "replies": [{"author": "dcnairb", "id": "h8z45q4", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "p4g28o", "stickied": false, "body": "no, because they are choosing to believe that god(s) made gay people but that they're evil. gay people (and anyone else who is discriminated against in such a way) had no choice in existing. the fact that religions and even denominations of these religions exist which don't hold these persecutory beliefs means it is entirely their unfounded faith from which the harm is coming", "is_submitter": false, "distinguished": null, "created_utc": 1628987766.0, "parent_id": "t1_h8z3gcw", "replies": []}, {"author": "floofandmemes", "id": "h8z5a2q", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p4g28o", "stickied": false, "body": "That's absurd. As a religious person myself, the existence of atheists or people of other religions does not affect me. Now, if some people started saying I and everyone else who follows my religion is evil and should (which, there certainly are people who think that), that would affect me, just as doing the same to LGBT would harm them.", "is_submitter": false, "distinguished": null, "created_utc": 1628988342.0, "parent_id": "t1_h8z3gcw", "replies": [{"author": "Hjemi", "id": "h8zadox", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "p4g28o", "stickied": false, "body": "Plus, religion isn't always the only reason people justify hate against the LGBT, obviously I didn't exactly study their stand, but I didn't spot any bible-verses etc. It's a common reason, but not the only one.\n\nWhile I've seen a lot of really gross things coming from different religious groups (honestly, every single one has those rotten eggs), I also know plenty of wonderful, accepting, and truly kind people who are religious.  Co-workers and acquintances who are peaceful, kind and muslims. Family and friends who are open minded and christians (some even lgbtq+ themselves, wow the possibilities haha). \n\nHey, even my fiancee is religious. I'm not, but that's fine too.", "is_submitter": true, "distinguished": null, "created_utc": 1628990907.0, "parent_id": "t1_h8z5a2q", "replies": [{"author": "toychristopher", "id": "h8zdehz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #177", "submission": "p4g28o", "stickied": false, "body": "I don't think religion is really the reason. There are plenty of religions that don't hate LGBT people, and there are plenty of things in religious texts that people don't focus on or protest about today. It's not even settled among Christian religious scholars that the bible even condemns homosexuality for instance, but there are entire religious groups that have made it their mission to protest against LGBT people.", "is_submitter": false, "distinguished": null, "created_utc": 1628992430.0, "parent_id": "t1_h8zadox", "replies": []}]}, {"author": "AndrewIsOnline", "id": "h8z74qq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "What religion are you?\n\nHave you ever tithed or donated?\n\nHas ___religion name here___ ever paid a settlement lawsuit to the family or victim of child abuse that happened in the church, involving a church member?\n\nHas your religion ever been found to move pedophile priests around instead of removing them from the Congregation and shunning them, or turning them into the police? \n\nBy association and donation, you are most likely contributing to evil being committed under the guise of religion. \n\nLike, if you drove the car to a bank robbery, but never went inside, just drove, but the guy inside shoots someone. \n\nAccessory to evil.", "is_submitter": false, "distinguished": null, "created_utc": 1628989277.0, "parent_id": "t1_h8z5a2q", "replies": [{"author": "floofandmemes", "id": "h8z8bb7", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p4g28o", "stickied": false, "body": "It's literally the largest charity and education provider in the world. Yes there's corruption at the top, but my particular diocese doesn't put up with that abusers.\n\nYou have a very one sided view of religion", "is_submitter": false, "distinguished": null, "created_utc": 1628989870.0, "parent_id": "t1_h8z74qq", "replies": [{"author": "AndrewIsOnline", "id": "h8ztd3c", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "Lol, you think widespread child abuse is “just corruption at the top”\n\nThe road To hell is paved my friend.\n\nThe Goodest intentions don’t negate the rampant abuses.", "is_submitter": false, "distinguished": null, "created_utc": 1629001203.0, "parent_id": "t1_h8z8bb7", "replies": []}, {"author": "AndrewIsOnline", "id": "h91429p", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "You never told me your religion so I could shower you with articles on all the horror of its history.", "is_submitter": false, "distinguished": null, "created_utc": 1629035541.0, "parent_id": "t1_h8z8bb7", "replies": []}]}]}]}, {"author": "toychristopher", "id": "h8zd6zo", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #177", "submission": "p4g28o", "stickied": false, "body": "They are hurting people. I grew up in a rural community and I don't really have the words to describe how this kind of protest hurt me. Other people having the \"opinion\" that I shouldn't exist is not the same as me reacting to that. \n\nIt's easy to say that I shouldn't let their words harm me. I said it to others and to myself for years, but that didn't make it true.", "is_submitter": false, "distinguished": null, "created_utc": 1628992324.0, "parent_id": "t1_h8z3gcw", "replies": []}]}]}, {"author": "AndrewIsOnline", "id": "h8yydeu", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "They haven’t hurt anyone…\n\n# yet\n\n\nAnd let’s be real, with these Christian types, the hurt will come eventually. It’s how they radicalize and evangelize.", "is_submitter": false, "distinguished": null, "created_utc": 1628984814.0, "parent_id": "t1_h8yy9l1", "replies": [{"author": "floofandmemes", "id": "h8yykko", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p4g28o", "stickied": false, "body": "\"Christian\"", "is_submitter": false, "distinguished": null, "created_utc": 1628984914.0, "parent_id": "t1_h8yydeu", "replies": []}, {"author": "Alpha-Charlie-Romeo", "id": "h8yyouq", "score": -4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p4g28o", "stickied": false, "body": "Right. And what indication do you have that they will hurt someone? \n\nStop discriminating people. Surely after all these years we should be done with this stuff.", "is_submitter": false, "distinguished": null, "created_utc": 1628984974.0, "parent_id": "t1_h8yydeu", "replies": [{"author": "floofandmemes", "id": "h8yz1ea", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p4g28o", "stickied": false, "body": "Spreading hate is harmful in and of itself.", "is_submitter": false, "distinguished": null, "created_utc": 1628985153.0, "parent_id": "t1_h8yyouq", "replies": [{"author": "Alpha-Charlie-Romeo", "id": "h8z2pta", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p4g28o", "stickied": false, "body": "That's very true. However everything we say has the potential to offend someone. How do you intend on solving that?\n\nWhen I was a kid there was this rhyme. \n\n\"Sticks and stones may break my bones, but words will never hurt me\"\n\nWhile it is just a silly kids rhyme, to me it's a very valuable life lesson. One that's not easy to practice, but it's taught me that I am responsible for my own feelings. And not anyone else. \n\nAlso. Everyone has different perspectives. Stopping people from having different perspectives isn't a good idea as far as I'm concerned because what if we are wrong? Very few villains in history thought they were the bad guys. I can't see any way of which we would be the bad guys for saying homosexuality is normal, but those religious people sure can. Likewise hundreds of years ago, I'm sure people who had slaves couldn't see anything wrong with it but we obviously can. Perspective is a scary thing, it blinds you.\n\nSo as far as I'm concerned, words shouldn't be restricted just because they harm someone emotionally. It would have to have real physical consequences for me to say that \"someone shouldn't be able to say that\".", "is_submitter": false, "distinguished": null, "created_utc": 1628987028.0, "parent_id": "t1_h8yz1ea", "replies": [{"author": "floofandmemes", "id": "h8z48mk", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p4g28o", "stickied": false, "body": "It's not about if it's offensive. It's about if it's intentionally spreading hate. Spreading hate can generate hate crimes, like that night club shooting some years ago. And I never said anything about legal action, or solving a problem, I just said why people would care and the reasons it can affect them.\n\nYou make a lot of assumptions there.", "is_submitter": false, "distinguished": null, "created_utc": 1628987807.0, "parent_id": "t1_h8z2pta", "replies": [{"author": "Alpha-Charlie-Romeo", "id": "h8z5mxb", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p4g28o", "stickied": false, "body": "You're right I'm making a lot of assumptions. I'm doing it on the other posts too. Really sorry about that. It's late, that's my excuse. So I'll end this conversation here and go bed since I don't think I'll do any better if I continue. I hope people understood where I was coming from through this rabble\n\nGood night.", "is_submitter": false, "distinguished": null, "created_utc": 1628988521.0, "parent_id": "t1_h8z48mk", "replies": []}]}]}]}, {"author": "AndrewIsOnline", "id": "h8yzya8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "The fact that they have so much hate in their heart that they went out and made signs and took to the street to spread their hate. They are one step away from a violent mob attack.\n\nI’m not discriminating either, all religion everywhere is evil and should die.", "is_submitter": false, "distinguished": null, "created_utc": 1628985621.0, "parent_id": "t1_h8yyouq", "replies": [{"author": "Alpha-Charlie-Romeo", "id": "h8z0mm5", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p4g28o", "stickied": false, "body": "I'll never understand how you can condemn hate while saying something so hateful and discriminatory.\n\nI mean you're literally telling a group of people that they're evil and should die just because they believe in a religion. That's about as hateful as it gets. I can't even continue talking with you.", "is_submitter": false, "distinguished": null, "created_utc": 1628985957.0, "parent_id": "t1_h8yzya8", "replies": [{"author": "CynAq", "id": "h8z3e4i", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #240", "submission": "p4g28o", "stickied": false, "body": "They said *religion* should die, not *religious people*.\n\nBad faith reactions like yours ~~isn't~~ aren't very inspiring in conversations like these. Was that an innocent reading error or did you just decide to one up what they said and make it suitable for getting offended?", "is_submitter": false, "distinguished": null, "created_utc": 1628987376.0, "parent_id": "t1_h8z0mm5", "replies": [{"author": "Alpha-Charlie-Romeo", "id": "h8z54on", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p4g28o", "stickied": false, "body": "Innocent reading error. I'm sincerely sorry for misrepresenting your words.\n\nBut even so, my point still stands. Insulting people's religion is still pretty hateful if you consider what that religion means to people.\n\nI mean you're saying that religion should die and they're saying homosexuality is wrong. What is the difference between you and those people?", "is_submitter": false, "distinguished": null, "created_utc": 1628988266.0, "parent_id": "t1_h8z3e4i", "replies": [{"author": "AndrewIsOnline", "id": "h8z5w5t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "Religion has birthed millions of hate motivated crimes or immoral crimes like pedophilia and child abuse, while lgbtq people just want to live without fear and hate. \n\nLGBTQ is natural\n\nReligion is unnatural, man made. \n\nThe difference is I have moral and ethical superiority over all religious followers, because I don’t align myself with immoral and hateful religions.\n\nName a religion, I’ll find a list of their horrors.", "is_submitter": false, "distinguished": null, "created_utc": 1628988650.0, "parent_id": "t1_h8z54on", "replies": []}, {"author": "CynAq", "id": "h8z6rul", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #240", "submission": "p4g28o", "stickied": false, "body": "First, you really gotta brush up on your reading skills. I'm not the person you were arguing with first. I came in later to clear up the misunderstanding.\n\nAlso, WHILE you do have a slight point that it's not very nice of that commenter to speak badly about people's beliefs, you can't disregard the fact that the people in question went out of their way to shun and condemn a major part of someone's identity which isn't something they can choose.\n\nLet me give you something to think about and have a conversation if you want to later. I don't know how tall you are but let's say the predominant religion of your country held the belief that people who's exactly as tall as you are standing straight was an abomination and should stoop to a lower height otherwise they were a sinner. Would you rather I as a third person not affiliated with you or that religion, be defending you and your right to be exactly as tall as you are, even it that meant insulting their religion, or that I don't speak bad of their religion and respect their beliefs, even it that meant their beliefs insulted your very being?\n\nNotice that I didn't say they would demand you'd cut off your feet to be shorter and therefore not a sinner, even if it would be a better analogy of trying to tell a gay person just stop being gay.", "is_submitter": false, "distinguished": null, "created_utc": 1628989096.0, "parent_id": "t1_h8z54on", "replies": []}]}]}, {"author": "AndrewIsOnline", "id": "h8z5oa7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "You don’t know how to read", "is_submitter": false, "distinguished": null, "created_utc": 1628988540.0, "parent_id": "t1_h8z0mm5", "replies": []}]}, {"author": "floofandmemes", "id": "h8z4rnv", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p4g28o", "stickied": false, "body": ">I'm not discriminating\n\n>Religion is evil and should die\n\nHmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm\n\nBe the better person", "is_submitter": false, "distinguished": null, "created_utc": 1628988080.0, "parent_id": "t1_h8yzya8", "replies": [{"author": "AndrewIsOnline", "id": "h8z63iu", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "Isn’t it obvious? I already am, since I don’t support religions filled with hate and murder or child abuse.", "is_submitter": false, "distinguished": null, "created_utc": 1628988755.0, "parent_id": "t1_h8z4rnv", "replies": [{"author": "HolisticHolograms", "id": "h90e7kv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p4g28o", "stickied": false, "body": "This is all Nero and Constantine’s fault.", "is_submitter": false, "distinguished": null, "created_utc": 1629016765.0, "parent_id": "t1_h8z63iu", "replies": [{"author": "AndrewIsOnline", "id": "h912ycy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p4g28o", "stickied": false, "body": "Eh, I doubt there was actually that much persecution during that time. Nero isn’t exactly that reliable a narrator, and there’s about 30 well known, widely written scholars and figures of the era who completely fail to mention anything of the sort, and their books could fill a library a few times over.", "is_submitter": false, "distinguished": null, "created_utc": 1629034973.0, "parent_id": "t1_h90e7kv", "replies": [{"author": "HolisticHolograms", "id": "h913gvt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p4g28o", "stickied": false, "body": "Yeah who could explain any social phenomenon with only two leaders anyways", "is_submitter": false, "distinguished": null, "created_utc": 1629035239.0, "parent_id": "t1_h912ycy", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "here_4_cat_memes", "id": "h8yoojp", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #178 | Consortii Concordus", "submission": "p4g28o", "stickied": false, "body": "Cant believe people out there still think homosexuality is “wrong”. It’s just a belief that seems so weird and morally disgusting to me. I’m happy you felt empowered by this—I would feel empowered too. Also congrats on getting a fiancée and good luck with ur wedding", "is_submitter": false, "distinguished": null, "created_utc": 1628980012.0, "parent_id": "t3_p4g28o", "replies": [{"author": "Hjemi", "id": "h8zbc4q", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "p4g28o", "stickied": false, "body": "It's mostly a confusing mindset for me personally, mostly because I really don't see a single way how that part of us is wrong even when I *try* to wrap my head around the homophobic arguments and viewpoints. It's never anything logical afterall. \n\nBut thankyou! We're taking our time with it still, while I did drop out she should finish her college degree before we start to stress about those plans. :) (Plus, by the time that's done maybe the situation in the world is good enough that we can actually have the whole family in!)", "is_submitter": true, "distinguished": null, "created_utc": 1628991388.0, "parent_id": "t1_h8yoojp", "replies": [{"author": "toad4409", "id": "h90a0jk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #145", "submission": "p4g28o", "stickied": false, "body": "Okay take this the right way please because I myself am Bi and I totally support everything you're doing,a lot of people are stuck in \"natural=nature\" in nature you see the majority of species being male female.... not a lot mating for life though so we just barely broke that standard a few hundred or so years ago. Remember we are basically animals, animals that are evolving rapidly and its not the every day person to sit down and think about what this means for us as a species or our impact on others. Most are comfortable living their life as they know it never wondering why they do so or wondering why they think a certain way.", "is_submitter": false, "distinguished": null, "created_utc": 1629013166.0, "parent_id": "t1_h8zbc4q", "replies": [{"author": "Hjemi", "id": "h90bbry", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "p4g28o", "stickied": false, "body": "Don't worry, I get what you mean. And yeah, that's about as close to \"logical\" as the arguments can get, and sure, it does make sense that straight relationships = what keeps the population growing, species evolving.\n\nBut then you have to take into consideration all the cases of homosexuality even in the animal kingdom, and how that can be useful too. My personal favorite example are penguins who adopt abandoned or oprhaned eggs with their same-sex partners. I'm sure there are plenty more but can't remember from the top of my head.\n\nSo even the \"we're animals it's not natural' argument falls short.", "is_submitter": true, "distinguished": null, "created_utc": 1629014235.0, "parent_id": "t1_h90a0jk", "replies": [{"author": "toad4409", "id": "h90iinm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #145", "submission": "p4g28o", "stickied": false, "body": "Yes!!! I was actually thinking of penguins when I was writing that. Among other things. That's why I worded things the way I did. There are always exceptions or fringe cases so to say. The majority of species though live to survive.... survival is copulation and producing heirs....I love that a few species on earth have learned the art of adoption but it's not as prominent as procreation.", "is_submitter": false, "distinguished": null, "created_utc": 1629020668.0, "parent_id": "t1_h90bbry", "replies": []}]}]}]}]}, {"author": "Th0masJefferson", "id": "h8yowai", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #11", "submission": "p4g28o", "stickied": false, "body": "You got to enjoy a day in the city with your fiancée instead of making an ass of yourself spouting off in public about how other people live. Sounds like you win.", "is_submitter": false, "distinguished": null, "created_utc": 1628980117.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "DaBaiterr", "id": "h8yxqm9", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #132", "submission": "p4g28o", "stickied": false, "body": "It reminds me of this video where this woman is protesting about how same sex relationships & marriage is a sin and these two girls stand right in front of her and just passionately kiss it out. \nKeep being bad ass girl!", "is_submitter": false, "distinguished": null, "created_utc": 1628984498.0, "parent_id": "t3_p4g28o", "replies": [{"author": "DELETED", "id": "h90jg27", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p4g28o", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1629021470.0, "parent_id": "t1_h8yxqm9", "replies": [{"author": "Hjemi", "id": "h92bo2e", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "p4g28o", "stickied": false, "body": "Lot less of that now with the masks and everything.  I *kind of* agree though. \n\nI don't mind seeing a quick kiss or a peck on the cheek or such, but it always bothered me when people are practically dry-fucking while having their tongues down eachothers throats out in public... less common, but just uncomfortable for everyone.", "is_submitter": true, "distinguished": null, "created_utc": 1629054388.0, "parent_id": "t1_h90jg27", "replies": []}]}]}, {"author": "boringlesbian", "id": "h8yyl6e", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "p4g28o", "stickied": false, "body": "Nice. When I was living in west Texas, U.S. in the nineties, I protested the protesters by plastering my van with gay rights bumper stickers. It felt very dangerous and I did have few close calls when they realized I was a woman and not a gay man and decided not to beat the shit out of me. Still, it felt good to not kow tow to bigots.", "is_submitter": false, "distinguished": null, "created_utc": 1628984922.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "2xThink", "id": "h8yz25s", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4g28o", "stickied": false, "body": "As someone queer as hell, its such a relief that the tides are changing. These people are losing and they know it. They're actually pathetic; you see them out there, desperately trying to regain ground they rightfully lost and its so satisfying to know that you're helping them lose even more. Eventually, they might even get over it and find something actually useful to do with their time, instead of floundering publicly for no good reason.", "is_submitter": false, "distinguished": null, "created_utc": 1628985163.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "roundearthervaxxer", "id": "h8z01bg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4g28o", "stickied": false, "body": "😀", "is_submitter": false, "distinguished": null, "created_utc": 1628985663.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "arokace", "id": "h8z0fmm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p4g28o", "stickied": false, "body": "The idea of protesting something that literally no one has control over.  Not exactly referring to marriage but just the fact of who you love in life. Uuuuugh...", "is_submitter": false, "distinguished": null, "created_utc": 1628985859.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "amitym", "id": "h8zckil", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "p4g28o", "stickied": false, "body": "You never know.\n\nFor a lot of people stuck in that mindset, a day comes when they look around them and see a queer couple going about their normal lives, and they're just like ... .... \"what the fuck is wrong with me?\"\n\nThat moment doesn't come very often.  Heaven knows it doesn't ever come for some of them.  But every once in a while, it does happen.  And you never know who is going to be the ones who trigger it.", "is_submitter": false, "distinguished": null, "created_utc": 1628992006.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "TesseractToo", "id": "h8yyhuu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p4g28o", "stickied": false, "body": "That's awesome.  <3 Here is a story:  \n\n\nA few years ago I was introduced to this guy on Facebook, I forget exactly how it went but he is a Professor of Theology at a local University and he's Catholic. This is in Australia and soon after I moved here was the vote to allow same sex marriage.   \n\n\nSo this guy strongly said \"no\" to it, that it was wrong and against god and blah balh, but he was also supporting what he called \"peaceful protests\" going on around the area of the city that has more same sex couples. Things like placards, graffiti, etc it was everywhere so people knew what it meant when something just said \"no\" on it and in fact someone paid for a sky writer to write \"no\" in the clouds they make over this neighbourhood.   \n\n\nMy argument was that this is not peaceful as it is deliberately invasive and harmful to the peace and comfort of a community and it is actually a form of violence because it is preventing a fundamental human right and injecting strife and stress into a peaceful community.   \n\n\nWe did not see eye to eye and I ended up dropping him as a FB contact because of his constant anti-LBGT rhetoric was just too awful.  \n\n\nAnyway, as you might know, a little while ago Pope Francis said that same sex relationships have a right to family and civil unions... man I would have liked to be a fly on the wall watching that Professor Catholic jerk guy backpedal lol", "is_submitter": false, "distinguished": null, "created_utc": 1628984876.0, "parent_id": "t3_p4g28o", "replies": [{"author": "chewbaccataco", "id": "h8zaesw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #67 | Classis Veritatus", "submission": "p4g28o", "stickied": false, "body": ">man I would have liked to be a fly on the wall watching that Professor Catholic jerk guy backpedal lol\n\nIf it's anything like the Mormon church right now, he would just say, \"the Pope was just speaking as a man, that statement didn't come from God\" then he would use \"personal revelation\" to justify his opposing stance.", "is_submitter": false, "distinguished": null, "created_utc": 1628990922.0, "parent_id": "t1_h8yyhuu", "replies": []}]}, {"author": "OstensibleBS", "id": "h8zbu95", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #9", "submission": "p4g28o", "stickied": false, "body": "Give them hell man", "is_submitter": false, "distinguished": null, "created_utc": 1628991636.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "jumpinjahosafa", "id": "h8zgujm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #218", "submission": "p4g28o", "stickied": false, "body": "Fuck those people. Good job. Homophobia needs to be a thing of the past.", "is_submitter": false, "distinguished": null, "created_utc": 1628994222.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "CantoErgoSum", "id": "h8zh93g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4g28o", "stickied": false, "body": "These kinds of folks are just making spectacles of themselves now. Their opinion is not widely shared or accepted any longer. Even the smallest gesture is a reminder that they really are doing it all for nothing. Good for the both of you.", "is_submitter": false, "distinguished": null, "created_utc": 1628994435.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "human_shadow", "id": "h8zl145", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #3", "submission": "p4g28o", "stickied": false, "body": "Good for you! Feel it, appreciate it, and own it!", "is_submitter": false, "distinguished": null, "created_utc": 1628996432.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "Solenya-C137", "id": "h8zypkm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #126", "submission": "p4g28o", "stickied": false, "body": "I'm sure those folks are fun at parties...", "is_submitter": false, "distinguished": null, "created_utc": 1629004607.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "SoulWanderer", "id": "h902a3b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p4g28o", "stickied": false, "body": "I cannot understand how this shit happens anymore (the signs about homosexuality being wrong, not you and your fiancee)\n\nI mean, many people does things I feel to be wrong, but I do not understand the need to go out with signs to judge people...\n\nI am a little envious of how much free time that people has... I would burn my ps4 with all that spare time...\n\nOn the other hand, op, you changed the most important thing, your attitud, and that, my friend, is the most powerful and empowering thing you can do. Kudos to you!", "is_submitter": false, "distinguished": null, "created_utc": 1629007113.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "ennovyelechim", "id": "h902vye", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "p4g28o", "stickied": false, "body": "The evolution of these so called people of God who can't respect that the world has moved on means that they are now the ones who are the pariahs. \n\nLBGTQ+ rights have been hard fought for and there is no place left in the world for these placard waving misfits. Who is ruining society? They are, they have nothing to do with the god that they shout about. Cherry picking obscure Bible texts to weaponise hasn't worked for 30 years and they are fast losing relevance in the modern world. So they shout into the night supposedly for a god who would be thoroughly embarrassed by them,  they may as well be howling at the wind. Love is love and hate is hate, when they get to the pearly gates they will get the shock of their existence when they find out hate doesn't get you in. \n\nNot that I care I don't believe,  but if I was a Christian god and did pop down for a visit I'd be opening up a can of major smiting on people of hate that used my name and I was save a very special lighting bolt for anyone who runs a conversion therapy group.\n\nIts not all about the big protests fighting for rights its the small things too, it's easy to be brave in a crowd, it's truly brave to hold hands in front of bigotry when there's only two of you. You are my heroes and I thank you for holding up a beacon of light in the darkness.", "is_submitter": false, "distinguished": null, "created_utc": 1629007563.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "ace_in_training", "id": "h907y12", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #1", "submission": "p4g28o", "stickied": false, "body": "That's so adorable. Kudos to both you!!!", "is_submitter": false, "distinguished": null, "created_utc": 1629011493.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "toad4409", "id": "h909dji", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #145", "submission": "p4g28o", "stickied": false, "body": "I love that you felt safe enough to do this!!! I hope one day that everyone all over the world will have that security inside their own mind and in the publics to be able to do this! 💙💙💙💙💙", "is_submitter": false, "distinguished": null, "created_utc": 1629012645.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "N0rthWind", "id": "h90lvzm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #74", "submission": "p4g28o", "stickied": false, "body": "Haven't been able to do this yet outside of pride. Main reason being I'm single, lol, but the situation where I live is not exactly favorable either.", "is_submitter": false, "distinguished": null, "created_utc": 1629023585.0, "parent_id": "t3_p4g28o", "replies": [{"author": "Hjemi", "id": "h90m7n2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #203 | Consortii Concordus", "submission": "p4g28o", "stickied": false, "body": "Hey, sending you love ♡ Your health, safety and comfort always comes first afterall!", "is_submitter": true, "distinguished": null, "created_utc": 1629023859.0, "parent_id": "t1_h90lvzm", "replies": []}]}, {"author": "banana_kiwi", "id": "h90wuin", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #12 | Consortii Concordus", "submission": "p4g28o", "stickied": false, "body": "My straight male friends and I kiss each other whenever we walk by people with those signs", "is_submitter": false, "distinguished": null, "created_utc": 1629031524.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "Mr--Elephant", "id": "h92nw4s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #72 | Ordo Cognitus", "submission": "p4g28o", "stickied": false, "body": "Congrats on your strength", "is_submitter": false, "distinguished": null, "created_utc": 1629059683.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "SybariteAussie", "id": "h9a8422", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p4g28o", "stickied": false, "body": "The only protest I would consider joining would be a protest against protesters and protesting", "is_submitter": false, "distinguished": null, "created_utc": 1629204548.0, "parent_id": "t3_p4g28o", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h8yha2z", "score": -7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p4g28o", "stickied": false, "body": "r/thatHappened", "is_submitter": false, "distinguished": null, "created_utc": 1628976479.0, "parent_id": "t3_p4g28o", "replies": []}]}