{"title": "I cannot stop crying", "name": "t3_p649l7", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p649l7/i_cannot_stop_crying/", "selftext": "Theocracy is alive and well in the world. I don’t know if I believe that humanity can connect with each other across the globe enough to make the world good for everyone anymore. I don’t know if we can progress technology and overcome greed before our environment falls apart ..  we can’t even collectively agree to wear a mask for a few years. On top of that… My mom may have cancer …. Second screening today… crying and nervous \n\n..and this is…", "score": 9, "upvote_ratio": 0.72, "permalink": "/r/TheFlyingTree/comments/p649l7/i_cannot_stop_crying/", "id": "p649l7", "author": "HolisticHolograms", "link_flair_text": "Humour", "num_comments": 15, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629208516.0, "comments": [{"author": "PalatableNourishment", "id": "h9apyuy", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "p649l7", "stickied": false, "body": "Hang in there. Focus on your mom right now. She needs your support, just like she has supported you. I can relate - my mom has a chronic illness that is very painful and seriously impacts her quality of life. Make sure she knows you love her, you’re proud to be her child, and it is an honour to be there for her when she needs you.", "is_submitter": false, "distinguished": null, "created_utc": 1629212507.0, "parent_id": "t3_p649l7", "replies": [{"author": "HolisticHolograms", "id": "h9aqf55", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p649l7", "stickied": false, "body": "Thank you for the palatablenourishment for my being", "is_submitter": true, "distinguished": null, "created_utc": 1629212697.0, "parent_id": "t1_h9apyuy", "replies": [{"author": "Wrathchilde", "id": "h9b9u1u", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #99", "submission": "p649l7", "stickied": false, "body": "I don't know your mom, but I can tell she is a great parent by the quality of the child she raised.", "is_submitter": false, "distinguished": null, "created_utc": 1629221288.0, "parent_id": "t1_h9aqf55", "replies": []}]}]}, {"author": "noodlefrits", "id": "h9e1bep", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Druid #1", "submission": "p649l7", "stickied": false, "body": "Why tf is this tagged humour?", "is_submitter": false, "distinguished": null, "created_utc": 1629276913.0, "parent_id": "t3_p649l7", "replies": [{"author": "HolisticHolograms", "id": "h9e50s2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p649l7", "stickied": false, "body": "Self directed sardonicism. I am doing a bit better right now though.", "is_submitter": true, "distinguished": null, "created_utc": 1629280402.0, "parent_id": "t1_h9e1bep", "replies": [{"author": "noodlefrits", "id": "h9e5cbo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #1", "submission": "p649l7", "stickied": false, "body": "Glad to hear it!", "is_submitter": false, "distinguished": null, "created_utc": 1629280690.0, "parent_id": "t1_h9e50s2", "replies": []}, {"author": "notdeepee", "id": "h9jc17h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #80 | Legio Virtus", "submission": "p649l7", "stickied": false, "body": "*searches sardines instead*", "is_submitter": false, "distinguished": null, "created_utc": 1629383384.0, "parent_id": "t1_h9e50s2", "replies": []}]}]}, {"author": "Zealousideal_Mix_629", "id": "h9arvij", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p649l7", "stickied": false, "body": ">My mom may have cancer …. Second screening today… crying and nervous\n\nI'm sorry to hear about this. Hang in there, deep breaths, you are strong and so is she. Take it one moment at a time.", "is_submitter": false, "distinguished": null, "created_utc": 1629213294.0, "parent_id": "t3_p649l7", "replies": []}, {"author": "RiresBarter", "id": "h9dxhoz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #158", "submission": "p649l7", "stickied": false, "body": "In my opinion, you should switch your priority to your mom instead of how the world is right now. Focus on spending more time with her, and the rest of the problems will still be there when you return from your priorities, so think of them as distractions for now. You're going to need a lot of energy and rests. Focus on taking care of yourself and your mom for now. \n\nTake good care.", "is_submitter": false, "distinguished": null, "created_utc": 1629273258.0, "parent_id": "t3_p649l7", "replies": []}, {"author": "themistocle_16", "id": "h9cu5am", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #243", "submission": "p649l7", "stickied": false, "body": "Need a hug? If you need anyone to talk to, you can PM me, everything will stay between us.", "is_submitter": false, "distinguished": null, "created_utc": 1629247734.0, "parent_id": "t3_p649l7", "replies": []}, {"author": "AVDeKn", "id": "h9bb2pq", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #161", "submission": "p649l7", "stickied": false, "body": "Look, I will try to make It the logical way;\n\n\n\n\n>Theocracy is alive and well in the world.\n\n\n\n-I know that It sounds bad, But really, You need to understand that history is a continuous process, and We will never be the final result. We live in a time that We think of ourselves as advanced because of the technology, but We just entered the era of understanding our fellow humans. Christianity just get rid of Its major theocratic characteristics, and Islam will probably take way more long to do so, because Of Its age and the way that It emerged.So please, dont die inside slowly over something that only time(and a lot of It) will change.\n\n\n\n\n\n>I don’t know if I believe that humanity can connect with each other across the globe enough to make the world good for everyone anymore.\n\n\n\n-Thats undertandable, and right at some point, We are all too different to make connection with everyone. Some people cant just do It naturally or forcibly. And again, We arent at the \"golden age\" of humanity, We are in a process, and It Will take long before We reach our best \"connection\" capabilities(That will probably not be perfect, but will be better).\n\n\n\n\n>I don’t know if we can progress technology and overcome greed before our environment falls apart ..\n\n\n-Relax, We can and We will. Finally, people are starting to see the problems, governments are starting to make changes that our most pessimistic sights said It wouldnt happen. We are obviously suffer the consequences, climate will be unstable for decades, regions already desertified, and species already died. It Will be rougher than It would be If We were more responsible with our planet. But believe me, We will make It.\n\n\n\n\n>we can’t even collectively agree to wear a mask for a few years.\n\n\n\nYou see? And even with all the stupid people that couldnt believe in masks, that are drowning themselves in their own madness with conspiracy theories and etc. And etc. And etc. We will still gonna make It. The vast majority agreed to use masks, and even with all the crazy ones, We still did It.\n\n\n\n\n>My mom may have cancer …. Second screening today… crying and nervous \n\n>..and this is…\n\n\n\nI know. Its terrible, but think of all the medicine! We are more advanced than ever! Cancer, a illness that were know for being a death sentence, is now cured at the level of the thousands and thousands amd thousands every year! Look at the bright side, Maybe It is just a false alarm, and even If it isnt, It means that Your mother will have a chance know It before Its too late, and to fight against It! I am sure that She will be well! Either by a little scared after the false alarm, or by the relief of being cured!\n\n\n\nAnd look, If you really need to, We may talk If You want. Just DM me, I Will try my best to answer!", "is_submitter": false, "distinguished": null, "created_utc": 1629222287.0, "parent_id": "t3_p649l7", "replies": []}, {"author": "HolisticHolograms", "id": "h9agqca", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p649l7", "stickied": false, "body": "The story of a girl, who cried a river and drowned the whole world.", "is_submitter": true, "distinguished": null, "created_utc": 1629208583.0, "parent_id": "t3_p649l7", "replies": []}, {"author": "Rue_Bixcube", "id": "h9ailze", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #103", "submission": "p649l7", "stickied": false, "body": "Religion will die one way or the other. Either humanity will abandon it and it will disappear, or it will consume humanity and wipe us out, leaving no one left to practice it.", "is_submitter": false, "distinguished": null, "created_utc": 1629209392.0, "parent_id": "t3_p649l7", "replies": [{"author": "raedr7n", "id": "h9aj13n", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #49 | Legio Virtus", "submission": "p649l7", "stickied": false, "body": "I think that neither of those things will happen. Human religion will die very nearly the same time humanity does for reasons unrelated to religion.", "is_submitter": false, "distinguished": null, "created_utc": 1629209573.0, "parent_id": "t1_h9ailze", "replies": []}]}, {"author": "usernames_suck_ok", "id": "h9axn1g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "p649l7", "stickied": false, "body": "I realized the world was shit a long time ago, and the people in it. I'm okay with that one. I just stay away from everyone else, lol, especially since you have all these crazies who will stab someone over masks. \n\nWent through the cancer thing with my father a few years ago, though. At this stage, you have to keep perspective. My mother and my sister started all of the crying and thinking about his dying way too soon. I tried to tell my mother that his having cancer doesn't mean he's going to die. I mean, we had been told he had it, but he had another appointment coming up for more info. My mother and I went to that appointment, and the news was pretty good. It had not spread, but the cancers were in a location where they could not do surgery to remove them. They decided to just give him what, apparently, is incorrectly called a \"chemo pill\" and a \"chemo shot\" regularly, and they did radiation. His testosterone level is now really low, which is annoying because we have household temperature battles all the time and he acts differently, but he's alive and all the numbers that would indicate prostate cancer are really low.", "is_submitter": false, "distinguished": null, "created_utc": 1629215591.0, "parent_id": "t3_p649l7", "replies": []}]}