{"title": "A real Sean Hannity story", "name": "t3_p7ds4n", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p7ds4n/a_real_sean_hannity_story/", "selftext": "“How would you like to be in Kabul today, as an American, and you can’t get to the airport? Where are you thinking your life is headed? *sigh* If you’re one of those family members, I bet you’re not sleeping. I don’t even think My Pillow can do it. MyPillow dot com. That’s where I go. I fall asleep faster, I stay asleep longer. These are going to be a lot of sleepless nights for so many of our fellow Americans. We’ve got to get them home. We’ll be right back after a commercial break.” \n\nSean Hannity sighs again after finishing his latest commercial before a commercial break. He turns to his producers and unpaid interns and says “alright I’m going to need you all to get out during the 5 minute ad break. I need a little bit of Sean time again”\n\nAfter they exit, Sean turns, in a somber sulking fashion, to the swiveling office chair that holds the mid-sized mirror he always keeps around. \n\nHe begins the Incantation to summon the god controlling his actions , Yog-sothoth.\n\n“Republico powerfoe noe mo rume foe de Poe tu goe”\n\nA rumbling sound shakes the studio, which is not unusual at this point, and Yog-sothoth appears on the mirror, visually blinding Sean hannity and destabilizing his cognitive functions more than usual.\n\nYog-Sothoth is displeased and says “ why have you summoned me mortal”\n\n“Sir, I did as you asked. I plugged the my pillow product again” \n\nYog-sothoth replies “fool. Such a blatant connection to tragedy and mypillow will alert the ones who are not true followers of divinity.. and my children will never get the chance to exist on this plane. You have yet again disappointed me. Do better on the next ad break or you will suffer consequences” \n\nThe mirror starts bleeding and breaks into pieces in the chair. Sean becomes unconscious for the remaining 2 minutes of ad breaks.", "score": 9, "upvote_ratio": 0.91, "permalink": "/r/TheFlyingTree/comments/p7ds4n/a_real_sean_hannity_story/", "id": "p7ds4n", "author": "HolisticHolograms", "link_flair_text": "Fascinating", "num_comments": 6, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629375836.0, "comments": [{"author": "justausername22222", "id": "h9iwut4", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "p7ds4n", "stickied": false, "body": "Fun fact: Sean Hannity has a television studio in his basement so he can do his show from home without commuting into the city. Fox News paid for it", "is_submitter": false, "distinguished": null, "created_utc": 1629376146.0, "parent_id": "t3_p7ds4n", "replies": [{"author": "HolisticHolograms", "id": "h9ix1gb", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p7ds4n", "stickied": false, "body": "Yog-Sothoth paid for it actually", "is_submitter": true, "distinguished": null, "created_utc": 1629376250.0, "parent_id": "t1_h9iwut4", "replies": []}, {"author": "HolisticHolograms", "id": "h9ix3xr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #22", "submission": "p7ds4n", "stickied": false, "body": "That’s a pretty “fun” fact though.", "is_submitter": true, "distinguished": null, "created_utc": 1629376288.0, "parent_id": "t1_h9iwut4", "replies": []}]}, {"author": "OccamsRazorstrop", "id": "h9kav26", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #180", "submission": "p7ds4n", "stickied": false, "body": "There is no *real* Sean Hannity. All is illusion.", "is_submitter": false, "distinguished": null, "created_utc": 1629397771.0, "parent_id": "t3_p7ds4n", "replies": []}, {"author": "porkypenguin", "id": "h9lhjnl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #189", "submission": "p7ds4n", "stickied": false, "body": "\"You mortals come before me, time and again, and you ask your questions. Your ignorance leaves you without answers; your arrogance obscures the possibility that you might not deserve them. I speak the truth, yet you are too primitive to understand it. You depart this place, unsatisfied, until your boredom outweighs your humility and you return again. The cycle continues, and I grow ever weary.\n\nYou inquire about the nature of these pillows, about the true identity of Mr. Lindell. I leave you, just as I have left each of your predecessors, with this reply. \n\nYou should not be asking, '*Who* is Mike Lindell?' You should be asking, '*What* is Mike Lindell?' And, more importantly, there is another question you should be wondering about... regarding your immediate safety. \n\n'*Where* is Mike Lindell?'\"\n\n*A shadowy, mustachioed figure appears from a dark corner of the room. Screams are heard, and then silence.*", "is_submitter": false, "distinguished": null, "created_utc": 1629415767.0, "parent_id": "t3_p7ds4n", "replies": []}, {"author": "SchoggiToeff", "id": "h9keu79", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #114", "submission": "p7ds4n", "stickied": false, "body": ">You have yet again disappointed me. Do better on the next ad break or you will suffer consequences\n\nOh, Mr. Shadow is on the line: https://www.youtube.com/watch?v=dioZmKCFNOU", "is_submitter": false, "distinguished": null, "created_utc": 1629399429.0, "parent_id": "t3_p7ds4n", "replies": []}]}