{"title": "I was going through some of my old story files, and came across this one. I just wanted to share the first chapter (constructive criticism welcome).", "name": "t3_oydsva", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oydsva/i_was_going_through_some_of_my_old_story_files/", "selftext": " \n\nAsha watched Lais carefully. He was the head of the Decimation Cooperative and, in a way, her boss. When she wasn’t the Shadow Keystone, she worked for him. He had many uses for a Shadowdancer like her; lie detector, guide during the Darkness—enforcer.\n\nThere were some who had wondered (not that they had known she was listening) why she listened to him. He didn’t seem like much on the surface; he looked like every other older man who was reasonably prosperous and old enough to be expecting grandchildren. His brown hair was liberally salted with gray, almost to the point where nothing of the original color could be seen. Even his choice of clothing appeared to be average; he wore a modest suit of ancient cut in the same dark gray that was popular among those who seemed to be his peers.\n\nAsha knew that looks were deceiving; who knew better than a Shadowdancer the shadows in a human soul? She knew that he was cold, calculating, and ruthless. When the far off king had withdrawn his protection from Hoshall city, *Lais* had been the one to take control before the city self-destructed. He now ruled Hoshall from the highest levels of society down to the slums—and he protected what he ruled. *All* residents of Hoshall were now equal in the eyes of Lais’s law—as they hadn’t been when the king ruled.\n\nAsha idly wondered what he saw when he looked at her. The two of them had one thing in common; neither of them looked as dangerous as they were. Asha was slim, and petite. Her clothes could have come from the wardrobes of any of the Shadowdancers in Hoshall; she had the dark knit trousers, the dark knit shirt, thin brown belt, and a dark cloak that covered it all. To those who weren’t ‘dancers, the cloak was plain black. To those who were, it sported an intricate design that told the world she was *the* Shadowdancer keystone and an enforcer for Lais.  \n\nLike Lais, she felt no need to advertise how dangerous she really was. People either knew, and reacted according to their natures, or they didn’t. She didn’t care either way.\n\n“Asha,” said Lais with warmth that only those powerful enough to kill him ever heard. “The men have a—complaint.”\n\nAsha frowned. She didn’t know what “the men” (Lais’s term for the generals he employed to keep order in the city and the militia in good standing) would have to complain about regarding her. She didn’t bully civilians, she didn’t torment the soldiers or rookies in the militia, and she didn’t indulge herself into excess. Considering the damage she *could* do—why were they complaining?\n\n“They don’t believe you’re human enough,” continued Lais.\n\nAsha stared at him with patent disbelief. Not human enough? She ate, drank, and even (a very little bit) socialized. Why would they *possibly* say that she wasn’t “human enough”?\n\n“Men tend to—sympathize with someone who has a weakness. You don’t seem to have any.”\n\nShe continued to stare at him in patent disbelief. Weaknesses? Of *course* she had weaknesses, she was *human*! She had to breathe, eat, and if she was cut she bled. What kind of *morons* were his generals?\n\nLais held up both of his hands in a conciliatory gesture. “I know, I know,” he said soothingly. “But all of the men purchase items at the auction, and they never see you do. They also know,” he added quickly,” that you get paid for all of your hard work helping us maintain peace—and you don’t seem to have any vices that you spend that money on.”\n\nAsha glared at Lais. She found the concept of the auctions disgusting (and had told him so on multiple occasions) and saw no reason to take part in them. The auctions took people who did something that Lais termed unforgivable—who were then wiped into blank mental slates as their memories were fed to creatures that ate them. The people who were wiped were sold to the highest bidder—as were their properties and possessions. Lais’s rule was hard and cruel one—but at least it was one. She remembered only too well the anarchy that had prevailed after the king’s troops had withdrawn. Some rule, even a cold and hard one, was better than none, and she would do what was needed to protect it.  \n\n“I know you find the concept—brutal and archaic,” said Lais choosing his words carefully. “But the fact of the matter is that the auction is part of one of the few forms of entertainment left Hoshall. It would make the men feel better if you participated long enough to buy something. Could be a vase, or a book—or even a pet. Just something to make them feel you’re human.”\n\nAsha sighed and rubbed the center of her forehead to stave off a headache. He had a point; she’d seen the damage that could be done when people were highly suspicious of a certain person. The ramifications were worse for those with power than those without it—she wasn’t sure why, but she’d seen it during the anarchy and chaos.\n\nLais nodded. “I’ll save you a seat at the auction,” he said with grim satisfaction. “Remember; it doesn’t matter *what* you buy, as long as you buy something.”\n\nAsha nodded and turned to leave—and paused. She turned back to him. “Be careful,” she said firmly. “There are rumors about your health that are—unsettling for me.”\n\nLais looked surprised, then calculating. “Are there now?” he asked. “I’ll have to look into them.”\n\nShe nodded and left the room. As always, the others stared at her from their corners. Usually she ignored them. This time she slowly scanned the room, marking each man and the shadows on his soul.\n\nLais was right. They were frightened of her; more than her reputation could account for. They saw her as something alien, unknowable, with no weaknesses or vices. They were afraid of not what she was, but what they thought she didn’t have. She was going to have to do something: she well knew the power of the mindless, frightened mob.\n\nLais thought she’d be able to fix the problem with one purchase at the auction. She thought he was probably wrong. She could, in theory, take the time to explain exactly what she saw her job as—but she didn’t think they’d believe her. She’d have to do something more than a single, grandiose gesture to make them see her as a person. She would think on it.\n\nShe continued out into the Darkness. At the moment the only other people on the streets of Hoshall were Shadowdancers, as they were the only ones that could see outside. Some of the lower level Shadowdancers earned some extra money by guiding people between buildings and across town while the Darkness was on them.\n\nShe pulled her hood up to cover her face and walked towards her home. The doors on the buildings on either side of the street were the only breaks in the smooth facades, and each wall was painted with a paint that was only visible to Shadowdancers and Lightdancers, to enable them to easily find their way around the city. She had always found the designs to be soothing.\n\nThe foot of one of the dark creatures drifted onto the ground in front of her. She stopped to look up at the creature: she’d always thought they were beautiful. To her Shadowsight they glowed in colors; this one was a deep purple-blue, but some were red, orange, pink—just about any conceivable color. Other Shadowdancers would make it a point to kill or drive away the ethereal creature—but not Asha. The creatures had no weight, no mass, and could not pass through the buildings to harm the people inside. She saw no reason to destroy or run them off. While the creatures were death to normal humans when they touched, to a Shadowdancer they were harmless.\n\nShe reached out and touched the glowing leg. As always, when she touched the creature she felt a warm, almost fizzing sensation in her hand that traveled up her arm and into her body. A proportionally small head (the head was still larger than she was) swung around to face her with wide, sightless eyes. Well, the eyes had nothing that a human eye would register as having sight; presumably the creatures had their own way of seeing the world.\n\nShe gently stroked the large leg. “You would probably feel better outside of the city,” she said softly to the creature, knowing that it wouldn't be able to respond. Only Tamers could hear the creatures, and she was no Tamer. She wondered what they sounded like; would they have deep, soothing voices or be astonishingly high pitched? She didn’t know. She would never know. A ‘dancer couldn’t become a Tamer. Perhaps she could have asked a Tamer, but they left when the king repealed his protection of Hoshall. Since then, there had been no signs of a Tamer in the city, or in the fields surrounding it.  \n\nThe creature shook all over and lumbered off. She wasn’t sure if it had understood her or not, but it was moving towards the outside of the city, instead of towards the center. She watched as the thing left with slow, deliberate movements.\n\nShe didn’t know why physical contact with a Shadow creature would kill a normal human. The only ones that seemed to have protection against that fate were the Shadowdancers (even Lightdancers would fall to Shadow creatures) and Shadow Tamers. Perhaps one day she’d be able to ask someone; since Lais had stabilized the city merchants had begun making the journey and perhaps, just perhaps, one day she’d meet a Shadow Tamer and be able to ask the questions she had.\n\nShe turned down the street and continued on to her building. One of the first things she’d purchased after beginning to work for Lais was a building of her own. It had once been an apartment building, but now she shared it with no one. A childhood among the Sanctuary had left her with a deep desire to have privacy—but sometimes, just sometimes, she felt lonely.\n\nThere weren’t many people she could talk to. None of the other Shadowdancers in Hoshall were anywhere near her level of power, and they couldn’t see the world the way she did. The only person who came close to being able to understand her power was the Lightdancer keystone—and they weren’t friends. They did not agree on even the most basic of things, and one of the things that prevented war from breaking out between the two of them was that they were almost never in the same place at the same time.\n\nOf course, matters weren’t helped by the fact that most of the others, Lightdancers and Shadowdancers both, viewed Lais and his policies with suspicion and distrust while she worked for him. Despite several of them having been raised in the Sanctuary as she was they had little in common. Their reasons were—different from hers. They had very little in common.\n\nMost of the normal humans, the ones who were neither Lightdancers nor Shadowdancers, viewed her powers with suspicion and fear. She would like to blame her association with Lais on that…but the facts were that people viewed her powers with with suspicion and fear long before the two of them had ever met. Of course, that was just the lot of a Shadowdancer. Shadowdancers could see the shadows in a person’s soul—no secret was safe from them. That tended to make people nervous, despite the fact that there had never been a Shadowdancer that gossiped about the shadows in a person’s soul. Oh, everyone agreed that Shadowdancers had to exist, but they were considered a necessary evil.\n\nOn the other hand, Lightdancers were held in high esteem. They saw the light of people's souls, they brought light to the darkness, and people held that ability in much higher esteem than the ability to bring shadow. Asha found it interesting, especially since Lightdancers had a much higher tendency to gossip about human flaws than Shadowdancers did.  \n\nA light wind sprung up and she turned her face to the cool breeze. She didn’t know if she preferred the Dark to the Light because she was a powerful Shadowdancer, or if it was because she simply preferred the coolness of the Dark to the heat of the Light. Smiling at the delightful sensation, she made her way home.\n\nUsually she ignored the other Shadowdancers and their charges, but this time she paid attention. She noted how the other Shadowdancers quietly and smoothly moved their charges (and themselves) out of her way. She noted how even the other Shadowdancers, who should have known better, seemed to be tense around her.\n\nShe wasn’t sure what she was going to do to fix the issue before it became a problem, but it was clear to her that she was going to have to. She knew the power of a mob. She knew how dangerous humans who thought that they were protecting themselves from a monster could be. She should have been paying more attention to the people around her; this shouldn't have caught her off guard.\n\nSomehow, in some way, she was *going* to fix the problem.\n\n\\~\\~\\~\n\nWhen Asha left the building, Lais let out a low, shuddering breath of relief. He wasn’t certain why the girl held him in such high esteem, and it didn’t count on it continuing. Still, she respected him. That had to count for something.\n\n“Boss,” said Dous, one of Lais’s most trusted men. “Are you going to be all right?” he asked worriedly. “She—”\n\nNo matter what Lais, personally, thought of the girl, he would not allow anyone to speak against her. “She would never harm someone without good reason,” he said firmly. Usually, when she *did* harm someone, it was on his orders. And it was always for good reason.\n\nDous did not look convinced. “But Boss, the rumors—”\n\n“Are just rumors,” said Lais firmly. Perhaps if he reassured his men he could reassure himself as well. He sighed and rubbed the bridge of his nose. “Asha does nothing that any of us should fear her for,” he told his second-in-command firmly. He met the eyes of his second-in-command. “She has done everything in her power to keep the peace in Hoshall,” he stated. He wasn't entirely sure if he was telling himself or Dous, but he knew it was true. He'd known that when she'd begun enforcing his reign on the city four years ago.\n\nHe still remembered the night; he'd been trying to reign in two of his men who were taking advantage of their positions—only to discover that they'd led him into a trap. He'd been prepared to die—when the girl, the *child*, in the cloak that all 'dancers, whether they Danced for Shadow or Light, seemed to wear interrupted. She drove one of the men that had been prepared to kill him insane as the others watched, in silent horror. Then she'd given the others a choice: they could follow Lais and listen to his decrees, or she could kill them.\n\nLais had known—they'd *all* known—that the girl would be as good as her word. If they agreed to listen to Lais and enforce *his* law on the city—she would spare them. If they didn't—she would kill them. This girl, this powerful Shadowdancer had proclaimed to the city that she was supporting Lais and opposition meant insanity or death.\n\nHe wasn't entirely certain *why* she was supporting him, but she still was. The mere knowledge that she could be called (seemingly) at any time helped keep the peace that Lais was desperately trying to protect. Most of the time the mere knowledge kept things from getting to the point where he needed to call on her power—and he was very careful not to abuse the power she gave him. He didn't want to know what would happen if she stopped respecting him.\n\n“Let's talk about the upcoming auction,” suggested Lais. Thinking about Asha for too long was uncomfortable.  \n\n“We have four singles and two with families going into the auction,” said Dous. From the eager way his second-in-command went into the new subject, Lais was sure that the topic of the keystone Shadowdancer was uncomfortable for him as well.\n\n“And the families,” prompted Lais.\n\n“Were split so that only the offending members are being treated for auction. The treatment should be completed within the next two or three light cycles.” Dous shook his head. “Of the singles, their entire possessions, land, and creatures will also be going up for auction. One of them seems to have been a collector of some sort—it should make for an exciting auction.”\n\n“Good,” said Lais settling back in his chair with satisfaction. He *could* have solely relied on Asha's power to keep his enemies in line—but he didn't. The auctions also served as a means of control. He frowned as something else occurred to him. “How is my son?”\n\n“He—isn't any worse,” said Dous diplomatically.\n\nLais sighed and rubbed his head. His son was a headache for him; the boy showed glimmers of promise to be a great leader—and it was tempered with arrogance and selfishness that could easily destroy everything that Lais had worked for. No matter what he did, the boy just did not seem to want to settle into his role.\n\n“Perhaps the boy needs time?” suggested Dous.\n\n“Time,” said Lais wearily. He wondered if they had the time. He knew that he was sick—and he knew that Asha would not support his son as she supported him. Still, it seemed to be the only answer he could get. “Time,” he admitted.\n\n\\~\\~\\~\n\nAsha was greeted by the cat when she went into her home. She wasn’t entirely certain where the cat came from—it just sort of appeared when she got the building. It didn't ask anything of her, it wasn't afraid of her, so she did her best to see that it had what it needed. Besides, the cat protected her treasure of books.\n\nIf anyone realized the extent of her book collection, they would be surprised. Several of the old apartments were filled with shelves of books. Not even the Sanctuary library rivaled what she had collected—and few attributed a desire to read to 'dancers. She was very careful to keep her books well preserved. Sometimes she wondered if she should invite some of the more voracious readers to visit, but given her reputation as an enforcer it would probably be taken amiss.\n\nThe cat paced Asha to the kitchen and sat attentively as she reached into her cold box—kept that way with ice harvested during the Darkness—and pulled out a fish for the cat. She put it on a plate and put the plate on the floor, along with a bowl of water. The cat leaped upon the fish as though it hadn't eaten in weeks—despite that it had eaten just the previous dark cycle.\n\nThe cat froze as a furious series of knocks echoed on the door. Asha frowned—few people bothered her at home. This must be an emergency. She opened the door to find Rish, one of the junior Shadowdancers. The girl was panting and covered with a thin sheen of sweat. “Rish, whatever is the matter?” asked Asha as her frown deepened. She recognized the girl—she was one of the calmest people that Asha knew.  \n\n“Keystone,” gasped Rish. The girl was breathing hard, her cloak still billowed from her hurried passage to Asha's home. Asha carefully put a hand on the girl's shoulder to make sure that she wasn't about to collapse. As soon as Rish got her breath back she gripped Asha's shirt. “Keystone,” she repeated, “I need help. I can't—I don't—please come!”\n\n“Deep breath,” Asha advised. She held the girl's shoulder to keep her from toppling over. She seemed prone to do so. “Now, tell me what's wrong.”\n\nRish took a deep breath and gained her footing back, but her eyes were still wide and desperate. “Keystone, a family hired me to heal their child—but I can't grip the shadow and the child is dying!”\n\nAh. The girl's panic made sense—Asha knew that when Rish had been a child she'd been playing with her younger siblings and one of them had gotten hurt. Rish had tried to save the sibling—and had failed, but had woken her power as a Shadowdancer. Since then she had never been able to bear the thought of failing another child.\n\nAsha nodded, grabbed her cloak once more, and followed Rish down the streets until they reached one of the smaller dwellings. The markings on this one identified it as belonging to no more than three wealthy families. The child must be sick indeed, for a family such as this one to call on a Shadowdancer for healing instead of waiting for a Lightdancer. Rish knocked on the door and it opened to reveal a maid.\n\nAsha frowned as she looked at the haggard woman. There was something odd on her—not exactly a shadow, but something like the echo of a shadow, or a place where a shadow could come to rest. Asha had never seen anything like it before. She glanced at Rish, who nodded.  \n\nAsha was more than familiar with shadows. She knew the Darkness, the shadows of darkness on human souls, and was even familiar with the shadows left by injuries. This though, this was new. What kind of shadow left an imprint on someone who wasn't affected by it?\n\nAsha absently followed the maid to a child's room. Toys were piled in the corners, the bed had been pulled away from the walls and into the center of the room to give more access to the child on it—she could see the drag marks on the floor. One look at the child on the bed told her why—the child was practically obscured by the shadow in it. Rish had needed the extra space to dance the shadow away—but the shadow hadn't left.\n\nAutomatically her breathing dropped into the rhythm she used for 'dancing and she took a few experimental steps and tugged on the shadow. It slipped through her grip like grease and tried to stain her as it had stained the other members of the house. Her 'dancing did not move it.\n\nResolve hardened Asha. She was *the* Shadowdancing Keystone, and she wasn't about to let a *shadow* get the better of her! *She* was the master of shadows—not the other way around!\n\nShe changed position to the beginning of the Rising Dance, the way the shadows were called when Shadowdancers lived in Sanctuary and were responsible for keeping the Lightness at bay. She could call shadow from the purest of light—she wasn't going to let a shadow get the better of her. She reached with her power and *pulled* the shadow out.\n\nNormally, she would let the shadow dissipate. She would let it return to the Darkness. She believed that they came from the forces that created Darkness and Lightness, and that when they died they returned to it.\n\nThe slippery shadow suddenly developed spikes and tried to attack her. *No* shadows, not even the shadow creatures, attacked the Shadowdancers. This shadow was not like the other shadows—it could not be allowed to return to the Darkness. She destroyed it.\n\nShe turned to Rish. “Did you see how I did that?” she asked. The Shadowdancer nodded. “Good. Tell everyone.” She looked at the child, now still, but deeply breathing on the bed in front of her. Once again, she felt resolve harden inside her and she turned back to Rish. “I will not allow these things in my city.”\n\nRish gave her a small half-bow. “Yes, Keystone,” she said deferring to the judgment.\n\nAsha turned, nodded to the parents of the child, and left. She didn't wait for Rish to begin telling other Shadowdancers how to remove and destroy this new shadow; she went around to the ones she knew the location of herself. She didn't know what the new shadow was, but she knew one thing for certain: she was not going to allow it to gain a foothold in Hoshall.\n\nFor a change, she was late enough getting home that the Lightdancers began their work before she got there, and she watched as the light they generated washed over the city. The beautiful colors of the paint marking the buildings faded into a dim, uniform rust red.\n\nShe knew that the Lightdancers worked just as hard as the Shadowdancers and they were just as important to the survival of Hoshall. That didn't stop her from feeling slightly let down every time the light came out during the Darkness. The world seemed much harsher, somehow, in the light than it did in the Darkness.\n\nShe picked up her pace on her way home as the regular citizens, those who weren't 'dancers, began leaving their homes and crowding the streets. It was time for her to get to sleep, past time. Perhaps, when she woke again, she'd be able to find a book in her collection that mentioned the strange shadow.", "score": 2, "upvote_ratio": 0.63, "permalink": "/r/TheFlyingTree/comments/oydsva/i_was_going_through_some_of_my_old_story_files/", "id": "oydsva", "author": "InfiniteEmotions", "link_flair_text": "User Made", "num_comments": 4, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628154830.0, "comments": [{"author": "bolrnly", "id": "h7sg61e", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #155 | Ordo Cognitus", "submission": "oydsva", "stickied": false, "body": "Fuck now im invested", "is_submitter": false, "distinguished": null, "created_utc": 1628159967.0, "parent_id": "t3_oydsva", "replies": [{"author": "InfiniteEmotions", "id": "h7sl1ye", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #167", "submission": "oydsva", "stickied": false, "body": "Like what you see?", "is_submitter": true, "distinguished": null, "created_utc": 1628163453.0, "parent_id": "t1_h7sg61e", "replies": [{"author": "bolrnly", "id": "h7uuaip", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #155 | Ordo Cognitus", "submission": "oydsva", "stickied": false, "body": "yes!", "is_submitter": false, "distinguished": null, "created_utc": 1628197641.0, "parent_id": "t1_h7sl1ye", "replies": [{"author": "InfiniteEmotions", "id": "h7vf63i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #167", "submission": "oydsva", "stickied": false, "body": ":)", "is_submitter": true, "distinguished": null, "created_utc": 1628207142.0, "parent_id": "t1_h7uuaip", "replies": []}]}]}]}]}