{"title": "Being a security guard is a fun job (long work story, slight NSFW)", "name": "t3_piua5h", "url": "https://www.reddit.com/r/TheFlyingTree/comments/piua5h/being_a_security_guard_is_a_fun_job_long_work/", "selftext": "As the title implies, I’ve recently taken a job as a security guard and I’ve been itching to share some of the absolute madness I encounter because I specifically do apartment security in a college town (I’m a student too, but these people are party animals). Maybe if people are interested in this sort of thing I can post some more experiences as there are a wealth of stories from myself or my coworkers. Also, this is such a niche community I feel okay about posting this here as long as I scrub all the personal details out.\n\nTonight was actually the first stressful night on the job. We do security for three buildings: one currently stands vacant of residents, one is small and generally quiet, and the third is the largest, rowdiest building (fortunately it’s not the worst in town though). I always volunteer to work the third one because I actually like interacting with the people, building rapport with them, and helping them deal with their own problems so I don’t have to get the building’s management or the authorities involved (e.g the building management charges you $75 if you get locked out, but I carry the master key 😉).\n\nThis building has a rooftop pool and deck that’s always occupied past it’s posted closing time, people have to hop a fence to get in and then are shocked when I tell them they’re not supposed to be up here this late.\n\nTonight, I open the door to the roof to close the pool and immediately lock eyes with a girl squatting against a low-wall and unleashing an absolutely torrential downpour of piss all over the deck floor’s corner.\n\nHer friend, who was presumably giving her some cover from the other partygoers on the roof, sees my uniform and lets out an inebriated squeal before darting away. I sigh and walk up the stairs, turning away from the girl while I talk to her.\n\n“Accidents happen and emergencies are emergencies but never do this again, okay? If the building sees they will just kick you out.” (in hindsight, a pretty hollow threat because she probably doesn’t live here)\n\nShe was drunkenly apologizing profusely and still pissing profusely so I considered the situation resolved before going to kick everyone else out of the pool. I inform them the pool is closed (and that I can’t have people pissing in the corner) and this group of roughly 30 people starts packing up their belongings and getting changed.\n\nIt’s at this point someone points out to me that there are three motionless figures on the roof’s patio furniture. At first I’m just annoyed that these guys got stoned/drunk and decided to take a nap, but as I’m trying to rouse these guys to leave, I begin to get increasingly worried as they are just totally dead to the outside world and not responding to my voice or touch at all. \n\nThe people around me begin to get concerned as well and start trying to snap these guys out of their obviously drug-induced coma (I dabbled with the percocets as a youth, so of course I ran recognize an opiate slump). I’m finally able to get one of these kids (and I mean *kids*, it was at this point I notice all three of these guys are like high school freshmen) to sit up on the couch.\n\nAt first I give him the standard security bs, “the pool’s closed, you can’t sleep here, you have to leave or I have to call the police, etc.” but this kid literally looks like a zombie with this vacant, wide-eyed stare that’s going straight through me. \n\nAt this point I began to get worried again because the third guy is completely unresponsive (I had been rubbing my knuckles on their sternums roughly, it’s a lot more effective for waking someone than throttling them or slapping them). I start asking the zombie some more questions, “are you okay?, do you and your friends need some help?, do you know where you are?, etc.” and still nothing.\n\nFinally, the third guy lets out a nearly incoherent “fuck off” and swats my hands away. Now that I see they’re alive, I go to unlock the door for everyone else to leave. By the time I return to the couches, a group of very concerned college girls had stepped in and were escorting them/consoling (?) them, so I take a big step back. These guys are now shuffling around and talking, calling the police obviously isn’t necessary and will land these kids in a fuckton of trouble and they seem well enough that they don’t need EMTs. \n\nI let them walk off (feel free to disagree with this decision, I just felt like they were in good hands) and finally finished writing up my *first* patrol of the night ten minutes before my next was scheduled to start. Anyways, just wanted to share to kind of help process the wild stuff I see. One of my coworkers later suggested that it was (hopefully) a couple of kids who were *really* stoned, but I’m not so sure based on how they were acting. Prescription painkillers are going to fuck over an entire generation of tonight was indicative of anything.", "score": 5, "upvote_ratio": 0.86, "permalink": "/r/TheFlyingTree/comments/piua5h/being_a_security_guard_is_a_fun_job_long_work/", "id": "piua5h", "author": "Insominus", "link_flair_text": "Other", "num_comments": 3, "over_18": true, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630911480.0, "comments": [{"author": "keyless-hieroglyphs", "id": "hbshbx0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #149", "submission": "piua5h", "stickied": false, "body": "Thanks for the insight and concern. I'd be interested to read, if you are safe posting the things.\n\nIt has of late churned in my mind that it is getting less fun to be a citizen even in the calm backwaters. Trouble is expected from everyone by the anxious and colored in by the imaginative. One establishment has after an event, grown a seemingly self volunteered bulky fixture, seeking social gratification from female keepers.\n\nPersonally I find that the response troubles me more than the commonly identified thugs, e.g. \"car riding lady chasers\". I recognize in them what was portrayed in a play as the local hands who sought rowdy companionship at the tavern a century or more ago. There are degrees of trouble and I don't think they are the worst. An uncentered person would find themselves challenged, especially if they in their own mind put themselves above them, but treating them like folks works real marvels. On the worst day, I expect an offer of human decency from them, and none from the others, who will shut their doors.", "is_submitter": false, "distinguished": null, "created_utc": 1630920679.0, "parent_id": "t3_piua5h", "replies": []}, {"author": "clovepod", "id": "hbw47qc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "piua5h", "stickied": false, "body": "trying to get my son and his cohort to understand just how dangerous modern drugs really are is something i've already started and he's 10. it's a different scene from when i was a teen, and i'm *still* amazed i'm alive. \n\nthank you for the story, and i'm keenly interested in any others you are able to share.", "is_submitter": false, "distinguished": null, "created_utc": 1630986965.0, "parent_id": "t3_piua5h", "replies": []}, {"author": "ace_in_training", "id": "hbww8fn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #1", "submission": "piua5h", "stickied": false, "body": "Please post more stories", "is_submitter": false, "distinguished": null, "created_utc": 1631008244.0, "parent_id": "t3_piua5h", "replies": []}]}