{"title": "Dream-Addiction", "name": "t3_p85gow", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p85gow/dreamaddiction/", "selftext": "Hello everyone! \n\nAm still confused what this sub is about but I feel like this fits in here fairly well.\n\nMy life hasn't been so great, I quit school years ago for hospital visits and never quit having to go to one on a regular basis. I lack a general enjoyment in life.\n\nNow, dreams. I consume a lot of different media. Strange indie music, movie, shows, youtube videos, games and books. And when I sleep my mind gets to processing things. \n\nI dream a lot and really livid. Each dream has the magnitude of an alternate reality, a book, a videogame or a drug-trip. \n\nI've recently tried going back to school but the stress is crushing and when I come home in the evening I am incredibly exhausted and tired. Sleep doesn't fix anything but yet when I dream I forget all of my stress and pain.\n\nAnd enter a new world. It's better than VR. You don't even know it's a dream. One time you're a member of a biking tribe living in an icy forest hunting and gathering, then the other day you're a teenager in a giant megacity that finds an old mecha in an abandoned warehouse and have to run from the patrolling police. \n\nNightmares can be endlessly twisted caves that turn into each other and defy logic, causing an endless path of twisting pain and disorientation but also they can be normal. A day at school. It's too hot. Really dusty. The teacher talks for 80 hours. Nothing happens. Hours pass. Nothing happens.\n\n&#x200B;\n\nAs much as I enjoy these dreams they're all fictional and just a construction of my mind using past experiences. They don't help me in live at all and sleeping too much gives me a headache and a feeling of a lot of wasted time. I forget to work out or to eat. \n\nWhat do you think about dreaming or my way of dreaming? Do you hold similar experiences?", "score": 17, "upvote_ratio": 0.9, "permalink": "/r/TheFlyingTree/comments/p85gow/dreamaddiction/", "id": "p85gow", "author": "Ionenschatten", "link_flair_text": "Fascinating", "num_comments": 28, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629466989.0, "comments": [{"author": "wh0-am-l", "id": "h9o2ts7", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #19", "submission": "p85gow", "stickied": false, "body": "Maybe you should learn to lucid dream, to have total control of your dreams. Then you can never have a nightmare since you can simply leave the area the nightmare is occurring in. Any dream can be everything you need to relax and de-stress. It can be a  vacation you go on almost every day. I think it may help you; to have something even bigger to look forward to each day", "is_submitter": false, "distinguished": null, "created_utc": 1629471130.0, "parent_id": "t3_p85gow", "replies": [{"author": "iseeverything", "id": "h9pwgki", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p85gow", "stickied": false, "body": "That was something I was gonna say. While mastering lucid dreaming is extremely hard, if a person manages to do so, they will unlock something incredible. \n\nHowever there are some cons I think to this: it is probable that if the mind is too conscious during the sleep, then the subject won't wake up rested. Now if OP is stressed and waking up tired, then the last thing he needs is lack of proper sleep.", "is_submitter": false, "distinguished": null, "created_utc": 1629498168.0, "parent_id": "t1_h9o2ts7", "replies": [{"author": "Alatain", "id": "h9qdj0r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p85gow", "stickied": false, "body": "So, having gone hard into lucid dreaming for almost a decade now in order to combat a pretty severe case of sleep paralysis, I will say that my experience is that you rarely accidentally lucid dream. It is something that you decide to do, and may take a few days preparation to actually trigger. Even when you do trigger it, it takes a conscious effort to stay in the zone with, so if you just wanted a good night's sleep, you could just decide to ditch it and go back to a normal sleep pattern. \n\nThe up side is when I start to have a nightmare or sleep paralysis episode, I am now well versed in understanding what is happening and can just kind of choose not to. I have not had an actual nightmare in years.", "is_submitter": false, "distinguished": null, "created_utc": 1629506156.0, "parent_id": "t1_h9pwgki", "replies": []}, {"author": "doegred", "id": "h9snz6x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #191", "submission": "p85gow", "stickied": false, "body": "My mother accidentally taught herself to lucid dream. At some point when she was a little girl she had to climb a lot of stairs everyday to reach her flat, so she decided to pinch herself every time at the bottom of the stairs in case she was dreaming. And she was always awake and always had to trudge up the stairs... Until one day she wasn't.", "is_submitter": false, "distinguished": null, "created_utc": 1629558386.0, "parent_id": "t1_h9pwgki", "replies": []}]}]}, {"author": "AVDeKn", "id": "h9nyhmv", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #161", "submission": "p85gow", "stickied": false, "body": ">Now, dreams. I consume a lot of different media. Strange indie music, movie, shows, youtube videos, games and books. And when I sleep my mind gets to processing things. \n\n\nI can relate in the indie Music...\n\n\n>I dream a lot and really livid. Each dream has the magnitude of an alternate reality, a book, a videogame or a drug-trip. \n\n\nIdk If It counts, but I basically daydream the whole day. it is bad because It lowers my producitvity. But I cant kinda live without It. So Yeah, I can kinda relate.\n\n\n\nI can relate in a lot of things that You said, But I really want to recommend You going to a psychologist, really. It seems to me that Your dreaming is not healthy for You at the moment, and maybe a signal of something worse. You should seek a professional, so You can live better with the real world, get back to school, and have all your daydreaming as a fun part of Your life, not all of It.\n\n\nAnd really, I do relate a lot, I love my daydreaming. And although I dont wanna be the boring guy, I needed to say It.", "is_submitter": false, "distinguished": null, "created_utc": 1629469347.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "SuddenProfile", "id": "h9nykqj", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "p85gow", "stickied": false, "body": "I couldn't dream from the time I was seven until I was 22 because of PTSD. I've been receivibg treatment though, and it's really interesting to finally know what everyone's been talking about. o.o", "is_submitter": false, "distinguished": null, "created_utc": 1629469383.0, "parent_id": "t3_p85gow", "replies": [{"author": "Pwngulator", "id": "h9psk9c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "p85gow", "stickied": false, "body": "PTSD at 7? That's awful 😞", "is_submitter": false, "distinguished": null, "created_utc": 1629496431.0, "parent_id": "t1_h9nykqj", "replies": []}]}, {"author": "MysticTheMeeM", "id": "h9o0pt6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #16", "submission": "p85gow", "stickied": false, "body": "I find myself forgetting my dreams more and more...", "is_submitter": false, "distinguished": null, "created_utc": 1629470268.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "OccamsRazorstrop", "id": "h9ooy7t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #180", "submission": "p85gow", "stickied": false, "body": "What you say about lack of general enjoyment in life, stress, and sleep sounds a whole lot like depression. You should talk to a doctor about it. Just your regular doctor (or one at a school clinic) is the place to start. Don't wait.", "is_submitter": false, "distinguished": null, "created_utc": 1629480015.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "claimstoknowpeople", "id": "h9o366j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #104", "submission": "p85gow", "stickied": false, "body": "I keep hoping my dreams will turn into good written short stories but it never seems to work out as well as it did in my head lol", "is_submitter": false, "distinguished": null, "created_utc": 1629471273.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "Kelyaan", "id": "h9o3j2y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p85gow", "stickied": false, "body": "I have realistically vivid dreams, Sleep is the best part of the day.", "is_submitter": false, "distinguished": null, "created_utc": 1629471418.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "th3BeastLord", "id": "h9o3od1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #154", "submission": "p85gow", "stickied": false, "body": "My dreams are so foggy these days. They always make so little sense and leave me feeling anxious when I wake up.", "is_submitter": false, "distinguished": null, "created_utc": 1629471478.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "usernames_suck_ok", "id": "h9o4rld", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "p85gow", "stickied": false, "body": "I have a psychology degree, and my focus was more on the neuroscience side. So, I studied a lot of things about how the brain works, including cognition. As best as I can remember, because I'm old at this point--dreams are basically as you say. Everyone has multiple dreams/nightmares every night, but most of us don't remember most of them. They are just processing stuff you've experienced, seen, heard, etc, solidifying what's important and getting rid of info you don't need. You take in a lot of videos/images and written content during each day, so that's probably why you have the kinds of dreams you have. They're normal. \n\nEven when I remember a dream right after waking up or have a vivid dream or scary nightmare, I forget it shortly after. I just can't remember dreams.", "is_submitter": false, "distinguished": null, "created_utc": 1629471922.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "19374729", "id": "h9oaxbv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p85gow", "stickied": false, "body": "I don’t think you can be addicted to dreams, that’s a bit silly. And I think the word you mean is “vivid” (thank you for the chuckle). \n\nI believe dreams are more than just past experience soup. Our dreams are rich with symbols for us to reflect against. Maybe try keeping a journal when you wake up, if you like, I find that productive for myself. \n\nI would also second the comments that say, maybe try to work up to lucid dreaming. You sound very “plugged in” to your dream state and may have fun with that.\n\nMost of all, enjoy the ride. Sounds like you have a nice respite from your work at the end of the day", "is_submitter": false, "distinguished": null, "created_utc": 1629474414.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "dogs_like_me", "id": "h9oi03z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "p85gow", "stickied": false, "body": "I don't have any real feedback, just wanted to say your current life sounds exhausting. I think it's understandable that you're having difficulty re-engaging with school under those conditions and it's commendable that you're making the effort. I hope it gets easier for you soon.\n\nAlso: I don't dream often these days. I'm a daily cannabis user and my understanding is that's likely a significant contributor to the suppression of my dream experience.", "is_submitter": false, "distinguished": null, "created_utc": 1629477240.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "Botwmaster23", "id": "h9om37x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p85gow", "stickied": false, "body": ">One time you're a member of a biking tribe living in an icy forest hunting and gathering, then the other day you're a teenager in a giant megacity that finds an old mecha in an abandoned warehouse and have to run from the patrolling police.\n\nhow do you get so cool dreams? Last dream i can remember was that i was living in a tribe in a forest, and the chief wanted the blood of one of the girls (either for a ritual or a trial for me idk) i brought him the blood he wanted but he said “thats not blood” i tried again and again but he kept saying it, then for some reason he wanted watermelon so i went to get some, but on the way i found an elderly homeless lemon plant (in the shape of an old lady) which wanted me to sing a birthday song, but for some reason i sang the national anthem of the usa ( which is weird because i dont even know how to sing it, i just knew that that was the national anthem in the dream usa) then i met a guy with a watermelon head, i decapitated him and brought the head to the chief (idk what happened next).", "is_submitter": false, "distinguished": null, "created_utc": 1629478873.0, "parent_id": "t3_p85gow", "replies": [{"author": "Ionenschatten", "id": "h9r4tah", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p85gow", "stickied": false, "body": "Well one of my totally useless abilities is to feel and see virtual structures. \n\nWhen I enter a building my head starts mapping.   \nWhen I create plans I see the stuff laid out before my very eyes in my mind. \n\nMy dream gadget would be some sort of virtual sphere where i can basically operate a computer in a 360° environment without gravity", "is_submitter": true, "distinguished": null, "created_utc": 1629520130.0, "parent_id": "t1_h9om37x", "replies": []}]}, {"author": "hdeanzer", "id": "h9p0ft5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #178", "submission": "p85gow", "stickied": false, "body": "There’s an idea that some dreams are wish fulfillment, after all, starving people will dream of food, the other idea seems to be that the mind in sleep seems to be working out deep conflicts that we have, but object to for some reason, and these remain obscured from our conscious mind during waking life.  I could see how all that drama and pleasure might be preferable over waking life with its drudgery and disappointments. I don’t know why, but I’m compelled to encourage you to do some free-writing.\n\nEdit: typo", "is_submitter": false, "distinguished": null, "created_utc": 1629484709.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "jcooli09", "id": "h9p1n4r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #101", "submission": "p85gow", "stickied": false, "body": "I very rarely remember dreams even for a minute.  Very rarely, and I envy you because you do.\n\nGood luck, OP.  I hope things incrementally improve for you for many years to come.", "is_submitter": false, "distinguished": null, "created_utc": 1629485213.0, "parent_id": "t3_p85gow", "replies": [{"author": "Ionenschatten", "id": "h9pb1wj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p85gow", "stickied": false, "body": "I usually only remember strong impressions and those are the gates to the rest of the dream.\n\nLike when I found that big ol' robot in the abandoned storage hall. Me and my friends were like\n\nwooow we thought the military destroyed all of them. How come there's still one of em just laying around here? It must be kinda old them and not armed but it's still a cool goddamn robot. But there're still police patrols so if we get found here we're fucked lol.", "is_submitter": true, "distinguished": null, "created_utc": 1629488984.0, "parent_id": "t1_h9p1n4r", "replies": [{"author": "jcooli09", "id": "h9pebad", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #101", "submission": "p85gow", "stickied": false, "body": "I'm late 50s and I only really remember an actual detail of one dream.  I was a teenager when I had it, and what I remember is my kid sister getting run over at a stock car race.  There have been a few times I remember something for a few minutes.\n\nSometimes I do wake up with strong feelings of one sort of another without any idea what generated them.  Sometimes I really regret not remembering, sometimes not so much.", "is_submitter": false, "distinguished": null, "created_utc": 1629490354.0, "parent_id": "t1_h9pb1wj", "replies": []}]}]}, {"author": "chewbaccataco", "id": "h9p4pl7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #67 | Classis Veritatus", "submission": "p85gow", "stickied": false, "body": "I have grown to hate my dreams. I would describe most of them as lucid except I rarely feel in control of what happens. But otherwise, very real. It was cool at first, but more often than not I am have nightmares ranging from normal but uncomfortable situations to full on horror. Worst of all, I tend to have variations of the same 12 or so dreams. There was abuse in my childhood, I frequently dream about my abuser. There is religious trauma in my past, I frequently dream about Hell or hell-like scenarios. Some aren't as bad, but still suck, such as my dream where I am back in high school and have a bunch of work to do. However, I have had this dream so often that when it happens I acknowledge mid-dream that I am having that stupid dream again, I already have a college degree, I don't need to be here. Sometimes I can walk away from that one.\n\nI have awakened myself or my wife because of screaming or trying to yell, or trying to physically pull away from the dream.\n\nI am also cursed with a pretty good memory, and struggle to forget the horrors I was witness to moments before I woke up.\n\nIf there was a way de-fragment my brain like a hard drive and forgo dreams entirely, I would opt for that.", "is_submitter": false, "distinguished": null, "created_utc": 1629486492.0, "parent_id": "t3_p85gow", "replies": [{"author": "Ionenschatten", "id": "h9pbslf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p85gow", "stickied": false, "body": "I by any means could never imagine what you went through but while I was rather protected from violent media when i was younger I'm still drawn to things like weapons and explosives (no guns tho). \n\nOne of my main impressions I have is emitting a strong physical force from my arm, be it whatever. I've seen media with arm cannons, hand prosthesis or right up grenade launcher arms that often find ways into my dreams in the strangest ways.\n\n&#x200B;\n\nOne time I dreamed about being attacked and fatally injured by a bully. He slit me open and I was bleeding all over the place and yet while I suffered I just didn't die. I managed to free myself from the attacker by blasting the bully with my arm. \n\nMaybe there's some sort of weapon you are drawn to that could manifest in your nightmares?\n\nMy current, worst nightmares usually are places that defy universal laws and are endless mazes of illogicy", "is_submitter": true, "distinguished": null, "created_utc": 1629489299.0, "parent_id": "t1_h9p4pl7", "replies": [{"author": "chewbaccataco", "id": "h9pxf2c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #67 | Classis Veritatus", "submission": "p85gow", "stickied": false, "body": "My dream \"power\" is floating. I can basically jump a normal-ish height, but somewhat control when I come down. Think of Racoon Mario waggling his tail for slow descent. But also think like a double jump. Once I am up, I cannot fly, but I can continue to go up in normal jump height increments, to where I am well above trees and buildings. So I can achieve an abnormal height or jump really, really far with the help of floating. This has been a very consistent aspect of my dreams since I was a kid, and has never gone away. It is so *real*, sometimes I wake up it just feels normal like I could go outside and actually do it.", "is_submitter": false, "distinguished": null, "created_utc": 1629498600.0, "parent_id": "t1_h9pbslf", "replies": [{"author": "Ionenschatten", "id": "h9r4guo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p85gow", "stickied": false, "body": "Lol, I always thought im so hella weird for constantly feeling as if my arm just holds this power that I could unleash.\n\nAs if i electrically charged it or something. And whenever I see any media with some kinda arm cannon I'm like\n\n\\*pointing leonardo\\*", "is_submitter": true, "distinguished": null, "created_utc": 1629519917.0, "parent_id": "t1_h9pxf2c", "replies": []}]}]}]}, {"author": "abraham1inco1n", "id": "h9p5eld", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "p85gow", "stickied": false, "body": "I've definitely depression slept for really long periods of time ( like 14 hours or more), but I didn't find it enjoyable at all? Or well, it was simpler than being awake but definitely not something that I consciously wanted to do if that makes sense.", "is_submitter": false, "distinguished": null, "created_utc": 1629486790.0, "parent_id": "t3_p85gow", "replies": []}, {"author": "YourFriendsDog", "id": "h9ph41p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p85gow", "stickied": false, "body": "I thought you meant the Minecraft youtuber", "is_submitter": false, "distinguished": null, "created_utc": 1629491540.0, "parent_id": "t3_p85gow", "replies": [{"author": "Ionenschatten", "id": "h9r4jhx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p85gow", "stickied": false, "body": "Ngl i did watch 2 videos of him that are like 1 yr old and thought those were funny. \n\n&#x200B;\n\n&#x200B;\n\nThat's it.", "is_submitter": true, "distinguished": null, "created_utc": 1629519962.0, "parent_id": "t1_h9ph41p", "replies": []}]}]}