{"title": "Thanks for the invite. I’ll do my best, but I work a lot. (In healthcare)", "name": "t3_p02src", "url": "https://i.redd.it/2xqrenr3i0g71.jpg", "selftext": "", "score": 79, "upvote_ratio": 0.98, "permalink": "/r/TheFlyingTree/comments/p02src/thanks_for_the_invite_ill_do_my_best_but_i_work_a/", "id": "p02src", "author": "ISTP_Loner", "link_flair_text": "Humour", "num_comments": 53, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628375241.0, "comments": [{"author": "RoyalEagle0408", "id": "h84blt8", "score": 14, "subreddit": "TheFlyingTree", "author_flair": "Seeker #173", "submission": "p02src", "stickied": false, "body": "Hope you’re taking care of yourself. -a microbiologist who is unbelievably tired.", "is_submitter": false, "distinguished": null, "created_utc": 1628385336.0, "parent_id": "t3_p02src", "replies": [{"author": "StopBanningMeGDIT", "id": "h84lom5", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "p02src", "stickied": false, "body": "I can't imagine. You gotta compete with Johnny three toes on YouTube for truth", "is_submitter": false, "distinguished": null, "created_utc": 1628390888.0, "parent_id": "t1_h84blt8", "replies": [{"author": "RoyalEagle0408", "id": "h84n69g", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #173", "submission": "p02src", "stickied": false, "body": "It’s exhausting, particularly when it’s my friend who I know is just being argumentative for the sake of being argumentative. Thankfully, most people appreciate and trust me, which can be a blessing and a curse- quite the responsibility!", "is_submitter": false, "distinguished": null, "created_utc": 1628391750.0, "parent_id": "t1_h84lom5", "replies": [{"author": "StopBanningMeGDIT", "id": "h84ouq7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "p02src", "stickied": false, "body": "Yea it feels like that's what, 35% of the country? This whole year must have been aomrough for you, but I'm.glad most people.atill trust you! I don't have the same expertise but people kind of trust me because I go to bat for them. I'm just tired of all of this", "is_submitter": false, "distinguished": null, "created_utc": 1628392724.0, "parent_id": "t1_h84n69g", "replies": []}, {"author": "07110518", "id": "h851n09", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p02src", "stickied": false, "body": ">“just being argumentative for the sake of being argumentative.“\n\nE.X.H.A.U.S.T.!!!!", "is_submitter": false, "distinguished": null, "created_utc": 1628400873.0, "parent_id": "t1_h84n69g", "replies": []}]}]}, {"author": "horny_coroner", "id": "h84p1wh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #253", "submission": "p02src", "stickied": false, "body": "Nah gonna work for 1-20 mire years die because I have inhaled so much asbestos and smokes for solid 8 years on top.", "is_submitter": false, "distinguished": null, "created_utc": 1628392838.0, "parent_id": "t1_h84blt8", "replies": []}, {"author": "ISTP_Loner", "id": "h85cr1c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "I’m skating through unscathed so far.", "is_submitter": true, "distinguished": null, "created_utc": 1628409861.0, "parent_id": "t1_h84blt8", "replies": []}, {"author": "SoyTuTocayo69", "id": "h86i88j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #105", "submission": "p02src", "stickied": false, "body": "It's not gonna get any better. Lots of people are unbelievable arrogant about this virus. This is a worldwide issue too. Tons of people think it's a globalist conspiracy, it's fucking aggregating.", "is_submitter": false, "distinguished": null, "created_utc": 1628437984.0, "parent_id": "t1_h84blt8", "replies": []}]}, {"author": "MisanthropicScott", "id": "h84fkbu", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "100% death rate?! Holy shit!!!\n\nIt's almost as if no one gets out alive.", "is_submitter": false, "distinguished": null, "created_utc": 1628387499.0, "parent_id": "t3_p02src", "replies": [{"author": "JanB1", "id": "h85losb", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #136", "submission": "p02src", "stickied": false, "body": "Live has a 100% death rate. Most people are killed by life in their sleep.", "is_submitter": false, "distinguished": null, "created_utc": 1628418025.0, "parent_id": "t1_h84fkbu", "replies": [{"author": "MisanthropicScott", "id": "h864b26", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "> in their sleep.\n\nThe lucky ones.", "is_submitter": false, "distinguished": null, "created_utc": 1628431077.0, "parent_id": "t1_h85losb", "replies": [{"author": "JanB1", "id": "h87e4mx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #136", "submission": "p02src", "stickied": false, "body": "Hence \"most\".", "is_submitter": false, "distinguished": null, "created_utc": 1628452771.0, "parent_id": "t1_h864b26", "replies": []}, {"author": "theascendedcarrot", "id": "h8ang3o", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #108", "submission": "p02src", "stickied": false, "body": ">The lucky ones.\r  \n\r\n\nThat all depends on your perception. I would like to be cognizant as death pulls me away from everything I have ever known, surrounded only by those I care about.  There would surely be less pain to go in your sleep, but pain is temporary.", "is_submitter": false, "distinguished": null, "created_utc": 1628522806.0, "parent_id": "t1_h864b26", "replies": [{"author": "MisanthropicScott", "id": "h8aoava", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "Interesting take on things.", "is_submitter": false, "distinguished": null, "created_utc": 1628523178.0, "parent_id": "t1_h8ang3o", "replies": []}]}]}]}, {"author": "ISTP_Loner", "id": "h85x8yi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "Mr. Scott, do you know your personality type? My ex BF was a misanthropic INTJ. I’m just curious. We were both stubborn as hell so it didn’t work out.", "is_submitter": true, "distinguished": null, "created_utc": 1628426973.0, "parent_id": "t1_h84fkbu", "replies": [{"author": "MisanthropicScott", "id": "h865klh", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "I'm MBTI type \"failure\". I literally failed the test.\n\nIt wasn't that I didn't feel strongly about the answers it was that I couldn't answer because I needed more information than was given in the question.\n\nFor example, if I'm in a room full of people I know reasonably well (doesn't have to be very well, just if I know everyone), coworkers, friends, relatively close family, etc., I'm quite extroverted.\n\nIf I'm in a room of more distant family whom I only see occasionally or a room full of complete strangers such as at a science lecture, then I'm quite introverted. \n\nSo, I hit some question about behavior in a room full of people. I could be either quite extroverted or quite introverted, never in between. How would I answer that?\n\nThat was just one example. I don't remember the questions all that well, I tried the mid-length test online soon after joining this sub when someone else asked.\n\nI'd also add a bit about my misanthropy. I hate the sum total of humanity for what we do to the biosphere on which we depend for our lives and for the cruelty to other humans. But, I don't hate every individual human on the planet. I've been married for 34 years and counting. I have a smallish circle of friends and family whom I love. But, I am a member of the Voluntary Human Extinction Movement, emphasis on voluntary.\n\nP.S. Just Scott is fine without the mister. It actually is my first name.", "is_submitter": false, "distinguished": null, "created_utc": 1628431749.0, "parent_id": "t1_h85x8yi", "replies": [{"author": "ISTP_Loner", "id": "h86hln1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "That’s interesting that someone else asked you. There are over 100k people in MBTI groups and subgroups on here. It’s why I initially joined, which was only a few days ago. The test I took was on 16personalities.com. \nThanks for clarifying the ‘voluntary’ part. Lol. Does that entail having less children, or is the group more for promoting awareness.", "is_submitter": true, "distinguished": null, "created_utc": 1628437694.0, "parent_id": "t1_h865klh", "replies": [{"author": "ISTP_Loner", "id": "h879nxa", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "There are discussions around ‘ambiversion’ which you may find interesting. The people in the crowded room did not matter for me. I don’t engage much in any group unless required to. I do ok socially in those cases. Being confident and a little sharp helps I guess. \n\nI can confidently say I won’t have anymore offspring than the two I have. The main reason being that I’m postmenopausal. Lol.", "is_submitter": true, "distinguished": null, "created_utc": 1628450671.0, "parent_id": "t1_h86hln1", "replies": []}, {"author": "MisanthropicScott", "id": "h86x7f8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "> That’s interesting that someone else asked you. There are over 100k people in MBTI groups and subgroups on here. It’s why I initially joined, which was only a few days ago.\n\nThe bot for this group pulls people from those subs, among others. So, there is an artificially high percentage of people from those groups here on this sub, which is where I was asked. Ditto for the various atheism subs which are also feeding grounds for the bot. I'm pretty sure I was pulled from the main atheism sub.\n\n>  The test I took was on 16personalities.com.\n\nMaybe I'll give it a try again. When they ask how you behave in a room full of people, what do you assume about those people? Are they people like coworkers or family or friends whom you know at least reasonably well? Are they total strangers?\n\n> Thanks for clarifying the ‘voluntary’ part. Lol. Does that entail having less children, or is the group more for promoting awareness.\n\nThe motto is “May we live long and die out”.\n\nAlso on the main page is the following explanation:\n\n> Phasing out the human species by voluntarily ceasing to breed will allow Earth’s biosphere to return to good health. Crowded conditions and resource shortages will improve as we become less dense.\n\nThe group has no membership dues or official registry. If you say you're a member, you are. But, you should meet the following criteria based on the [Voluntary Human Extinction Movement website](http://www.vhemt.org/).\n\nNote that the site will look as old as it is, which is at least a couple of decades. I'm not sure anyone has updated it in a lot of years. But, someone must still be paying the bills.\n\nEmphasis mine (from the FAQ):\n\n> Being VHEMT is a state of mind. **All you have to do to join is make the choice to refrain from further reproduction.** For some, this is an easy decision to make. For others, it’s a moot issue. But for many, joining The Movement means making a monumental personal sacrifice.\n\n> The Voluntary Human Extinction Movement is not an organization, so no membership dues go to officials in offices. We are millions of individuals, each doing what we feel is best.\n\nAlso, from a different part of the FAQ that pertains to those who already have children.\n\n> Naturally you’re welcome to join, and you won’t be alone. When people gain the VHEMT perspective, they decide to add no more to the existing human family. They don’t pressure their children to give them grandchildren and might encourage them to make a responsible choice with their fertility.\n\nAs for me, my wife and I are childfree by choice. \n\nWe've been happily married 34 years. We made the decision not to have children as soon as we had enough money to consider having them. We both thought we'd have children one day when we got married. But, we married young. When the time came to actually have children, we both didn't want to do so.\n\nNow, all of our hypothetical children are safe and happy and warm locked behind my severed, tied, and cauterized vasa deferentia. They will not have to deal with the world in its degraded and deteriorating state. They will never get sick or die. They will simply never be dragged into existence.", "is_submitter": false, "distinguished": null, "created_utc": 1628444875.0, "parent_id": "t1_h86hln1", "replies": []}, {"author": "MisanthropicScott", "id": "h89duzm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "> The test I took was on 16personalities.com.\n\nSo, I tried again and muddled through that test. I had to answer neutral on way too many questions. Then it gave me a type that I'm not even going to post (or remember) because it seems so radically wrong about who I am.\n\nSo, I'm still staying with MBTI type *failure*.\n\nI just don't understand the questions well enough to answer them accurately. When I try to just answer even if I don't get it, it obviously throws my score completely out of whack.", "is_submitter": false, "distinguished": null, "created_utc": 1628492656.0, "parent_id": "t1_h86hln1", "replies": [{"author": "ISTP_Loner", "id": "h89nl9r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "Yes I’m sure some people fall into the ‘unidentifiable’ category.  The questions can be vague and then you end up giving contradictory answers.", "is_submitter": true, "distinguished": null, "created_utc": 1628501405.0, "parent_id": "t1_h89duzm", "replies": [{"author": "MisanthropicScott", "id": "h8aaxdc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "Contradictory answers, possibly. But, definitely a lot of just neither agree nor disagree. It actually classed me as ISTP-A. When I read more of the details than just the intro, some of it makes sense about me. But, a lot of it doesn't. Despite being introverted in situations where I don't really know many people, I'm quite strongly a social being and do not get tired of social interactions with people I know. Or, for that matter, people on the internet. \n\nAs a guess, I'd say maybe 50-60% of the stuff it said made sense about me, especially the highly logical problem solver stuff. One thing it really got right is not following rules that don't make sense to me. Growing up, my mom was really great about that. She would always explain. She never said \"because I'm the mommy\" or anything similar.\n\nBut, even as a programmer (now retired), I always preferred working as a team on a large scale project. And, I even liked when earlier in my career, I was able to work with the users to figure out the requirements instead of the later trend that took over of having someone hand the specs down from on high.\n\nAs an aside, my wife and I met in programming class. We were programming our assignments together, pair programming before that became a buzz word in the late 1990s, before the eXtreme Programming (XP) book was written.\n\nAnd, if a real crisis comes up, major system crash or similar, I'm a huge believer in \"when in danger; when in doubt; run in circles; scream and shout.\" It's amazing how well it works to get absolutely everyone even tangentially related to the system racing around like mad. No one knows who will be the one to solve it or how many will be splintered off working together to solve it. But, if you just put \"the right person\"^(tm) on it, that system is going to be down for a long time.\n\nThese days, I'm practically living on reddit when my wife and I (34 years, which it does say is possible for ISTP-A, except that neither of us ever need that alone time it mentions) are home. She's more introverted than I am. So, I do get extra social interaction online. I consider this a social interaction.\n\nBut, while my wife won't want to make plans with friends and family too many days of the week, I'd be fine seeing people I know almost every day.\n\nI wonder if there's one of the MBTI types specifically for people who don't like to be pigeonholed into an MBTI type, don't believe 7.8 gigapeople can be pigeonholed into just 16 types, and don't even think it's such a great idea to try.\n\nP.S. I also found the term virtuoso to be a turn off right from the start. I don't think of myself as a virtuoso and it sounds arrogant.", "is_submitter": false, "distinguished": null, "created_utc": 1628517066.0, "parent_id": "t1_h89nl9r", "replies": [{"author": "ISTP_Loner", "id": "h8bdxmn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "I was ISTP-A on the test. I really fit a lot of the traits listed, but I also behave like INTP in that I’m introspective and nerdy at times. For ISTP traits, I used to race motocross, I still ride motorcycles (more cautiously these days) was quarterback on girls football team and starting left fielder in HS, coached work softball teams, play drums and piano, worked in emergency services for 30+ years, handy around the house, love cars, and shoot guns. And I’m kind of aloof and noncommittal with relationships, hence, I’m alone. Lol. I prob sound pretty butch but I’m not. I’m a relatively feminine hetero.", "is_submitter": true, "distinguished": null, "created_utc": 1628534044.0, "parent_id": "t1_h8aaxdc", "replies": [{"author": "MisanthropicScott", "id": "h8bhsqi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "> I prob sound pretty butch but I’m not.\n\nNot at all. You just sound like you're living life to its fullest by your own standards. Who cares about cultural norms?", "is_submitter": false, "distinguished": null, "created_utc": 1628535667.0, "parent_id": "t1_h8bdxmn", "replies": []}]}, {"author": "ISTP_Loner", "id": "h8beoek", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "I’ve read where some people purposely chose answers in the middle of the range for everything and got ISTP. I guess it’s just an apathetic personality type. Lol. I relate to the virtuoso name because I play music, but I’m hardly a virtuoso, especially on the drums. Lol", "is_submitter": true, "distinguished": null, "created_utc": 1628534355.0, "parent_id": "t1_h8aaxdc", "replies": []}]}]}]}]}, {"author": "theascendedcarrot", "id": "h8aqb00", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #108", "submission": "p02src", "stickied": false, "body": "This website runs a scan on all of your reddit posts/comments in an effort to determine your mbti type. After using it on myself and on a couple friends (that have been typed) reddit accounts, it seems fairly adequate so long as you aren't larping. It has placed you as an INTP. Obviously take this, along with mbti in general, with a grain of salt. \n\nhttps://gimmeserendipity.com/mbtimodel/reddit/u/misanthropicscott", "is_submitter": false, "distinguished": null, "created_utc": 1628524044.0, "parent_id": "t1_h865klh", "replies": [{"author": "MisanthropicScott", "id": "h8atjho", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "From a quick check of the characteristics of INTP:\n\n> **Key INTP Characteristics**\n\n> * INTPs are quiet, reserved, and thoughtful.\n\n   Literally no one would ever describe me as quiet or reserved.\n\n>   As introverts, they prefer to socialize with a small group of close friends with whom they share common interests and connections.\n\n   This is true of me.\n\n> * They enjoy thinking about theoretical concepts and tend to value intellect over emotion. INTPs are logical and base decisions on objective information rather than subjective feelings.\n\n   True of me.\n\n> * When analyzing data and making decisions, they are highly logical and objective.\n\n   I certainly think this is true of me. I hope I'm correct.\n\n> * Tends to be flexible and good at thinking \"outside of the box.\"\n\n   I'm not sure I equate these things. At times I can be inflexible, especially once I've reached a hard conclusion. But, I hope I can think outside the box.\n\n> * People with this personality type think about the big picture rather than focusing on every tiny detail.\n\n   This does not seem true of me. One of my problems when I was still working as as programmer was that I was fine thinking about the big picture as long as I could imagine some way to implement it.\n\n   If I got stuck on thinking some minor point was not possible, I found it very hard to continue to think about that big picture. Once there's a showstopping problem, why bother. So, if someone came up with some way it *could* be done, even if it wasn't the way we did it later, I could continue. But, without that, I get really stuck.\n\n> * INTPs like to keep their options open and feel limited by structure and planning.\n\n   This is definitely not me. My wife and I often make our travel plans 9 - 15 months in advance due to the type of travel we love.\n\n> Strengths\n\n> * Logical and objective\n\n   I hope so.\n\n> * Abstract thinker\n\n   Sometimes, but probably not really my strong suit.\n\n> * Independent\n\n   In what context?\n\n> * Loyal and affectionate with loved ones\n\n   Yes.\n\n> Weaknesses\n\n> * Difficult to get to know\n\n   I don't think so. It takes a bit. But, I do start to open up pretty quickly once I have some common ground with someone.\n\n> * Can be insensitive\n\n   Only by accident. I certainly try to be sensitive.\n\n> * Prone to self-doubt\n\n   No. I'm pretty self-confident, actually. I know my strengths and weaknesses. I don't tend to doubt myself.\n\n> * Struggles to follow rules\n\n   This depends on whether the rules make sense to me.\n\n> * Has trouble expressing feelings\n\n   Yes. At times, especially negative feelings.\n\n**Overall**: Not bad. But, there are some pretty significant differences here. I think I don't fit pigeonholes well.", "is_submitter": false, "distinguished": null, "created_utc": 1628525433.0, "parent_id": "t1_h8aqb00", "replies": []}]}]}]}]}, {"author": "wh0-am-l", "id": "h84leuh", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #19", "submission": "p02src", "stickied": false, "body": "Watch someone repost this as actual proof against vaccines", "is_submitter": false, "distinguished": null, "created_utc": 1628390734.0, "parent_id": "t3_p02src", "replies": [{"author": "FiannaTheBard", "id": "h84mbqn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #196", "submission": "p02src", "stickied": false, "body": "😭", "is_submitter": false, "distinguished": null, "created_utc": 1628391254.0, "parent_id": "t1_h84leuh", "replies": []}]}, {"author": "WikiContributor83", "id": "h83wscu", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #120", "submission": "p02src", "stickied": false, "body": "Day after day people drink Dihydrogen Monoxide, even though statistically 100% of people who drink it will eventually die. Wake up sheeple!", "is_submitter": false, "distinguished": null, "created_utc": 1628377379.0, "parent_id": "t3_p02src", "replies": [{"author": "SchoggiToeff", "id": "h85o3p9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #114", "submission": "p02src", "stickied": false, "body": "Be careful with that stuff. One drop and you are hooked for life. Worst withdrawal symptoms of any drug. Absolutely no one could ever come clean.", "is_submitter": false, "distinguished": null, "created_utc": 1628420145.0, "parent_id": "t1_h83wscu", "replies": []}, {"author": "ISTP_Loner", "id": "h85cnug", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "Dihydrogen dioxide is also a killer. Everyone whose wounds I’ve cleaned with it will eventually die as well.", "is_submitter": true, "distinguished": null, "created_utc": 1628409785.0, "parent_id": "t1_h83wscu", "replies": []}, {"author": "brian9000", "id": "h864240", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p02src", "stickied": false, "body": "And dont even get me started on the birds…", "is_submitter": false, "distinguished": null, "created_utc": 1628430943.0, "parent_id": "t1_h83wscu", "replies": []}]}, {"author": "Alirezahjt", "id": "h8532n1", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "p02src", "stickied": false, "body": "Did they have Macrochips back then?", "is_submitter": false, "distinguished": null, "created_utc": 1628401940.0, "parent_id": "t3_p02src", "replies": [{"author": "MisanthropicScott", "id": "h854t1h", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "No. But, a couple of decades later, they were able to start injecting [Babbage computers](https://upload.wikimedia.org/wikipedia/commons/5/53/BabbageDifferenceEngine.jpg) with the vaccines.", "is_submitter": false, "distinguished": null, "created_utc": 1628403275.0, "parent_id": "t1_h8532n1", "replies": [{"author": "LMA73", "id": "h85j4py", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #4", "submission": "p02src", "stickied": false, "body": "This really made me laugh! Thanks!", "is_submitter": false, "distinguished": null, "created_utc": 1628415674.0, "parent_id": "t1_h854t1h", "replies": []}, {"author": "ISTP_Loner", "id": "h85tj39", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "I just clicked on the Babbage pic link. WTH is it? 😂  Calling it a computer seems overly generous.", "is_submitter": true, "distinguished": null, "created_utc": 1628424450.0, "parent_id": "t1_h854t1h", "replies": [{"author": "MisanthropicScott", "id": "h864gwc", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p02src", "stickied": false, "body": "Well, it's a machine that computes. Did you know that before the devices we call computers the word *computer* was a job title? It was used for people who did things like calculating logarithm tables.\n\nI think the image I picked was a difference engine. Here's some history of Babbages computing machines.\n\nhttps://www.computerhistory.org/babbage/engines/", "is_submitter": false, "distinguished": null, "created_utc": 1628431166.0, "parent_id": "t1_h85tj39", "replies": [{"author": "Alirezahjt", "id": "h86b53s", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "p02src", "stickied": false, "body": "I learned this after watching Imitation Game. Certain employers would hire people to just sit and do math.\n\nIMAGINE THAT.", "is_submitter": false, "distinguished": null, "created_utc": 1628434556.0, "parent_id": "t1_h864gwc", "replies": []}]}]}]}, {"author": "ISTP_Loner", "id": "h85sjbz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "Yes, that’s why the scar is so big from the smallpox vaccine. After about 1972 they switched over to the micro. Lol.", "is_submitter": true, "distinguished": null, "created_utc": 1628423710.0, "parent_id": "t1_h8532n1", "replies": []}]}, {"author": "floofandmemes", "id": "h83z33t", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p02src", "stickied": false, "body": "Haha, I got my vaccines AFTER 1798, that means I can live forever, right?", "is_submitter": false, "distinguished": null, "created_utc": 1628378564.0, "parent_id": "t3_p02src", "replies": [{"author": "Professor_Gurgi", "id": "h84rihl", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p02src", "stickied": false, "body": "Yes", "is_submitter": false, "distinguished": null, "created_utc": 1628394262.0, "parent_id": "t1_h83z33t", "replies": []}, {"author": "VenomOUShazard", "id": "h85b2nf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p02src", "stickied": false, "body": "checkmate cryogenics", "is_submitter": false, "distinguished": null, "created_utc": 1628408421.0, "parent_id": "t1_h83z33t", "replies": []}]}, {"author": "redsyrinx2112", "id": "h84x7ka", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p02src", "stickied": false, "body": "Ha! Rekt", "is_submitter": false, "distinguished": null, "created_utc": 1628397812.0, "parent_id": "t3_p02src", "replies": []}, {"author": "sparant76", "id": "h859kve", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #51", "submission": "p02src", "stickied": false, "body": "That we know of.   The living ones are in hiding.", "is_submitter": false, "distinguished": null, "created_utc": 1628407142.0, "parent_id": "t3_p02src", "replies": [{"author": "ISTP_Loner", "id": "h85c1ui", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "I remember after 9/11 there was talk about vaccinating healthcare workers for smallpox again. Glad we didn’t have to do it. I work in ER so we’re at risk for exposure to everything. EMS and Police are even more at risk however.", "is_submitter": true, "distinguished": null, "created_utc": 1628409257.0, "parent_id": "t1_h859kve", "replies": []}]}, {"author": "DmitryTheRussianSpy", "id": "h85baif", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #103", "submission": "p02src", "stickied": false, "body": "Welp, that justifies saying vaccines cause death. Thanks", "is_submitter": false, "distinguished": null, "created_utc": 1628408606.0, "parent_id": "t3_p02src", "replies": []}, {"author": "LustigesSporenDrama", "id": "h85bm1m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #265", "submission": "p02src", "stickied": false, "body": "\"People used to live forever until they discovered the vaccines\". - Your friendly neighbourhood snake-oil salesman.", "is_submitter": false, "distinguished": null, "created_utc": 1628408881.0, "parent_id": "t3_p02src", "replies": []}, {"author": "Alert_Watercress4998", "id": "h85dpwu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #34", "submission": "p02src", "stickied": false, "body": "It shows it’s not safe. Everyone who takes a vaccine will die, you can’t argue with the 100% rates. Can’t believe people eat either, they’ll die!", "is_submitter": false, "distinguished": null, "created_utc": 1628410715.0, "parent_id": "t3_p02src", "replies": []}, {"author": "kindasortasalty", "id": "h85hv12", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #33", "submission": "p02src", "stickied": false, "body": "That’s a great meme", "is_submitter": false, "distinguished": null, "created_utc": 1628414494.0, "parent_id": "t3_p02src", "replies": []}, {"author": "THF-Killingpro", "id": "h86cwgj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p02src", "stickied": false, "body": "Every person who breathes oxygen dies.", "is_submitter": false, "distinguished": null, "created_utc": 1628435419.0, "parent_id": "t3_p02src", "replies": []}, {"author": "Brohozombie", "id": "h86kq5a", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p02src", "stickied": false, "body": "In the Army I had to get the smallpox vaccine before going to the Middle East. They jab you 10-15 times like a traditional Polynesian tattoo on your shoulder. Not fun.", "is_submitter": false, "distinguished": null, "created_utc": 1628439151.0, "parent_id": "t3_p02src", "replies": [{"author": "ISTP_Loner", "id": "h86n32u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p02src", "stickied": false, "body": "Wow they actually started doing it then. It was a scary time. Back then when I found out that there were actually samples of about every infectious contagion known to man, I felt like nothing was ever ‘eradicated’, just maintained for future use.", "is_submitter": true, "distinguished": null, "created_utc": 1628440246.0, "parent_id": "t1_h86kq5a", "replies": []}]}]}