{"title": "Why you should support carbon pricing", "name": "t3_p5yp4d", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p5yp4d/why_you_should_support_carbon_pricing/", "selftext": "Bot decided I should be here, so imma use this as a soapbox to shill for politics by copying someone else's post:\n\n---\n\n“If anyone intentionally spoils the water of another…let him not only pay for damages, but purify the stream or cistern which contains the water” -The Dialogues of Plato: The Laws\n\n**What is carbon pricing?**\n\nCarbon Pricing as an umbrella term under which a number of schemes, notably carbon-taxation and cap-and-trade fall. Carbon pricing is based on the idea of pricing externalities through [Pigouvian taxation](https://www.economist.com/economics-brief/2017/08/19/pigouvian-taxes). There are certain economic activities that affect others than those directly involved in them, without those affects having an impact in the cost. These are called externalities. In the case of **positive** externalities there is a strong argument for subsidization, as these are activities that benefit society. Looking at education, an educated workforce is going to be more productive, make better political decisions, and be more prone to innovation, yet these facts are not directly taken into account in the price of education. This is why education is subsidized, to an extent, in most developed countries. Conversely, there are certain activities that take place to the detriment of those not involved in them, called **negative** externalities. There is a strong case for implementing taxation on these activities. Greenhouse gas emissions are an example of negative externalities, because they [worsen health outcomes](http://www.who.int/airpollution/ambient/health-impacts/en/h) and lead to [anthropogenic climate change](http://ar5-syr.ipcc.ch/ipcc/ipcc/resources/pdf/IPCC_SynthesisReport.pdf). Carbon pricing would mean placing a tax on these externalities in order to replicate their true cost to society. This pricing would be an effective way to get rid of these problems, without harming the economy in the way that excessive regulation might. In practice, carbon pricing is implemented through either a carbon tax, or through a cap-and-trade scheme (note: there are costs and benefits to either of these, but this seemed like a needless tangent). In spite this fact, many states have been reluctant to introduce prices on greenhouse gases, either not introducing them, or introducing them despite a considerable amount of opposition. Not only that, but emissions intensive industries are presently [subsidized to the tune of $493 billion in 2014](https://openknowledge.worldbank.org/bitstream/handle/10986/28510/wb_report_171027.pdf?sequence=7&isAllowed=y). At present, about 85% of emissions are not covered by a carbon tax. I'm going to be arguing that not only are carbon taxes a great idea, but that this opposition is based virtually entirely on ignorance of how carbon taxes work, or a lack of willingness to do anything about climate change. \n\n**There is a need for action on climate change**\n\nI would hope that this is something that is already accepted by most readers here, however I unfortunately doubt that this is the case. If you doubt that climate change is real, that it is caused by human activity, or that it will have a catastrophic impact on humanity and our way of life, I'd encourage you to read [this section](http://ar5-syr.ipcc.ch/topic_futurechanges.php) of the Intergovernmental Panel of Climate Change's fifth report, section 2.3 in particular. Climate change is [already affecting economic growth, and could limit economic growth by as much as 10% by the end of the century, with the harshest impacts hitting already vulnerable populations in areas like sub-Saharan Africa](https://read.oecd-ilibrary.org/environment/the-economic-consequences-of-climate-change_9789264235410-en#page23). \n\n\n **Carbon pricing works.**\n\nIn assessing how to best implement climate policy, there are two major questions: Does the policy reduce GHG emissions? and: Does the policy reduce GHG emissions without seriously hampering the economy? Carbon pricing is an effective policy because it answers both of these questions with an emphatic yes. \n\nCarbon pricing works on the basis of how prices impact consumer choice, which is a lot.  Analyses of cigarette consumption, for instance, have found that, despite the prevalence of warning labels and limits to cigarette advertising in much of the west, the most effective way to reduce smoking is simply [to tax the product](https://voxeu.org/sites/default/files/image/FromAug2011/guindon_fig4.gif). The same is true of greenhouse gas products. The higher the price, the less willing people are to consume it. Unlike cigarettes, which have a mixed impact on society, GHG emissions are purely bad for society. Because of this, the lack of a carbon tax can effectively be considered a subsidy. A carbon tax is a way to internalize the price that emissions have on society onto the emitter themself. This is not (or at least, should not) be done all at once, it would immediately put many industries out of business, but is rather done incrementally. Most carbon taxes have tended to start at around $5-10 USD per tonne, going up exponentially over time until the actual cost of carbon is internalized (in effect until emissions are at or near zero). \n\nHow does this pan out in practice? Based on this principle, carbon pricing has been introduced in a number of different jurisdictions around the world, to great effect. Carbon pricing is [widely supported among economists](https://ecofiscal.ca/wayforward/) as a mechanism that is able to lower emissions without hindering economic growth. \n\nBritish Columbia was the first province in Canada to introduce a price on carbon, implementing a cabon tax of $10 per tonne in 2008, rising to $30 per tonne in 2012. The result has been a reduction of emissions of between [5 and 15 percent](https://ecofiscal.ca/carbon-pricing-works/#section-3). How has the price affected their economy? Well, it's hard to say how they would be doing withotu the tax, but it is notable that between 2011 and 2015, BC had the [highest labour productivity growth in Canada](http://www.conferenceboard.ca/hcp/provincial/economy/labour-productivity.aspx) in spite of the fact that they had the most robust carbon pricing system. \n\nCalifornia implemented its AB32 cap-and-trade scheme, [covering 85% of emissions, in 2012 and its economic growth continues to outpace the growth of the rest of the country](http://www.nber.org/papers/w21742.pdf). What's changed is that it is now on track to meet its 2020 emissions-reduction targets. \n\n**Revenue Recycling**\n\nNoting the success of carbon pricing in theory, it now becomes very important to discuss the implementation of carbon pricing, as improper implementation can ruin even the best ideas. The most important factor for consideration in administering a carbon price is where the revenue that is generated through the price goes. What many economists like is the idea of a revenue neutral carbon tax. This means that all the revenue that is paid to the government through the tax is paid back to the population. There are a number of mechanisms to accomplish this, such as lowering income taxes or establishing a basic income/negative income tax. \n\nThis type of policy, known as revenue recycling, improve economic efficiency by shifting revenue generation from things that arguably should be taxed (GHG emissions) to things that arguably shouldn't (income). It shouldn't be surprising that survey of American economists shows that 97% (hey, where have i heard that number before?*) of economists surveyed [supported a carbon tax that recycled its revenue through lowering income taxes](http://www.igmchicago.org/surveys/carbon-taxes-ii). What's more is that this type of policy further improves the economic incentive to reduce emissions by directly showing to consumers their incentive to live a more sustainable lifestyle. \n\n*The 3% of those who didn't were one economist that was ignorant of the science on climate change. \n\n**Myth and Fact**\n\nI've been promoting carbon pricing on reddit for awhile; accordingly, I've been met with my fair share of opposition. Below are some of the arguments I've encountered, and how well they stand up against the facts. \n\n>Carbon taxes won't decrease fuel usage, people driving cars are doing so because they have to drive them, and don't have any other option. \n\nThis claim is *false*. BC's carbon price has resulted in both an [increase in more fuel-efficient vehicles, and a drop in gasoline consumption](https://ecofiscal.ca/carbon-pricing-works/#section-3). \n\n>A carbon tax will hurt the poor the most. \n\nThis claim is *mostly false*. It's true that a carbon tax has the potential to add another economic cost to those who are already potentially in dire straits. But when you consider that [the wealthiest people tend to pollute much more than the poorest](https://www.vox.com/energy-and-environment/2017/12/1/16718844/green-consumers-climate-change), it can be easy to se why this claim doesn't hold much water. The revenue generated by a carbon tax would be paid largely by the wealthy, while revenue recycling (depending on the method) would allow for revenue to go to all at an equal rate. Effectively, this means that the poorest stand to benefit the most from a carbon tax. If you're truly concerned for the impact of a carbon tax on the poor, push for a revenue neutral carbon tax, not no carbon tax. \n\n>The effects of climate change have been exaggerated by the scientific community. \n\nThis claim is *false*. In fact the [opposite is true](https://insideclimatenews.org/news/22082017/study-confirms-exxon-misled-public-about-climate-change-authors-say). \n\nI hope that wasn't too long or painful. If you have any comments or criticisms, I'd love to hear them.", "score": 25, "upvote_ratio": 0.88, "permalink": "/r/TheFlyingTree/comments/p5yp4d/why_you_should_support_carbon_pricing/", "id": "p5yp4d", "author": "jenbanim", "link_flair_text": "Discussion", "num_comments": 51, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629183720.0, "comments": [{"author": "SybariteAussie", "id": "h99q7lt", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p5yp4d", "stickied": false, "body": "Income tax was introduced to assist finances during WW1. The government assured us that it would cease post war. I am sceptical about how our governments would spend additional taxes. The peasants/working class would bear the brunt. Those with “the vision of the anointed” would not have to make many adjustments. On a positive note, these taxes would assist financing those with “the vision of the anointed” to travel the world in their private jets. It would also help financing their hotel rooms and lavish meals.", "is_submitter": false, "distinguished": null, "created_utc": 1629192743.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "ATR2400", "id": "h9e6r8q", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "p5yp4d", "stickied": false, "body": "Idealistic view: The government will use carbon tax income to invest in researching and building new clean technologies \n\nRealistic view: That money is going straight into a dark pit and we’ll never see it again", "is_submitter": false, "distinguished": null, "created_utc": 1629281955.0, "parent_id": "t1_h99q7lt", "replies": []}, {"author": "havens1515", "id": "h9a0tnp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Income tax was also unconstitutional. They literally had to pass a constitutional amendment to do it. Which tells you something.\n\nAlso, taxing income is counter productive. It encourages people to not have income. Or at least, to have as little as possible income that is reportable to the government. (Especially with the absolutely broken tax law in the US.)", "is_submitter": false, "distinguished": null, "created_utc": 1629200501.0, "parent_id": "t1_h99q7lt", "replies": [{"author": "Fearghas2011", "id": "h9bv7l1", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #38", "submission": "p5yp4d", "stickied": false, "body": "I mean, they also had to ammend the constitution to ban slavery and allow women the right to vote. Just because the constitution had to be amended doesn't make a certain change bad.\n\nOn the topic of income tax, the only real problem for me are broken tax laws (the concept of income tax in and of itself is fine though).", "is_submitter": false, "distinguished": null, "created_utc": 1629231456.0, "parent_id": "t1_h9a0tnp", "replies": [{"author": "havens1515", "id": "h9c4648", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Good point, but income tax was specifically disallowed on the original constitution. Specifically because the founders knew that income tax is not a sustainable system.", "is_submitter": false, "distinguished": null, "created_utc": 1629235189.0, "parent_id": "t1_h9bv7l1", "replies": []}]}, {"author": "eliminating_coasts", "id": "h9a3zte", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #129", "submission": "p5yp4d", "stickied": false, "body": "I disagree with this; taxing income is one of the least distortionary ways to tax, because it never creates a negative incentive that overwhelms the basic value of wanting to have money.\n\nVAT is better in that it has an internal enforcement mechanism, generating its own paper trail, but it works in a similar way; you pay tax because you have a business that is making money.\n\nPeople aren't going to stop wanting to have income, or wanting to make money, so if you want to place a tax anywhere that's a good place.\n\nOn the other hand, you can probably argue that in some ways land value taxes and carbon taxes are better, because they reflect putting a price on something that is scarce, and either cannot disappear because of the tax (like land), or we actually want to disappear, like a carbon tax.\n\nBut conversely, with an income tax, you can put some effort into insuring that the tax doesn't interfere with people's ability to live; you can give a tax-free threshold, and tax income above that amount, meaning that you can be confident that the money you're taxing is in the range of discretionary spending, whereas managing the impacts of a land tax on people's welfare is hard to do directly, however theoretically efficient it is.\n\nBut for anyone concerned about a carbon tax being used to generally increase the tax burden, the easiest way to resolve that is just to separate off the revenue into a carbon tax and dividend, where you just give the total money earned back to citizens evenly. This way, over half the population get more back than they put in, and a small number of very high income people with high levels of consumption and emissions pay for the dividends the rest get.\n\nSo the money goes out, comes back in, with most people being the same or better off in terms of income, but you still get the benefit that it changes the relative cost of things with different amounts of emissions, helping the market respond.\n\n*And*, if you have it separated off as its own separate loop with its own budget, people can complain when some politician starts trying to pull things out of the pot, you can even potentially put laws on it restricting the executive from doing anything other than sending that money back.", "is_submitter": false, "distinguished": null, "created_utc": 1629202363.0, "parent_id": "t1_h9a0tnp", "replies": []}, {"author": "Cheomesh", "id": "h9f56ok", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p5yp4d", "stickied": false, "body": "Taxation is permitted in the body of the Constitution.", "is_submitter": false, "distinguished": null, "created_utc": 1629301557.0, "parent_id": "t1_h9a0tnp", "replies": []}]}]}, {"author": "Espumma", "id": "h99o8d3", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #12", "submission": "p5yp4d", "stickied": false, "body": "Thanks for sharing!", "is_submitter": false, "distinguished": null, "created_utc": 1629191066.0, "parent_id": "t3_p5yp4d", "replies": []}, {"author": "von_Viken", "id": "h99foyf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #230", "submission": "p5yp4d", "stickied": false, "body": "Agree", "is_submitter": false, "distinguished": null, "created_utc": 1629184081.0, "parent_id": "t3_p5yp4d", "replies": []}, {"author": "I_Am_Anjelen", "id": "h99i6k9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #297", "submission": "p5yp4d", "stickied": false, "body": "Didn't this turn into an excuse for massive corporations to make no change whatsoever, in fact to ramp up production because the profits outweighed the prices they paid to buy carbon credits from elsewhere, like, a decade or so ago ?", "is_submitter": false, "distinguished": null, "created_utc": 1629186079.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "jenbanim", "id": "h99ke13", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "If the profits outweigh the price for carbon credits, just increase the price lmao\n\nBut actually, with carbon pricing you're free to set either the price on carbon or the cap on carbon as needed to get the desired result. As with most things climate change, I would expect that we're not being aggressive enough, but that's not a strike against the policy itself\n\nPlus there are many success stories, like the one of BC in the post above", "is_submitter": true, "distinguished": null, "created_utc": 1629187872.0, "parent_id": "t1_h99i6k9", "replies": []}]}, {"author": "dcnairb", "id": "h99so63", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "p5yp4d", "stickied": false, "body": "Hell yes", "is_submitter": false, "distinguished": null, "created_utc": 1629194737.0, "parent_id": "t3_p5yp4d", "replies": []}, {"author": "DoglessDyslexic", "id": "h99zvi7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p5yp4d", "stickied": false, "body": "Nice write up.  Thanks for that.", "is_submitter": false, "distinguished": null, "created_utc": 1629199919.0, "parent_id": "t3_p5yp4d", "replies": []}, {"author": "dashingThroughSnow12", "id": "h9a4tj9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p5yp4d", "stickied": false, "body": "I'm ok with a carbon tax.\n\nYou argue your case poorly and your citations are dreadful.\n\nFor example, you link to _Wealthier people produce more carbon pollution — even the “green” ones_ by David Roberts on Vox. Their main reference is a German survey of 1012 individuals whose net yearly per capita household income ranged from 3K to under 88K. The study is about how income effects carbon emissions, not wealth. It mentions wealth only twice. Once is in a section on what future research can look into.\n\nThe Vox article repeatedly talked about wealth and the wealthiest. Despite the study using income and not even looking at wealth or affluence. Furthermore, you and I know what image is conjured up when an article talks about \"the wealthiest\".  What's the image that comes up though when you think of a family with a net yearly per capita income of 88K? That is a doctor in Canada with a wife and a kid or two. That's two teachers in New York with a kid. That's a kid fresh out of school working her first programming job in Toronto. Those aren't the images that the person who put the title on the article wants the reader to think of.\n\nOne can accurately look at that study and say that as   one's per capita household income decile rises, their carbon emissions tend to rise disproportionately. Instead it is deceptive with its title and wrong in how it summarizes the article.\n\nThat's one example but almost all your arguments and sources fall into this chasm of mistakes. As someone who agrees with you on the headline topic of carbon taxation, either you need to improve your arguments or stop making them.", "is_submitter": false, "distinguished": null, "created_utc": 1629202822.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "jenbanim", "id": "h9csmdy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Fair points, this isn't my post originally\n\nI should stop being lazy and write a post like this myself and hopefully fix the issues you've highlighted. This post was more of me testing the waters in this sub since I just got here", "is_submitter": true, "distinguished": null, "created_utc": 1629246946.0, "parent_id": "t1_h9a4tj9", "replies": []}]}, {"author": "Zealousideal_Mix_629", "id": "h9addnx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p5yp4d", "stickied": false, "body": "Policies like this disproportionately impact lower income families.", "is_submitter": false, "distinguished": null, "created_utc": 1629207097.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "bluesam3", "id": "h9b6nzy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #23", "submission": "p5yp4d", "stickied": false, "body": "Which is why you take the funds raised by the carbon tax and redistribute it to lower income people (or to everybody evenly: it essentially doesn't matter, and the latter probably wins due to ease of administration).", "is_submitter": false, "distinguished": null, "created_utc": 1629219242.0, "parent_id": "t1_h9addnx", "replies": [{"author": "Zealousideal_Mix_629", "id": "h9b8bgc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p5yp4d", "stickied": false, "body": "The complicated the chain of money, the more it changes hands, the more likelihood it will cause corruption and the funds will not end up in the hands of those who need it most.", "is_submitter": false, "distinguished": null, "created_utc": 1629220178.0, "parent_id": "t1_h9b6nzy", "replies": [{"author": "jenbanim", "id": "h9c71zq", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "* government gets money from carbon tax\n* government gives money back to the people\n\nDividends are the least complicated chain of money possible, the form of welfare that requires the least overhead, and a tried and true policy", "is_submitter": true, "distinguished": null, "created_utc": 1629236447.0, "parent_id": "t1_h9b8bgc", "replies": [{"author": "Zealousideal_Mix_629", "id": "h9c8a2v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p5yp4d", "stickied": false, "body": "You forgot one step \n\n-government gives money to their friends, whatever is left goes to themselves.", "is_submitter": false, "distinguished": null, "created_utc": 1629236994.0, "parent_id": "t1_h9c71zq", "replies": [{"author": "jenbanim", "id": "h9c8d1o", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Do you have any reason to expect that this would be the outcome based on past examples of carbon pricing?", "is_submitter": true, "distinguished": null, "created_utc": 1629237031.0, "parent_id": "t1_h9c8a2v", "replies": [{"author": "Zealousideal_Mix_629", "id": "h9c8hv1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p5yp4d", "stickied": false, "body": "Based on how most government projects go.", "is_submitter": false, "distinguished": null, "created_utc": 1629237092.0, "parent_id": "t1_h9c8d1o", "replies": []}]}]}]}]}]}]}, {"author": "metalhev", "id": "h9f33wh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "ITT: why people who defend even more taxes shouldn't be considered people", "is_submitter": false, "distinguished": null, "created_utc": 1629300607.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "jenbanim", "id": "h9gg4tl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "💰🤏😎 Don't mind me, I'm just the big nasty gubbermint taking your money\n\nYOU'LL NEVER CATCH ME 🏃", "is_submitter": true, "distinguished": null, "created_utc": 1629322514.0, "parent_id": "t1_h9f33wh", "replies": [{"author": "metalhev", "id": "h9gk14u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Little need to catch, you tend to bunch together, so it's easier to set off a nuke.", "is_submitter": false, "distinguished": null, "created_utc": 1629324318.0, "parent_id": "t1_h9gg4tl", "replies": [{"author": "jenbanim", "id": "h9gkuv1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Hmm, what groups of people are gonna get the nuke? Just curious", "is_submitter": true, "distinguished": null, "created_utc": 1629324704.0, "parent_id": "t1_h9gk14u", "replies": [{"author": "metalhev", "id": "h9gm9b8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "All the ones that believe there should be a state. Maybe we can set a big gathering, a debate between the current leftist sock-puppet and the right-wing sock puppet, get a lot of people, then reintegrate them into the soil.  \nOr maybe just put a FREE SHIT HERE arrow sign and a deep hole, would work just as well based on how dumb statists are.", "is_submitter": false, "distinguished": null, "created_utc": 1629325352.0, "parent_id": "t1_h9gkuv1", "replies": [{"author": "jenbanim", "id": "h9go93j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "I think there should be a state. Do you want to kill me?", "is_submitter": true, "distinguished": null, "created_utc": 1629326272.0, "parent_id": "t1_h9gm9b8", "replies": [{"author": "metalhev", "id": "h9goini", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Of course not. It's just self-defense.", "is_submitter": false, "distinguished": null, "created_utc": 1629326393.0, "parent_id": "t1_h9go93j", "replies": []}]}]}]}]}]}]}, {"author": "Cheomesh", "id": "h9f9n5g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p5yp4d", "stickied": false, "body": "Remove all subsidies first, and see where the chips fall.", "is_submitter": false, "distinguished": null, "created_utc": 1629303528.0, "parent_id": "t3_p5yp4d", "replies": []}, {"author": "skeebidybop", "id": "h9i8qgc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "hello techmod, fancy seeing you here 🧐", "is_submitter": false, "distinguished": null, "created_utc": 1629357513.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "jenbanim", "id": "h9l6ayt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "How are so many DT regs showing up here? I thought it was basically random\n\nMaybe we just comment so much it was inevitable lol", "is_submitter": true, "distinguished": null, "created_utc": 1629410688.0, "parent_id": "t1_h9i8qgc", "replies": []}]}, {"author": "p00bix", "id": "h9ibsz5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "lmao of course this is the first thing you post here", "is_submitter": false, "distinguished": null, "created_utc": 1629360134.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "jenbanim", "id": "h9l65xk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Gotta shillpill the unwashed masses\n\nYou're welcome for my service 😏", "is_submitter": true, "distinguished": null, "created_utc": 1629410628.0, "parent_id": "t1_h9ibsz5", "replies": []}]}, {"author": "A7omicDog", "id": "h9crakh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "You didn’t mention Carbon Tax being a back door for Socialist anti-Capitalism.", "is_submitter": false, "distinguished": null, "created_utc": 1629246259.0, "parent_id": "t3_p5yp4d", "replies": []}, {"author": "MisanthropicScott", "id": "h99gacq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p5yp4d", "stickied": false, "body": "Yup. I've been a supporter of a carbon tax for a couple of decades or more. I prefer a tax to cap and trade.\n\nSince a cap hands out licenses to pollute by X amount and people will always cheat and industries will be exempt, the cap is really a minimum, not a maximum.\n\nI think a simple tax at the well head or point of entry would be more effective.\n\nBut, I'll take any price on carbon over no price on carbon.", "is_submitter": false, "distinguished": null, "created_utc": 1629184554.0, "parent_id": "t3_p5yp4d", "replies": []}, {"author": "FormerBandmate", "id": "h99h7k6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "p5yp4d", "stickied": false, "body": "Yo. Guess they were getting tons of NL people, or maybe it was my NC meme modship that got it", "is_submitter": false, "distinguished": null, "created_utc": 1629185287.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "jenbanim", "id": "h99hc8i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "I think I actually got this by posting in /r/UnexpectedMulaney of all places lol\n\nI got the message right after making a comment there", "is_submitter": true, "distinguished": null, "created_utc": 1629185391.0, "parent_id": "t1_h99h7k6", "replies": []}]}, {"author": "FnchWzrd314", "id": "h9a3hya", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "p5yp4d", "stickied": false, "body": "I'm not really qualifies to talk about this, but the biggest problem when pushing legislation like this through is that it directly harms the people who pass it most of the time.\n\nThe people in power always have, and most likely always will, be from the upper class, and they will always pass the law that supports them and their companies the best.\n\nAt least here in Aus, coal mining is *huge* like, wealthiest people in Australia are all coal tycoons huge. So any legislation that harms the coal industry is going to face massive push back from the wealthiest people in the country, and from inside the government too. \n\nHumanity is fucked man.", "is_submitter": false, "distinguished": null, "created_utc": 1629202076.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "jenbanim", "id": "h9csy6a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "This is an achievable goal! [Australia actually has had some carbon pricing legislation passed](https://en.wikipedia.org/wiki/Carbon_pricing_in_Australia) but it seems to have been ineffective due to the prices being too low and too many industries being exempt\n\nWe're headed for disaster sure, but we can't afford to give up!", "is_submitter": true, "distinguished": null, "created_utc": 1629247120.0, "parent_id": "t1_h9a3hya", "replies": [{"author": "R5Cats", "id": "h9gaqtc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p5yp4d", "stickied": false, "body": "Canada's Federal Liberals forced Carbon Tax down everyone's throats. It has decreased nothing, and made us all poorer.  \n\nCoal mines in the Maritimes? THEY got blanket exemptions! Why? To \"remain internationally competitive\". See how it works? (It doesn't: it's a money-grab and has nothing to do with the environment)", "is_submitter": false, "distinguished": null, "created_utc": 1629320032.0, "parent_id": "t1_h9csy6a", "replies": [{"author": "jenbanim", "id": "h9gghav", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": ">Canada's Federal Liberals forced Carbon Tax down everyone's throats.\n\nFuck that's so hot. Can't wait to ram even more taxes down throats\n\n>Coal mines in the Maritimes? THEY got blanket exemptions!\n\nWell that's just stupid and breaking the entire purpose of the carbon tax. But a bad implementation isn't the same thing as a flawed policy", "is_submitter": true, "distinguished": null, "created_utc": 1629322675.0, "parent_id": "t1_h9gaqtc", "replies": []}]}]}]}, {"author": "Stand_kicker", "id": "h9cuqc4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "p5yp4d", "stickied": false, "body": "I don't have to support anything. \n\nBut carbon tax is decent idea.\n\nPersonally I support the idea of accelerating this downward spiral and the end of humanity if it means I can live a more hedonistic life.", "is_submitter": false, "distinguished": null, "created_utc": 1629248031.0, "parent_id": "t3_p5yp4d", "replies": []}, {"author": "R5Cats", "id": "h9g9ww2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p5yp4d", "stickied": false, "body": "What an utter load of shit.  \n\nYour \"myths\" are ass-backwards, for example.  \nWhen the price of things like food, transportation (including busses) and shelter ALL increase by 20% due entirely to Carbon Taxes? Who can absorb that sort of increase? The rich. Who cannot? The poorest of the poor. It's a straight-up fact.\n\n\"The rich\" do not \"create more pollution\" because there's hardly any of them! 50% of the population outweighs 5% ok? The top 5% can cut here and there without feeling it. 1 less jet vacation trip a year saves a lot! Where do the poor cut? From lowering their thermostat *another 3 degrees*? Cold kills more people than heat, look it up. \n\n97% of all scientists? What a fat fucking joke.", "is_submitter": false, "distinguished": null, "created_utc": 1629319662.0, "parent_id": "t3_p5yp4d", "replies": [{"author": "jenbanim", "id": "h9ggam8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "With a tax-and-dividend, poor people will be better off than they would prior to the carbon tax. They will pay more for stuff like transportation, but that will be more than offset by getting a check in the mail", "is_submitter": true, "distinguished": null, "created_utc": 1629322589.0, "parent_id": "t1_h9g9ww2", "replies": [{"author": "R5Cats", "id": "h9ghc6e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p5yp4d", "stickied": false, "body": "This is the exact same lie that was told when the GST came out: poor people would \"have more money\" through rebates... it was fiction then and so is the Carbon Tax Rebate Bonanza fictional too.\n\nEvery single item! That's what goes up in price! Anything manufactured, moved or stored will cost more. How can a \"refund\" with 10% off the top (that they admit to) and thousands of select \"exemptions\" possibly outweigh that?\n\nIt is not merely \"bad implementation\" it is an impossibility.   \nWith GST added on no less!!", "is_submitter": false, "distinguished": null, "created_utc": 1629323076.0, "parent_id": "t1_h9ggam8", "replies": [{"author": "jenbanim", "id": "h9giyxb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "Got any evidence to back this up?", "is_submitter": true, "distinguished": null, "created_utc": 1629323828.0, "parent_id": "t1_h9ghc6e", "replies": [{"author": "R5Cats", "id": "h9gjz9w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p5yp4d", "stickied": false, "body": "That the price of every item goes up? You said it yourself: they raise the prices to cover the taxes.  \nOr they go out of business. It's into-economics.\n\nCarbon tax on fuel (movement) and heating (storage) and other things too makes everything more expensive. How could it not?", "is_submitter": false, "distinguished": null, "created_utc": 1629324296.0, "parent_id": "t1_h9giyxb", "replies": [{"author": "jenbanim", "id": "h9gl5tf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p5yp4d", "stickied": false, "body": "I was specifically thinking about the dividend not offsetting the additional cost of the taxes\n\nAlso businesses going broke because their model relies on killing the planet is a good thing actually. We're going to have to make some painful adjustments to how we live. Either we rip the band-aid off now, or we're going to all suffer a much worse fate from climate change", "is_submitter": true, "distinguished": null, "created_utc": 1629324845.0, "parent_id": "t1_h9gjz9w", "replies": [{"author": "R5Cats", "id": "h9h52t4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p5yp4d", "stickied": false, "body": "If the dividends do not cover the increased costs, then the poor bite the bullet, yes? \n\nYou imagine those goods will not be built elsewhere once a Canadian manufacturer shutters its doors? They will, transported (by fossil fuels) across oceans after being built in nations with TERRIBLE environmental and safety laws. How is that better? The same people will make even more money and thousands of Canadians will be out of work. Great plan!\n\n+1.5C is not going to kill anyone. It's a big fat lie. CO2 is not pollution, it is essential for all life on Earth. We're seeing mountains of benefits and NO negative issues with increased CO2, and that won't change until it passes 5000ppm.   \nAnyhow, if the Grand Solar Minimum pans out? Global temperatures will drop and we may have another 'Little Ice Age' which will kill many millions of people.", "is_submitter": false, "distinguished": null, "created_utc": 1629334194.0, "parent_id": "t1_h9gl5tf", "replies": []}]}]}]}]}]}]}, {"author": "R5Cats", "id": "h9vbr2s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "p5yp4d", "stickied": false, "body": "[Sorry Charlie, Carbon Tax **Cannot Possibly Be** \"Revenue Neutral\"](https://climaterealism.com/2021/08/sorry-deseret-news-carbon-taxes-will-harm-people-because-they-cant-be-revenue-neutral/) It's just a big, fat lie. Pulling the wool over the eyes of the sheep.\n\n\"I'm from the government! This tax will make you rich! More taxes will increase prosperity and lower prices!\" (In a pig's eye!) Do you see how idiotic that sounds now?", "is_submitter": false, "distinguished": null, "created_utc": 1629603843.0, "parent_id": "t3_p5yp4d", "replies": []}]}