{"title": "I know we're all redditors here but where are you with video games?", "name": "t3_pgl3an", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pgl3an/i_know_were_all_redditors_here_but_where_are_you/", "selftext": "These used to be a big part of my life, and I guess they're still fine but I've got enough going for myself now that's sufficiently satisfactory that I'm not really looking for large gaming experiences to fill my schedule.\n\n\nI've drifted to where I mainly play arcade games, even.  My brother has kept in the loop with a bunch of indie games that are quick and easy to pick up, and I'm glad for that - but it's more rewarding to actually do something with the same amount of time.\n\n\nMaybe I'm just too old now, I feel like I've lived the whole spectrum of possible attitudes on video games. For society as a whole, I feel like they exploit psychological mechanisms to thwart people's ambition into consumption instead of proper creativity and responsibility. This is something sad to say, about a cultural artifact that has meant so much to me.", "score": 1, "upvote_ratio": 0.55, "permalink": "/r/TheFlyingTree/comments/pgl3an/i_know_were_all_redditors_here_but_where_are_you/", "id": "pgl3an", "author": "JivePrintingDotCom", "link_flair_text": "Discussion", "num_comments": 27, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630599408.0, "comments": [{"author": "BuccaneerRex", "id": "hbchv99", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pgl3an", "stickied": false, "body": "I am a gamer, and have been since Zork on PC and the Atari 2600.\n\nI don't do multiplayer anymore, because it's full of people. \n\n>For society as a whole, I feel like they exploit psychological mechanisms to thwart people's ambition into consumption instead of proper creativity and responsibility.\n\nSo watch TV instead? It's an entertainment form, same as any other. Why is someone who prefers to spend their time on video games less responsible than a person who watches sports or sitcoms or Marvel movies?\n\nI'm glad you've found other hobbies neighbor, but perhaps you should stop passing judgment on others for the ways they choose to spend their time.", "is_submitter": false, "distinguished": null, "created_utc": 1630607030.0, "parent_id": "t3_pgl3an", "replies": [{"author": "JivePrintingDotCom", "id": "hbcjc12", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgl3an", "stickied": false, "body": "Not a bad argument. I definitely think video games are a healthier hobby than TV, although manga is really my jam these days.\n\n\nLeisure is exactly that, and I don't claim people should make any different choices in it then they want to necessarily.  I do suspect that video games have expanded the scope of leisure considerably.\n\n\nProps on your background by the way. My dad got out his old Sega Genesis when the pandemic started, and I bought a copy of Columns for him on eBay.  It was like yeah, my mom says it's the most he's played video games since Pac-Man.", "is_submitter": true, "distinguished": null, "created_utc": 1630607611.0, "parent_id": "t1_hbchv99", "replies": []}]}, {"author": "Transparency2Thee", "id": "hbcjp8v", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #32", "submission": "pgl3an", "stickied": false, "body": "Yeah, it is sad. Sad to see profit leverage enjoyment against the user. Entertainment has that problem in general. We’re a fish in a bucket with 100 fishing lines floating at the top. It really jades you to enjoyment of any kind and makes you weigh any potential meal against the hook within. \n\nUnfortunately, the legacy of success seems to be greed and it’s balancing act of maximizing net gains. Every good media type and genre becomes chock-full of wash-ups and wannabes until interest is exhausted and a new pond can be found, drained and dried up.", "is_submitter": false, "distinguished": null, "created_utc": 1630607756.0, "parent_id": "t3_pgl3an", "replies": []}, {"author": "baalroo", "id": "hbd1ml6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #120 | Legio Virtus", "submission": "pgl3an", "stickied": false, "body": "I started gaming on atari and feel like, for the most part, gaming as a whole got better and better up through the SNES and then started to make a downward turn. Or, at least, the things about gaming that I loved had done so. I really checked out during the PS1 and PS2 era, almost all of those games felt clunky and looked terrible.\n\nI still play some small games, mostly roguelikes and similar from time to time (maybe an hour or two a week), and I play dumb mobile games on my phone when I'm winding down for the night in bed, but that's about it.\n\nI don't think I've had a \"AAA\" title keep my interest for more than an hour or two for decades. I feel like you can usually get everything you're going to get out of a AAA title in about 2 hours. After that it's just gonna be more of the same for the next 15-80 hours tacked onto poorly written shlock 99% of the time.", "is_submitter": false, "distinguished": null, "created_utc": 1630614846.0, "parent_id": "t3_pgl3an", "replies": []}, {"author": "HumanoidDespair", "id": "hbguzhd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #565", "submission": "pgl3an", "stickied": false, "body": "I’m a hardcore gamer. I’ve been one since the first time I met a computer at age 6. I play on PC and PS4, love strategy, horror, dating sim, indie, and basically anything with a good story. I’ve put many thousands of hours into the Sims series. My current obsessions are Don’t Starve Together (I played 500+ hours and still suck at it) and Vincent: The Secret of Myers (Makes me think and keeps me entertained like nothing else).\n\nYou do sound too old with that “exploiting psychological mechanisms...” thing. I think it’s real life education and workplaces that don’t put enough effort into motivating people, and could learn a lot from video games. And doing something purely for enjoyment is certainly not wasted time. Whether it’s books, music, video games, or something different, hobbies only make life better.", "is_submitter": false, "distinguished": null, "created_utc": 1630688715.0, "parent_id": "t3_pgl3an", "replies": []}, {"author": "amymonae", "id": "hbnz2nx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #325", "submission": "pgl3an", "stickied": false, "body": "I suck at playstation/xbox games. I like computer games from time to time, but since time is worth more than money when you get older, the time spent with gaming shrinks proportionally..", "is_submitter": false, "distinguished": null, "created_utc": 1630829668.0, "parent_id": "t3_pgl3an", "replies": []}, {"author": "NotablyNugatory", "id": "hbc13qx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #523", "submission": "pgl3an", "stickied": false, "body": "I can agree with a lot of this. However, the good games still nurture creativity, imo. I’ve been playing a good amount of games with my nephews these past few years, and honestly some of the Mario games and other titles for kids really end up teaching some good logic foundation skills. Things like learning several mechanics before adding them together to get to a spot where you learn even another thing, and then having all of those start to be more prevalent on top of the base game... There’s still some good ones out there. \n\nI’m a video game junky though, so I also get where you’re coming from on the consumption side of things. World of Warcraft isn’t exactly pushing me to my limits, but I enjoy playing it with friends all the same. Sometimes the challenge is less the actual game and more the planning to complete it. \n\nBeen playing games since my memory can even pick up, and I’ll probably play them until my brain turns to smooth soup.", "is_submitter": false, "distinguished": null, "created_utc": 1630600356.0, "parent_id": "t3_pgl3an", "replies": [{"author": "JivePrintingDotCom", "id": "hbc8idd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgl3an", "stickied": false, "body": "It's that instinct toward challenge and creativity that, if not for video games or comparable leisure, would have beforetimes been spent learning a trade or homesteading.\n\n\nA couple years ago I went to a national conference of accounting educators, and the keynote address subject was how video games became the defining influence of our generation.  They throw a lot of data at young minds and give them the tools to realize an outcome. It's not all bad, probably it's just the next social incarnation of sports, I just think we should recognize what's happening.", "is_submitter": true, "distinguished": null, "created_utc": 1630603277.0, "parent_id": "t1_hbc13qx", "replies": [{"author": "NotablyNugatory", "id": "hbcbpry", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #523", "submission": "pgl3an", "stickied": false, "body": "My last philosophy class in university was Philo if STS (science technology and society and how they’re all related). The professor was tenured. He said he was upset that the school wouldn’t let him teach a Philosophy of Drugs class where the basic idea of “what is a drug” is questioned. He then asked people to raise their hands at different various video game, food, tv, and other not-traditionally-called-drugs subjects. \n\nWas kinda sad that he never got that class. I’d have loved to sit in on it. He was a great teacher. Sorry to ramble a bit like that, I just feel it was kind of relevant to the conversation. Games can definitely have an agenda. Are they money makers, educational, competitive, simulation, etc? Games designed to keep people addicted by reward systems proven to mess with dopamine rewards in the brain bring out some interesting conversation for sure. \n\nI actually pride myself on gaming, but not being a micro transaction whale. Closest thing to mtx I do is Pokémon cards, but I mainly buy those for my nephews.", "is_submitter": false, "distinguished": null, "created_utc": 1630604545.0, "parent_id": "t1_hbc8idd", "replies": []}]}]}, {"author": "mellowsout", "id": "hbc2gud", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #205", "submission": "pgl3an", "stickied": false, "body": "I'm currently more active in gaming. When I try out different kinds of games, I often like to see what the maker has done with his blank sheet of paper. What kind of world did he make, the lore, mechanics, design, music, ... Not even to complete the game.\n\nMy creative activities are also mainly there to entertain myself, although the payoff is higher when you made something out of nothing, something that wasn't there before. Gaming is different in that. But if you are having fun, it's not time wasted.", "is_submitter": false, "distinguished": null, "created_utc": 1630600885.0, "parent_id": "t3_pgl3an", "replies": []}, {"author": "areyouseriousdotard", "id": "hbc4wko", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "pgl3an", "stickied": false, "body": "I play Attila Total War and not much else and not all the time.  But, I'm 41 w kids.  I'm lucky to get to play at all...", "is_submitter": false, "distinguished": null, "created_utc": 1630601838.0, "parent_id": "t3_pgl3an", "replies": []}, {"author": "HomeworkGlad", "id": "hbc7z9a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #342", "submission": "pgl3an", "stickied": false, "body": "Alice Madness Returns is guaranteed to kick your ass", "is_submitter": false, "distinguished": null, "created_utc": 1630603065.0, "parent_id": "t3_pgl3an", "replies": [{"author": "JivePrintingDotCom", "id": "hbc8de5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgl3an", "stickied": false, "body": "Interesting, how so?", "is_submitter": true, "distinguished": null, "created_utc": 1630603223.0, "parent_id": "t1_hbc7z9a", "replies": [{"author": "HomeworkGlad", "id": "hbcmz86", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #342", "submission": "pgl3an", "stickied": false, "body": "It’s a 2011 video game. Go get it and play it", "is_submitter": false, "distinguished": null, "created_utc": 1630609051.0, "parent_id": "t1_hbc8de5", "replies": [{"author": "JivePrintingDotCom", "id": "hbcnves", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgl3an", "stickied": false, "body": "What is specifically so compelling here? I loved borderlands and stalker, lot of other games, why do you recommend that one specifically instead of the million other games around?", "is_submitter": true, "distinguished": null, "created_utc": 1630609406.0, "parent_id": "t1_hbcmz86", "replies": [{"author": "HomeworkGlad", "id": "hbco24m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #342", "submission": "pgl3an", "stickied": false, "body": "Quit kvetching and procrastinating. Go get it and play it through. It’s still on torrents. You wanted an answer. I gave you an answer.", "is_submitter": false, "distinguished": null, "created_utc": 1630609482.0, "parent_id": "t1_hbcnves", "replies": [{"author": "JivePrintingDotCom", "id": "hbcugkw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgl3an", "stickied": false, "body": "Not quite that simple, besides being on Linux I have a lot of things to do with my life. I'm willing to hear you on why this particular game should be a strong choice.", "is_submitter": true, "distinguished": null, "created_utc": 1630612033.0, "parent_id": "t1_hbco24m", "replies": [{"author": "HomeworkGlad", "id": "hbdqhzs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #342", "submission": "pgl3an", "stickied": false, "body": "Put your windows rig in Virtual Box. Trust me big guy. This game is worth a new laptop", "is_submitter": false, "distinguished": null, "created_utc": 1630626170.0, "parent_id": "t1_hbcugkw", "replies": [{"author": "JivePrintingDotCom", "id": "hbdrc70", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgl3an", "stickied": false, "body": "Alright man cool thanks.  Dual-booting isn't that big a deal with 7 at least", "is_submitter": true, "distinguished": null, "created_utc": 1630626575.0, "parent_id": "t1_hbdqhzs", "replies": []}]}]}]}]}]}]}]}, {"author": "Cognizant_Psyche", "id": "hbc8sbe", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pgl3an", "stickied": false, "body": "Im kind of in the same boat.  Video Games were my life for a while, they inspired creativity and I loved to just spend hours on end immersed in the story and gameplay (Vanilla Wow for life!...or is it classic now?).  Then I started to get older, I got married, had kids, a home, side business, and my priorities shifted.  Even when I get time where I could play I find that there are other things I would rather do.  I like the idea of it, I still maintain my Steam Library, and maybe once my kids get older Ill revisit it as a past-time.  Occasionally I would play a mobile game like Arknights or Genshin Impact, but the daily grind (and gatcha) got to be too much of a chore and it became a side job/obligation rather than enjoyment (like WoW), so I really haven't invested much time in them.  Now I'll spend a lot of my free time reading - I can put it down to deal with a toddler meltdown then pick it up right away without having to shift environments.  Sometimes at night Ill revisit some classics on an emulator or the google play version for old JRPG titles (I have the original copies paid for, sometimes on multiple formats so I dont feel bad) on my tablet, but that is the extent of my Video Gaming.  Im currently in the middle of Final Fantasy VI (III) and Star Ocean: The Second Story.", "is_submitter": false, "distinguished": null, "created_utc": 1630603385.0, "parent_id": "t3_pgl3an", "replies": [{"author": "JivePrintingDotCom", "id": "hbc94cd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgl3an", "stickied": false, "body": "Based.\n\n\nI find YouTube longplays are an excellent compromise, delivering much of the experience and enjoyment without any effort - just the time.  Especially good for the 16-bit era, and DOS games.", "is_submitter": true, "distinguished": null, "created_utc": 1630603514.0, "parent_id": "t1_hbc8sbe", "replies": [{"author": "Cognizant_Psyche", "id": "hbcd9st", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pgl3an", "stickied": false, "body": "Ill do the same for titles I want the story for but lack the time.  I enjoyed Last of Us, God of War (Recent one) and many other titles that way.  The only ones I cant do that for are games with choices that affect the story or with multiple outcomes and/or open world, I still prefer to save the title for a later date, i.e. any upcoming offline Fallout/Elder Scrolls games.", "is_submitter": false, "distinguished": null, "created_utc": 1630605161.0, "parent_id": "t1_hbc94cd", "replies": []}]}]}, {"author": "WikiContributor83", "id": "hbcbvsy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #120", "submission": "pgl3an", "stickied": false, "body": "I still play video games often, perhaps more than I really should now. I keep going in between playing fast paced shooters with twitch reflexes (I await the day Titanfall 2 is delivered from the DDOS) to slow 4X games like Civ or games by Paradox.\n\nI’d say TTRPGs are what I’d rather be distracted by now in my adult years. You can do whatever you want as determined by the rules, you can truly play your character and not some stiff Canadian model who ends his sentences with “I should go” (unless that is your character), and it pretty much forces you to find people to play with.", "is_submitter": false, "distinguished": null, "created_utc": 1630604613.0, "parent_id": "t3_pgl3an", "replies": []}, {"author": "freddyPowell", "id": "hbceovt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #52", "submission": "pgl3an", "stickied": false, "body": "I've never really been able to get into them. I'm terribly malcoordinated and find it hard to focus on one thing for extended periods of time. The result is that I find it hard to play even in the earliest stages, it rarely gets easier unless I practice the muscle memory specific to that level, and I generally lose interest before I make much progress. That, combined with a general lack of tech savvy due the the way I have been raised means that I rarely seek out, play, or persist with any games. That said, I did complete kingdom rush, which was fun.", "is_submitter": false, "distinguished": null, "created_utc": 1630605751.0, "parent_id": "t3_pgl3an", "replies": []}, {"author": "gemini_pain", "id": "hbcyha7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #43", "submission": "pgl3an", "stickied": false, "body": "Similar boat. I was huge into video games back in the day. \n\nStarted on Super Nintendo, skipped a generation, picked it back up at the PlayStation 2 and stuck with gaming all the way to the Xbox 360. Then…jobs, life, and the pursuit of money cause my parents wouldn’t buy me games anymore happened. Suddenly I saw how much multiple games cost and I realized there were more important things my money should go to. \n\nI’ve since taken up the mantle of “casual gamer” and I’ll only get one or two games a year, the occasional Pokemon game, and maybe a personal game like Back4Blood (can’t wait!!!), Kingdom Hearts, or a hentai sim on Steam; I was never a PC game person so there’s a whole debauched world I’ve been missing out on! (Looking at you Nekopara 18+ and Hunnie Pop!😘)", "is_submitter": false, "distinguished": null, "created_utc": 1630613612.0, "parent_id": "t3_pgl3an", "replies": [{"author": "JivePrintingDotCom", "id": "hbd00jw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pgl3an", "stickied": false, "body": "make it Fruit of Grisaia", "is_submitter": true, "distinguished": null, "created_utc": 1630614212.0, "parent_id": "t1_hbcyha7", "replies": []}]}, {"author": "CielTheEarl", "id": "hbes3fc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #172 | Consortii Concordus", "submission": "pgl3an", "stickied": false, "body": "Not a hardcore player, I only used to play the PS2, but that was a long time ago. I only play anything available on mobile since I don't have any other gaming consoles/platforms like gaming PCs and any other gaming consoles.", "is_submitter": false, "distinguished": null, "created_utc": 1630644852.0, "parent_id": "t3_pgl3an", "replies": []}]}