{"title": "Afghanistan: What should the world do?", "name": "t3_pc60fr", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pc60fr/afghanistan_what_should_the_world_do/", "selftext": "I hate starting a politics discussion; the very nature of online politics dialogue is cancerous. But this is one topic that I just need to know more about, because people's lives are on the line. Just a little while ago even, [Kabul airport bombs](https://www.wsj.com/articles/afghanistan-kabul-airport-explosion-11629976397) killed four United States marines and 60 Afghans.\n\nI used to be a hard noninterventionist and pacifist. But after studying America's foreign policy failures (such as with the Rwandan genocide), watching Myanmar get taken over by their own military, and reading Hitchens, I don't know anymore. I lean further from my old ideas by the day.\n\nRegardless of my thoughts, however, I feel as if I am not even qualified to hold an opinion on the Afghanistan conflict. The situation feels too convoluted for anyone to possess the one right answer (if a right answer even exists in the first place, which very well might not be the case).\n\nWhat are your thoughts on Afghanistan, whether the United States should stay, what the United States should've done differently, and what the world should do moving forward?", "score": 8, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/pc60fr/afghanistan_what_should_the_world_do/", "id": "pc60fr", "author": "jmcsquared", "link_flair_text": "Discussion", "num_comments": 37, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630004257.0, "comments": [{"author": "Alatain", "id": "hagsre7", "score": 17, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pc60fr", "stickied": false, "body": "I served there several years ago, and my opinion is that the culture of the people does not line up with what we were trying to do. We wanted to give them the training and tools necessary to create a democratic state, but the culture that is in place is inherently based on different values. The government that we were trying to help get formed was never going to outlast US and NATO forces propping it up. \n\nThe regional/tribal nature of the leadership in the country was always going to make it so that the equipment and training that we provided would be used to perpetuate the previous power structure, not build a new one.", "is_submitter": false, "distinguished": null, "created_utc": 1630007875.0, "parent_id": "t3_pc60fr", "replies": [{"author": "usernames_suck_ok", "id": "hahge9o", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "pc60fr", "stickied": false, "body": "Great answer. I think one of the reasons why I am at a loss for an articulate plan or approach to Afghanistan is because I feel like most of us are too much on the outside to know/comprehend information like this and then some, though it was never hard to imagine that what we want to do just does not fit with their culture...but there is so much other info that we just don't know, and it's kind of silly to sit and say \"x, y and z should be done\" with so many unknowns. Outsiders always want to do this with complex problems, especially when it comes to different kinds of people. \n\nWe're not in a vacuum, though. Just because Afghanistan is not our country doesn't mean what happens there will not impact us, and that's just my response to the idea a lot of people have that it's just their problem/we should have nothing to do with it. I think it's quite foreseeable that another \"9-11\" happens without trying to do ***something***.", "is_submitter": false, "distinguished": null, "created_utc": 1630017824.0, "parent_id": "t1_hagsre7", "replies": [{"author": "Alatain", "id": "hahk9ll", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pc60fr", "stickied": false, "body": "Definitely. The idea that we should do nothing is the wrong way to move policy. But without being willing to actually take over the country, it is difficult to give a better way forward at the moment other than withdrawing and beginning to set up a diplomatic solution. Sadly, my guess is that Afghanistan will see a civil war before a unified government can be set up, and I am really not sure what that might look like. \n\nIf you want an idea of what the military there looked like when I left, this is a [pretty good example.](https://youtu.be/Ja5Q75hf6QI)", "is_submitter": false, "distinguished": null, "created_utc": 1630019588.0, "parent_id": "t1_hahge9o", "replies": []}]}, {"author": "ItsJustAnAdFor", "id": "hak6h6j", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #73", "submission": "pc60fr", "stickied": false, "body": "I’ll have to research more about the government we were trying to help get formed. It would seem, if they’re more tribal, a decentralized federal government with more power given to state and local governments (much like early USA) would seem to be the obvious way to structure the institutions. Was that not how it was done?", "is_submitter": false, "distinguished": null, "created_utc": 1630074432.0, "parent_id": "t1_hagsre7", "replies": [{"author": "Alatain", "id": "hakkahb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pc60fr", "stickied": false, "body": "So, I cannot speak on the political side of things as that was not my role while I was there. What I can say is that I am not sure that a good national identity has really formed around the idea of Afghanistan as a sovereign nation. That issue makes it really hard to form a national military force as any individual soldier is more likely to be loyal to their kin and elders than to their leaders in the military. \n\nThat resulted in military units being misused by local politicians and elders like [in this documentary](https://youtu.be/Ja5Q75hf6QI?t=286), for instance.", "is_submitter": false, "distinguished": null, "created_utc": 1630079990.0, "parent_id": "t1_hak6h6j", "replies": [{"author": "ItsJustAnAdFor", "id": "haldydr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #73", "submission": "pc60fr", "stickied": false, "body": "That is a captivating story - I’ll be watching in its entirety this weekend!", "is_submitter": false, "distinguished": null, "created_utc": 1630091975.0, "parent_id": "t1_hakkahb", "replies": []}]}]}, {"author": "amitym", "id": "hahwrtt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pc60fr", "stickied": false, "body": "Not to disagree with anything you say, I just need to point out:  that is why they call it a \"power structure.\"  It's durable and self-perpetuating.", "is_submitter": false, "distinguished": null, "created_utc": 1630025458.0, "parent_id": "t1_hagsre7", "replies": []}]}, {"author": "Cognizant_Psyche", "id": "hagntw9", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pc60fr", "stickied": false, "body": "Man... I would love to hear Hitchens' perspective and opinion on the current situation of... well hell all of everything right now.\n\nThere is no right answer for Afghanistan IMO.  No one has been able to \"fix\" or control that region in the history of... ever.  To think that we could do any different was stupid and highly egotistical.  \n\nWe aren't *Team America: World Police* and that wasn't *Derka Derkastan.*", "is_submitter": false, "distinguished": null, "created_utc": 1630005898.0, "parent_id": "t3_pc60fr", "replies": [{"author": "jmcsquared", "id": "hagoztk", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "pc60fr", "stickied": false, "body": ">No one has been able to \"fix\" or control that region in the history of... ever.\n\nThis is one of the biggest points I've had to contend with. The region is practically unconquerable due to being landlocked, very rough geography thanks to the Hindu Kush mountain range, and lack of national identity. Russia found out the hard way, so did we.\n\nBut I'm also wondering if nations have simply approached the problem incorrectly. Hitchens said that we lacked the imagination to view this project as one of social transformation and liberation from tyranny, rather than as a colonial conquering project.\n\nI also wish Hitch was still around, for many reasons.", "is_submitter": true, "distinguished": null, "created_utc": 1630006365.0, "parent_id": "t1_hagntw9", "replies": [{"author": "Cognizant_Psyche", "id": "hagry1r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pc60fr", "stickied": false, "body": "I would say rather than the lack of imagination, more so the lack of drive and willingness to do so. On the surface (if we listen to the media and PR) that was what we were trying to do: liberate them from Taliban (theocratic) tyranny and reform their oppressive religiously infused culture into one more progressed socially (women's rights and such)... then, as always, greedy and opportunistic human leaders got in the way and found a way to make money and exhort power under the perfect PR camouflage of doing \"good\".  That means the money gets sent to and by the wrong people who have no desire of improving anything, as famously said and paraphrased: \"Beware the Military-Industrial Complex.\"  Colonial Conquering is what we do best and offers the quickest gains and short term rewards.  So it just replaces one corruption with another, which only fuels the fanatically religious to become even more fervent with the boost of being rooted to the cultural norm since they share the same societal/cultural identity and foundations (theocratically) on home turf.  So as soon as the strong arming ends, even a little, it is repelled and returns to \"normal,\" as we are seeing now.\n\nIt was doomed before it even began the moment profit and power could be had by those who exist and work within a system rigged to enable them to do so unseen.  I'm not even saying this in a conspiracy kind of way, just observing rich powerful assholes who are career manipulators (politicians) doing what they do to get even more powerful and rich.  Power corrupts and absolute power corrupts absolutely. \n\nThis is why I dont think there will ever be a \"fix\" or \"correct\" way to go about these types of situations... humans are just too greedy and self-serving for any other outcome to be had.  At least at this point in time.", "is_submitter": false, "distinguished": null, "created_utc": 1630007545.0, "parent_id": "t1_hagoztk", "replies": [{"author": "jmcsquared", "id": "hagw60k", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "pc60fr", "stickied": false, "body": ">humans are just too greedy and self-serving for any other outcome to be had.\n\nThe United States' current leadership is certainly too greedy and self-serving, not too mention incompetent. With our current leaders, I have no confidence that they will do anything that roughly approximates the \"right\" thing.", "is_submitter": true, "distinguished": null, "created_utc": 1630009254.0, "parent_id": "t1_hagry1r", "replies": []}]}, {"author": "baalroo", "id": "hagvbwe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #120 | Legio Virtus", "submission": "pc60fr", "stickied": false, "body": "It's a logistics problem really (IMO).  There are too many violent warlords and tribalism there to simply hand out money and expect it to help the regular people, and there isn't the will from the rest of the world to invest enough military presence into the region for long enough to force change upon them.\n\nInstead we have to rely on capitalistic systems of funnelling massive amounts of money to \"contractors\" who are expected to make a profit on a program that inherently should *cost* money rather than *make* money. And expecting the contractors to not EXTRACT value from the region is beyond naive.", "is_submitter": false, "distinguished": null, "created_utc": 1630008917.0, "parent_id": "t1_hagoztk", "replies": []}]}, {"author": "someguyfromtheuk", "id": "haheuee", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #63", "submission": "pc60fr", "stickied": false, "body": "The region has only a few more decades before it becomes uninhabitable due to climate change anyway, so there was nothing anyone was ever going to do with it.\n\n100 years from now the region will be at peace because there won't be anyone there to fight about it.", "is_submitter": false, "distinguished": null, "created_utc": 1630017118.0, "parent_id": "t1_hagntw9", "replies": []}]}, {"author": "smbell", "id": "hah8rja", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #158", "submission": "pc60fr", "stickied": false, "body": "Maybe if we would have stopped overthrowing democratic governments, stopped killing civilians by the tens/hundreds of thousands, stopped waging endless wars for oil...\n\nWe've been doing that shit for at least 50 years. Maybe a good place to start is just to stop.", "is_submitter": false, "distinguished": null, "created_utc": 1630014464.0, "parent_id": "t3_pc60fr", "replies": [{"author": "bernpfenn", "id": "haiqtat", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "pc60fr", "stickied": false, "body": "wasn't there a British pipeline project stopped by the Taliban that started the us involvement?", "is_submitter": false, "distinguished": null, "created_utc": 1630040552.0, "parent_id": "t1_hah8rja", "replies": [{"author": "Concrete_Grapes", "id": "haj86hj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pc60fr", "stickied": false, "body": "Yes. It was resigned into existing by trump and folks in 2018, under the leadership of a shell corp based in a European island nation, and should come online (if tis not already) this year.", "is_submitter": false, "distinguished": null, "created_utc": 1630053965.0, "parent_id": "t1_haiqtat", "replies": []}]}]}, {"author": "GLXC_AUS", "id": "hahp99e", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #260", "submission": "pc60fr", "stickied": false, "body": "What if we actually do nothing about it once we've evacuated the people needing to leave?\nI've heard that in some places of the world, they thrive not on democracy but on other forms of ruling.\nSo perhaps imo,  we minimise involvement.", "is_submitter": false, "distinguished": null, "created_utc": 1630021915.0, "parent_id": "t3_pc60fr", "replies": [{"author": "Pwngulator", "id": "hakkz44", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #171", "submission": "pc60fr", "stickied": false, "body": "I don't buy that. How could oppressive forms of government be good for anyone?", "is_submitter": false, "distinguished": null, "created_utc": 1630080261.0, "parent_id": "t1_hahp99e", "replies": []}]}, {"author": "Trzef", "id": "hahpo1b", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #19 | Classis Veritatus", "submission": "pc60fr", "stickied": false, "body": "Nothing, leave Afghans alone. Don't be fooled by neocons who milk the white saviour complex. \n\nSome countries and societies are destined to be an eternal failure, and American imperialism never was a humanist force. \n\nThis attack were done by ISIS, so is expected that Taliban retaliate against them. \n\nSince Najibullah was dead, restoring the monarchy in 2003 had would been a good idea.", "is_submitter": false, "distinguished": null, "created_utc": 1630022109.0, "parent_id": "t3_pc60fr", "replies": []}, {"author": "yrogerg123", "id": "hah1dcm", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "pc60fr", "stickied": false, "body": "We tried for 20 years to use military intervention and the second we leave this is what happens. So either we stay quite literally forever, or we leave. I don't think anything changes after 10 more years of artificially propping up a failed state. The sad truth is if the Afghan people truly wanted to unite together to fight and defeat the Taliban, they would have, but they chose not to. I don't think anybody deserves what's happening but they had the Taliban before we invaded and they have it again now.\n\nWhat I feel bad for is everybody who fought and died for 20 years just to end up in a worse version of where we started. It was all for nothing.", "is_submitter": false, "distinguished": null, "created_utc": 1630011357.0, "parent_id": "t3_pc60fr", "replies": [{"author": "Golden-Snowflake", "id": "hah4jjl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pc60fr", "stickied": false, "body": "If the taliban continue what they used to do, after this break of 20 years, those folks whom have had freedoms given to them and taken away, will eventually realize the problems.   \n\n\nLets hope it doesn't take too long.", "is_submitter": false, "distinguished": null, "created_utc": 1630012678.0, "parent_id": "t1_hah1dcm", "replies": [{"author": "kemperus", "id": "hai8zbr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #134", "submission": "pc60fr", "stickied": false, "body": "This I think is perhaps the best contribution of the whole mess made there. Many people had their entire lives outside taliban control now", "is_submitter": false, "distinguished": null, "created_utc": 1630031230.0, "parent_id": "t1_hah4jjl", "replies": []}]}]}, {"author": "therapythrowaway1205", "id": "hahl4mu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "pc60fr", "stickied": false, "body": "I mean I don’t think they wanted our help to begin with so….", "is_submitter": false, "distinguished": null, "created_utc": 1630019986.0, "parent_id": "t3_pc60fr", "replies": [{"author": "kemperus", "id": "hai8odx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #134", "submission": "pc60fr", "stickied": false, "body": "I’m not sure this is the right way of seeing the situation. While I agree that perhaps the US doesn’t have a decent plan or the tools to “fix” (if that is even an appropriate word) their problems, sometimes people are so damaged/ignorant that they don’t realize that there’s better options for them.\n\nI believe that there are some cases in which is important to intervene against someone’s wishes in order to act on their best benefit (e.g. some drug addicted people sometimes need strong intervention from others against their will), but I don’t think the past 20 years were a move in the right direction either", "is_submitter": false, "distinguished": null, "created_utc": 1630031087.0, "parent_id": "t1_hahl4mu", "replies": [{"author": "therapythrowaway1205", "id": "haiatsl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "pc60fr", "stickied": false, "body": "Ya but how much of this current situation is the us fault? Intervention might be the exact reason they’re in such a shitty situation now. \n\nAdditionally, if someone doesn’t want to be rehabilitated they won’t be. Doesn’t matter how much force you use. People ultimately have free will, regardless if they recognize that or not. \n\nSomeone could be in an abusive relationship, and you could do everything in your power to try and protect that person and prevent them from more damage but if the person doesn’t want help you are fighting a loosing battle. And forcing the person, society and whatever else is taking away their autonomy to begin with making any choice from them coerced and disingenuous at best and done through a veiled inner hatred at worst.\n\nIt’s a waste of time, resources and whatever else to help someone who doesn’t want to be helped. You should and can leave the door open should they want help and want change but the best thing to do is give that option while simultaneously protecting yourself from being taken advantage of. That is the only practical solution because you can’t force people to do things they don’t want to. Not without guns and a lot more violence which given the past 20 years it’s safe to say that was entirely ineffective. \n\nGranted that’s just my opinion and it’s surface at best with minimal knowledge of the situation up to this point and is based on my own research into psychology and sociology. I’m vastly under qualified to give an answer, nor did I ever claim I was. Just throwing my own two cents out there.", "is_submitter": false, "distinguished": null, "created_utc": 1630032107.0, "parent_id": "t1_hai8odx", "replies": []}]}]}, {"author": "Kelyaan", "id": "hagrqdb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pc60fr", "stickied": false, "body": "Honestly ... Nothing, some countries struggle with themselves never mind another one.", "is_submitter": false, "distinguished": null, "created_utc": 1630007459.0, "parent_id": "t3_pc60fr", "replies": []}, {"author": "AndrewIsOnline", "id": "hagr2b0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "pc60fr", "stickied": false, "body": "Nothing", "is_submitter": false, "distinguished": null, "created_utc": 1630007193.0, "parent_id": "t3_pc60fr", "replies": [{"author": "jmcsquared", "id": "hagvelk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "pc60fr", "stickied": false, "body": "Not even help Afghans who want out to get out?", "is_submitter": true, "distinguished": null, "created_utc": 1630008947.0, "parent_id": "t1_hagr2b0", "replies": [{"author": "AndrewIsOnline", "id": "haigeux", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "pc60fr", "stickied": false, "body": "I don’t know I was just being dramatic\n\nBut also…..\n\nIs there ever going to be some perfect window to break out of a decades long war that we’ve been losing? \n\nThere’s always going to be the trolley problem", "is_submitter": false, "distinguished": null, "created_utc": 1630034892.0, "parent_id": "t1_hagvelk", "replies": []}]}]}, {"author": "AndrewIsOnline", "id": "hahwzp2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "pc60fr", "stickied": false, "body": "Yes!!", "is_submitter": false, "distinguished": null, "created_utc": 1630025562.0, "parent_id": "t3_pc60fr", "replies": []}, {"author": "amitym", "id": "hahz0p6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pc60fr", "stickied": false, "body": "There are other stable nation-states that comprise semi-autonomous \"tribal\" territories in a loose confederation.  Switzerland is a fine example.  Modern, forward-thinking cantons lie side by side with insane, sexist, religious-reactionary cantons.  Every canton has its own language and religion, and none of them overlap very much.  Should sound familiar if you know anything about Afghanistan....\n\nAnd yet, while Switzerland has all kinds of problems, and these days we take a dim view of not letting women vote, their system is stable.  They chose it at a time in their history when, not unlike Afghanistan, they couldn't agree to form a single government and everything was on the brink of disaster with everyone at everyone else's throats.\n\nNot to put too fine a point on it:  they chose that system because there was *no way in hell* they could possibly form a stronger, more centralized government.\n\nIt's hard not to see Afghanistan in a similar light.  The US and its allies tried to establish a strong centralized power structure in a country that was bound to reject that idea.  Many of us said at the time, and kept saying it, and still say it to this day:  that was not going to work.  And it's clear it has not.\n\nWhat's even more ironic is that the US is not a very strongly centralized political system either.   The US is pretty highly anarchic compared to most industrial democracies.  (Not Switzerland but most others.)  So it's funny that the first thing that the American planners did in Afghanistan was try for this fantasy of highly centralized government power.  Washington DC seems to have that effect on people.  They forget how their own country even works.\n\nIf it had been up to me (heaven help us all....), I would have started with what Afghanistan already has -- a loose system of autonomous regional power.  As an invading military force, I would be bound by the conventions of international law to ensure border integrity and internal security *to a point*, but I would quickly move to socialize the idea that Afghanistan is going to look like its own thing, not like anyone else's fantasy of power.\n\nWithin the first 6 months or so, I would make it clear that continued intervention after the initial military phase is going to depend entirely on the provinces.  Each province can invite or refuse outside aid -- if they invite it, it comes with a promise of military support on our side and a promise of security on theirs.  That's one of the key points.  Security is their responsibility.  They don't have to form a national army, they can organize and fight \"their way\" instead of \"our way\" if that's what they want.   But they have to guarantee security in their own home.  If they can't or won't, then we leave, and that means everything -- troops, technical support, development support, cash payments, everything.  We will review any decision to return whenever we feel like getting around to it.\n\nIf that meant that by year 1 we were out of every province, then so be it.  We declare victory and announce that the people of Afghanistan have chosen their own destiny.  Yay.  Hooray.\n\nIf it meant staying in some parts of the country and letting the Taliban overrun others, then okay, that's what they want.  In a few hundred years maybe they'll be like Switzerland.\n\nWould it have worked?  I have no clue.  20 years later, my plan might have been mired in civil war, the return of the Taliban, and a power vacuum in Afghanistan that was rapidly being filled by pan-Islamic fundamentalist organizations.\n\nBut that wouldn't be any worse than today, or than 1990 for that matter.", "is_submitter": false, "distinguished": null, "created_utc": 1630026525.0, "parent_id": "t3_pc60fr", "replies": []}, {"author": "ravenclaw1138", "id": "hai1e4n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #27 | Classis Veritatus", "submission": "pc60fr", "stickied": false, "body": "One thing for sure we need to do is to stop funding the extremist groups and corrupt governments, that would help mitigate a lot of problems. Another thing is that Afghanistan is so divided into regional and tribal groups, that a more decentralized government or multiple new countries need to be made. Afghanistan used to be fairly stable and progressive, look at photos of Afghanistan in the 1970’s, so we need to stop treating it as a failed state that will never be fixed.", "is_submitter": false, "distinguished": null, "created_utc": 1630027660.0, "parent_id": "t3_pc60fr", "replies": []}, {"author": "ariciabetelguese", "id": "haj2igf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #282", "submission": "pc60fr", "stickied": false, "body": "The US has intervened in my country once before. The events they set in motion involved mass murder, death of hundreds and thousands of people, and a thirty-year corrupt dictatorship.\n\nI think the US should leave other countries alone unless they're the ones asking for help. Some of you may mean well, but many of the people in power are opportunists who would use the opportunity to further their own interests at the cost of literal human lives... and they're the ones who usually got their way.", "is_submitter": false, "distinguished": null, "created_utc": 1630049081.0, "parent_id": "t3_pc60fr", "replies": []}, {"author": "Concrete_Grapes", "id": "haj99ci", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pc60fr", "stickied": false, "body": "What should the Us have done differently?  \n\n\nAs horrid as it is, the Powell doctrine for war should have been used. Blitz and bomb the ever loving shit out of it in the greatest show of power we could muster, and then let it fucking stew. There never should have been boots on the ground like there was, or as long as it was. For the same reason that we saw Iraq as a monstrous clusterfuck we shouldn't touch, we SHOULD have seen Afghanistan as that as well.   \n\n\nhowever, corporate greed got in the way. They saw the chance to renew the oil pipelines that several countries wanted to run through there (One of which Trump signed into existing as part of the deal with the Taliban, and should be online this year). They then saw the potential of the mining and mineral reserves there. Lithium. The corruption, overall, also saw the drugs (opium), and that caused a shit ton of problems because, well, greed and stupidity.   \n\n\nWhat should have been done differently, other than that brief war, would have been entering it as China enters unstructured, piss poor, undeveloped nations. They build roads, infrastructure, power grid, wells, all of it with loans and leases, so that the companies AND states that enter into agreements with them end up with a vested interest in making things better. The shit China's doing in some African nations is ASTOUNDING in it's level of success. Yes, it's expositive and bad, yes it's profit driven and it caters to dictators sometimes, HOWEVER, they're laying the groundwork when they do this to allow the societies themselves to advance economically out of tribal war cultures, and into states where a middle and working class WILL develop given some time. The way they do it, is a way that the locals feel like THEY created it, when all along it was just  as planned and structured as the chinese economy has been for decades.   \n\n\nSo, we should have done that. Tie projects to resources. Hey, we want 20% of your mining, and for that we'll go in and build 1000 miles of roads to the mines we want, AND put in an entire city water sewer plan and plot out homes/apartments for 50000 people. (that's the sort of shit china does). Hey, we'd love for you to have a strong internal defense force so that loonies cant attack the pipeline we'll pay you 400 million a year in royalties for--so, hop to it guys, money's on the line!  \n\n\nThat would have been something close to what should have been done. With SMALL, RARE,  interventions with military force. China does this with paid (bribed) local police and military. They make WAY WAY more working for china than they so some shit head with rusty AK's and a Koran fetish.   \n\n\nAnyway, i think a video would be educational. It's old, but it's relevant to this topic. Consider watching.   \n\n\nhttps://www.youtube.com/watch?v=d3xlb6\\_0OEs", "is_submitter": false, "distinguished": null, "created_utc": 1630054914.0, "parent_id": "t3_pc60fr", "replies": []}, {"author": "DELETED", "id": "hagjyup", "score": -2, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "pc60fr", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1630004344.0, "parent_id": "t3_pc60fr", "replies": [{"author": "justausername22222", "id": "haglr2l", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "pc60fr", "stickied": false, "body": "WMDs were  the justification for the war in Iraq. The war in Afghanistan was launched earlier, in response to 9/11 to keep the Taliban from providing a safe haven for Al-Qaeda.", "is_submitter": false, "distinguished": null, "created_utc": 1630005061.0, "parent_id": "t1_hagjyup", "replies": []}]}, {"author": "dashingThroughSnow12", "id": "hahi6gz", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "pc60fr", "stickied": false, "body": "Prior to today, the last USA military death was in February 2020.\n\nThe USA had by and large won its primary objective. Few casualties. Bases in the region for any operation it needed in Afghanistan or surrounding areas.\n\nThe secondary objective, give Afghanistan a stable government and allow women to have freedom, was largely won too.\n\nThe move out seems to have been to snatch defeat out of a victory.\n\n> What are your thoughts on Afghanistan, whether the United States should stay, what the United States should've done differently, and what the world should do moving forward?\n\nNo, stayed, and harsh rhetoric / generous with asylum claims.", "is_submitter": false, "distinguished": null, "created_utc": 1630018632.0, "parent_id": "t3_pc60fr", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "hahkr3z", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pc60fr", "stickied": false, "body": "Build a wall around the problem area and let them sort themselves out.", "is_submitter": false, "distinguished": null, "created_utc": 1630019812.0, "parent_id": "t3_pc60fr", "replies": []}]}