{"title": "LSD and Meditation has changed my whole conception of life", "name": "t3_pbwh5i", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pbwh5i/lsd_and_meditation_has_changed_my_whole/", "selftext": "Longstory short my parents divorced when I was 4. Bang. My big brother just didn't want to talk to me at all and ignored me even though I tried so hard to be friends with him. Bang X2. I grew up alone, cuz mom was working all day long and my father just gave up on his kids and never saw him again since I was 7. Grew up in front of a computer screen masturbating since 8. Bang X3.\n\nThese things hurt a lot and damaged me and my attitude. I tried to stay strong even though I wasn't.\n\nTo sum up ive had mild depression since I was pretty young so I didn't even know what it was like to be happy.\n\nI was about to quit life after 2+ years of smoking marihuana and everyday (started at 17, now I'm 20). \nThen I started watching videos about Wim Hof and his method (breathwork and cold showers). I started feeling a little bit better yet my addiction was still there. Then I got the willpower to quit, i started meditating, reading, more often, and so far so good I'm getting just a 1% better everyday. \n\nYesterday I had an LSD trip with some friends, and i first felt in my life a REAL connection. I'm the kind of guy to dream while I'm awake and always disconnected at some point when I was hanging out. Now that was different. My mood and everyone's else was like \"moving \" with the mood of the group (7 20 y olds). We went on hiking and it was such an adventure. We finally got home late night and it was so dark we could event climb down the mountain.\n\nAt this point I was tripping and feeling good. It was like i was being my \"real\" self. No faking, just fully present, like in a meditative state. We sat forming a circle and i guided my friends through a breathing to calm us down, then 2 bats started flying in circles right above our heads, and disappeared right away... Then I looked my phone and it was 22:22 22 august... It may seem like a coincidence but it was mind-blowing when you're on LSD. This experience changed my perception on life and myself.\n\nHave you ever tried lsd or any hallucinogenic? Enjoy with responsibility!", "score": 7, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/pbwh5i/lsd_and_meditation_has_changed_my_whole/", "id": "pbwh5i", "author": "joanitobnn", "link_flair_text": "Fascinating", "num_comments": 9, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629972473.0, "comments": [{"author": "FiannaTheBard", "id": "haf5rq6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #196", "submission": "pbwh5i", "stickied": false, "body": "Of all the weird stuff I tried as a teenager LSD was probably my favorite! Don’t do so much as to wreck yourself but yeah… it’s very powerful for rewriting brain trauma into something more meaningful that you can get a handle on. Heard on the radio (NPR probably?) that they are using it to treat PTSD sometimes now and thought what a great idea that is. \n\nOfc I haven’t had any sort of drug for decades and please watch after your physical health and don’t go doing too much.", "is_submitter": false, "distinguished": null, "created_utc": 1629983897.0, "parent_id": "t3_pbwh5i", "replies": [{"author": "joanitobnn", "id": "haffq1f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pbwh5i", "stickied": false, "body": "Thanks for your advice! Yes it is powerful... It literally \"rewrote\" my system for good. I am not planning in doing it in the near future, rather I'll keep meditating, working out and studying so I can keep up this mentality! Thanks! 👊", "is_submitter": true, "distinguished": null, "created_utc": 1629988293.0, "parent_id": "t1_haf5rq6", "replies": [{"author": "FiannaTheBard", "id": "haffv7d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #196", "submission": "pbwh5i", "stickied": false, "body": "Good plan! Hope you enjoy your accidental fruits of your experience to their fullest!", "is_submitter": false, "distinguished": null, "created_utc": 1629988352.0, "parent_id": "t1_haffq1f", "replies": []}]}]}, {"author": "mattg4704", "id": "hagdyf8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #94", "submission": "pbwh5i", "stickied": false, "body": "you capable of having friends. dont take that for granted. as bad as life can get having and keeping friends is dear and important.", "is_submitter": false, "distinguished": null, "created_utc": 1630001916.0, "parent_id": "t3_pbwh5i", "replies": []}, {"author": "Rue_Bixcube", "id": "hai3g1r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #103", "submission": "pbwh5i", "stickied": false, "body": "I like LSD, but I really prefer to mix it with Molly. LSD without Molly is like cake without frosting.", "is_submitter": false, "distinguished": null, "created_utc": 1630028643.0, "parent_id": "t3_pbwh5i", "replies": []}, {"author": "sweber145", "id": "haenkrz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #68", "submission": "pbwh5i", "stickied": false, "body": "I’ve tried shrooms. I know they were good, because everyone else was tripping balls, but they didn’t do anything to me. \n\nI’d try ayahuasca or peyote, but lsd kinda scares me a bit for some reason. Prolly all the programming from those 60’s and 70’s folks who actually saw people have really bad trips and od because they were all figuring it out still.", "is_submitter": false, "distinguished": null, "created_utc": 1629972807.0, "parent_id": "t3_pbwh5i", "replies": []}, {"author": "agaminon22", "id": "haennu2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #174", "submission": "pbwh5i", "stickied": false, "body": "I've tried shrooms a couple times. Alone, though. Not the best of ideas but hey what could go wrong? Turns out, quite a bit.\n\nThe first time it was pretty fun. If you've never done any psychedelics, it's really hard to explain. You're aware of the trip, yet you still can't do anything about how you feel about it. Imagination goes wild. Things taste so good. Music is awesome. Auditory hallucinations are everywhere, that's what I most noticed. Visual ones too, but definitely nothing crazy. \n\nIf it's going good, it's fun. I had a few \"deep\" thoughts and definitely learned how to relax a bit more, but it didn't really change  my way of living life. The second time I tried them it wasn't as fun. I started having a bad trip and going into a dark place... not that great. Eventually I surfaced and it was mostly fine but for a while I had a bit of a bad reaction when presented with anything psychedelic or surreal, since it reminded me of that experience.", "is_submitter": false, "distinguished": null, "created_utc": 1629972874.0, "parent_id": "t3_pbwh5i", "replies": []}, {"author": "bernpfenn", "id": "haiwrxf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "pbwh5i", "stickied": false, "body": "what is molly?", "is_submitter": false, "distinguished": null, "created_utc": 1630044487.0, "parent_id": "t3_pbwh5i", "replies": []}, {"author": "sarcasmoverwhelming", "id": "haq9o5d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #274", "submission": "pbwh5i", "stickied": false, "body": "For some reason I have an obsession with the times 11:11 and 22:22. LSD helped me and my ex wife work through our divorce and become co parents not bitter exes. I love the stuff. I’d be interested in trying ketamine at some point with a therapist.", "is_submitter": false, "distinguished": null, "created_utc": 1630185765.0, "parent_id": "t3_pbwh5i", "replies": []}]}