{"title": "Do flat rate fines disproportionately effect poor people?", "name": "t3_pfdn7i", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pfdn7i/do_flat_rate_fines_disproportionately_effect_poor/", "selftext": "I was thinking the other day about how tons of things are based around percentage of income, like taxes. Fines, speeding for example, are a flat rate. An individual that makes $200k/yr and gets a $500 speeding ticket can easily pay it off, where an individual making $30k/yr cannot. Does that encourage individuals of higher income to break rules more often as they are less effected by the penalties? Would a system where fines are proportional to income work?", "score": 12, "upvote_ratio": 0.83, "permalink": "/r/TheFlyingTree/comments/pfdn7i/do_flat_rate_fines_disproportionately_effect_poor/", "id": "pfdn7i", "author": "joshuamunson", "link_flair_text": "Discussion", "num_comments": 29, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630440237.0, "comments": [{"author": "baalroo", "id": "hb3ndtm", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Seeker #120 | Legio Virtus", "submission": "pfdn7i", "stickied": false, "body": "It seems like that's obviously and demonstrably true.\n\nEven myself, as I've progressed in my career I've found myself less concerned with that sort of thing. When I was in my 20s and broke, a speeding ticket meant that I'd probably end up totally and completely fucked. I pretty much never sped, and was very careful about following the rules of the road.\n\nNow in my 40s with good stable income, it's honestly not as big of a concern for me because I could handle a ticket without any real pain. I'm not rich or anything, but a couple hundred bucks isn't a big deal. So now, although I still mostly follow the rules of the road because I'm not an asshole, the thought of getting a ticket no longer factors into my driving habits.", "is_submitter": false, "distinguished": null, "created_utc": 1630441420.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "Alatain", "id": "hb3nrmx", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pfdn7i", "stickied": false, "body": "If committing a crime has a monetary cost, it is only a crime to those that cannot afford it. \n\nIf the goal was to actually make driving safer, reckless driving would just get your licence revoked, or end in jail time. Putting a fee on it that is trivial to some, but life ending to the most disadvantaged just creates a class divide in the justice system.", "is_submitter": false, "distinguished": null, "created_utc": 1630441569.0, "parent_id": "t3_pfdn7i", "replies": [{"author": "145676337", "id": "hb43r1r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #116", "submission": "pfdn7i", "stickied": false, "body": "Both of those are also problematic though. Jail time means most people that are lower income have lost their job. They don't have time off or any job protection. Plus they lose the income from those days. If I have a bunch of savings and they're paycheck to paycheck it's a big difference.\n\nLoss of license for many people in the IS means you can't really get to a job unless you take a cab. Sure there's some options for public transport but there's lots of places where that isn't an option. Generally biking/walking is only really doable where public transport exists and not even always there.\n\nI'm not saying we can make a system without favoritism to the wealthy but there's challenges with everything.", "is_submitter": false, "distinguished": null, "created_utc": 1630448206.0, "parent_id": "t1_hb3nrmx", "replies": []}, {"author": "andero", "id": "hb4dix6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #167", "submission": "pfdn7i", "stickied": false, "body": ">If committing a crime has a monetary cost, it is only a crime to those that cannot afford it. \n\nExactly.\n\nThat said, I'm way more concerned about corporations paying fines that are pocket-change compared to their income. Like.... maybe instead of charging a company a million dollars for breaking an environmental rule, the company has to pay a fine based on their income plus they have to give a % of its shares to the government.\n\nThe idea is not for this to happen, it's for there to be a disincentive for them to do it. With a million dollar fine, the company will put that cost as an expense in their calculations so as long as they make a million and one dollars, that's profit, so go for it.  \nIf the \"fine\" were losing a high enough percent AND losing a chunk of their shares, that could be more than they're willing to pay.", "is_submitter": false, "distinguished": null, "created_utc": 1630452608.0, "parent_id": "t1_hb3nrmx", "replies": []}]}, {"author": "smbell", "id": "hb3wuq0", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #158", "submission": "pfdn7i", "stickied": false, "body": "Yes. Some places, like Finland, link fines to income.", "is_submitter": false, "distinguished": null, "created_utc": 1630445274.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "SchoggiToeff", "id": "hb3v2fj", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #114", "submission": "pfdn7i", "stickied": false, "body": "In my country, if you get a speeding ticket worth $500 you would you get banned from driving for one month (longer for repeated offenders). On top of that you get slapped with various administrative fees worth another few hundred $ . Sure the rich can get a taxi or use the very good public transportation as a taxis are freaking expensive to be used for daily and/or long distance transport. \n\nBut at the next stage, for more severe speeding or traffic offences (and also criminal offences), we actually have income based monetary penalties. They were introduced in lieu of short jail sentences. Jails are expensive. Accordingly they are measured in days and multiplied with how much you earn in a day. Also like jail sentences they can be on probation only and usually are (for two to three years) in case of first time offenders. However in such a case, where the sentence is on probation, there will be still a huge fine, and court fee, and a three month or more driving ban, and more admirative fees. \n\nExample: The judge decides your traffic infraction is worth 10 days the $200k/yr would get a monetary penalty of $ 5500, and the $30k/yr guy one of $ 820. Sure, the richer guy has properly a greater disposable income and thus will still profit. But there is also some a adjustment for kids which have to be supported.", "is_submitter": false, "distinguished": null, "created_utc": 1630444526.0, "parent_id": "t3_pfdn7i", "replies": [{"author": "joshuamunson", "id": "hb3wv9r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #139", "submission": "pfdn7i", "stickied": false, "body": "Super interesting perspective to have and I thank you for the well spoken explanation. Might I ask where you are from?", "is_submitter": true, "distinguished": null, "created_utc": 1630445280.0, "parent_id": "t1_hb3v2fj", "replies": [{"author": "SchoggiToeff", "id": "hb3yvzv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #114", "submission": "pfdn7i", "stickied": false, "body": "Switzerland.", "is_submitter": false, "distinguished": null, "created_utc": 1630446131.0, "parent_id": "t1_hb3wv9r", "replies": []}]}]}, {"author": "MisanthropicScott", "id": "hb3ztcw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pfdn7i", "stickied": false, "body": "This is an interesting concept. Taken as the only variable, you're probably correct.\n\nThe thing is that I sped a lot when I was young and stupid. The cost of the fine was not on my mind at all. Once I started to get older (which did correspond with greater income), I found that the way to avoid speeding tickets entirely was simply to set the cruise control to 8 MPH (U.S., obviously) above the speed limit. I never get pulled over now.\n\nI would also say that somewhere along the way, I realized that the fine of the ticket was nothing compared to the increase in insurance costs for at least 39 months (then, not sure about now).\n\nCompare that to my teens and early 20s when I was stupid enough to get a ticket for going 68 MPH (~110 km/h) in a 30 MPH (~50 km/h) zone.\n\nAlso strange here in the U.S., or at least where I live, is that the severity of the speeding violation is determined by miles per hour over the speed limit rather than a percentage over the speed limit. So, more than doubling the limit as I did above would be no worse than going 38 MPH over a 65 MPH speed limit.\n\nBoth are bad. But, the percentage over the limit is much worse in the first case.\n\nToday, I think things have changed so radically since that time that a single ticket that high over the limit might trigger a mandatory suspension/revocation hearing. Then it was just points on my license and a fine.\n\nLastly, a wealthy person is also more likely to pay a lawyer to come to court to try to beat the ticket.", "is_submitter": false, "distinguished": null, "created_utc": 1630446524.0, "parent_id": "t3_pfdn7i", "replies": [{"author": "145676337", "id": "hb47428", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #116", "submission": "pfdn7i", "stickied": false, "body": "Fun fact, the UK also uses MPH. So when someone drives from Northern Ireland (MPH) to Ireland (km/h) they have to note the different system.", "is_submitter": false, "distinguished": null, "created_utc": 1630449691.0, "parent_id": "t1_hb3ztcw", "replies": [{"author": "MisanthropicScott", "id": "hb4osf3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pfdn7i", "stickied": false, "body": "Ditto for me in NYC driving north to Canada. But, that is about 6 hours and not that common for me. I do just switch my speedo to km/h. It's a simple button on the dash.", "is_submitter": false, "distinguished": null, "created_utc": 1630457852.0, "parent_id": "t1_hb47428", "replies": []}]}]}, {"author": "kubigjay", "id": "hb7db28", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #64", "submission": "pfdn7i", "stickied": false, "body": "Take it one step further, think about bail.  If you can't pay bail you sit in jail, lose your job, and then plead guilty just to get out. \n\nIf you have money you post bail and a lawyer negotiates it so you don't have any jail time.", "is_submitter": false, "distinguished": null, "created_utc": 1630513616.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "ARtEmiS_Oo", "id": "hb3scgq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "pfdn7i", "stickied": false, "body": "If the punishment for something is a fine, then that law is for poor people only.", "is_submitter": false, "distinguished": null, "created_utc": 1630443394.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "validusrex", "id": "hb49eqi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #176", "submission": "pfdn7i", "stickied": false, "body": "Yes. Isnt that obvious?", "is_submitter": false, "distinguished": null, "created_utc": 1630450718.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "YashinNashi", "id": "hb4aofo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #226", "submission": "pfdn7i", "stickied": false, "body": "By definition, yes, they are a higher proportion of a lower income.", "is_submitter": false, "distinguished": null, "created_utc": 1630451295.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "I_Am_Anjelen", "id": "hb4fj4o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #297", "submission": "pfdn7i", "stickied": false, "body": "No, Flat rate fines _as such_ do not disproportionately **effect** poor people.\n\nAfter all, nobody is _expected_ to break the law. In an ideal world, nobody would be fined, ever; the fines are there to be a _deterrent_ against, not a tax on - for instance - driving over the speed limit.\n\nFines are an expression of justice, not an expression of the fairness of a system. That said - yes, the deterrent against breaking the law is proportionally larger for a poor person than it is for a wealthy person, which is why fined calculated as a percentage of income are a more _just_ system.\n\nHowever. If I make 30k a year, a 500 dollar ticket is a good sixth of my monthly income. That's a good chunk of change. That's probably at the very _least_ money I am hoping I can save at the end of the month, or invest somewhere, if not money I have already earmarked for other things entirely.\n\nIf I make 200k a year, though, I can (more than likely) easily put money aside. I am exponentially more likely to have a nest-egg, so losing a sixth of my monthly income (roughly 2800 dollars out of 16000-odd) isn't going to break my bank nor be anything more than an annoyance \n\nI've lived both lifestyles (and lifestyles lesser than 30k a year, and lifestyles in excess of 200k a year) and frankly, three thousand bucks in the latter case wouldn't even have _concerned_ me as a one-time occurrence. I'd have shrugged it off.\n\nSo, yes, percentage-of-income fines would be a more _fair_ system, but only in the case that that percentage also goes up as income goes up.", "is_submitter": false, "distinguished": null, "created_utc": 1630453534.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "GuyGuy2727", "id": "hb4jd6m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #286", "submission": "pfdn7i", "stickied": false, "body": "Almost everything in America disproportionately effects poor people. And middle class people. There's a certain amount of wealth you need to guarantee you'll have a full set of teeth by the time you're sixty.", "is_submitter": false, "distinguished": null, "created_utc": 1630455310.0, "parent_id": "t3_pfdn7i", "replies": [{"author": "MatthewPrague", "id": "hb88o2o", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #383", "submission": "pfdn7i", "stickied": false, "body": "Its just human nature. Money = power. You cant change it. Its obvious that poor people will be affected by everything much more than rich people. Is it right? Probably not? Can we solve this? Probably not. No matter what we do, there would always be people with big influence and power.", "is_submitter": false, "distinguished": null, "created_utc": 1630526391.0, "parent_id": "t1_hb4jd6m", "replies": [{"author": "GuyGuy2727", "id": "hbdz80u", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #286", "submission": "pfdn7i", "stickied": false, "body": "That's not human nature... it's capitalism. The concept of a necessary evil or stomping on others being 'human nature' are lies sold to you by sharks eating minnows to keep the minnows in line. It's not *real*. There are already solutions out there. Of *course* the people in power are gonna tell you everything and anything that would put them out of power is evil, they don't want to lose that power.", "is_submitter": false, "distinguished": null, "created_utc": 1630630293.0, "parent_id": "t1_hb88o2o", "replies": [{"author": "MatthewPrague", "id": "hbeul5b", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #383", "submission": "pfdn7i", "stickied": false, "body": "You need to understand that there are always people in power.", "is_submitter": false, "distinguished": null, "created_utc": 1630646421.0, "parent_id": "t1_hbdz80u", "replies": [{"author": "GuyGuy2727", "id": "hbiixz2", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #286", "submission": "pfdn7i", "stickied": false, "body": "You need to understand the fact that there are people in power doesn't change the fact that we are morally obligated to ease the suffering of the 99% and if that means taking from the 1% then that is what we have to do. You sound like a spineless bootlicking little coward. Stop responding to my comments you little worm.", "is_submitter": false, "distinguished": null, "created_utc": 1630716239.0, "parent_id": "t1_hbeul5b", "replies": []}]}]}]}]}, {"author": "zebediah49", "id": "hb4rpdb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #131", "submission": "pfdn7i", "stickied": false, "body": "Yeah, pretty much.\n\nI can say that, empirically, one of my \"hey, I actually have money now!\" moments was when I looked up the city rules about swords, and found that they amounted to \"It's probably fine, but even if it isn't I can afford that fine, so whatever.\"\n\nAlso, because I have to... 'affect'.\n\n- The effect is that I ignore rules because I can afford to pay the fine.\n- The fine doesn't affect me particularly much\n- The weak fines effect an increase in my willingness to flaunt the law.", "is_submitter": false, "distinguished": null, "created_utc": 1630459187.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "MatthewPrague", "id": "hb8cspw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #383", "submission": "pfdn7i", "stickied": false, "body": "Now lets compare unemplyed person who has no income and very succesfull business man. Both got speeding ticket. Let say person with no income would get $50 fine and bussiness man $50k. Again is that fair, isnt $50k just too much? Another example rich kid vs poor hardworking  mother, again it would not be fair. Nothing can be completely fair and money( even though people dont like it) defines succes of people living in democracy, with that succes comes privilage. Because of this, fixed fine is not such a hard hit for rich person as it is for poor person and I personaly dont like this, thats not kind of privilage rich people should have. If we talk about % fine its unreasonably hard hit for rich people, just for speeding for example paying dozens thousands of dollars is nuts(you might think its fair because its same % but thats not the case here, even rich person can see value of money same way as poor person). In best case scenario I would not fine people at all. I would give everyone limited number of points and if they would for example speed they would lose some these points. If your points get to zero you will lose you driving license for 2 years, but it can be any punishment as long as it is same for everyone its ok. Thats the only way you can get as close as possible to make it fair for everyone, but again for someone car can be less important and therefore this punishment wont affect him as much as somone who really needs a car.", "is_submitter": false, "distinguished": null, "created_utc": 1630528054.0, "parent_id": "t3_pfdn7i", "replies": [{"author": "joshuamunson", "id": "hb8dlyz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #139", "submission": "pfdn7i", "stickied": false, "body": "The point system already exists for licenses on top of the fines. And you're saying rich people deserve a flat fine that is worth less of a percentage of their income than poor people because they deserve it because they're rich and successful?", "is_submitter": true, "distinguished": null, "created_utc": 1630528385.0, "parent_id": "t1_hb8cspw", "replies": []}]}, {"author": "zoharel", "id": "hb9l381", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "pfdn7i", "stickied": false, "body": "All fines disproportionately harm the poor.", "is_submitter": false, "distinguished": null, "created_utc": 1630548801.0, "parent_id": "t3_pfdn7i", "replies": []}, {"author": "logoyahoo", "id": "hb47ahr", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #80", "submission": "pfdn7i", "stickied": false, "body": "Fines proportional to income aren’t workable. Flat fines make practical sense.", "is_submitter": false, "distinguished": null, "created_utc": 1630449772.0, "parent_id": "t3_pfdn7i", "replies": [{"author": "bluesam3", "id": "hb49e89", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #23", "submission": "pfdn7i", "stickied": false, "body": "Except for all of the countries that do scale fines to income just fine.", "is_submitter": false, "distinguished": null, "created_utc": 1630450711.0, "parent_id": "t1_hb47ahr", "replies": [{"author": "logoyahoo", "id": "hb62la4", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #80", "submission": "pfdn7i", "stickied": false, "body": "Let them keep their communist notions.", "is_submitter": false, "distinguished": null, "created_utc": 1630489666.0, "parent_id": "t1_hb49e89", "replies": [{"author": "bluesam3", "id": "hb63iy6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #23", "submission": "pfdn7i", "stickied": false, "body": "*:Roll:*", "is_submitter": false, "distinguished": null, "created_utc": 1630490450.0, "parent_id": "t1_hb62la4", "replies": []}]}]}]}]}