{"title": "Question about sleep", "name": "t3_p4i6th", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p4i6th/question_about_sleep/", "selftext": "Dear tree, I find it more easy to doze off on bed during the day than I find myself lulled into that long rest and comfort that night is supposed to provide. What gives?", "score": 2, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/p4i6th/question_about_sleep/", "id": "p4i6th", "author": "keyless-hieroglyphs", "link_flair_text": "Question", "num_comments": 5, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628982551.0, "comments": [{"author": "Muroid", "id": "h8yxnxv", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p4i6th", "stickied": false, "body": "A point to remember:\n\nYou have two possible states you can be in. You want to fall asleep, or you don’t want to fall asleep.\n\nYou can also be falling asleep, or not falling asleep.\n\nIf the state that you are in matches what you want to be doing, it’s not terribly noticeable. If it doesn’t, it stands out.\n\nSo all the times that you don’t want to be falling asleep and are wide awake. It’s not very noticeable. Similarly, if you want to go to sleep and you actually fall asleep, it’s not noticeable.\n\nBut if you want to stay awake and are falling asleep, that’s a problem and stands out. Likewise, if you want to fall asleep but you’re wide awake, that’s a problem and is very noticeable.\n\nUnless you have a clinical sleep issue, you probably spend most of your time doing exactly what you want to be doing, but the times when you don’t stand out and get more of both your attention and memory.", "is_submitter": false, "distinguished": null, "created_utc": 1628984460.0, "parent_id": "t3_p4i6th", "replies": [{"author": "maibrl", "id": "h90ihvk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4i6th", "stickied": false, "body": "That would be confirmation bias right?", "is_submitter": false, "distinguished": null, "created_utc": 1629020647.0, "parent_id": "t1_h8yxnxv", "replies": []}]}, {"author": "NoSuchKotH", "id": "h8ywwwv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p4i6th", "stickied": false, "body": "Can have many reasons. Some of them are psychological, some of them are physical. The psychological stuff is hard to tell without knowing you, but generally boils down to stress or stress like things disturbing your sleep. The physical ones start from external factors (temperature, noise etc) and go to internal factors (hormone levels, daily schedule).\n\nIt helps if you go to bed at same time and get up at the same time every day, including weekends. Especially if your hormonal cycle is messed up. For the other things, you'd need to be more specific what makes your sleep at night less restful.", "is_submitter": false, "distinguished": null, "created_utc": 1628984082.0, "parent_id": "t3_p4i6th", "replies": [{"author": "keyless-hieroglyphs", "id": "h9vvyky", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #149", "submission": "p4i6th", "stickied": false, "body": "Thank you for your reflections. I have contemplated a bit and have some insights. \n\n- Physical side: better over the years. E.g. temperature. I generated too much heat for bedding. Now minimum bedding and better temperature distribution. I live in cold climate. Hypothesis: in outdoor clothing and bedding, our heads are more exposed. To avoid getting cold, we may naively clothe up or increase indoor temperature.\n- Caffeine. I could do well to avoid caffeine after noon. I don't think it is an effective banisher of sleep for me, but it can influence rest for various reasons.\n- Psychology. I do a lot of it wrong. Before going to bed weekdays, I rebelliously try to squeeze in one more thing in and finish up, e.g. shower, rather than go with the rhythm, which even can be interrupted. This should have an awakening undoing any natural winding down.\n- When the system is free to do as it likes, I easily sleep for at least eight hours, regardless of starting point. Weekdays I can stress myself to be able to get up in the morning, which more than likely is before the desired time. During awakening I find myself floating to the surface with the reasons to get up, if there are none, I sleep on... this explains the weekends, when I also go to bed later.\n- A weekend experiment. I felt drowsiness coming on and obeyed. With the least preparation, I found myself internally absorbed on a matter, concluded, then simply curled up without turning off lights and drawing curtains. I was beyond care to do anything about it for four hours, on the good side of sleep. Midway I had a sip of water, drew the curtains and turned off lights, a slit of light peering at me from the window for maybe 1-2 hours. This did not feel so successful, on the bad side of sleep. I rose when I felt readier for the day. Now 2-3 hours later, I could have used more.\n- Some years ago, I experimented with a \"CO2\" measuring device. It was also highly sensitive to other bodily emissions, which seemed to happen naturally and regularly. I wildly speculated that the body had the same rhythm for these emissions as for the circadian and, if so, believed myself to be in excess of standard.\n\nI have little understanding of the hormones, but the above might constitute an abuse of the system.\n\nSome aspirations could be to:\n- Align life to be able to follow rhythm when it takes one, rely on the mechanisms more.\n- Get at rest or maybe darkness or inactivity will prey subtly on ones mind.\n- \"Upon retiring, sleep as if you had entered your last sleep. Upon awakening, leave your bed behind you instantly as if you had cast away a pair of old shoes.\"\n- Caffeine distribution earlier in the day than later.\n- (Seemingly) peering light can at least be an annoyance. It would tell me to get alert. Light is difficult to avoid at this latitude during summer. Sleep goes heywire for one or other reason.", "is_submitter": true, "distinguished": null, "created_utc": 1629617340.0, "parent_id": "t1_h8ywwwv", "replies": []}]}, {"author": "Happy_INTP", "id": "h93267j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #69", "submission": "p4i6th", "stickied": false, "body": "The fact that you are dozing off during the day may be what is making it difficult to sleep at night.  :)", "is_submitter": false, "distinguished": null, "created_utc": 1629065922.0, "parent_id": "t3_p4i6th", "replies": []}]}