{"title": "Those of you living in areas who will be affected by tropical cyclone Henri, what are you doing about/during it?", "name": "t3_p8ze3f", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p8ze3f/those_of_you_living_in_areas_who_will_be_affected/", "selftext": "I know a large portion of reddit user base lives in the northeast US and we're not used to this tropical bullshit at all. So, if you're not too busy preparing to mess around on reddit, what's your situation and what's your plan?\n\nI live in a coastal city within the width that could get hurricane force winds. I'm far enough from the actual shoreline that I don't have to evacuate, and I'm on the third floor so my place won't get direct flooding, but we're going to go a bit inland and stay with some family. They have about the same wind forecast, it's not far, but they live on a hill and a main road so the streets are less likely to be flooded or have a mess of trees and power lines making it unsafe to drive afterwards.", "score": 2, "upvote_ratio": 0.76, "permalink": "/r/TheFlyingTree/comments/p8ze3f/those_of_you_living_in_areas_who_will_be_affected/", "id": "p8ze3f", "author": "KuriousKhemicals", "link_flair_text": "Event", "num_comments": 8, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629580284.0, "comments": [{"author": "Cognizant_Psyche", "id": "h9ug6f0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "p8ze3f", "stickied": false, "body": "Oooh you mean *Hurricane* Henri, you are saying what I was saying but in a different way.\n\nAll joking aside yeah, these storms are no joke, more often than not they are just strong storms with little impact, but seemingly unimpressive storms can turn disastrous with one variable change and inflict catastrophic damage. Living in the south and dealing with them all the time I know better than to take chances, better safe than sorry. Best of luck fellow arborist, stay safe.", "is_submitter": false, "distinguished": null, "created_utc": 1629588054.0, "parent_id": "t3_p8ze3f", "replies": [{"author": "KuriousKhemicals", "id": "h9ui8l0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "p8ze3f", "stickied": false, "body": "I described it that way because it might weaken back to TS before it landfalls, it's right on the border of Cat 1. Cyclone refers to both.\n\nAnd we get other types of storms here with AFAIK less wind speed that usually make a mess of branches and tear down some power lines, so I'm not exactly expecting \"little impact\" either way.", "is_submitter": true, "distinguished": null, "created_utc": 1629589065.0, "parent_id": "t1_h9ug6f0", "replies": [{"author": "Cognizant_Psyche", "id": "h9uj5hs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "p8ze3f", "stickied": false, "body": "Oh I know, I was referencing a very old video joke by Group X while being facetious. Best of luck to you.", "is_submitter": false, "distinguished": null, "created_utc": 1629589513.0, "parent_id": "t1_h9ui8l0", "replies": []}]}]}, {"author": "S_thyrsoidea", "id": "h9uz3gx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "p8ze3f", "stickied": false, "body": "> I know a large portion of reddit user base lives in the northeast US and we're not used to this tropical bullshit at all.\n\nHuh.  [AP is saying](https://apnews.com/article/henri-weather-what-to-know-fa093f1fbf970c6b3ae58dabb6e86bda) we haven't had a proper hurricane in 30 years.  Whereas I'm thinking, whaddaymean we just had one, uh, the other year... Okay, I'm old, fine.\n\nI'm not particularly flustered by it even if it still looked like it would pack any punch when it got to Boston, which is presently does not.  I'm inland, in an upper floor apartment, I'm prepared for a blackout, I don't have anywhere to be and I don't have a car to worry about.\n\nCurrent forecasts for my area are as much as an inch of rain and 15mph winds, which is a shower and a stiff breeze.", "is_submitter": false, "distinguished": null, "created_utc": 1629597369.0, "parent_id": "t3_p8ze3f", "replies": []}, {"author": "Parking_Pineapple440", "id": "h9vgz5t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #224", "submission": "p8ze3f", "stickied": false, "body": "I’m at college so we’re just trying to stay in. Hoping I can make a quick trip before it comes in.", "is_submitter": false, "distinguished": null, "created_utc": 1629606731.0, "parent_id": "t3_p8ze3f", "replies": []}, {"author": "FreyjaSunshine", "id": "h9vtrd5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #161", "submission": "p8ze3f", "stickied": false, "body": "I'm traveling to New England in a week and a half.  Hope it's still there then.", "is_submitter": false, "distinguished": null, "created_utc": 1629615567.0, "parent_id": "t3_p8ze3f", "replies": []}, {"author": "Barisaxgod", "id": "h9wqhsi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #57", "submission": "p8ze3f", "stickied": false, "body": "I’m in Westchester County. I’m at the top of a hill, and it looks like the rain right here won’t be too torrential. I’m just sitting tight with plenty of non-perishable food.", "is_submitter": false, "distinguished": null, "created_utc": 1629640281.0, "parent_id": "t3_p8ze3f", "replies": []}, {"author": "entropyStable", "id": "h9xp7eb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "p8ze3f", "stickied": false, "body": "Treat it like you would a bad winter storm for preparation. It will be wet. Lots of tree branches will come down on the road making power restoration slow. Enjoy your day or two off work. \n\nMake sure you have 40 bucks in cash so you can buy something at the local corner store if needed.", "is_submitter": false, "distinguished": null, "created_utc": 1629655585.0, "parent_id": "t3_p8ze3f", "replies": []}]}