{"title": "Stochastic or chaotic history?", "name": "t3_pdj6p5", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pdj6p5/stochastic_or_chaotic_history/", "selftext": "Do you subscribe to more of a stochastic view or a chaotic view of history?\n\nBy stochastic I mean that given enough human beings (i.e. all of recorded history) human-driven events are fairly predictable; random and infrequent *natural* events like the Black Plague or a meteor impact could have a truly novel impact on the course of events, but sociological forces will tend to steer in the same direction no matter which individuals are involved. Under this theory, if you could go back in time and prevent Hitler from being born (or get him into art school), most likely someone else in German society would have taken his place and perpetrated the same sort of evils, though perhaps with some different details. Whatever inventions may have been brewing in the minds of people killed or records of companies destroyed on 9/11, they were likely invented anyway, albeit perhaps 5-10 years later; and if the CIA/FBI had caught Bin Laden's plot in the first place, something similar was still likely to happen eventually.\n\nBy chaotic I mean in keeping with chaos theory; that if you change any element, even seemingly small ones, the divergence in outcomes may be immense. If you went back in time and caused Hitler's mother to miscarry, the entire Holocaust may have been prevented, the discovery and regulation of nuclear technology may have developed completely differently, and LGBTQ rights may have advanced three generations ahead of schedule; or the Soviets may have taken over Europe, beat the US to the nuclear bomb, and absorbed China, eventually merging into a communist one-world-government by the 21st century. 9/11 could have set our technology back decades in the talent and records that were lost. Even delaying some ordinary person from leaving home on the day they will have a fatal heart attack, so that they die at home instead of on the subway, could have an enormous ripple effect depending on who witnesses that death and where they do or don't go on that day as a result, potentially changing major events for all of humanity.\n\nPersonally I lean toward a stochastic view. History just looks so damn repetitive on the long view - and there are also a number of instances where the same idea was clearly discovered independently around the same time by people who didn't know about each other at the time, like Leibniz and Newton inventing calculus. Humans once exceeding the hundreds of thousands seem like a stochastic system, like molecules of a liquid - you can't say which ones will happen to leave the bulk, but it has a boiling temperature. But I am interested in arguments either way or just a tally of opinions.", "score": 2, "upvote_ratio": 0.76, "permalink": "/r/TheFlyingTree/comments/pdj6p5/stochastic_or_chaotic_history/", "id": "pdj6p5", "author": "KuriousKhemicals", "link_flair_text": "Discussion", "num_comments": 6, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630189194.0, "comments": [{"author": "shig23", "id": "haqn2v7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pdj6p5", "stickied": false, "body": "Sounds like a repackaging of the age old Great Man vs historical trends debate. I take a middle approach: I think the Holocaust would not have happened without Hitler and his cohort; but I don’t think they would have gained prominence if not for Germany’s defeat in WWI, the Great Depression, etc. History is far too complicated to accurately simulate right now, and until we can, asking what would happen if we removed certain pieces (or gave Spartacus a Piper Cub) is a fun diversion but nothing more.", "is_submitter": false, "distinguished": null, "created_utc": 1630192195.0, "parent_id": "t3_pdj6p5", "replies": [{"author": "KuriousKhemicals", "id": "haqo72r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pdj6p5", "stickied": false, "body": "Well if anything that seems like evidence for stochasticity - despite being by all objective metrics a pretty intellectually high performing person, this idea is SO unoriginal that it already has a name. There are possibly thousands of people who have already come up with every idea I'll ever have. Nothing new under the sun.\n\nYou didn't have to call it \"repackaging,\" though. That implies I knew and was trying to pass something off that I got somewhere else.", "is_submitter": true, "distinguished": null, "created_utc": 1630192754.0, "parent_id": "t1_haqn2v7", "replies": []}]}, {"author": "BaddDadd2010", "id": "haqp3bp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #50", "submission": "pdj6p5", "stickied": false, "body": "Both.  Tiny changes will amplify, so delaying some ordinary person from leaving home will lead to different people being born in 9 months.  That includes the few people like Hitler and Stalin whose personalities and actions had huge effects on history. \n\nBut that doesn't mean sociological forces won't tend to steer in the same direction, and grand arcs of history won't occur.  Inventions and scientific advances will still occur, though the timing will vary.", "is_submitter": false, "distinguished": null, "created_utc": 1630193198.0, "parent_id": "t3_pdj6p5", "replies": [{"author": "KuriousKhemicals", "id": "haxd6gd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pdj6p5", "stickied": false, "body": "I guess the question is, do those tiny changes actually amplify indefinitely, or do they eventually get averaged and smoothed out? In the molecular analogy, any molecule could randomly get a bump that sends it at a much higher than average speed, but it very likely will subsequently undergo collisions that slow it down again. The stochastic hypothesis would be essentially that there were maybe 100 possible Hitlers at the time, due to the historical conditions that already existed, and the fact that 99 of them did not become the Hitler we know is *because* that Hitler happened to fall into the niche and begin developing the earliest. Had the actual Hitler been diverted, then one of the others would have been free to develop.\n\nIt just doesn't sound right to me that there was only *one individual* in existence at the time with the right combination of ideology, personality, ambition, and charisma to do what he did - given how many people were willing to follow him, not just those who went along but a substantial number of people who were enthusiastic and gave him credibility in the early stages and genuine loyalty in the later ones. Without those enablers, he couldn't have done anything, and the very existence of enough enablers suggests to me that there were others who could have taken his place.", "is_submitter": true, "distinguished": null, "created_utc": 1630330158.0, "parent_id": "t1_haqp3bp", "replies": []}]}, {"author": "BuccaneerRex", "id": "hat2m3c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pdj6p5", "stickied": false, "body": "It's both. \n\nI think history is both stochastic and chaotic. On the whole people are predictable, but there is no possible way to predict the future from that fact, because on the scales at which it is true, it is itself a chaotic element.\n\nThere's a concept I came across recently called 'Computational irreducibility'. \n\nBasically, while the laws of physics aren't ever violated, they're not always predictable. Due to uncertainty, complexity, and the unique contingencies of a single event in spacetime, we are not able to compute the outcome of physical events; i.e. the only way to figure out the outcome is to let it play out in real time. \n\nPretty much any quantum system above a few dozen particles is going to be computationally irreducible. \n\nSo the idea that things that are emergent from systems that themselves are multiply emergent from the already impossible to predict fundamental level can be predicted to this extent is simply silly.  \n\nTo borrow a quote I saw in the favorite quotes thread, 'No man can step in the same river twice because it's not the same river and he's not the same man' -- Heraclitus \n\nThere's also the physical eternalist view of physics in which the past,present, and future are all fixed and 'now' is simply the sweep of a 3D slice through the 4D bulk universe.", "is_submitter": false, "distinguished": null, "created_utc": 1630247790.0, "parent_id": "t3_pdj6p5", "replies": []}, {"author": "obiwanlenobi", "id": "haxa0ok", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pdj6p5", "stickied": false, "body": "More chaotic than stochastic. Although there are some patterns throughout history, I would say that for the most part it's chaotic. Sometimes all it takes is one chaotic event to set off a chain of other chaotic events, just look at how war starts. Even though people come up with several theories about the patterns in history, you can always find examples that contradict them.", "is_submitter": false, "distinguished": null, "created_utc": 1630328575.0, "parent_id": "t3_pdj6p5", "replies": []}]}