{"title": "\"I'm gonna sell propane and propane accessories!\" Unexpected respect for baby Hank Hill", "name": "t3_otmem7", "url": "https://www.reddit.com/r/TheFlyingTree/comments/otmem7/im_gonna_sell_propane_and_propane_accessories/", "selftext": "I watched a lot of the Simpsons when I was a kid - probably the majority of the first 10-12 seasons. The creator was from my hometown so the sarcastic take on \"small town America\" was relatable. Just recently at the age of 30 my partner started showing me Family Guy, which is fascinating for its distinct New England flavor of the same sorts of humor. And then there's the more adult shows I liked even before the Netflix era: Star Trek, especially DS9 but at least all the first 4 series; Buffy the Vampire Slayer, House MD, Six Feet Under.\n\nKing of the Hill was on either before or after the Simpsons on Sundays but it never really caught my attention. I thought recently that was another family humor cartoon from the same era I really should be familiar with, though I have little to no connection to Texas (other than as an object of ridicule in the Bush era). I'm only a few episodes in but I was really struck by the flashback to baby Hank Hill saying he wanted to sell propane and propane accessories, if his grades were good enough - while his friends wanted to be astronauts and stuff. Of course thatsthejoke.jpg but damn, imagine having such an attainable vision of your adulthood. No disappointed astronaut dreams, but also no self sabotaging family baggage.", "score": 4, "upvote_ratio": 0.83, "permalink": "/r/TheFlyingTree/comments/otmem7/im_gonna_sell_propane_and_propane_accessories/", "id": "otmem7", "author": "KuriousKhemicals", "link_flair_text": "Discussion", "num_comments": 2, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1627517399.0, "comments": [{"author": "dashingThroughSnow12", "id": "h6wqwdh", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "otmem7", "stickied": false, "body": "Hank is a simple man with a complicated life.", "is_submitter": false, "distinguished": null, "created_utc": 1627525632.0, "parent_id": "t3_otmem7", "replies": [{"author": "Lord_Cellow", "id": "h6xcj9i", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #41", "submission": "otmem7", "stickied": false, "body": "That is strangely poetic and fits the show wonderfully.", "is_submitter": false, "distinguished": null, "created_utc": 1627538698.0, "parent_id": "t1_h6wqwdh", "replies": []}]}]}