{"title": "Why should I bother when humanity is a disaster?", "name": "t3_p1cqke", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p1cqke/why_should_i_bother_when_humanity_is_a_disaster/", "selftext": "The IPCC report came out and while it's zero percent surprising, it's incredibly depressing. And yet the media has the task to act like any of this was unforseen. Guys. For like 30 years *every* prediction about climate change that was put to the test happened ahead of schedule, because there are shitloads of positive feedback loops we didn't know about whereas negative feedback is what maintains equilibrium so we've had centuries to discover those. What the IPCC released today is probably *still* 10-20% on the optimistic side.\n\nI'm 31 years old. I learned about global warming (hadn't been politically renamed at that point) as a kid in school. I was 10 when Al Gore ran against George W. Bush; I favored Gore almost entirely on the basis of his concern for the issue. I've heard since then that his plan to tackle it was flawed and possibly a bit of a corporate handout like what happened with the ACA. Maybe that's so, I wasn't exactly a policy wonk at the age of 10 and at this point it seems pointless to comb through 20 year old policy proposals - but in retrospect, *fucking anything* would have been a worthy start.\n\nBush opposed the Kyoto protocol. US Republicans alternately pushed the line that climate change either wasn't real, wasn't harmful, wasn't caused and couldn't be stopped by humans, or simply refused to consider any policy that might help on free market grounds. Obama prioritized health care instead and then lost Congress and spent the rest of his presidency facing Senate obstructionism and playing whack-a-mole in the Middle East, though at least he did cultivate a position at the Paris accords - from which Trump promptly withdrew. China is building plenty of coal power plants. Bolsonaro is happy to let the Amazon get deforested. I am t i r e d.\n\nThis has been a looming problem since I was a little kid, and I haven't seen a major win my entire lifetime.  What emissions progress has been made, has been made almost exclusively by the natural process of supply and demand, with a small niche of concerned consumers driving more research until new technologies become profitable enough to compete with carbon emitting tech. It's not enough and doesn't come early enough for this kind of problem. We had A LOT of warning and maybe could have limited warming to what we see today, if we had started converting the exponential increase into a level-off and decline 20 years ago. Instead, we'll keep heating up for decades even if emissions hit zero tomorrow. If humanity can't get its shit together and cooperate on this, why should I bother doing anything more aspirational than protecting my own little corner of the world against the flood? Caring doesn't fix anything. Arguing doesn't convince anyone. Politics is a shitshow. If nobody else cares enough about humanity as a whole, why should I put effort into contributing for the good of all?\n\nIt's funny, at the dawn of nuclear technology and for 20-30 years after, there was a sense that we were flirting with danger; much literature explored the possibility of a nuclear holocaust, citizen groups became uneasy and protest grew, and eventually, though we've grudgingly accepted our governments keeping the weapons, nuclear power became unpopular and only a minor component of our energy supply. The supreme irony is that such resistance solidified in the late 1960s, just as the carbon levels were starting to take off, and instead if we bring an environmental holocaust upon ourselves it's likely to be via the fossil fuels that we used at first innocently, then despite knowing their drawbacks, even though nuclear power could have significantly replaced them with little to no carbon load. Then again, maybe that's just what happens when intelligent beings handle such large amounts of energy, and it would have led to disaster either way. Or maybe humans are uniquely Icarian, and there are plenty of alien races who handled the energy needs of their civilization growth just fine, and have kept themselves hidden specifically because we always overreach and destroy everything we touch. \n\nSo yeah, I'm a bit down on humanity and disappointed that Star Trek Earth is largely not a possibility anymore. Nevermind warp travel and all, but utopian coexistence on Earth? That seemed like a possibility so long as it was only our own bickering over differences that limited us, and the climate clock still had time on it. I kind of want to go to Mars a la \"The Dispossessed\" and start over with people who get it and give a shit, or at least the Mars trilogy where it's being made suitable for life for the first time, a fresh start. We're going to need carbon capture at a minimum and probably geoengineering to save this place, and it still won't be the same, and frankly I don't know if we're gonna do it. Maybe we just have a population collapse from mass famine and hopefully I've moved to a defensible subsistence commune in Alaska by then.", "score": 40, "upvote_ratio": 0.88, "permalink": "/r/TheFlyingTree/comments/p1cqke/why_should_i_bother_when_humanity_is_a_disaster/", "id": "p1cqke", "author": "KuriousKhemicals", "link_flair_text": "Discussion", "num_comments": 88, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628550201.0, "comments": [{"author": "calmlikeasexbobomb", "id": "h8d0tet", "score": 14, "subreddit": "TheFlyingTree", "author_flair": "Seeker #262", "submission": "p1cqke", "stickied": false, "body": "Wait until you find out just how much of this was put in motion by the oil companies. How long ago they knew, what they’ve done to suppress action, how much money they’ve thrown at *not* addressing the problem. We have the technology and resources to fix this, what is lacking is the political will.", "is_submitter": false, "distinguished": null, "created_utc": 1628560774.0, "parent_id": "t3_p1cqke", "replies": [{"author": "DmitryTheRussianSpy", "id": "h8dxqd5", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #103", "submission": "p1cqke", "stickied": false, "body": "Welp, fuck humanity", "is_submitter": false, "distinguished": null, "created_utc": 1628582227.0, "parent_id": "t1_h8d0tet", "replies": [{"author": "PlsGiveMeBetterName", "id": "h8fd54p", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #91 | Consortii Concordus", "submission": "p1cqke", "stickied": false, "body": "we fuck ourselves, no need to ask for any more fuckage", "is_submitter": false, "distinguished": null, "created_utc": 1628612784.0, "parent_id": "t1_h8dxqd5", "replies": []}]}, {"author": "craftycontrarian", "id": "h8fft8v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #125", "submission": "p1cqke", "stickied": false, "body": "Are you saying this is already known and OP just doesn't realize it, or that you assume some major revelation is forthcoming?", "is_submitter": false, "distinguished": null, "created_utc": 1628613901.0, "parent_id": "t1_h8d0tet", "replies": [{"author": "calmlikeasexbobomb", "id": "h8gj9ug", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #262", "submission": "p1cqke", "stickied": false, "body": "The information is already out there. OP will get to it if they keep researching", "is_submitter": false, "distinguished": null, "created_utc": 1628630628.0, "parent_id": "t1_h8fft8v", "replies": []}]}, {"author": "Pleaseusesomelogic", "id": "h8hznqa", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p1cqke", "stickied": false, "body": "Wait until you find out 50 years from now that 99.9% of this is just the earth breathing in and out. Humans like to think that they control everything. They are by far overreaching thinking that they control the fate of a planet. Planetary Hubris, but politically motivated.", "is_submitter": false, "distinguished": null, "created_utc": 1628657001.0, "parent_id": "t1_h8d0tet", "replies": []}]}, {"author": "clovepod", "id": "h8ckoj1", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "p1cqke", "stickied": false, "body": "I read this thread today, and found it somewhat helpful. But indeed, I feel quite powerless. I’ve got 20 years more tired than you do. \n\nhttps://twitter.com/jessicathelaw/status/1424680492914331653?s=21", "is_submitter": false, "distinguished": null, "created_utc": 1628552976.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "Traditional_Meat1299", "id": "h8cn0uj", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seer", "submission": "p1cqke", "stickied": false, "body": "33 here. I feel like you do.", "is_submitter": false, "distinguished": null, "created_utc": 1628554118.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "S_thyrsoidea", "id": "h8d7yra", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "p1cqke", "stickied": false, "body": "Virtual hugs if you want 'em.  I just wanted to say: I see you.  You're not wrong about how bad it is, and how awful it is to be basically losing our future – all the grief and rage and despair.", "is_submitter": false, "distinguished": null, "created_utc": 1628564359.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "FlipSchitz", "id": "h8cmtsc", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Seeker #237", "submission": "p1cqke", "stickied": false, "body": "\nI feel like we need an environmentalist media machine like the right wing has.  They sell fake fear 24/7 and its meaningless.  We have real cause for concern and should be shouting this from the rooftops.", "is_submitter": false, "distinguished": null, "created_utc": 1628554024.0, "parent_id": "t3_p1cqke", "replies": [{"author": "yrogerg123", "id": "h8dezqm", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "p1cqke", "stickied": false, "body": "Lies are simple and truth is nuanced. You can have 100 experts agree on the science of climate change and 100 differing opinions about what to do about it.", "is_submitter": false, "distinguished": null, "created_utc": 1628568280.0, "parent_id": "t1_h8cmtsc", "replies": []}, {"author": "U_L_Uus", "id": "h8dtg01", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #119 | Classis Veritatus", "submission": "p1cqke", "stickied": false, "body": "Problem is, that same fake fear is more appealing than reality. Why would anyone very much uncapable of admitting they're wrong choose to face a reality that says \"humanity as a whole fucked up, which includes you\" rather than the honey-candy lie of \"those communists are bananas, that's part of the world order they want to impose\"?", "is_submitter": false, "distinguished": null, "created_utc": 1628578530.0, "parent_id": "t1_h8cmtsc", "replies": []}]}, {"author": "TSM-", "id": "h8cyzol", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #39", "submission": "p1cqke", "stickied": false, "body": "The only thing more sure than global warming is that it is systematically underestimated in order to seem credible in the face of corporate opposition. That's how it has been for decades among researchers and such reports.\n\nIn an equally exactly-as-expected twist, it turns out that people 50+ shrug it off but younger people who will be affected by it in their lifetimes actually think it matters.", "is_submitter": false, "distinguished": null, "created_utc": 1628559880.0, "parent_id": "t3_p1cqke", "replies": [{"author": "Happy_INTP", "id": "h8da7sb", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #69", "submission": "p1cqke", "stickied": false, "body": "Not all 50+, I've been an active recycler since the 70s and I learned that from my grandmother.  :)", "is_submitter": false, "distinguished": null, "created_utc": 1628565577.0, "parent_id": "t1_h8cyzol", "replies": []}]}, {"author": "Kelyaan", "id": "h8cmt29", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p1cqke", "stickied": false, "body": "It's why I'm part of the VHEM - My bloodline ends with me as it would be the most immoral thing a human can do to drag a child into this existence.\n\nEnjoy it while the good times last. The earth will survive - Humanity wont.", "is_submitter": false, "distinguished": null, "created_utc": 1628554014.0, "parent_id": "t3_p1cqke", "replies": [{"author": "yrogerg123", "id": "h8det7n", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "p1cqke", "stickied": false, "body": "Both will survive. Just not in any recognizable form. Humans are extremely resilient and have survived ice ages, plagues, and hundreds of thousands of years at the bottom of the food chain. The species will make it. Modern society will not.\n\nI think there is a mass extinction coming, but 99.9% of humanity is not 100%, and there will be humans who survive and rebuild, and end up with something resembling a society. \n\nI guess if runaway greenhouse ends up looking like Venus, then we won't, but I think that cataclysmic climate change is just that: cataclysmic climate change. Societies will collapse, millions or billions will die, but the species survives.", "is_submitter": false, "distinguished": null, "created_utc": 1628568176.0, "parent_id": "t1_h8cmt29", "replies": [{"author": "Kelyaan", "id": "h8dg9i4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p1cqke", "stickied": false, "body": "There are people who have panic attacks at meat emoji's ... there is no chance some humans would survive any major race changing event like that. Might just be me being pessimistic but I doubt we do with how soft we've become as a race.", "is_submitter": false, "distinguished": null, "created_utc": 1628569041.0, "parent_id": "t1_h8det7n", "replies": [{"author": "modernzen", "id": "h8eqg14", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #46", "submission": "p1cqke", "stickied": false, "body": "\"There exist some people who have silly panic attacks, therefore there is ZERO chance that ANY humans at all will survive\". Seems logical to me.", "is_submitter": false, "distinguished": null, "created_utc": 1628602872.0, "parent_id": "t1_h8dg9i4", "replies": [{"author": "Kelyaan", "id": "h8faaom", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p1cqke", "stickied": false, "body": "If humanity is that fragile where people get panic attacks over emoji's then as a race I can say we've gone beyond a point of return where people will be able to survive without the cushion of technology.", "is_submitter": false, "distinguished": null, "created_utc": 1628611601.0, "parent_id": "t1_h8eqg14", "replies": [{"author": "DELETED", "id": "h8fi44x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p1cqke", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628614851.0, "parent_id": "t1_h8faaom", "replies": [{"author": "Kelyaan", "id": "h8fza3x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p1cqke", "stickied": false, "body": "Love how you think it's political - I can tell just from you trying to make it so what type of person you are and from that I know no rational outlet would ever convince you that these people exist.  \n\n\nLet's just say no \"propagandist\" told me they exists, I saw it first hand so nice try there.", "is_submitter": false, "distinguished": null, "created_utc": 1628622049.0, "parent_id": "t1_h8fi44x", "replies": []}]}]}]}, {"author": "yrogerg123", "id": "h8dh5jr", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "p1cqke", "stickied": false, "body": "The soft will die. Every last one of them.  But there are people climbing mountains with no oxygen, free climbing a thousand feet of sheer rock face, free diving hundreds of feet, running ultra marathons. And some of them will survive whatever comes. We're not all the same. Some of the strong will survive.", "is_submitter": false, "distinguished": null, "created_utc": 1628569588.0, "parent_id": "t1_h8dg9i4", "replies": [{"author": "veringer", "id": "h8dtsnd", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #87", "submission": "p1cqke", "stickied": false, "body": "It's not going to be an instantaneous collapse, like a meteor impact. It's going to be a deterioration over years or decades. My money's on the people who can balance cooperation and credible defense. A loner survivalist super-man isn't going to be better off than a bunch of rational-minded normal people working together.", "is_submitter": false, "distinguished": null, "created_utc": 1628578822.0, "parent_id": "t1_h8dh5jr", "replies": []}, {"author": "Kelyaan", "id": "h8e63zx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p1cqke", "stickied": false, "body": "There are people climbing without oxygen ... but with help from other people and help from technology. I don't think even the \"hard\" humans will survive.", "is_submitter": false, "distinguished": null, "created_utc": 1628589755.0, "parent_id": "t1_h8dh5jr", "replies": []}]}, {"author": "THF-Killingpro", "id": "h8euj2w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "Well, I think every person that can think enough rationaly will not work together with these peopel and natural selection will start to work again. It is just my theorie, but since we live in an advanced society natural selection isn't really a thing anymore. So people who wouldn't survive natural selection will survive it( not even directly talking about disabled people). But they will die in such an case... And there will be some people that will survive it, because not everyone is an idiot", "is_submitter": false, "distinguished": null, "created_utc": 1628604783.0, "parent_id": "t1_h8dg9i4", "replies": []}]}]}, {"author": "ystwyth", "id": "h8cqj51", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "I'm okay with that. I think Agent Smith basically had it right.", "is_submitter": false, "distinguished": null, "created_utc": 1628555808.0, "parent_id": "t1_h8cmt29", "replies": [{"author": "AKnightAlone", "id": "h8d03ps", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": ">Agent Smith basically had it right.\n\nHugo Weaving has a *veritable veracity* with words *very* much of the time in his movies.", "is_submitter": false, "distinguished": null, "created_utc": 1628560424.0, "parent_id": "t1_h8cqj51", "replies": [{"author": "S_thyrsoidea", "id": "h8d6tvx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "p1cqke", "stickied": false, "body": "Iswydt", "is_submitter": false, "distinguished": null, "created_utc": 1628563774.0, "parent_id": "t1_h8d03ps", "replies": []}]}]}, {"author": "KuriousKhemicals", "id": "h8ezxk9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "p1cqke", "stickied": false, "body": "I don't see much point in voluntary human extinction. For yourself, individually, if you can't morally justify creating a child then okay. But as to the overall goal, without humanity I don't really have any frame of reference for what a desirable future would be. Our domestic farm animals will probably suffer and die with us, the pet animals will almost certainly be worse off, many wild species are doomed whether we survive or not, some wild species may be benefited if we disappear, and new species will arise whose relationship to our existence or non-existence cannot be reasonably predicted. Without the motivation of myself, my descendants, or humanity overall, how can I possibly say what is a better or worse way for the Earth to turn out?\n\nMore personally, I've always passionately wanted to have a child. I deeply resent the fact that I'm forced to even consider it might be in a hypothetical child's best interest not to exist. Deciding I won't would feel like giving up on being myself and resigning to just going through the motions of existence until I die.", "is_submitter": true, "distinguished": null, "created_utc": 1628607183.0, "parent_id": "t1_h8cmt29", "replies": [{"author": "Kelyaan", "id": "h8fanc1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p1cqke", "stickied": false, "body": "Here's the wording for it.  \n\n\n> I've always passionately wanted to have a child.\n\nYou want one, it's a want to sate your own desires and needs, to bring a life into existence to sate your own wants. So you would bring a sentient living being into this world to suffer and ache through potentially 80 years of life just because you wanted a child.", "is_submitter": false, "distinguished": null, "created_utc": 1628611750.0, "parent_id": "t1_h8ezxk9", "replies": []}]}]}, {"author": "Quetzatcoatl93", "id": "h8czzm4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #270", "submission": "p1cqke", "stickied": false, "body": "Look I'm not the owner of this channel but since I don't think i'm the right person to say anything on this topic here...\n\n[https://youtu.be/uqwvf6R1\\_QY](https://youtu.be/uqwvf6R1_QY)\n\nthis is a delicate subject and I'm sorry that I don't have an answer for you I'm 28 but like other people here all I can tell you is, do your best, recicle, reuse, reduce like they taught us at school, try to have friends and family take some approach on the matter but it also comes down to big companies, they cause a whole lot more waste than you or me could ever hope to produce in a lifetime, don't give up on hope, we have to give our best if we want to keep this planet alive and us with it", "is_submitter": false, "distinguished": null, "created_utc": 1628560370.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "Alpha-Charlie-Romeo", "id": "h8d5y49", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #217", "submission": "p1cqke", "stickied": false, "body": "Because if you stop bothering then you also become a disaster.\n\nYou were supposed to destroy the Sith, not join them!", "is_submitter": false, "distinguished": null, "created_utc": 1628563322.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "IonOtter", "id": "h8dio34", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #112", "submission": "p1cqke", "stickied": false, "body": " >\"...disappointed that Star Trek Earth is largely not a possibility anymore.\"\n\nDon't forget that Earth went through World War 3, from 2026 to 2053.  And it wasn't until 2063 that [Zefram Cochrane established warp drive and made contact with the Vulcans.](https://www.youtube.com/watch?v=bCt0bB7Dva4)", "is_submitter": false, "distinguished": null, "created_utc": 1628570559.0, "parent_id": "t3_p1cqke", "replies": [{"author": "KuriousKhemicals", "id": "h8ec1f9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "p1cqke", "stickied": false, "body": "World wars are ultimately a human problem that ceases under human decisions or human extinction. Unless you mean... nuclear war could force climate in the other direction? There's no indication that ST Earth went through a type of problem that gets so radically out of human control.\n\nAlso, 2026 to 2053, is that from TOS? I tend to go with the DS9/VOY retcon where Sanctuary riots happen in 2024 and the timeline of the Eugenics Wars is highly uncertain.", "is_submitter": true, "distinguished": null, "created_utc": 1628594458.0, "parent_id": "t1_h8dio34", "replies": []}]}, {"author": "Some_Animal", "id": "h8dlfiw", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #118", "submission": "p1cqke", "stickied": false, "body": "When the peaceful, legal route fails, what is left to those trying to make a change than a trolly problem?", "is_submitter": false, "distinguished": null, "created_utc": 1628572396.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "sparant76", "id": "h8dt65m", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #51", "submission": "p1cqke", "stickied": false, "body": "Because there’s no second option", "is_submitter": false, "distinguished": null, "created_utc": 1628578302.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "enhtie", "id": "h8ctnt7", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #67", "submission": "p1cqke", "stickied": false, "body": "i have honestly already given up at this point. i’m 16, turning 17 soon so i grew up with teachers and adults educating me on climate change. however, since then, things have only slowly worsened.\n\ni used to think that i should try to do something to help, then i began to think that i should just live the remainder of my life to the fullest and not worry about climate change, since i might be old by the time it takes any serious effect. now, however, i realise that this is coming a lot sooner than i originally thought and it’s caused me to lose hope. \n\nive come to the conclusion that we, as average people, can’t do anything about it. it doesn’t matter if we turn off our lights when exiting the room or use less water, because the majority of our population won’t change, and the people who are actually eating up our resources won’t change. \n\ni came to the conclusion that when it comes down to survival, money and power is important in society. we could all go on the streets and protest like greta thunberg but has her actions actually changed anything? my current goals are just to study and work hard so that when resources become scarce, i won’t be the one sacrificed.", "is_submitter": false, "distinguished": null, "created_utc": 1628557310.0, "parent_id": "t3_p1cqke", "replies": [{"author": "Golden-Snowflake", "id": "h8dwd28", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "p1cqke", "stickied": false, "body": "Nahh, we have single people, piloting ships that can carry the oil, of a few million folks, yearly usage... so yeah nahh....  \n\n\nEdit\\* a few million, anywhere but America.", "is_submitter": false, "distinguished": null, "created_utc": 1628581011.0, "parent_id": "t1_h8ctnt7", "replies": [{"author": "enhtie", "id": "h8ian1x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #67", "submission": "p1cqke", "stickied": false, "body": "i mean yeah, i don’t disagree with this, but at the same time i alone or even a few hundred people together can’t do much, not without power and money", "is_submitter": false, "distinguished": null, "created_utc": 1628665265.0, "parent_id": "t1_h8dwd28", "replies": [{"author": "Golden-Snowflake", "id": "h8ifxmx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "p1cqke", "stickied": false, "body": "Power and money have magnified the ability of a single persons ability to fuck up the planet, around a million fold.   \n\n\nIt takes a truly impressive group of would be do gooders, to counter that.", "is_submitter": false, "distinguished": null, "created_utc": 1628669918.0, "parent_id": "t1_h8ian1x", "replies": [{"author": "olkver", "id": "h8l5f4r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #279 | Legio Virtus", "submission": "p1cqke", "stickied": false, "body": "[this](https://en.m.wikipedia.org/wiki/Churchill_Club)is such an impressive group. They did something and inspired others.", "is_submitter": false, "distinguished": null, "created_utc": 1628718954.0, "parent_id": "t1_h8ifxmx", "replies": [{"author": "WikiSummarizerBot", "id": "h8l5gj1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "**[Churchill Club](https://en.m.wikipedia.org/wiki/Churchill_Club)** \n \n >The Churchill Club (Danish: Churchill-klubben) was a group of eight teenage schoolboys from Aalborg Cathedral School in the north of Jutland who performed acts of sabotage against the Germans during the occupation of Denmark in the Second World War. The Churchill Club was one of the earliest resistance group to be formed in Denmark. Under the leadership of 15-year-old Knud Pedersen, their activities began at the end of 1941 when they began to target the German occupation forces in Aalborg to imitate the resistance of Norwegian soldiers. They succeeded in carrying out 25 acts of sabotage before they were arrested by the police in May 1942.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/TheFlyingTree/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)", "is_submitter": false, "distinguished": null, "created_utc": 1628718970.0, "parent_id": "t1_h8l5f4r", "replies": []}]}]}]}]}, {"author": "FirstUser", "id": "h8e05kr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #127", "submission": "p1cqke", "stickied": false, "body": "> it doesn’t matter if we turn off our lights when exiting the room or use less water, because the majority of our population won’t change\n\nWe  should probably aim at being smarter than the majority... Wasting energy and water is foolish, I think that's enough of a reason not to do it. The day will come when we regret every little bit we wasted.", "is_submitter": false, "distinguished": null, "created_utc": 1628584360.0, "parent_id": "t1_h8ctnt7", "replies": [{"author": "enhtie", "id": "h8iaqj2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #67", "submission": "p1cqke", "stickied": false, "body": "of course, i don’t think we should be wasteful per se. however, i’m not going to stop using my ac or count the seconds that my tap is turned on, because it wouldn’t do much at all.", "is_submitter": false, "distinguished": null, "created_utc": 1628665346.0, "parent_id": "t1_h8e05kr", "replies": []}]}, {"author": "eliminating_coasts", "id": "h8e5s4n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #129", "submission": "p1cqke", "stickied": false, "body": "> ive come to the conclusion that we, as average people, can’t do anything about it. it doesn’t matter if we turn off our lights when exiting the room or use less water, because the majority of our population won’t change, and the people who are actually eating up our resources won’t change.\n> \n> i came to the conclusion that when it comes down to survival, money and power is important in society. we could all go on the streets and protest like greta thunberg but has her actions actually changed anything? \n\nThe other option to deal with this despair is to [go further than Greta](https://www.youtube.com/watch?v=8c2f_JmzoWU&t=4s); the extinction rebellion people started off about 3 years ago and their ideas are based on three specific conclusions:\n\n- Whenever you get people to sit down and work through the issues, almost anywhere they land on the political spectrum, they recognise that the problem is serious and we need to act.\n\n- Normal political campaigning to raise awareness gets backlash from right wing media, and gets drawn into partisan culture wars.\n\n- But getting people to recognise there needs to be some solution is a lot easier, and there's a groundswell of people who just want to do *something*.\n\n- Research shows that principled, nonviolent resistance, if you can get enough people to do it, can actually force the hand of governments to push in a different direction.\n\nSo what's the answer? Demand that governments pass a law, that will set up a randomly selected group of citizens like a jury to look at expert opinions on climate change, how fast it needs to be dealt with, and what options are available, and then automatically pass whatever they decide as law.\n\nThat's it. No solution you're selling to people, just a commitment to get random ordinary citizens to grapple with the scale of the problem and decide what needs to be done.\n\nBecause the evidence of [past](https://www.climatechangenews.com/2019/06/27/irelands-world-leading-citizens-climate-assembly-worked-didnt/) \"citizens' assemblies\" shows, if you ask people to take some time off and actually look through it, people of every political persuasion come up with and agree concrete solutions, and so the demand that people just recognise the problem and sit down and deal with it is not just a glib emotional phrase, it's something specific you can actually demand.\n\nAll they need is volume, enough people pissed off enough to say\n\n\"\nDon't listen to us, don't do what *we* want, just because we're causing a fuss, recognise the problem and get other people to decide what to do, random people, we trust that they'll come to the right conclusion.\n\nAnd if you don't, we'll keep causing disruption, and intentionally getting arrested for it, until you take this seriously.\n\"\n\nIt's easy to participate in, you don't need to have everything figured out, you just need to be willing to put your feelings into action.\n\nAnd if enough people do this, their impact is far higher than any other kind of protest, even greater in impact than people violently attacking the government. Nonviolent civil disobedience on a meaningful and easy to understand cause is the most powerful thing you can do, if you want to change things.", "is_submitter": false, "distinguished": null, "created_utc": 1628589468.0, "parent_id": "t1_h8ctnt7", "replies": []}]}, {"author": "fastcarsandliberty", "id": "h8d14v5", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #207", "submission": "p1cqke", "stickied": false, "body": "Have a good time till you die", "is_submitter": false, "distinguished": null, "created_utc": 1628560932.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "sg_14", "id": "h8d4q39", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "I kid you not when I say climate change keeps me up at night everyday. These are the things I think about too and I’m afraid of all the other consequences that come with it like wars over natural resources, climate refugees, water and food scarcity etc. And to add to my worry, I think about our current situation with covid and how we’re so damn individualistic that we can’t bother to put a mask to help others and ourselves. Like if we can’t even do this then wtf are we going to do in these other critical situations.", "is_submitter": false, "distinguished": null, "created_utc": 1628562705.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "N2Gen", "id": "h8dfuff", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #20", "submission": "p1cqke", "stickied": false, "body": "35. I read the report this morning too. Everything felt just as bleak as you described \n\n\nI want to be optimistic and keep doing what I can as an individual , but it seems really hopeless on a broader scale.", "is_submitter": false, "distinguished": null, "created_utc": 1628568784.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "jcooli09", "id": "h8esay5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #101", "submission": "p1cqke", "stickied": false, "body": "I hear what your saying and largely agree.  I am not optimistic about the future of humanity or even of our current civilization.  If I were still a young man I would not have children.\n\nBut I do have kids, adult now, and I live in the current civilization.  This is just the reality I find myself in, and I have to operate entirely within it.  If I’m here anyway I generally want to do those things that tend to put humanity on a more likely path to solve all the issues above.  I can’t do much, but what I can I do.\n\nThe other thing I keep in mind is how often I am wrong.  I’m wrong a lot, especially when it comes to predicting the future.  I’m wrong often enough that my certainty regarding predictions is never high enough for me to feel confident that I’m right, even when I do.", "is_submitter": false, "distinguished": null, "created_utc": 1628603755.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "eliminating_coasts", "id": "h8ffjyj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #129", "submission": "p1cqke", "stickied": false, "body": ">If humanity can't get its shit together and cooperate on this, why should I bother doing anything more aspirational than protecting my own little corner of the world against the flood? Caring doesn't fix anything. Arguing doesn't convince anyone. Politics is a shitshow. If nobody else cares enough about humanity as a whole, why should I put effort into contributing for the good of all?\n\nA lot of people give a shit, if you're really serious that you want to know what kind of political attitude goes with the kind of hopelessness you're feeling, here's a video here that goes into it:\n\n[Advice to Young People as they face Annihilation](https://www.youtube.com/watch?v=dnpOnO71wno)\n\nThat's from Roger Hallam, one of the founders of extinction rebellion, and he argues that you need to be able to find ways to maintain your mental health and avoid burnout while also not relying on *hope*, which may seem counter-intuitive; often, people feel that the most important thing is to try and find hope in a better future in order to keep going, but when you're already hopeless, that's not what you need, instead you need to know how to keep moving and keep finding a sense of purpose and motion and life *while not having hope*. Because trying to trick yourself into feeling like there's hope when you don't see any evidence for it, risks moving away from truth and into self-deception.\n\nSo on those lines, if you think the world is completely fucked, why would you imagine that your commune in Alaska will be immune? A fantastical aspiration of being able to separate yourself from a world of intelligent human beings who will at some point *also* recognise that they need to be in places less affected by climate change, ([if that place even is capable of dealing with climate change](https://www.nationalgeographic.com/science/article/climate-change-finally-caught-up-to-this-alaska-village)) is like a mirror of wanting to distance yourself personally from the awful reality we currently face.\n\nAs the climate shifts, with uncertain consequences of changing circulations of global heat and water, and feedback loops pushing things further out of control, trying to work out exactly where will be the safe spot to stand is difficult.\n\nSo if you abandon even that hope, how can you keep going in that kind of situation?\n\nBy doing what you can.\n\nNot because you want other people to do it, but because if you can't run from death or pain, the only alternative is to fight it, and the only way you can get any satisfaction.\n\nI personally have a bit more hope, but I'm not going to try and share that with you. Firstly because I'm not sure my sense of hope would connect with you, but also because your sense of the seriousness of this situation is actually, potentially something productive.", "is_submitter": false, "distinguished": null, "created_utc": 1628613790.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "dcnairb", "id": "h8cuzoc", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #210", "submission": "p1cqke", "stickied": false, "body": "global warming wasn’t “politically renamed”, climate change is a broader umbrella term under which global warming fits. I agree with you that it’s exhausting though because it makes everything seem futile", "is_submitter": false, "distinguished": null, "created_utc": 1628557949.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "Happy_INTP", "id": "h8d1f9t", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #69", "submission": "p1cqke", "stickied": false, "body": "There are other measures where life is better than ever, less war, less infant mortality, less crime, more education, more access to health services, etc.  Dwelling on realities you cannot change does no one a service.  Life can be better, people are smarter, there is plenty of reason to hope if you look past all the problems.\n\nSo take a walk, get some sunshine, smile, act local, think global....  All of these cheesy slogans are actually good advice if you'd like a better life than the one you write about now.  :)", "is_submitter": false, "distinguished": null, "created_utc": 1628561074.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "chocol8cek", "id": "h8cksbm", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #107 | Legio Virtus", "submission": "p1cqke", "stickied": false, "body": "Tbh, I've started thinking of it as why not just enjoy what little life we have left before it all turns into a huge mess.\n\nNot saying that I don't do my bit to help the environment but there's only so much civilians can do. Instead of worrying myself over things that are out of my hands, I've now decided that I'd rather focus on my own peace of mind and build a good life for myself.\n\nAlso, tbh I do believe that something similar to Star Trek is definitely possible in the near to distant future. Humanity already has plans to colonise Mars. I think we'll survive. Earth is probably fucked beyond belief tho. Yea.", "is_submitter": false, "distinguished": null, "created_utc": 1628553026.0, "parent_id": "t3_p1cqke", "replies": [{"author": "04221970", "id": "h8clluk", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #110", "submission": "p1cqke", "stickied": false, "body": "Earth isn't fucked...it will just adjust to the new normal and populations of things will grow or fall depending on their fit for the new environments.", "is_submitter": false, "distinguished": null, "created_utc": 1628553430.0, "parent_id": "t1_h8cksbm", "replies": [{"author": "chocol8cek", "id": "h8clzgo", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #107 | Legio Virtus", "submission": "p1cqke", "stickied": false, "body": "Fair enough. I'm not versed enough in the environmental sciences to debate about it.", "is_submitter": false, "distinguished": null, "created_utc": 1628553617.0, "parent_id": "t1_h8clluk", "replies": []}, {"author": "XeroKibo", "id": "h8d3a8q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "Agreed. Plants the world over are already reacting to the change in climate. The Earth is greening.", "is_submitter": false, "distinguished": null, "created_utc": 1628561994.0, "parent_id": "t1_h8clluk", "replies": []}]}, {"author": "XeroKibo", "id": "h8d37de", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "I think we’ll figure it out in another 200-300 years; By then we’ll have colony ships down and hopefully the ability to terraform worlds. Maybe we even renew Earth’s gaiety to its former glory. \n\nI have hope for the future; We just have to make sure we get there.", "is_submitter": false, "distinguished": null, "created_utc": 1628561956.0, "parent_id": "t1_h8cksbm", "replies": [{"author": "Feste_the_Mad", "id": "h8d6eg7", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #242", "submission": "p1cqke", "stickied": false, "body": "Assuming global crop failure and city sized floods don't wreck civilization ala the Bronze Age collapse within the next few decades.", "is_submitter": false, "distinguished": null, "created_utc": 1628563552.0, "parent_id": "t1_h8d37de", "replies": [{"author": "XeroKibo", "id": "h8diex7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "The Nok people of Western Africa were entering their Iron Age and prospered for 2000 years more while the Mediterranean world was collapsing in their Bronze Age; Not all of the world will suffer the same way.\n\nThere could be different cultures/societies that exist already that are suited to survive the changes we’re seeing; I’m certain there are. \n\nIf it forces cultures/societies to adapt or go extinct: It will have been for the good; That’s just my opinion.", "is_submitter": false, "distinguished": null, "created_utc": 1628570393.0, "parent_id": "t1_h8d6eg7", "replies": [{"author": "Feste_the_Mad", "id": "h8fb8ee", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #242", "submission": "p1cqke", "stickied": false, "body": "The Nok people prospered because they weren't Mediterranean. They were away from the blast zone, as it were. The only one's who would be away from the blast zone of this Information Age Collapse would be the miniscule population that makes up the various uncontacted tribes in the world, and I see no reason why this event would bring them out of isolation, let alone figure out how to travel in space or friggin terraform.\n\nThat being said, do you have any resources about the Nok people? I do like soaking up historical knowledge.", "is_submitter": false, "distinguished": null, "created_utc": 1628611994.0, "parent_id": "t1_h8diex7", "replies": [{"author": "XeroKibo", "id": "h8fvq6b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "I think you’re presuming a lot about the crises we’re faced with; You don’t think civilizations like China, India, Pakistan, Russia, Nigeria, The U.S, Brazil, etc the list goes on will rebound? You really think they’d all fail to adapt? \n\nI can’t agree with this generalization; It’s too presumptuous. I don’t think all nations will be affected the same. Civilization as a whole will move on as it always has. \n\nThere’s a great video by Epimetheus on YT that I’ll link; He talks about the history of Nigeria as a whole but that begins with the Nok people. \nThere’s also a a few articles done by Nat Geo and Met Museum writers that are interesting. \n\nLinks:\n\nhttps://youtu.be/fMmkmHUAAO0\n\nhttps://www.metmuseum.org/toah/hd/iron/hd_iron.htm\n\nhttps://www.nationalgeographic.org/encyclopedia/nok-culture/\n\nHave fun! I love soaking stuff up too; And speculating! Let’s talk again, yeah?", "is_submitter": false, "distinguished": null, "created_utc": 1628620541.0, "parent_id": "t1_h8fb8ee", "replies": [{"author": "Feste_the_Mad", "id": "h8g3t91", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #242", "submission": "p1cqke", "stickied": false, "body": "I don't think these organized states will survive. I'm quite sure humanity will survive, and whatever's left will form successor states, just like the afternath of the fall of Roman Empire. If history is anything to go by, China will shatter before eventually reuniting (they're probably going to do that within the next few decades anyway, regardless of climate change).\n\nIf the worst comes to pass, the vast majority of humankind will be killed, and what survivors remain will be knocked back to a dark age, having to effectively start from scratch. Eventually, a great many of the hunter/gatherer tribes will settle back into sedentary lifestyles, and what you and I think of as civilization will be slowly brought back.\n\nI don't know about you, but I for one would very much like to avoid such a scenario.\n\n\nI may try playing in Nigeria next time I start up Crusader Kings 3. In any case, I would recommend [Extra History's series on the Bronze Age Collapse](https://youtu.be/KkMP328eU5Q), if you haven't already seen it. I would also implore you to check out r/AfterTheEndFanFork, which is about a very interesting post-post-apocalypse mod for Crusader Kings 2 and (at some point) Crusader Kings 3.", "is_submitter": false, "distinguished": null, "created_utc": 1628623973.0, "parent_id": "t1_h8fvq6b", "replies": [{"author": "XeroKibo", "id": "h8gh6bc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "You’ve given me much to think on; I’m going to be thinking of this for weeks now. I also play CK; I’ll definitely be trying the mod, friend.\n\nThank you for the argument in good faith. If thinkers as adamant as you remain: Humanity will be just fine.", "is_submitter": false, "distinguished": null, "created_utc": 1628629702.0, "parent_id": "t1_h8g3t91", "replies": [{"author": "Feste_the_Mad", "id": "h9xt5c5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #242", "submission": "p1cqke", "stickied": false, "body": "You truly warm my heart, my friend. Thank you. I tend to be hard on myself, so such a comment, at the end of a very nice and polite debate no less, is very touching.\n\nBtw, have you tried the mod yet?", "is_submitter": false, "distinguished": null, "created_utc": 1629657290.0, "parent_id": "t1_h8gh6bc", "replies": []}]}]}]}]}]}]}]}, {"author": "KuriousKhemicals", "id": "h8da7tq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "p1cqke", "stickied": false, "body": ">there's only so much civilians can do. [...] I've now decided that I'd rather focus on my own peace of mind and build a good life for myself.\n\nYeah, this is more what I meant. Haven't gotten through all the replies yet but a few already have responded like I mean true-mental-diagnosis depressing - I guess I should have anticipated that interpretation given reddit demography but I actually seem unusually resilient against depression. Being born in 1990 has been a rough timeline to grow up with though. Anyway, it's not like I plan to give up doing the right thing at a basic level, but that aspiration for humanity piece... just doesn't seem to be rewarded.", "is_submitter": true, "distinguished": null, "created_utc": 1628565577.0, "parent_id": "t1_h8cksbm", "replies": [{"author": "yrogerg123", "id": "h8dfbzf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #258", "submission": "p1cqke", "stickied": false, "body": "Life gets a lot easier when you just...give up. Ultimately, I don't want to be the savior of humanity, I just want to earn a living and have a loving family. Maybe humanity doesn't deserve to be saved.", "is_submitter": false, "distinguished": null, "created_utc": 1628568478.0, "parent_id": "t1_h8da7tq", "replies": []}]}, {"author": "According-Cat-6145", "id": "h8deycn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "Global warming, if not stopped, will eventually kill off the humans. Not Earth though. Earth will go into another ice age eventually and refresh itself once its killed everything off. The Earth won't let itself burn just like our bodies won't let us hold our breath until we die. Eventually we'll just pass out and wake back up.", "is_submitter": false, "distinguished": null, "created_utc": 1628568257.0, "parent_id": "t1_h8cksbm", "replies": []}]}, {"author": "AKnightAlone", "id": "h8d28uv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "As somewhere between a partial and full response to your predicament(as a 33 year old who's self-destructed under these types of thoughts and thinking for over a decade,) I listened to this the first time a couple years ago and just ordered the very short book and read it myself. The audio book is an hour and forty minutes here, but just listen to the first few and see whether it pulls you in.\n\nhttps://www.youtube.com/watch?v=iEq0dMu9vpk\n\nI almost *enjoy* that I can imagine some /r/wowthanksimcured nerd getting angry that it *seems* so obvious, but I also believe there's an uncomfortable reality in that idea for men in particular, though the idea can just as easily fit for anyone.\n\nHell, I could straight up show you a video of my own depressive rant with the exact same mood. I've got several I could share with different levels of frustration. For fuck's sake, I've got my own damn sub(which I'm honestly afraid to popularize) I made that was intended to be for utopian Star Trek hopes based on my own theories: /r/TechnoComRenaissance.", "is_submitter": false, "distinguished": null, "created_utc": 1628561480.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "ETL6000yotru", "id": "h8cs48j", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #138", "submission": "p1cqke", "stickied": false, "body": "We're all fucked so why not watch the fireworks and burn with it", "is_submitter": false, "distinguished": null, "created_utc": 1628556566.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "Potate-inator", "id": "h8d9s1x", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #294", "submission": "p1cqke", "stickied": false, "body": "You don't gotta bother if u don't wanna", "is_submitter": false, "distinguished": null, "created_utc": 1628565340.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "dashingThroughSnow12", "id": "h8coz99", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p1cqke", "stickied": false, "body": "You are a scattergun my friend.\n\n> Maybe that's so, I wasn't exactly a policy wonk at the age of 10 and at this point it seems pointless to comb through 20 year old policy proposals -\n\nI agree. I was about to agree with you but then this nugget of wisdom came.\n\n> but in retrospect, fucking anything would have been a worthy start.\n\nWait, what!? You can't go from genius to this in half a sentence.\n\n> Bush opposed the Kyoto protocol. US Republicans alternately pushed the line that climate change either wasn't real, wasn't harmful, wasn't caused and couldn't be stopped by humans, or simply refused to consider any policy that might help on free market grounds.\n\nThere is a human suffering ground. I'll get back to this later.\n\n> though at least he did cultivate a position at the Paris accords - from which Trump promptly withdrew. \n\nThe USA was never in the Paris climate accords. It still hasn't been ratified.\n\n> China is building plenty of coal power plants. Bolsonaro is happy to let the Amazon get deforested. I am t i r e d.\n\nGot here quicker than I thought.\n\nWould you rather 1.6B Chinese people live in poverty? Tens of millions die from preventable causes? Hundreds of millions of children not have access to education and opportunity?\n\n> We had A LOT of warning and maybe could have limited warming to what we see today, if we had started converting the exponential increase into a level-off and decline 20 years ago.\n\nAs an aside, Gore likes to claim he studied with the pioneer of correlating CO2 and other green house gases with global heating.\n\n> So yeah, I'm a bit down on humanity and disappointed that Star Trek Earth is largely not a possibility anymore. Nevermind warp travel and all, but utopian coexistence on Earth? That seemed like a possibility so long as it was only our own bickering over differences that limited us, and the climate clock still had time on it.\n\nDon't be pessimistic. They had at least two more world wars than we did before they got to that point.\n\nSvante Arrhenius in 1896 was the first. He is the same guy who revolutionizes the study of acids and bases in chemistry.", "is_submitter": false, "distinguished": null, "created_utc": 1628555060.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "areyouseriousdotard", "id": "h8deln4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "p1cqke", "stickied": false, "body": "Come doom scroll with us at /r/collapse\nI have a one y.o., it wasn't planned.  I feel awful for him...\n\nYou have to just live in the moment, but don't stop planning for the future.  You never know, even tho odds are we are fucked...", "is_submitter": false, "distinguished": null, "created_utc": 1628568051.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "meowmemeow", "id": "h8doixo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #37", "submission": "p1cqke", "stickied": false, "body": "A lot of tragedy awaits us :(", "is_submitter": false, "distinguished": null, "created_utc": 1628574632.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "caparisme", "id": "h8dollh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "You don't have to if you don't want to. There's not much you *can* do anyways.", "is_submitter": false, "distinguished": null, "created_utc": 1628574687.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "Golden-Snowflake", "id": "h8dvsdh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "p1cqke", "stickied": false, "body": "Don't worry mate, its not like humanity will keep it up, after the planet kills off 99.9% of all life, when the feedback loop escalates to that point...\n\nReally hard for 2-3000 people to do what we are doing today, and by the time, they catch back up to todays level of technological ability, there won't be any more coal, or easily accessed fuel to get them out of the early stages of technological hurdles, to get to this stage.\n\nthere are microbes that eat oil, and the life that would produce coal over time now, not to mention plastics.  \nSo humanity will either grow the fuck up, and fix their shit, or they will be wiped out, and never again be given big boy pants.  \n(there won't be an industrial age, that could even come close to the one we already had, without petrol and Coal.)", "is_submitter": false, "distinguished": null, "created_utc": 1628580513.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "cocobisoil", "id": "h8e4vdp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #87", "submission": "p1cqke", "stickied": false, "body": "Révolution anyone?", "is_submitter": false, "distinguished": null, "created_utc": 1628588666.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "THF-Killingpro", "id": "h8eviqp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "I have seen a lot of people say, that doing something won't change shit. Well, I agree partially, but don't using unesecery energy and water is also better for your wallet. Well, if everyone would be a decent human being they would do such mundain things and that might even help a little...", "is_submitter": false, "distinguished": null, "created_utc": 1628605229.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "yeetoveeto", "id": "h8f4wa8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #62", "submission": "p1cqke", "stickied": false, "body": "We are a tribal species attempting to be a global species", "is_submitter": false, "distinguished": null, "created_utc": 1628609321.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "Qwopie", "id": "h8fbmp7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #13", "submission": "p1cqke", "stickied": false, "body": "The planet will be fine, it's the humans that are fucked - George Carlin", "is_submitter": false, "distinguished": null, "created_utc": 1628612160.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "arokace", "id": "h8hntd2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p1cqke", "stickied": false, "body": "Welp, I'm in need and don't really feel like reading a bunch right now (sorry :/) so I'm gonna be answering solely off of the title.\n\nThe way I look at it if you view humanity like this.  Is that should give yourself way more liberties on what you can/should/will try in life. If nothing matters then the world is your oyster.\n\nBut I would hope you can see past the shit show on the front page and dig deeper into humanity and the intricacies that makes up our world as a whole.  There is so much beauty out there.  There's so many different perspectives.  There's so many people... And honestly, the vast majority of us are just trying to live our lives to our own ideals.  So many of us really aren't trying to do horrible things to one another.  We just default to seeing things as that way.\n\nAlso... Humanity, even though it still isn't perfect is far better off then it was even half a century ago... Let alone when you look back 100s, 1000s of years ago.  The amount of \"smart people\" there is in the world per capita is insanely high nowadays. \n\nI can see our potential and I'm sad I won't be able to see us achieve it because I'll be dead before that happens, all of will be.  But it will happen I assure you that.", "is_submitter": false, "distinguished": null, "created_utc": 1628650153.0, "parent_id": "t3_p1cqke", "replies": [{"author": "KuriousKhemicals", "id": "h8ir2kh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "p1cqke", "stickied": false, "body": "Why would you bother answering a post you haven't read? Like what do you get out of that or expect anyone else to get out of that?\n\nAnyhow, yeah, humans would have forever to get it right and I'd give us infinite chances if we weren't fucking up the climate and already quite possibly out of control. That's the part I have low confidence about.", "is_submitter": true, "distinguished": null, "created_utc": 1628679688.0, "parent_id": "t1_h8hntd2", "replies": [{"author": "arokace", "id": "h8knwip", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p1cqke", "stickied": false, "body": "Welp your title made it sound like it was gonna be a lot more personal and a lot more depressing.  As for why... well I attempted to say way in the first 4 words but I swiping failed me.  I was in bed and tired.  \n\n\nI still feel my answer covers what you were talking about though.  I'll just add on that all hope isn't lost but a lot of the things you think won't happen any more weren't gonna happen in our life times anyways (I'm 31 too).  I do wish we weren't so afraid of nuclear though.  Its been shown that if you run it properly you don't have much to worry about it.  And in comparison to \"green energy\" you can make a strong argument that its more green then they are (at least with current technologies).    \n\n\nBut yes the climate isn't great and is still getting worse.  But more and more countries are looking to start to go after the corporations that cause the issues.  Since its pretty well known that us citizens aren't really the big contributors in all of this... Not by a long shot.  \n\n\nUltimately, I'd rather have hope than being depressed over it.  But I generally try to see the good side in most things, I can see the bad sides but as you said in the title \"why bother\".  Do what you can do to help the world.  Don't buy from certain companies.  Don't do certain activities.  etc etc.  Will I alone make a difference by doing these things of course not.  But if you're doing it it can hopefully encourage other people to do it too.", "is_submitter": false, "distinguished": null, "created_utc": 1628711639.0, "parent_id": "t1_h8ir2kh", "replies": []}]}]}, {"author": "Professor_Gurgi", "id": "h8cn6i9", "score": -9, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "Reminder that most pollution comes from China and India. Just do you know who to be mad at", "is_submitter": false, "distinguished": null, "created_utc": 1628554192.0, "parent_id": "t3_p1cqke", "replies": [{"author": "solongfish99", "id": "h8d15d2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "p1cqke", "stickied": false, "body": "In general, it's never helpful to tell people who to be mad at- either because your facts are wrong or because being mad at (insert group) isn't productive.", "is_submitter": false, "distinguished": null, "created_utc": 1628560939.0, "parent_id": "t1_h8cn6i9", "replies": []}, {"author": "KuriousKhemicals", "id": "h8daki7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "p1cqke", "stickied": false, "body": "It wasn't during a looooottt of the time we could have been acting on this problem though. If anything that is one of the biggest reasons I'm pissed off at the United States government - we set the tone of procrastinating it instead of handling it when the ball was most in our court.", "is_submitter": true, "distinguished": null, "created_utc": 1628565771.0, "parent_id": "t1_h8cn6i9", "replies": []}]}, {"author": "vista_999", "id": "h8dg4xz", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p1cqke", "stickied": false, "body": "i aint reading all that but im sorry or congratulations.", "is_submitter": false, "distinguished": null, "created_utc": 1628568964.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "Cheomesh", "id": "h8dbp9f", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p1cqke", "stickied": false, "body": "Self-satisfaction I guess.  Probably most people's real motives for anything, really.", "is_submitter": false, "distinguished": null, "created_utc": 1628566400.0, "parent_id": "t3_p1cqke", "replies": []}, {"author": "Tokoolfurskool", "id": "h8dkkea", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #252", "submission": "p1cqke", "stickied": false, "body": "Guys, it’s gonna be fine. Humanity isn’t going extinct. Life will change, people will adapt, “normal” will change. People have gone through tough times before, we live in an unprecedented era of prosperity. I just want to chill out and enjoy life, but the fear mongering is exhausting from every side of the political spectrum. If you don’t want kids, don’t have them, no one gives a fuck, the worlds not ending.", "is_submitter": false, "distinguished": null, "created_utc": 1628571809.0, "parent_id": "t3_p1cqke", "replies": [{"author": "KuriousKhemicals", "id": "h8ec6bl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "p1cqke", "stickied": false, "body": "Glad you have such optimism, but you haven't explained much of a logical basis for it and genuine concern is not \"fear mongering.\"", "is_submitter": true, "distinguished": null, "created_utc": 1628594555.0, "parent_id": "t1_h8dkkea", "replies": []}]}]}