{"title": "Compromised immune system, just got 3rd vaccine dose", "name": "t3_p70kpc", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p70kpc/compromised_immune_system_just_got_3rd_vaccine/", "selftext": "Very concerned about the new variants given my medical conditions, and so many recent stories of ~~double~~fully-vaccinated people still winding up in the ICU. So it's a huge relief to get the extra dose; hopefully everyone else will be able to get the doses they need as soon as possible.\n\nI'll still be masking and distancing though, because I don't believe in an afterlife and want to do everything I can to not die or kill children / people who can't be vaccinated. Fuck everyone who made a personal choice to side with a deadly virus and is refusing vaccines and masks.\n\nUpdate: had a bad headache and general soreness, but overall much less of a reaction than to my 2nd dose. Pretty much all cleared up at the 24hr mark.", "score": 34, "upvote_ratio": 0.87, "permalink": "/r/TheFlyingTree/comments/p70kpc/compromised_immune_system_just_got_3rd_vaccine/", "id": "p70kpc", "author": "L4sgc", "link_flair_text": "Other", "num_comments": 111, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629321768.0, "comments": [{"author": "ktpr", "id": "h9hczaw", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #90", "submission": "p70kpc", "stickied": false, "body": "Did you have a reaction to the third dose?", "is_submitter": false, "distinguished": null, "created_utc": 1629337913.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9he9uk", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "Almost 7 hours in, nothing so far. As I remember it, my side effect from the 2nd dose was low fever and extremely painfully sore arm the next day, but then good as new the day after that. I think I probably feel something tomorrow.\n\nEveryone is different, but they said reaction to 3rd dose could potentially be the most severe and soreness, tiredness, headaches, fever, for several days after are not unexpected. And unless it seems like a medical emergency I should only call my doctor if the symptoms last beyond the fifth day.\n\nI'll edit the post tomorrow with an update.", "is_submitter": true, "distinguished": null, "created_utc": 1629338537.0, "parent_id": "t1_h9hczaw", "replies": [{"author": "NoSuchKotH", "id": "h9ieie6", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": ">Everyone is different, but they said reaction to 3rd dose could potentially be the most severe and soreness, tiredness, headaches, fever, for several days after are not unexpected. And unless it seems like a medical emergency I should only call my doctor if the symptoms last beyond the fifth day.\n\nAccording to the [German report](https://www.pei.de/SharedDocs/Downloads/DE/newsroom/dossiers/sicherheitsberichte/sicherheitsbericht-27-12-bis-30-06-21.pdf?__blob=publicationFile&v=5) on vaccine safety from July seen side effects in their study after 75 million people being fully vaccinated were:\n\n\\~10% had a sore arm\n\n\\~8% were tired and/or have head aches\n\n8-10% got fiver\n\n4% got muscle pain and joint pain, flu like symptoms, dizziness\n\n3% got a general unwellness, nausea\n\nless than 2% got a rash, swollen lymph nodes, paraesthesia, tachycardia or dyspnoe.\n\nThere were 228 reports of perimyocarditis and myocarditis after an earlier vaccination (ie 1 in 328'947 or 0.000304%). Of these six men (ages 90, 80, 71, 59 and 56) and three women (ages 84, 67 and 64) have died (i.e. 1 in 8'333'333).\n\nThere were a total 157 people who died due to thrombosis after receiving AstraZeneca. Which translates to a 28.3% higher rate than for unvaccinated people (ie statistically they expected around 110-115 to die from thrombosis in the same time span, due to the background prevalence of thrombosis in the general population). After that, AZ was not given to anyone below the age of 60 without their explicit demand. And even for the elderly it was quickly phased out as other vaccines became available. For all other vaccines, the rates of thrombosis were not elevated. (i.e. they took this very seriously)\n\nThere have been a total of 135 reports of abnormal menstrual cycles (most of which returned to normal after one or two months according to a different study).\n\nThere have been 362 reports of allergic reactions.\n\nTable 11 (page 24) gives long list of diseases that might be triggered by the various vaccines and their background levels. Only two show (potentially) elevated levels: thrombozytopenie and Guillain-Barré syndrom, both for AstraZeneca.\n\n&#x200B;\n\nSo, yes, if you get vaccinated, there will be likely adverse reactions. Yes, some of them are even dangerous. But the ones that are dangerous are rare and you are more likely to die by a toaster falling into your bathtub than from those.\n\nAnd just for reference: The small pox vaccine was known to induce a strong fever for several days in 10-20% of the population. It was so prevalent that people took off from work after vaccination, just in case. I.e., strong immune reactions to vaccines are nothing new. It is just that the classical vaccines have been fine tuned to an extreme to give the desired immunity, while limiting the immune reaction. But this took decades for each of them. Decades that we did not have with Covid.", "is_submitter": false, "distinguished": null, "created_utc": 1629362505.0, "parent_id": "t1_h9he9uk", "replies": [{"author": "ktpr", "id": "h9iodlf", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #90", "submission": "p70kpc", "stickied": false, "body": "Interesting. For my second dose I had a sore lymph node, slight fever, tired and a sore arm. All but the sore arm cleared up in about a day. I’ll see what’s what when it’s my time to take the third dose.", "is_submitter": false, "distinguished": null, "created_utc": 1629370740.0, "parent_id": "t1_h9ieie6", "replies": [{"author": "L4sgc", "id": "h9kk0zm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "Update: had a bad headache and general soreness, but overall much less of a reaction than to my 2nd dose. Pretty much all cleared up at the 24hr mark.", "is_submitter": true, "distinguished": null, "created_utc": 1629401570.0, "parent_id": "t1_h9iodlf", "replies": []}]}, {"author": "vook485", "id": "h9x9iqv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p70kpc", "stickied": false, "body": ">Table 11 (page 24) gives long list of diseases that might be triggered by the various vaccines and their background levels. Only two show (potentially) elevated levels: thrombozytopenie and Guillain-Barré syndrom, both for AstraZeneca.\n\nThat's what's really frustrating about all the vaccine *concern*. Almost every complaint I've seen ignores the base rate of the alleged long-term vaccine side effects. It's usually the same people who were saying covid deaths were over reported because people already die of other stuff anyway, tacitly acknowledging that there *is* a base rate while ignoring that the base rate of death was significantly lower.\n\nI don't know how to hammer it thru people's heads that they're committing dangerous [base rate fallacies](https://en.wikipedia.org/wiki/Base_rate_fallacy), but I hope that labeling that helps you or others who pass by here to better understand.\n\n(The other frequent anti-vax arguments I've seen are fear-mongering about vaccines' safety despite no plausible mechanism for them to be worse than the virus itself, and general conspiracy theories.)", "is_submitter": false, "distinguished": null, "created_utc": 1629648894.0, "parent_id": "t1_h9ieie6", "replies": [{"author": "NoSuchKotH", "id": "h9xcco7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "I stopped trying to convince people. These people don't want to discuss. They don't want to learn. They don't want to listen. They only want to be right about it. They want to feel superior for \"connecting the dots\" for \"seeing reality for what it is\". No matter what argument you bring, no matter what strategy you have, it will not work. \n\nThe only thing that might work is if they or their loved ones will succumb to Covid. And even then, there are plenty of people who shout at the doctors for lying to them, when they get a Covid diagnosis.", "is_submitter": false, "distinguished": null, "created_utc": 1629650087.0, "parent_id": "t1_h9x9iqv", "replies": [{"author": "vook485", "id": "h9xqmwl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p70kpc", "stickied": false, "body": ">The only thing that might work is if they or their loved ones will succumb to Covid. And even then […]\n\nI've succumbed to covid, but I lived, unfortunately for the conspiracy theorists. So I can still refute their bullshit through the longterm reduction in lung function / stamina, brainfog, general malaise, etc.\n\nUnfortunately for me, the biggest deniers in my life are my parents, who I probably got it from, and who stopped masking at the first opportunity.\n\nAt least I managed to get vaccinated, so I'm unlikely to get another severe case of it. I'm still masking, since vaccination only provides ~60% protection against *spreading* the delta variant, and the ~80% spread prevention of wearing a mask is needed to cut my spread chance by >90%.", "is_submitter": false, "distinguished": null, "created_utc": 1629656209.0, "parent_id": "t1_h9xcco7", "replies": []}]}]}]}]}]}, {"author": "DoglessDyslexic", "id": "h9i9cdf", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p70kpc", "stickied": false, "body": "> Fuck everyone who made a personal choice to side with a deadly virus and is refusing vaccines and masks.\n\nMy adult son doesn't refuse to mask, but he's been watching right wing talk stuff and has gotten it into his head that vaccines are dangerous.  I'm in the midst of a back and forth with him showing him how all the objections he has are based on pseudoscience but frankly I'm very disappointed in him for falling prey to it in the first place.  When 30% of people that get covid (even asymptomatic) suffer fucking measurable brain damage, why on Earth would you not get vaccinated when .0014% of people who get vaccinated suffer heart issues (which they don't, the percentage is much much lower, but that's what his crappy sources say).  Simple math says that if you want to not suffer brain damage you should get vaccinated.", "is_submitter": false, "distinguished": null, "created_utc": 1629358015.0, "parent_id": "t3_p70kpc", "replies": [{"author": "NoSuchKotH", "id": "h9ibq2b", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "Do you know how your son fell prey to the Fox rethoric?\n\nI've been trying to figure out how, otherwise intelligent and decently educated people could come to the conclusion that covid is a hoax, that masks don't help that vaccines kill etc. \n\nAnd how do you try to convince him that he had been lied to? And do you have success?", "is_submitter": false, "distinguished": null, "created_utc": 1629360064.0, "parent_id": "t1_h9i9cdf", "replies": [{"author": "L4sgc", "id": "h9id8u6", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "Not who you posed the question to, but imo the main problem is the algorithms implemented by Facebook, YouTube, and other social media. The algorithms have essentially no concept of truth and just seek engagement. Clickbait, sensationalism, and other forms of misinformation are very often more profitable for them than the truth. Proven to create echochambers and increase polarization.\n\nPlus \"real\" people on YouTube and your crazy relative on Facebook are probably a lot more convincing to someone than even a news anchor they agree with.", "is_submitter": true, "distinguished": null, "created_utc": 1629361388.0, "parent_id": "t1_h9ibq2b", "replies": []}]}, {"author": "L4sgc", "id": "h9ia8sh", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "If his arguments against it are based on right wing politics, you could try basing your arguments for it on right wing politics as well. Why does he think Trump spent billions of dollars on operation warp speed if the vaccine wasn't crucial? Trump and other political leaders were some of the first to be vaccinated. Etc.\n\nBest of luck to you.", "is_submitter": true, "distinguished": null, "created_utc": 1629358780.0, "parent_id": "t1_h9i9cdf", "replies": []}]}, {"author": "AVDeKn", "id": "h9ghhe9", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #161", "submission": "p70kpc", "stickied": false, "body": "Congratulations for getting immunized!\n\n\n>I'll still be masking and distancing though, because I don't believe in an afterlife and want to do everything I can to not die or kill children / people who can't be vaccinated.\n\n\nAnd Would be nice if everyone was sensible to the situation like You, really.", "is_submitter": false, "distinguished": null, "created_utc": 1629323141.0, "parent_id": "t3_p70kpc", "replies": []}, {"author": "arokace", "id": "h9hjyrp", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p70kpc", "stickied": false, "body": "I'm about to get tested tomorrow.  I'm vaccinated (back in April) but made the careless mistake to not wear a mask at my new job.  That's public facing and the company wasn't requiring it either when I came on (they used to and are again).  Then some cases were reported there and maybe I'll be the third one.  I don't have any serious symptoms but this doesn't feel like how I normally experience the common cold and it's not flu season (I know you can get it out of season though).", "is_submitter": false, "distinguished": null, "created_utc": 1629341341.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9hnfoe", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "Best of luck to you! Hopefully weather or not it's covid your symptoms will be mild and end soon. But there are a lot of other weird random virus flying around.\n\nA while ago my fiancee literally had all the flu symptoms and lack of taste but tested negative 3 separate times (and I tested negative twice) so we think it was just a coincidence. Still did the full quarantine and even isolated from each other just in case.", "is_submitter": true, "distinguished": null, "created_utc": 1629343129.0, "parent_id": "t1_h9hjyrp", "replies": []}]}, {"author": "PurpleDevilR", "id": "h9inmll", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "I can in theory take the vaccine though I’m extremely apprehensive simply because I have needelphobia, I still use masks, distancing etc though.\n\nI’m a an arse for this in your view or not?", "is_submitter": false, "distinguished": null, "created_utc": 1629370179.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9iqxgv", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I don't want to belittle a legitimate condition, but have you tried anything to overcome it? The needle is like as thin as a hair and only out for a couple seconds.\n\nI do not have that phobia but I think I lived most of my life in a similar situation. Maybe you can relate to this story. As part of my condition I had a g-tube for like 14 years. Meaning a hole was literally drilled through the skin of my abdomen to reach my stomach and a plastic tube with a valve was pushed into the hole to keep it open and allow syringes of nutrients to be pushed through. These tubes get dirty and slowly dissolve from stomache acid so they need to be changed roughly once or twice a year. Apparently it's pretty painless for most people so it's done without any sedative or pain meds, but my particular stomach hole happened to hit a nerve or something, so the procedure was so excruciatingly painful for me I can't even begin to describe it. Naturally I had a lot of dread and fear every time a tube change was approaching. Actually I'm starting to shake a little just thinking about it.\n\nBut at the end of the day I knew that pain would be temporary and it was something that I needed to do to live and be healthy. I never once kept my eyes open for the procedure, lots of breathing exercises, and I didn't feel ashamed of screaming if I had to scream. But I always pushed through it and could leave with my head high.\n\nYou don't have to like it but maybe you can find a method that allows you to get it done.", "is_submitter": true, "distinguished": null, "created_utc": 1629372535.0, "parent_id": "t1_h9inmll", "replies": [{"author": "PurpleDevilR", "id": "ha5plap", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "Yeah, I can’t simply logic my way out of the fear, irrational fear and all. I suppose exposure therapy would be the answer but you can’t just go in and ask for several dozen injections as a practice.", "is_submitter": false, "distinguished": null, "created_utc": 1629811160.0, "parent_id": "t1_h9iqxgv", "replies": [{"author": "L4sgc", "id": "ha6d76p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I guess I was wondering if you had a level of fear where someone could still drag you through kicking and screaming. Did you ever manage to get any other vaccines? Tried speaking to a therapist?\n\nAs for exposure, if your phobia is specifically about the needles and not the injection, you could work with an acupuncturist or even have a friend sterilize a sewing needle and give you little pokes with that. You can also get blood sugar test needles over the counter.", "is_submitter": true, "distinguished": null, "created_utc": 1629821443.0, "parent_id": "t1_ha5plap", "replies": [{"author": "PurpleDevilR", "id": "ham1vz1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "I’ve gotten vaccines when I was younger. And I believe I’ve gotten better. But I haven’t had to have one for some time as they introduced nasel sprays for a lot of stuff.\n\nI haven’t talked with a therapist and frankly, why would I? This is just a fear is something, an irrational fear, talking about simply being afraid won’t help it. It’s just a waste of money, time and resources.\n\nI have a problem with acupuncture in general, seems a bit scamish. Sewing needles could work though they don’t have the same effect, they’re shorter and have less of a presence. And to my knowledge you can’t casually grab some blood testing needles over the counter in Britain.", "is_submitter": false, "distinguished": null, "created_utc": 1630102216.0, "parent_id": "t1_ha6d76p", "replies": [{"author": "L4sgc", "id": "hame17o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "It's unfortunate how stigmatized it is in our society to acknowledge mental health. Among other things, therapy can be extremely helpful for developing coping mechanisms and providing tools which allow you to deal with whatever mental or emotional struggle is preventing you from being able to do something you want to do. In your case finding a way to cope with and overcome your fear of needles to get the vaccine. Millions of people see therapists to overcome phobias every year.\n\nI honestly believe the majority of people would benefit from a few therapy sessions even if they think things are going fine. It's like how you still go to the GP for a yearly checkup even if you don't think something's wrong with you. But note that unlike a physical ailment where a doctor can do a test, find what's wrong, and treat you, in order to benefit from therapy you do actually have to be willing to cooperate and work with the therapist. What you get out of it is entirely dependent on what you put in.\n\nGoing back to your original question:\n\n> I'm an arse for this in your view or not?\n\nThe vaccine is available to you. You've gotten shots before. You believe your phobia has gotten better. But you still haven't gotten this vaccine, and are not currently taken actions to practice coping with your phobia? It sounds like you have yet to give this a serious effort...\n\nIf it was me, I would find like 30 mins a week and genuinely devote that time dealing with the phobia. It doesn't matter if that's talking to a professional, talking to a friend, visualizing and practicing breathing exercises, watching vaccination videos on YouTube, whatever you think will help build up to it. If you can't find at least 5 mins a day, I'd say you're lieing. Plus you get to stop as soon as you get the vaccine.", "is_submitter": true, "distinguished": null, "created_utc": 1630107961.0, "parent_id": "t1_ham1vz1", "replies": [{"author": "PurpleDevilR", "id": "hanorox", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "It’s not because I stigmatise it. It’s because I view it as a genuine waste of time and resources. I already know I have this fear, it isn’t debilitating in the day-to-day of my life. I don’t need to cope with a fear I’m faced with so rarely, I wouldn’t seek therapy if I had a fear of water.\n\nI don’t go to my GP for a yearly checkup. I don’t know if that’s even a thing in Britain but it might be. Besides everyone going for regular therapy is just a waste of resources, our health services are underfunded enough let alone mental health. We have a stiff upper lip approach already, imagine sending people to therapists for no reason, no one would go unless they had a serious problem.\n\nYes going back.\n\nYeah but I was little then, someone could hold my arm down. Now I’m a practically fully grown teenager. I’m probably not taking a serious amount of effort.\n\nI like the idea of watching a video everyday. That I can do. Someone else also recommended pricking myself with sewing needles which is manageable too.\n\nI’ve ended up getting a fair few methods to deal with this, and I’ll begin to attempt to improve it. Thanks for the conversation.", "is_submitter": false, "distinguished": null, "created_utc": 1630135808.0, "parent_id": "t1_hame17o", "replies": [{"author": "L4sgc", "id": "haof271", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "Sounds great, I really hope that you'll see improvement, and eventually be able to get it!\n\nDon't rule out the hold-down strategy as a last resort though. I have to get blood tests every 7 weeks and it's more common that you'd think to see adults who still need a partner or an extra nurse to hold their arm down.", "is_submitter": true, "distinguished": null, "created_utc": 1630155918.0, "parent_id": "t1_hanorox", "replies": [{"author": "PurpleDevilR", "id": "hb7fn4b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "Well I just had the vaccine today.\n\nMy strategy was panicking while it happened.", "is_submitter": false, "distinguished": null, "created_utc": 1630514563.0, "parent_id": "t1_haof271", "replies": [{"author": "L4sgc", "id": "hb7ka7b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "That's amazing, you should feel very proud for pulling through!", "is_submitter": true, "distinguished": null, "created_utc": 1630516446.0, "parent_id": "t1_hb7fn4b", "replies": []}]}]}]}]}]}]}]}]}, {"author": "vook485", "id": "h9xce9e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p70kpc", "stickied": false, "body": "You at least admit that you have a problem with an irrational response, and you're still taking the pandemic seriously. Masking cuts your chance of unknowingly spreading SARS-CoV-2 by about 80%, which really helps!\n\nAs someone who likes to see the needle going in, I can't judge you. But I still encourage you to seek a workaround for your phobia, so you can cut your transmission chance even more while drastically lowering your risk of severe illness.\n\nI don't know if this will help you in particular, but I've seen it suggested that if you've got needle anxiety to ask your doctor for a prescription of 2 doses of an anxiolytic like Xanax or Valium (and I guess additional doses for all the other shots you may be missing).\n\nGet safer!", "is_submitter": false, "distinguished": null, "created_utc": 1629650105.0, "parent_id": "t1_h9inmll", "replies": [{"author": "PurpleDevilR", "id": "ha5pc3g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "Thanks for the reasonable response.\n\nYeah normal workarounds don’t work too well, I can’t simply not look without getting just as panicked.\n\nI’m not sure you can just ask your doctor to prescribe medication in my country.\n\nThanks for all the words though.", "is_submitter": false, "distinguished": null, "created_utc": 1629811035.0, "parent_id": "t1_h9xce9e", "replies": [{"author": "vook485", "id": "hanfs0n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p70kpc", "stickied": false, "body": ">I’m not sure you can just ask your doctor to prescribe medication in my country.\n\nIt's *probably* worth asking, even if your doctor says no. Given that the pandemic is an overriding concern and that it's such a limited quantity that the abuse potential is really low, it *should* be an option, even if you have to take it under supervision or whatever.\n\nUnfortunately, there's often a huge gap between what *should* be and what *is*. I know most countries have varying levels of insanity in their drug laws, so I wouldn't be too surprised if in your country even *asking* for just enough anxiolytic to get vaccinated could be seen as \"drug-seeking behavior\" and get you in trouble. I don't know your situation, so I can't judge you. But I trust that you're doing everything you can.\n\nThank you for examining every option available and doing what you can in the meantime.", "is_submitter": false, "distinguished": null, "created_utc": 1630128739.0, "parent_id": "t1_ha5pc3g", "replies": [{"author": "PurpleDevilR", "id": "hanny5q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "I meant just *any* medication. Mild stuff like hay fever and that which can’t be abused sure. Medical equipment like needles is a bit dodgy, especially for no medical reason other than just having needles.\n\nYeah but I’m too anti-social/awkward to ask such and odd and specific request. That’s the truth of it.\n\nWell I’m British. Generally we’re pretty lax about the law and when someone breaks it. Unfortunately.\n\nThanks for presenting some. I particularly like the sewing needle idea.", "is_submitter": false, "distinguished": null, "created_utc": 1630135105.0, "parent_id": "t1_hanfs0n", "replies": []}]}]}]}]}, {"author": "Stand_kicker", "id": "h9hkusl", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "p70kpc", "stickied": false, "body": "Did you check if your body is producing antibodies? And the number it is producing?\n\nA booster is needed for the following reasons\n\n- your body is not producing enough antibodies\n\n- the booster is designed to protect against the new variants. That is they have antibodies and help you produce antibiotics designed to fight the mutant strains.", "is_submitter": false, "distinguished": null, "created_utc": 1629341790.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9hlnvm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I didn't get a booster. I am included in the groups that the CDC has recently advised are actually in need of a 3rd dose. Immunocompromised and individuals with certain medical conditions are now supposed to get a 3rd dose 28 days after their 2nd. My 3rd dose just happens to be a bit late since we didn't know that at the time.\n\nI consulted with my primary physician, and she said based on my condition I didn't need to get an antibody test and should just get the 3rd dose as soon as possible.", "is_submitter": true, "distinguished": null, "created_utc": 1629342197.0, "parent_id": "t1_h9hkusl", "replies": []}]}, {"author": "MisanthropicScott", "id": "h9i9x8r", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "I'm curious whether you got the same vaccine all three doses. Did you get the same for the third?\n\nI'm expecting to be eligible for a third dose in November. I had Pfizer for the first 2. I'm thinking that if/when I get a booster, it might be good to get Moderna to get the benefits of both.\n\nP.S. I noted that yours is not a booster. My November shot would be. I'm not sure if that makes a difference. I still wonder whether 2 Pfizer and 1 Moderna or 2 Moderna and 1 Pfizer would be better than 3 of the same.", "is_submitter": false, "distinguished": null, "created_utc": 1629358505.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9ibs7y", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I got moderna all 3 times. Mixing doses hasn't been studied nearly as much as 3 of the same, so I think there's certainly an advantage to following a larger clinical trial group. Not because I'm worried about any side effects, just because I want there to be less guesswork in how much immunity I have / how long it will last.\n\nThe CDC recommendation is to try and stick to the same one and only mix if the same one isn't available.", "is_submitter": true, "distinguished": null, "created_utc": 1629360116.0, "parent_id": "t1_h9i9x8r", "replies": [{"author": "MisanthropicScott", "id": "h9ick66", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "Thanks. I'm curious whether that might change by November for those who get a booster.\n\nBut, especially with your case not being a booster, that makes a lot of sense.\n\nStay safe out there.", "is_submitter": false, "distinguished": null, "created_utc": 1629360795.0, "parent_id": "t1_h9ibs7y", "replies": []}]}]}, {"author": "iloveregex", "id": "h9iknwa", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #148", "submission": "p70kpc", "stickied": false, "body": "My mom just got her booster. She said the immune response was more intense than the second dose. Looking forward to mine in October (I’m a teacher)", "is_submitter": false, "distinguished": null, "created_utc": 1629367840.0, "parent_id": "t3_p70kpc", "replies": []}, {"author": "Parking_Pineapple440", "id": "h9izj3m", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #224", "submission": "p70kpc", "stickied": false, "body": "I’ve been worried lately because I just returned to college, but thankfully we have a mask, testing, and vaccine mandate here and no one here acts like a jackass about it.", "is_submitter": false, "distinguished": null, "created_utc": 1629377578.0, "parent_id": "t3_p70kpc", "replies": []}, {"author": "iamnotroberts", "id": "h9hye5a", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p70kpc", "stickied": false, "body": "I feel bad for people with legitimately compromised immune systems, especially given how many fucking MAGA/QAnon assholes are claiming they have compromised immune systems when they absolutely don't.", "is_submitter": false, "distinguished": null, "created_utc": 1629349656.0, "parent_id": "t3_p70kpc", "replies": []}, {"author": "SoulWanderer", "id": "h9k5h09", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p70kpc", "stickied": false, "body": "I am totally pro vaccines, but I disagree with your fuck to those who refuse vaccines.\nThey have their right to not get vaccinated, and it is a legitimate decision. Maybe they are bad informed, oraybe they are afraid (there is people with medical conditions, such as blood cots, that are legitimally afraid of the cots of the vaccines), also I now one case (third hand case. Fríend is a doctor and he had this case) where a kid (really young, 4 or so) died from the reaction to one well tested vaccine. Their parents became terrified to vaccines, and legitimately so!\n\nAnd yes, in some cases there is stupid people.\n\nWith all of them, your attitude will only make them more adamant. It is better to try to teach than to insult.\n\nAnd I understand your concerns (hey! They put my life at risk), but in my book, liberty to decide what medical treatment you undertake is a vital right (and human rights agree with me), so I am against mandatory vaccination.\n\n(here come the down votes!)", "is_submitter": false, "distinguished": null, "created_utc": 1629395505.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9ker3v", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I won't down vote a well thought criticism. However based on the exact same concerns I do happen to reach the opposite conclusion. It is precisely because of people with legitimate health conditions that it is so crucial for everyone else to be vaccinated.\n\nIn our society we have already accepted that people don't have the right to make negligent choices that even unintentionally lead to the deaths of others, it's called involuntary manslaughter. Covid19 is the leading cause of death in the US this year. So I argue people choosing not to vaccinate is an even bigger problem than something like driving under the influence, for which there are charges even if it doesn't result in the death of someone else.\n\nI'm sure you're aware that if you don't know you have a specific preexisting condition, the risk of dieing to the vaccine is barely more significant than the risk someone has of dropping dead totally at random. It's terrible when it happens, but many orders of magnitude more people will be saved as a result.\n\nI further argue that even if you are in this group of people who will have a dangerous reaction to the vaccine and you don't know it, you are much more likely to be treated, recover, and have that information for the future, than you are to actually die. So even in this at-risk group the policy for everyone to be vaccinated will result in a greater chance of their survival than what they'd currently have with millions of people unvaccinated and covid running rampant.", "is_submitter": true, "distinguished": null, "created_utc": 1629399393.0, "parent_id": "t1_h9k5h09", "replies": [{"author": "SoulWanderer", "id": "h9khgc4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p70kpc", "stickied": false, "body": "And I totally agree. The benefit outweigh massively the risk. \n\nBut that is not your call, that is their call... And that is what I defend.\nAlso, I do not trust government to decide my medical treatment. Maybe in the US you have nice presidents that will never do anything wrong, but the history of illegal castration and mutilation of other races, gay people or dissidents, make me super suspicious. I do not trust the president with that decision. I will take it myself (or you yourself).\nLast, at least in my country (Spain) government said covid was flu, then mask do not work, then they said that ffp2 did not work, only to use a cloth or chirurgical mask, then that only ffp2 is good and covid is hell....\nWhen the government lies to the population, and then recommend a vaccine I can understand doubts... (sorry if my point is not clear, on mobile so I cannot explain as good as I would f2f)\n\nSo my point is : my decision, not yours, not the government. And if the decision is to not vaccinate, educate is better than insult. Also, vaccines work and get your shot!", "is_submitter": false, "distinguished": null, "created_utc": 1629400519.0, "parent_id": "t1_h9ker3v", "replies": [{"author": "BaddDadd2010", "id": "h9kxz2x", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #50", "submission": "p70kpc", "stickied": false, "body": "> But that is not your call, that is their call... And that is what I defend. \n\nIt's people's right in the US to be assholes.  That doesn't mean that they aren't still assholes, and it doesn't mean they shouldn't be called out for it.", "is_submitter": false, "distinguished": null, "created_utc": 1629407183.0, "parent_id": "t1_h9khgc4", "replies": [{"author": "SoulWanderer", "id": "h9n18rm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p70kpc", "stickied": false, "body": "And I defend your right to call them assholes.\n\nI only question what do you want? to call them assholes or them to get the vaccine?\n\nIf you debate with them maybe you get one or two to get their shot. If you call them assholes you will only make them closed on their position. It is a matter of what do we want to achieve. \\*\\*I only say that that might not be the best estrategy towards getting people vaccinated\\*\\*\n\nBut other than that you can call them assholes all the time (and you can call me and whoever you want asshole, it is your right).", "is_submitter": false, "distinguished": null, "created_utc": 1629448664.0, "parent_id": "t1_h9kxz2x", "replies": [{"author": "BaddDadd2010", "id": "h9ngdp4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #50", "submission": "p70kpc", "stickied": false, "body": "They aren't getting the vaccine whether I debate with them or not, so I disagree that continuing to debate with them has any value.  You're free to think you're going to convince more to get a vaccine by \"debating\" if that makes you feel better, but I don't buy it.", "is_submitter": false, "distinguished": null, "created_utc": 1629460487.0, "parent_id": "t1_h9n18rm", "replies": []}, {"author": "vook485", "id": "h9xhsbd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p70kpc", "stickied": false, "body": "At this point, at least where I'm at in the USA, I think the only way to get most vaccine refusers in line is to make it mandatory. [We have a Supreme Court precedent for states having the right to mandate vaccines, overriding personal liberty](https://en.wikipedia.org/wiki/Jacobson_v._Massachusetts).\n\nAt this point, debate at best serves to deter the undecided who may see the debate. I'd love to see counterexamples, but in my experience everyone who's repeatedly bringing up *concerns* about vaccination safety either [doesn't care about or is unable to comprehend the base rate](https://en.wikipedia.org/wiki/Base_rate_fallacy) of the claimed vaccine side effects amongst the unvaccinated.", "is_submitter": false, "distinguished": null, "created_utc": 1629652403.0, "parent_id": "t1_h9n18rm", "replies": [{"author": "SoulWanderer", "id": "h9xl7dp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p70kpc", "stickied": false, "body": "I have no concerns about vaccine safety. In fact I have all my vaccines including covid up to date.\nI have MASSIVE concerns with government dictating health measures.\nI mean US government has not yet approved it properlly, only for emergency usage, and those same incompetents bureaucrats (that have not been able to speed the approval to get more trust) can order me to get an injection...\n\nI do not mean covid, I mean any medical procedure. I am the owner of my body, and that is the only sacred thing. Giving the government that power is to open a huge door to abuse.\n\nBut hey, the USA is pissing over freedom of speech because Covid, and that is the first amendment (I think, not American so please bear with me), and with the clapping of most of the country, so that is to be expected...\n\nDemocracy will die between applause,and in the name of security.", "is_submitter": false, "distinguished": null, "created_utc": 1629653854.0, "parent_id": "t1_h9xhsbd", "replies": [{"author": "vook485", "id": "h9xryra", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p70kpc", "stickied": false, "body": "The thing is, the precedent for forced vaccination here is very specific. Government here can't legally force sterilization or even vaccines against noncommunicable diseases like tetanus. The states' right to compel vaccination (and lockdowns, etc) rests on it being a *public* health concern, since refusing to get vaccinated is putting others at risk.\n\nIt's similar to how alcohol laws forbid driving after a few beers (risk of harming others), but it's legally okay for someone of age to chug hard liquor by the bottle on their front porch until they kill themselves with liver failure.\n\nAlso, it's a 116 year old precedent, so I expect it would have been abused by now if it went too far.", "is_submitter": false, "distinguished": null, "created_utc": 1629656782.0, "parent_id": "t1_h9xl7dp", "replies": []}]}]}]}, {"author": "vook485", "id": "h9xftt9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p70kpc", "stickied": false, "body": ">It's people's right in the US to be assholes\n\n[The SCOTUS of 1905 disagrees](https://en.wikipedia.org/wiki/Jacobson_v._Massachusetts), at least when it's a state that mandates vaccination and there's no medical contraindication. Personally, I'd like to see states start implementing vaccine requirements. We already have 3 widely available vaccines which are all orders of magnitude safer than the smallpox vaccine of 1902 that was litigated on personal liberty grounds.\n\nLet the covidiots doctor shop, and give them condolences for being too frail to handle a vaccine that has such negligible long-term side effects that the 4th option was pulled for a literally one-in-a-million problem. Then deride their idiocy when they still go out (unmasked, of course) because there's no way anyone too weak to get vaccinated is tough enough to handle the actual virus.\n\n… I wish I was bold enough to actually go through with that in real life. Instead, because of poorly addressed childhood trauma from punishments for \"making waves\", I'm stuck seeing it as a war of attrition, where the pandemic here will  end as soon as *concerned* people like my parents are hit  much closer to home by covid stats than my disabling case of long covid. There will be many more preventable covid deaths.", "is_submitter": false, "distinguished": null, "created_utc": 1629651570.0, "parent_id": "t1_h9kxz2x", "replies": []}]}, {"author": "L4sgc", "id": "h9kj9pc", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "There is no correct answer for this question, and I wouldn't think negatively of you for havigning a very different than me, but how many lives would you be willing to sacrifice in order to preserve that right? You know that a lot more people will die by allowing people to have this choice. What is the number where you draw the line for weather or not it's worth it?", "is_submitter": true, "distinguished": null, "created_utc": 1629401261.0, "parent_id": "t1_h9khgc4", "replies": [{"author": "SoulWanderer", "id": "h9kngbq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p70kpc", "stickied": false, "body": "That is a good question. Exploring the limits of freedom is a really complex problem...\n\nChina has managed the covid great. Are you willing to convert your country in a chinese dictatorship to have better crisis management? In old Rome they did so, when there was a great trouble they would declare a [dictator](https://en.m.wikipedia.org/wiki/Roman_dictator). Would that work with you? How many deaths until you deem that acceptable?\n\nI see no direct direction between someone not vaccinating and you dying... Spain, Germany, Israel are all reaching 70% vaccinated and cases are on the rise... I find it difficult to believe that only a 30% un vaccinated generate such huge numbers (specially in Spain, where the huge numbers of positives in previous waves make me believe more than that are immunized), so there is more than meet the eye...\n\nI do not have a number, but I feel that in a balance between liberty and security, having 0 liberty sucks big time, and having 0 security as well (I guess we both agree on that). Our basic difference is that I give more relevance to liberty than security...\n\nThat said, think of government deciding over medical treatment. Old and unhealthy people are expensive... I do not like how it sounds... In Spain government is trying to legalize euthanasia and people with ALS say that by denying them the medical means (delays, denying because stupid things...) and approving euthanasia will push them to suicide to avoid the burden to their families... And this without being able to mandate it. Grant them the power and someone will overuse it.\n\nI will think about my number, and read a little bit more about limits on freedom...in the meantime, what does it take for you to see that government having medical decisions is bad?\nOnly talking about esterilization has it own [Wikipedia page](https://en.m.wikipedia.org/wiki/Compulsory_sterilization) and not small....", "is_submitter": false, "distinguished": null, "created_utc": 1629402960.0, "parent_id": "t1_h9kj9pc", "replies": [{"author": "L4sgc", "id": "h9kufxw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I suppose my perspective is if we can make a change to give the government the power to make medical decisions in an emergency, it is possible to make a second change after the emergency is over to remove that power. Once again I agree with your concerns, but I do think there are components to the urgency and severity of this problem that you have overlooked.\n\nThe percentage of population that needs to be vaccinated in order to achieve a heard immunity depends on the transmissibility of the virus. From what I've seen from studies of covid, we need at least 90% of everybody to be vaccinated, and that's including children and people with those specific medical conditions. So the % of vaccinated healthy adults actually needs to be even greater.\n\nThe virus also mutates as it replicates in every single person it infects. 30% of people choosing not to vaccinate is millions of people, and is thus millions of chances for the vaccine to mutate to a point where the existing vaccines are no longer effective.\n\nThe delta variant has much higher viral loads than the original covid strain, more virus replicating inside of you is also more chance for further mutation. And the lambda variant has a mutation related to the spike proteins that the vaccines are targeting. It is a goddamn miracle the same vaccines are still working against all the existing mutations, and it is so important we don't keep rolling these dice and get to the point where every single person on earth is once again at risk.\n\nThe time to educate people was 2020 and every single year before that. I honestly believe that the number of people who would die in the time it would take to successfully educate a sufficient number of people is not worth it. I'd rather take a drastic action and stop the problem asap, and then afterward when millions of people aren't dieing we can take the time we need to once again worry about rights and education.", "is_submitter": true, "distinguished": null, "created_utc": 1629405761.0, "parent_id": "t1_h9kngbq", "replies": [{"author": "SoulWanderer", "id": "h9n10v7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p70kpc", "stickied": false, "body": "With your views, you should be far more worried about mass vaccination in latin america, asia and africa, because most of the variants will come from there (according to experts, as they have no access to vaccines).\n\nAnd the problem with educating is that most of the governments in the world have focused in making education more akin to its values, then degradating it. Why is there a lack of trust in medicine and a growth of faith in alternative medicine? because we have good health and bad education.\n\nGovernments are causing that kind of ignorance, and the game between left-and-right-namecalling has polarized people much more. That is far more damaging than ativaxxers (for it causes a raise in antivaxxers, in extremism and lower empathy with \"the enemy\").\n\nAnd by the way, your 90% is not vaccinated, it is immunized. For immunization, gettin the illness is as good (or better) as the vaccine, so with a 70% vaccinated and the number of cases we are having, we should be really close to that 90% immunized, that was my point.\n\nAlso,  But nothing is so permanent as a temporary government program (Milton Friedman). For example, [income tax in the USA was supposed to be temporary and removed by 1866,](https://www.mwattorneys.com/blog/first-income-tax-was-supposed-to-be-temporary/) so I am esceptic of any temporary measure... \n\n(and by the way, thanks for one of the longest and most calmed a polite debate I found in reddit)", "is_submitter": false, "distinguished": null, "created_utc": 1629448462.0, "parent_id": "t1_h9kufxw", "replies": [{"author": "L4sgc", "id": "h9nkrfk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "Yeah I've enjoyed this discussion as well. I had no idea about income tax. But other countries needing vaccine more isn't a good reason to take pressure off the people who have vaccines available and are choosing not to get them. The vaccine was already manufactured/purchased/distributed for them and if they don't take it, it will most likely be thrown away thus requiring additional vaccine to be purchased instead of donated.\n\nMost importantly, note that the natural immunity from fighting a covid infection is actually much worse than the immunity from vaccine (not better). Natural immunity only protects against the one particular strain that the body was exposed to, as opposed to the vaccine which still protects against all strains. As such, unvaccinated people are more than twice as likely to catch covid a second time.\n\nSo considering the new strains that continue to make their rounds, I think it makes more sense not to include covid recovered unvaccinated people in the % required for heard immunity.", "is_submitter": true, "distinguished": null, "created_utc": 1629462977.0, "parent_id": "t1_h9n10v7", "replies": []}]}]}]}]}]}]}, {"author": "NoSuchKotH", "id": "h9kdrd5", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "What infuriates me about these people, that only an extremely small fraction have actual medical concerns. Most of them just peddle some weird conspiracy theories that they have heard from somewhere. NNN is full of videos of people showing all kinds of  \"after effects of vaccination\", and a damn lot of them cannot even come from the vaccine, they are biologically impossible!\n\nIf someone tells me they are not going to get vaccinated because they have some conditions that might make them more susceptible to one of the (very rare) side effects of the vaccines (see my post above for a list with probabilities), then I can accept that. \n\nI cannot accept if someone says \"it's experimental\" (it's not!) or \"it is a gene therapy\" (it's not) or \"it kills more people than covid!\" (it's does not) or \"99.98% survival rate is better than any long term consequences of the vaccine\" (no, the survival rate is less than 99.0% and it's not about protecting the young and healthy, it's about protecting those who have underlying conditions) or \"it's just the old and the obese who die\" (what the fuck is wrong with you being ok killing others for your fucking convenience?????)", "is_submitter": false, "distinguished": null, "created_utc": 1629398980.0, "parent_id": "t1_h9k5h09", "replies": [{"author": "SoulWanderer", "id": "h9khw8c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p70kpc", "stickied": false, "body": "I agree, but it is better to explain them than to shout. If you call them stupid, don't expect them to listen.\nIt is better to empathise and explain, and then maybe you win one for the cause!\nIf I say all antivac deserve to die, and then try to convince one, it is only logical he will not listen to me in the best predisposition...", "is_submitter": false, "distinguished": null, "created_utc": 1629400700.0, "parent_id": "t1_h9kdrd5", "replies": [{"author": "NoSuchKotH", "id": "h9kiwvn", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "If anyone, pro-vax or anti-vax, says it's ok for others to die, then they, IMHO, lost all moral credit and should leave any discussion immediately. People like this are not worth to have around for any reason. They deserve to be banished.", "is_submitter": false, "distinguished": null, "created_utc": 1629401116.0, "parent_id": "t1_h9khw8c", "replies": [{"author": "SoulWanderer", "id": "h9kjsr9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #263", "submission": "p70kpc", "stickied": false, "body": "You are right!\nWe can debate, but there are minimum not to be crossed.", "is_submitter": false, "distinguished": null, "created_utc": 1629401477.0, "parent_id": "t1_h9kiwvn", "replies": []}]}, {"author": "BaddDadd2010", "id": "h9kxm19", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #50", "submission": "p70kpc", "stickied": false, "body": "> If you call them stupid, don't expect them to listen.\n\nThey don't listen anyway.", "is_submitter": false, "distinguished": null, "created_utc": 1629407036.0, "parent_id": "t1_h9khw8c", "replies": []}]}]}]}, {"author": "vook485", "id": "h9xos4m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p70kpc", "stickied": false, "body": "Thanks for your post and taking all available actions against the virus!\n\nOne nit-pick tho:\n\n>double-vaccinated\n\nThis term is confusing and misleading. It reads as if someone who just got their second dose of a 1-dose vaccine was vaccinated twice, when they've still got two weeks to go to reach full vaccination! It also ignores people who got a 1-dose vaccine, which offers (roughly) the same vaccination level as two doses of a 2-dose vaccine.\n\nInstead, I prefer the term \"fully vaccinated\", which applies to everyone who's received all doses of whichever vaccine they got and has waited enough days after their last dose for their immune system to process it.\n\nAlso, congrats on being 11 days from being fully vaccinated! May you have a >90% reduction in significant covid symptoms in the unfortunately common event of exposure!", "is_submitter": false, "distinguished": null, "created_utc": 1629655400.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9y8w9i", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "Thank you for pointing that out; I've edited the post accordingly. Wishing you the best of health as well!", "is_submitter": true, "distinguished": null, "created_utc": 1629664209.0, "parent_id": "t1_h9xos4m", "replies": []}]}, {"author": "NoSuchKotH", "id": "h9ghzvr", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "While I am glad that you and other immune compromised people are getting their 3rd shot, I wish we (i.e. the western world) would prioritize getting vaccines into the hands of the poor and developing countries before we give boosters to people who could as easily just stay at home or wear a mask.", "is_submitter": false, "distinguished": null, "created_utc": 1629323377.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9glm97", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I totally agree with you that more of our doses need to be donated, but it does seem like in the coming months a lot of people will have problematically low antibody levels, and unfortunately a lot of jobs simply can't be done from home.\n\nI wish that instead of walk in clinics being allowed and  unused doses being thrown away, there was a national form like the census everyone fills out where they can enter:\n\n- I have a compromised immune system and need a shot asap, attached is the proof\n- I work in a high risk field and need a booster when it's recommended, attached is the proof\n- I want to be in the waitlist to get a vaccine when available\n- I want my covid shot to be donated to a developing country\n\nWhere the last option is the default for anyone who doesn't respond, and registering for a dose and not showing up has a big penalty. At the very least we need something to ensure fewer doses are wasted.", "is_submitter": true, "distinguished": null, "created_utc": 1629325058.0, "parent_id": "t1_h9ghzvr", "replies": [{"author": "NoSuchKotH", "id": "h9gno0f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "In Germany we had that. Then, in July, almost from one day to the next, vaccination centers became deserted places. Misinformation and alternative facts kept people from getting vaccinated. They tried to get general practitioners and company doctors to convince people to get vaccinating. It was not really that successful, though. And by spreading the vaccination effort over more people and places, the number of wasted dozes rose dramatically :-( Doses that people in other countries would pay [lots of money for](https://time.com/6090239/iran-covid-vaccine-black-market/).", "is_submitter": false, "distinguished": null, "created_utc": 1629326000.0, "parent_id": "t1_h9glm97", "replies": []}]}, {"author": "RoyalEagle0408", "id": "h9hq2cn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #173", "submission": "p70kpc", "stickied": false, "body": "I get what you're saying but it's not like the vaccine is a finite resource. Pfizer can make more and honestly, if huge amounts of the population start to lose efficacy, that's going to for sure overwhelm an already strained healthcare system. If the pandemic continues to rage like a wildfire in America, that's not great for anyone. Also, developing countries unfortunately do not have the necessary infrastructure for the mRNA vaccines. I know they're more shelf stable than originally thought, but there are huge issues of delivery in developing countries. It does no good to ship vaccines that will go bad before they reach arms.", "is_submitter": false, "distinguished": null, "created_utc": 1629344547.0, "parent_id": "t1_h9ghzvr", "replies": [{"author": "NoSuchKotH", "id": "h9iaa35", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "While it is true that we can always produce more vaccines, the amount that can be produced in a given timespan is finite. And, especially for the mRNA vaccines, one cannot simply build new factories as the process used is quite involved.\n\nAlso, the loss in efficacy is still debated. We have everything from \"going down to 70%\" over \"no loss\" to \"a SARS infection from 20 years ago gives you a decent protection\", depending on which study you read. Current consensus seems to be that elderly and people with weakened immune system lose efficacy faster. But how much it is and when things become dangerous again, is not known. As such, I'd rather have people getting their first/second dose to get a decent protection first, rather then people who already have a decent protection boosting it.", "is_submitter": false, "distinguished": null, "created_utc": 1629358812.0, "parent_id": "t1_h9hq2cn", "replies": [{"author": "RoyalEagle0408", "id": "h9iohtj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #173", "submission": "p70kpc", "stickied": false, "body": "I’ve read the range as well, and also seen that HCW are more at risk. Anecdotally, I have heard doctors are getting infected. What I’m unsure of is if this is a Pfizer specific issue or just due to that being first and therefore the “oldest”, so those vaccinated with it are losing protection faster. We always knew boosters were going to be necessary. The problem is, we are entering a surge similar to last winter, which I don’t think many of us predicted for this August. That makes antibody levels more important. The more virus circulating, the more likely you are to be exposed (regardless of vaccination status). If you get sick and become symptomatic (which even the vaccinated are at higher risk of right now), you can spread it at a higher rate. While antibodies are not the whole story, they’re an important frontline selfie as in terms of stopping the pandemic.\n\nThe booster shots will not be given at once to most people, which is why I don’t see the issue with manufacturing more over the next six to eight months. I’m not suggesting anyone builds new factories- that would take far too much time, but is not unique to the mRNA vaccines. The processes is actually not that involved from a manufacturing standpoint.", "is_submitter": false, "distinguished": null, "created_utc": 1629370826.0, "parent_id": "t1_h9iaa35", "replies": [{"author": "NoSuchKotH", "id": "h9is84c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": ">I’ve read the range as well, and also seen that HCW are more at risk. Anecdotally, I have heard doctors are getting infected.\n\nIt's most likely just a probability issue. Especially doctors and HCW are constantly exposed to the virus. I.e., the viral load the have to bear is high. As we have no 100% sure prevention, it's just a matter of time until a doctor/HCW catches it, because they are, due to their job, constantly exposed.\n\nOr in other words: It's the difference between rolling a dice once and rolling a dice every 5 minutes.", "is_submitter": false, "distinguished": null, "created_utc": 1629373383.0, "parent_id": "t1_h9iohtj", "replies": [{"author": "RoyalEagle0408", "id": "h9isrjr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #173", "submission": "p70kpc", "stickied": false, "body": "I agree, but these are also people who managed to not get it while dealing with rationing PPE and no vaccine so my guess is they’re getting it outside of work (again, anecdotal, I don’t have the health history of all of them). I’m not saying increased exposure doesn’t increase your risk (obviously it does!), just that I think decreasing antibody titers are the culprit.", "is_submitter": false, "distinguished": null, "created_utc": 1629373722.0, "parent_id": "t1_h9is84c", "replies": []}]}]}]}, {"author": "MisanthropicScott", "id": "h9iafx1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "> I get what you're saying but it's not like the vaccine is a finite resource.\n\nIt's finite right now.\n\n> If the pandemic continues to rage like a wildfire in America, that's not great for anyone.\n\nAgreed. But, our vaccines are literally sitting there waiting for people and then expiring. There is an expiration date. If people here are refusing the vaccine, we have a moral obligation to ship it to places where people are literally dying to get it.\n\n> It does no good to ship vaccines that will go bad before they reach arms.\n\nThey're going bad in the U.S. too. I'm not sure how it's being handled to get them where they need to go. But, if they're going to expire here, we should at least try to get them to the people who need and want them since our people would rather die than get vaccinated.", "is_submitter": false, "distinguished": null, "created_utc": 1629358948.0, "parent_id": "t1_h9hq2cn", "replies": [{"author": "NoSuchKotH", "id": "h9ieuyk", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": ">They're going bad in the U.S. too. I'm not sure how it's being handled to get them where they need to go. But, if they're going to expire here, we should at least try to get them to the people who need and want them since our people would rather die than get vaccinated.\n\nThis is one of the things in the NNN/Qanon/anti-vax rethoric that I cannot understand. Why would people die before getting vaccinated? Even if there is a one in a thousand chance that the vaccine is deadly (which it isn't!) that's still safer than a 100% chance of killing yourself.", "is_submitter": false, "distinguished": null, "created_utc": 1629362820.0, "parent_id": "t1_h9iafx1", "replies": [{"author": "MisanthropicScott", "id": "h9if5sh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "I meant that they'd rather risk death by COVID than get vaccinated, not that they'd actually kill themselves.", "is_submitter": false, "distinguished": null, "created_utc": 1629363083.0, "parent_id": "t1_h9ieuyk", "replies": [{"author": "NoSuchKotH", "id": "h9ig3o7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "That's probably what they mean, but I've read often enough \"I rather die than take the vaccine\" on NNN to be not so sure anymore. These people seem rather adamant about their \"freedom\".", "is_submitter": false, "distinguished": null, "created_utc": 1629363918.0, "parent_id": "t1_h9if5sh", "replies": [{"author": "MisanthropicScott", "id": "h9igi1e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "Honestly, I don't even know what NNN is. I haven't heard anything about what they're really thinking. I was just going by the evidence of enormous outbreaks of COVID among the unvaccinated, especially in the red states, and was looking at them literally choosing to die of COVID.\n\nThe more famously anti-vax people who get it and die end up on /r/LeopardsAteMyFace (Inspired by [this tweet:](https://twitter.com/cavalorn/status/654934442549620736?lang=en) - \"'I never thought leopards would eat MY face,' sobs woman who voted for the Leopards Eating People's Faces Party.\")", "is_submitter": false, "distinguished": null, "created_utc": 1629364275.0, "parent_id": "t1_h9ig3o7", "replies": [{"author": "NoSuchKotH", "id": "h9ii721", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "NNN is the NoNewNormal subreddit. If you have never been there, don't go. It's a cesspit of conspiracy theories, FREEEDOM!, and \"we are just critical\" and delusions all around.", "is_submitter": false, "distinguished": null, "created_utc": 1629365767.0, "parent_id": "t1_h9igi1e", "replies": [{"author": "MisanthropicScott", "id": "h9jc10t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "I see NNN and think of triple net leases. So, what do I know. Sounds like that's the replacement for ~~TheDickhead~~ TheDonald.", "is_submitter": false, "distinguished": null, "created_utc": 1629383382.0, "parent_id": "t1_h9ii721", "replies": [{"author": "NoSuchKotH", "id": "h9kba3k", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "Yeah, it's as bad as TheDonald. With teh difference that half the people say that they are not white christian conservatives.\n\nWell, if you look like an orange idiot, walk like an orange idiot and sound like an orange idiot, then surely you are an orange idiot.", "is_submitter": false, "distinguished": null, "created_utc": 1629397945.0, "parent_id": "t1_h9jc10t", "replies": []}]}]}]}]}]}]}, {"author": "RoyalEagle0408", "id": "h9inq38", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #173", "submission": "p70kpc", "stickied": false, "body": "The production capability of Pfizer is incredible. Also, not everyone in the US is getting a booster tomorrow. The lot I get in December has more than likely not been manufactured yet.\n\nI do think we should ship doses elsewhere, I’m not saying we shouldn’t, but how do you suggest we send something that requires incredibly cold temperatures or that is stable for a month in a refrigerator to countries with little to no electricity? I’m not being sarcastic. This is the reality in a lot of places.\n\nIn my opinion, we need to help Novavax with their manufacturing issues. They need to get their vaccine submitted for approval. It’s a traditional vaccine, which takes longer to manufacture, but they have run into supply chain issues that could easily be addressed.", "is_submitter": false, "distinguished": null, "created_utc": 1629370251.0, "parent_id": "t1_h9iafx1", "replies": [{"author": "MisanthropicScott", "id": "h9jcgde", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "> how do you suggest we send something that requires incredibly cold temperatures\n\nI'm just guessing here. I'd probably suggest putting military grade logisticians on the task.\n\nMy guess would be to send it with the freezer and some form of generator keeping it going throughout. Then, if it's good for up to a month in a fridge, send lots of coolers and use dry ice to transport to a village at a time. Vaccinate a whole village and move on.\n\nBut, I'm sure you can poke holes in that, including where to get the dry ice in such places. Regular ice might have to do the job.", "is_submitter": false, "distinguished": null, "created_utc": 1629383563.0, "parent_id": "t1_h9inq38", "replies": []}, {"author": "NoSuchKotH", "id": "h9kbrwd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": ">but they have run into supply chain issues that could easily be addressed\n\nI don't know about Novavax, but Pfizer and AstraZeneca had plenty of supply chain issues because the US did not allow to export needed materials \"until everyone in the US got vaccinated\". Getting the US to export even a bit of what they had on stock and sitting around unused took a lot of negotiation.", "is_submitter": false, "distinguished": null, "created_utc": 1629398151.0, "parent_id": "t1_h9inq38", "replies": [{"author": "RoyalEagle0408", "id": "h9wpnek", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #173", "submission": "p70kpc", "stickied": false, "body": "(Sorry forgot to reply to this)\n\nI read an article that novavax is having an issue getting supplies for their cross-site validation assays, which are required for approval. It’s pretty standard for companies to use different sites to make the same thing so it seems like a common issue. Everyone is having issues with the supply chain, but Biden could use the DPA to help with forcing companies to make more of these things.\n\nETA: Novavax is based on the US, and I’d guess their manufacturing is as well (or they could be doing it here), so not sure why an export rule would impact them. Also, this vaccine would primarily be for people outside the US…", "is_submitter": false, "distinguished": null, "created_utc": 1629639858.0, "parent_id": "t1_h9kbrwd", "replies": []}]}]}]}]}]}, {"author": "usernames_suck_ok", "id": "h9h49fa", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "p70kpc", "stickied": false, "body": "When did you get your second dose? Curious since you're getting your third already.", "is_submitter": false, "distinguished": null, "created_utc": 1629333810.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9h8vdj", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "Different than the booster healthy individuals will probably need after 8 months. Got my second in march, but new recommendation is for immunocompromised people to get 3rd dose 28 days after their 2nd dose.\n\nThis whole time I probably only had <70% effectiveness instead of the >90% most people have after 2 (I think effectiveness means preventing all symptoms). Hopefully I'm around 90% now.", "is_submitter": true, "distinguished": null, "created_utc": 1629335967.0, "parent_id": "t1_h9h49fa", "replies": []}]}, {"author": "sparant76", "id": "h9hk77e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #51", "submission": "p70kpc", "stickied": false, "body": "Show off.", "is_submitter": false, "distinguished": null, "created_utc": 1629341456.0, "parent_id": "t3_p70kpc", "replies": []}, {"author": "humantheemma", "id": "h9h93hl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p70kpc", "stickied": false, "body": "Pidgin", "is_submitter": false, "distinguished": null, "created_utc": 1629336074.0, "parent_id": "t3_p70kpc", "replies": []}, {"author": "SybariteAussie", "id": "h9hof5r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p70kpc", "stickied": false, "body": "Life is for living! I am just 1 face in a vast crowd. “Memento Mori”. If you are keen for vaccinations, go for it. I certainly won’t judge you. I got the flu vaccine once. Was at the doctors for something else,was about to leave & he offered me a flu vaccine. In my head this translated to, would you like fries with that burger? I was amused by the doctor up selling so I agreed.", "is_submitter": false, "distinguished": null, "created_utc": 1629343647.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9hrl4d", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I appreciate that you got any vaccine, it's a start. I'm assuming you're coming from the point of view that vaccines aren't dangerous, but you doubt their effectiveness? I don't think I'll be able to change your mind if the world's scientists and medical experts have failed to convince you of their effectiveness.\n\nBut I plead with you to consider people with medical conditions that keep them at a higher risk, people with an allergy to vaccines, and all children who are not able to be vaccinated yet. For millions of people it is literally a matter of life and death if people like you get vaccinated and follow the proper precautions.", "is_submitter": true, "distinguished": null, "created_utc": 1629345411.0, "parent_id": "t1_h9hof5r", "replies": [{"author": "SybariteAussie", "id": "h9hwq1z", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p70kpc", "stickied": false, "body": "If this kind of vibe is going to prevail or intensify. If given the choice, will prefer a nice pot of hemlock tea. Am a recluse & rarely leave the house. Occasionally I enjoy interacting with humans. Not if I am being subjected to waves of panic & fear when trying to purchase food etc though. Am more concerned about becoming infected with fear than a virus. I am emphatic on one point. If I do get a vaccine, I will immediately destroy any certificate to prove I did get one. I would simply adjust & not go anywhere that requires any vaccine passport. I have empathy for people that have been victims of our pernicious media cartel.", "is_submitter": false, "distinguished": null, "created_utc": 1629348533.0, "parent_id": "t1_h9hrl4d", "replies": [{"author": "L4sgc", "id": "h9i30wa", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I know you think the rest of the world is overreacting, but what do you think the downside is in hedging your bets, taking a few min to vaccinated, and then going back to living life exactly as you were before? If you want to destroy your card to protest vaccine requirements by all means do so.\n\nIf you don't want to be afraid, don't be afraid. But I do want to point out my fear doesn't come from any fucking media. My condition means every time I caught a cold, flu, or any other virus, I got hit HARD. Obviously some of that was unavoidable, but I don't want to be forced to tempt fate for something which could've been prevented. I don't want to force someone who can't get vaccinated themselves to have to have an even tougher fight unnecessarily.\n\nI have family and friends who died last year, before the vaccines were available. Perfectly healthy and isolated as much as they could, but they said they must have caught it from their trip to the grocery store. I sincerely hope you won't have to experience anything similar.", "is_submitter": true, "distinguished": null, "created_utc": 1629352965.0, "parent_id": "t1_h9hwq1z", "replies": [{"author": "NoSuchKotH", "id": "h9ibe70", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": ">If you don't want to be afraid, don't be afraid. But I do want to point out my fear doesn't come from any fucking media. My condition means every time I caught a cold, flu, or any other virus, I got hit HARD. Obviously some of that was unavoidable, but I don't want to be forced to tempt fate for something which could've been prevented. I don't want to force someone who can't get vaccinated themselves to have to have an even tougher fight unnecessarily.\n\nTHIS! The vaccine is not to protect the young and healthy! It is there to protect those who have a weaker immune system, for whatever reason. And please no \"it only kills the old and obese.\" If your moral compass says it is ok to endanger other people for your own convenience, then you don't have morals.\n\nWhile it is true that, if you are a recluse that you are less of a problem, because the chances of you getting infected or infecting others are lower. But nobody in the western society can live completely isolated. You are still going out once or twice a week to get groceries or for work/bureaucracy... and reducing the probability of infecting someone else is key here.\n\nVaccines never were an absolute protection. Not the first vaccines that we got, neither the ones we have now. An epidemic (or all highly infectious diseases) are a probability game. The difference between measles killing everyone and their dog within a few weeks and only a few people getting ill are just a hand full of percent points in infection probability. The vaccines are an effective way to lower the probability of transmitting and getting seriously ill. This takes the steam out of the epidemic. Similarly do social distancing and masks lower the probability. Yes, they are not absolute protection either, but again, it's the reduction in probability that counts.\n\nAnd the earlier we get the probability of people getting infected down and keep it there for a sufficiently long time for the last pockets to fizzle out, the sooner we can stop this stupid game completely. And if we don't... well, just look at what's going on in Texas and Florida... and the whole rest of the southern US.", "is_submitter": false, "distinguished": null, "created_utc": 1629359778.0, "parent_id": "t1_h9i30wa", "replies": [{"author": "NoSuchKotH", "id": "h9ifavr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "Addendum:\n\nTo counter the whole \"if vaccinated people can still get ill, what's the whole point\" rethoric: Even if never cross a street and hunker down at home, never to leave again, you can still be hit by a car. Heck, you could even die of an air plane crash while being at home. Sure, the probability is low, but it can still happen!", "is_submitter": false, "distinguished": null, "created_utc": 1629363208.0, "parent_id": "t1_h9ibe70", "replies": []}]}, {"author": "SybariteAussie", "id": "h9iffv7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p70kpc", "stickied": false, "body": "I also have allergies. If I catch a virus & become ill. I will stay home and either live or die. There will be “no great mischief” if I perish. I will not go to the doctors or hospital. I live alone so nobody will become infected. Those that are vaccinated will be safe. If I permit my hay fever or food allergies to get out of hand they can manifest into hives & asthma. I had a anxiety induced asthma attack for the first time since high school about 6 weeks ago. Car got a flat tyre, my jack was not working, I was on the side of the highway, it was during a lockdown, I didn’t have mobile phone with me & about a 9 or 10 hours walk from home. Fortunately someone had seen my vehicle & me sitting forlornly on the side of the highway on the grass a few kilometres from the car. Stopped & offered help. I find that wearing a cover over my good eye on my sunglasses when shopping assists with not reading or feeling the emotions of others. My other eye is a bit lazy but works well enough for me to navigate a supermarket. Lockdowns don’t concern me. I have been a hermit since 2013 & rarely leave the house. My record for not uttering a single word is 17 days. If prisoners were allowed access to as many books as they like & could turn light on or off. Solitary confinement sounds very appealing to me! I hear that only 3 books per week is permitted & you are unable to turn the light on to read through the night. I do not consume any domestic media. No tv or radio. I realise lockdowns are on again if I notice empty roads on my way to the shop or denied access to shop due to lack of mask. I have to suppress the urge to remove my shoe & lick the sole, from heel to toe. I just leave & return home. To assist with anxiety & worry, I can recommend a audiobook available free on YouTube. The Enchiridion by Epictetus. If you find his writing style hard work. Meditations by Marcus Aurelius. Seneca has a prettier writing style that delivers similar information. A cruder modern version is “The subtle art of not giving a f*ck by Mark Manson. I don’t mind the government having a iron fist. It’s the perfumed, silk lined velvet glove it’s wearing that I despise.", "is_submitter": false, "distinguished": null, "created_utc": 1629363331.0, "parent_id": "t1_h9i30wa", "replies": [{"author": "L4sgc", "id": "h9iims6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "I appreciate you having this conversation with me and giving this some thought. From what you've written here it sounds like you have a lot of apathy about yourself and other humans, and a lot of spite for the media and the government. Some or all of which is probably well deserved, but the spread of a virus is purely a biological matter. And you haven't said anything doubting the vaccines effectiveness or safety.\n\nIt sounds like you simply aren't willing to put in a minimal effort to protect the health of yourself or others.", "is_submitter": true, "distinguished": null, "created_utc": 1629366144.0, "parent_id": "t1_h9iffv7", "replies": [{"author": "SybariteAussie", "id": "h9ipwm9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p70kpc", "stickied": false, "body": "Any anger I feel is towards the media. At times it feels they have too much power. Lots of prime minister changes in Australia in the last 10 years. Have they occurred because the prime minister is not doing what they are told? Governments being secretive or deceptive is no surprise. It’s possible that I have more empathy for others than I do myself? “Memento Mori”. The way I die is of more concern to me than death itself. Can I purchase my vaccine myself with my own $ without producing identification? Is it necessary to get all 3? Can I get all 3 in the same day? Winter is almost over here. Spring & summer beckon. It might make sense to not worry until the end of autumn? It’s possible that we will be on vaccine number 6 by then? Perth West Australia is next to a desert. Hot dry air. Good place to be when having a cold or flu. I have not formed any concrete opinions yet. I feel some information is being withheld. I began to dislike the media when they were relentlessly attacking Trump. Living in Australia I shouldn’t care. I don’t have any strong feelings for him, I felt sorry for him & purchased a Trump T-shirt & hat. The febrile attacks continued. I responded by joining the NRA & I don’t own or intend on owning a gun. I know the media cartel dislike the NRA & that the NRA don’t crumble or bow to them. To stop myself wasting $ I stopped watching tv. Feel much better for it! I’m confident that I could get a mask exemption from my doctor & possibly the vaccine. If the vaccine is Sulfur based I will have a reaction of some sort. I have to catch a cab home after a antihistamine injection when I get severe hives. It knocks me out for the rest of the day and night. Too groggy to drive the next day.", "is_submitter": false, "distinguished": null, "created_utc": 1629371838.0, "parent_id": "t1_h9iims6", "replies": [{"author": "NoSuchKotH", "id": "h9kcr9q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": ">I feel some information is being withheld.\n\nFunny you think that. From day one, all scientific publishers agreed to make all studies and papers related to Covid available to everyone for free. If you felt like it you could have watched scientist discover how Covid works and how to combat it in real time. Yet nobody cares to look anything up. Everyone regurgitates that things are being hidden. That nefarious things are happening. Or other conspiracy theories that come from god knows where. Meanwhile nothing in science has been ever this public and this easily accessible to the world!", "is_submitter": false, "distinguished": null, "created_utc": 1629398561.0, "parent_id": "t1_h9ipwm9", "replies": [{"author": "SybariteAussie", "id": "h9lvya6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p70kpc", "stickied": false, "body": "Some seem hypersensitive on this delicate subject. Some opinions are forbidden. I understand people buying fear. It’s being enthusiastically promoted by the media cartel. I don’t condemn anyone either taking vaccine or succumbing to fear. Some doctors have lost jobs or have been canceled for their opinions. I am trying to comprehend how a fully vaccinated person would find a unvaccinated hermit a danger. Can I purchase my own vaccine or vaccines with my own $? Can I purchase all 3 & take them one after the other or mix them & take them all at once? It’s possible that your critique of me being ambivalent about my own health is correct? If you are fully vaccinated, why are you concerned about others not being vaccinated? If you need to vent, I can be your wailing wall. I have some other faults that you are not aware of that are either a source of shame, regret or pain. If you like, I can provide you with some ammunition that will sting when utilised. Expose several vulnerable points that still cause me pain and require maintenance.", "is_submitter": false, "distinguished": null, "created_utc": 1629422503.0, "parent_id": "t1_h9kcr9q", "replies": []}]}]}]}]}]}]}]}]}, {"author": "DELETED", "id": "h9gp1z6", "score": -5, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p70kpc", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1629326638.0, "parent_id": "t3_p70kpc", "replies": [{"author": "BaddDadd2010", "id": "h9gqubp", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #50", "submission": "p70kpc", "stickied": false, "body": "This is such an ignorant post.  Like 3 year old kids have any choice at all.  Like everyone can just stay home and not work and don't need to eat.", "is_submitter": false, "distinguished": null, "created_utc": 1629327469.0, "parent_id": "t1_h9gp1z6", "replies": [{"author": "DELETED", "id": "h9gsagz", "score": -6, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p70kpc", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1629328144.0, "parent_id": "t1_h9gqubp", "replies": [{"author": "BaddDadd2010", "id": "h9gwzfr", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #50", "submission": "p70kpc", "stickied": false, "body": "No, fuck you assholes.  3 year olds **don't get choices**.  People who are living paycheck to paycheck **don't get choices**.  People who are immune compromised got **no fucking choice** in that.  Assholes like you could *choose* to wear a mask, could *choose* to vaccinate.  But you don't because you're fucking morons, and the rest of us are tired of your shit.", "is_submitter": false, "distinguished": null, "created_utc": 1629330381.0, "parent_id": "t1_h9gsagz", "replies": [{"author": "DELETED", "id": "h9gyvev", "score": -6, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p70kpc", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1629331289.0, "parent_id": "t1_h9gwzfr", "replies": [{"author": "BaddDadd2010", "id": "h9h975h", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #50", "submission": "p70kpc", "stickied": false, "body": "More bullshit from an asshole full of crap like \"You're 100% protected from the virus if you don't leave your house and stay alone.\"", "is_submitter": false, "distinguished": null, "created_utc": 1629336123.0, "parent_id": "t1_h9gyvev", "replies": []}, {"author": "Rise-and-Fly", "id": "h9i01h4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #185", "submission": "p70kpc", "stickied": false, "body": "There is something wrong with your brain. Whether through privilege or just bad wiring, you're missing empathy.", "is_submitter": false, "distinguished": null, "created_utc": 1629350796.0, "parent_id": "t1_h9gyvev", "replies": []}]}]}, {"author": "MisanthropicScott", "id": "h9iap85", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p70kpc", "stickied": false, "body": "> All risks willingly taken.\n\nI'm genuinely curious how you feel about drunk drivers. Do you think they're entitled to take that risk?", "is_submitter": false, "distinguished": null, "created_utc": 1629359171.0, "parent_id": "t1_h9gsagz", "replies": []}]}]}]}, {"author": "roguezebra", "id": "h9h0t8s", "score": -5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #15", "submission": "p70kpc", "stickied": false, "body": "99.x% survival & natural immunity are personal choices too. Good luck with your vaccines.", "is_submitter": false, "distinguished": null, "created_utc": 1629332197.0, "parent_id": "t3_p70kpc", "replies": [{"author": "L4sgc", "id": "h9hc9bn", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "For many groups the chance of survival is less than 97%, but even increasing your chances from 99% to 99.9% or 99.99% is a lot of lives saved when dealing with hundreds of millions or billions of people. But just looking at survival as a binary state doesn't take into account the people who survive after needing to spend weeks in intensive care with ventilators / will experience permanent health complications like reduced lung capacity.\n\nThe covid cases using ER and ICU capacity are also taking resources away from anyone else who has a serious medical emergency. There are areas in the US today where you literally will need to wait for someone to die before there is a bed/nurse/doctor available to see you. That extra waiting time seriously reduces the chances of surviving other medical emergencies like heart attacks. \n\nTrusting your natural immune response also has several major problems, like the fact that many people are capable of transmitting covid and infecting others before they begin to express symptoms and will know to quarantine themselves. The antibodies from fighting off covid also seem not to last as long as the antibodies you get from the vaccine. And the long term health complications from fighting covid infection and symptoms are not understood.", "is_submitter": true, "distinguished": null, "created_utc": 1629337570.0, "parent_id": "t1_h9h0t8s", "replies": [{"author": "roguezebra", "id": "h9hi2zb", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #15", "submission": "p70kpc", "stickied": false, "body": "T cells matter.", "is_submitter": false, "distinguished": null, "created_utc": 1629340404.0, "parent_id": "t1_h9hc9bn", "replies": [{"author": "L4sgc", "id": "h9hktcj", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #75 | Legio Virtus", "submission": "p70kpc", "stickied": false, "body": "> T cells matter.\n\nI'm glad you agree and understand some biology. However I think you are slightly misinformed about the way vaccines work. The mRNA covid vaccines were specifically studied, and found to be highly potent in inducing spike-specific T cell response in naïve individuals (never contravted covid). As well as  triggering memory T cell response in COVID-19 recovered individuals. So weather or not you've previously contracted covid, your body will be more prepared to fight a future covid infection after getting the recommended vaccine doses and boosters.\n\nWhy wouldn't you want your body to have every tool available to fight this disease and reduce your symptoms and risk of serious health complications?", "is_submitter": true, "distinguished": null, "created_utc": 1629341769.0, "parent_id": "t1_h9hi2zb", "replies": []}]}]}, {"author": "NoSuchKotH", "id": "h9iflcf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "The survival rate is between 99.0% and 98.0%, depending on which country/state you live in. The whole 99.999999% survival rate is total utter bullshit. If that were true, then 600k people would not have died in the US already.\n\nAlso, natural immunity only works ***after*** you had the illness ***and survived***. Before that, you are not immune.", "is_submitter": false, "distinguished": null, "created_utc": 1629363469.0, "parent_id": "t1_h9h0t8s", "replies": []}, {"author": "Rise-and-Fly", "id": "h9i0cyz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #185", "submission": "p70kpc", "stickied": false, "body": "Neat thing about science, we don't need your idiotic concepts like \"luck.\" We have data, and odds, while you have feelings like petulance and, beneath that, fragility.\n\n\nImbecile.", "is_submitter": false, "distinguished": null, "created_utc": 1629351023.0, "parent_id": "t1_h9h0t8s", "replies": [{"author": "NoSuchKotH", "id": "h9ifua4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "Please don't call names. While I agree with your sentiment, I don't think calling people you disagree with, no matter how outlandish their claims are, is proper.\n\nFeel free to call them names after they have been rude, though. But only after!", "is_submitter": false, "distinguished": null, "created_utc": 1629363690.0, "parent_id": "t1_h9i0cyz", "replies": [{"author": "Rise-and-Fly", "id": "h9k3xfv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #185", "submission": "p70kpc", "stickied": false, "body": "People like that who are perpetuating misinformation and leading to the death and long term disability of real human beings have easily been adequately \"rude\" enough for me to call them their very deserved name of imbecile, and in fact much worse wouldn't be unwarranted.", "is_submitter": false, "distinguished": null, "created_utc": 1629394862.0, "parent_id": "t1_h9ifua4", "replies": [{"author": "NoSuchKotH", "id": "h9kf8py", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p70kpc", "stickied": false, "body": "Yes, but name calling will not help anyone.", "is_submitter": false, "distinguished": null, "created_utc": 1629399597.0, "parent_id": "t1_h9k3xfv", "replies": [{"author": "Rise-and-Fly", "id": "h9kj0sb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #185", "submission": "p70kpc", "stickied": false, "body": "Of course not, but I'm not trying to help that individual. I'm trying to vocally draw a line in the sand that I - and others - are done coddling their immature, petulant, conspiracy theory mentality.", "is_submitter": false, "distinguished": null, "created_utc": 1629401161.0, "parent_id": "t1_h9kf8py", "replies": []}]}]}]}]}]}]}