{"title": "Is the moral obligation to question authority a clever tactic to keep the oppressed suppressed in their current state?", "name": "t3_peppz9", "url": "https://www.reddit.com/r/TheFlyingTree/comments/peppz9/is_the_moral_obligation_to_question_authority_a/", "selftext": "Question of the day, no wrong answers here.\n\nIt crossed my mind that this “obligation” requires more proportional resources from the oppressed.\n\nMaking it a moral obligation would therefore create its own obligation to accumulate resources. This may be difficult if conditions that need to be questioned need to be questioned because you cannot accumulate resources.\n\nA failure to do so would leave you at the starting point, and without the resources to question authority, you’d have no “moral” ground to do so.\n\nBy working harder to accumulate resources, and challenging authority to remove cognitive dissonance, you’d be back at square one.\n\nSo, power perpetuates itself.\n\nI’m either crazy or on to something. Or I heard it and am not giving credit where I should be.", "score": 2, "upvote_ratio": 0.63, "permalink": "/r/TheFlyingTree/comments/peppz9/is_the_moral_obligation_to_question_authority_a/", "id": "peppz9", "author": "Least_Land", "link_flair_text": "Idea", "num_comments": 18, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630353161.0, "comments": [{"author": "Btankersly66", "id": "hayzjjx", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "peppz9", "stickied": false, "body": "The oppressed have no moral obligation to question the authority of their oppressors. The burden lies on the authority committing the oppression to justify its oppression. They rarely do that because they will always have an excuse as to why various forms of oppression are warranted. And mostly because they run the risk of losing their power.", "is_submitter": false, "distinguished": null, "created_utc": 1630354786.0, "parent_id": "t3_peppz9", "replies": [{"author": "Least_Land", "id": "hazncax", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "peppz9", "stickied": false, "body": "I guess it follows, then, that putting the burden on the oppressed to justify their freedom would be an imposed moral that irrationally justifies their authority.\n\nWhich makes sense, because oppressive authority is hardly legitimate, especially if you disregard possession of said authority as justification.", "is_submitter": true, "distinguished": null, "created_utc": 1630365140.0, "parent_id": "t1_hayzjjx", "replies": []}]}, {"author": "GreyShuck", "id": "haz17ev", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #201", "submission": "peppz9", "stickied": false, "body": "To the extent that there ever is any moral obligation to question authority - which I do not for a moment see that there is - then there must be a corresponding moral obligation on the authority to ensure that the necessary resources to do so are available.\n\nFailure to do that would remove any obligation from the oppressed.", "is_submitter": false, "distinguished": null, "created_utc": 1630355472.0, "parent_id": "t3_peppz9", "replies": [{"author": "Least_Land", "id": "haz8h0k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "peppz9", "stickied": false, "body": "Fascinating. \nAnd I’m not being sarcastic.", "is_submitter": true, "distinguished": null, "created_utc": 1630358515.0, "parent_id": "t1_haz17ev", "replies": []}]}, {"author": "Kweldulf", "id": "hb1948w", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "peppz9", "stickied": false, "body": "Yes. To begin with: the moral obligation to question authority is present only in democratic society. In a totalitarian one for example one does not have such an obligation, as it would get them killed. So we need to consider democracies only.\n\nNow since this moral obligation is essentially one of the guards which make a democracy a functioning system it's also logical to consider it a tool to maintain the democracy. As such it is already a tool of maintaining the status quo. Now let's sprinkle on top of that the real world stuff you mentioned: the economic necessity of posessing resources in order to effectively question authority.\n\nOne can notice that the amount of resources necessary to effectively question authority is inversly proportional to the diversity of the political scene in a given state. In other words it's easier to have your words heard in a more pluralistic system and harder in say a two party system.\n\nIn democracies designed to become two party systems by their administrative procedures (so in countries such as the US, UK or Poland) the moral obligation of questioning the authority becomes but a tool for legitimising the governance, while effectively maintaining status quo. There is very little an individual can do in such systems to act out any kind of change, thus making questioning the authority nothing but a mirage, an afterimage of a dream, which a well functioning democracy would be.\n\nIn other words the less pluralistic a democratic system is the more it resembles in its actual functioning a more power-centralised system, in which the moral obligation does not exist. The moral obligation to question authority is not a thing in feudalism, totalitarianism or in technocracy.", "is_submitter": false, "distinguished": null, "created_utc": 1630398810.0, "parent_id": "t3_peppz9", "replies": [{"author": "Least_Land", "id": "hb3byx5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "peppz9", "stickied": false, "body": "Thank you for the thoughtful comment. I did hear it somewhere. :-)\n\nOne can vote, if they can. It’s not a small deal, either. \n\nIn a true democracy, one person seeking enough power to effectively question authority would be highly suspect without deference to said authority. \n\n“Moral breakdown” of a society would imply that the breakdown is against some immutable authority, such as God, and it would threaten the legitimacy of the institution. The Spanish Inquisition comes to mind, among others. \n\nWhich brings us to, basically, fear and violence, self-defense, and non-reactivity, and collective actions as means of responses. Which we are free to choose.\n\nWow, freedom and bondage really are states of mind. I mean, I’ve heard it, just never really applied it to this context before.", "is_submitter": true, "distinguished": null, "created_utc": 1630436559.0, "parent_id": "t1_hb1948w", "replies": []}]}, {"author": "shig23", "id": "hayw0xc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "peppz9", "stickied": false, "body": "What kind of questioning requires resources?", "is_submitter": false, "distinguished": null, "created_utc": 1630353334.0, "parent_id": "t3_peppz9", "replies": [{"author": "Least_Land", "id": "haywgvr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "peppz9", "stickied": false, "body": "Most questioning. Many people don’t question… to keep their jobs, the peace, prevent retaliation. \n\nQuestioning at a national level requires lobbying money, or at least time to write your senator/reps.", "is_submitter": true, "distinguished": null, "created_utc": 1630353514.0, "parent_id": "t1_hayw0xc", "replies": []}]}, {"author": "Kelyaan", "id": "haz3xw2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "peppz9", "stickied": false, "body": "There is no such thing as a moral obligation, Such a thing would imply that there is an objective moral to push out there to make an obligation.  \n\n\nPeople will make excuses as to why they can't even in a world where all the information you every need is accessible in less than a few minutes.", "is_submitter": false, "distinguished": null, "created_utc": 1630356612.0, "parent_id": "t3_peppz9", "replies": [{"author": "Least_Land", "id": "haz4gtq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "peppz9", "stickied": false, "body": "Moral == personal belief. \nPeople exist -> have beliefs,\nArgument of no objective morals does not compute… analyzing professed morals is prudent for objective philosophy.", "is_submitter": true, "distinguished": null, "created_utc": 1630356828.0, "parent_id": "t1_haz3xw2", "replies": [{"author": "Kelyaan", "id": "haz6j8a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "peppz9", "stickied": false, "body": "Your reply offers nothing to counter my statement.", "is_submitter": false, "distinguished": null, "created_utc": 1630357691.0, "parent_id": "t1_haz4gtq", "replies": [{"author": "Least_Land", "id": "haz7uqt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "peppz9", "stickied": false, "body": "It means I don’t understand it. \n\n\nNo morals… \n\ndoes that mean you have no morals? That you view morality as irrelevant? Are you calling people’s personal morals something? Do you invalidate the possibility of people adopting someone else’s morals voluntarily? Are you fighting back against morals which someone has tried to impose upon you? Are you protesting morals which have been codified in law? Are you opposed to being subjected to morals you disagree with? \n\nAs I see it, morals are beliefs that inform right and wrong within a person.", "is_submitter": true, "distinguished": null, "created_utc": 1630358252.0, "parent_id": "t1_haz6j8a", "replies": [{"author": "Kelyaan", "id": "haz9v3y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "peppz9", "stickied": false, "body": ">does that mean you have no morals? That you view morality as irrelevant? Are you calling people’s personal morals something? Do you invalidate the possibility of people adopting someone else’s morals voluntarily? Are you fighting back against morals which someone has tried to impose upon you? Are you opposed to being subjected to morals you disagree with?\n\nNothing that I said implies any of those things in any way possible. and the fact you're asking that makes me doubt the integrity of your replies going further.  \n\n\n>Are you protesting morals which have been codified in law?\n\nLegal moralists are the lowest rung and need mocking - They are jokes.  \n\n\n>As I see it, morals are beliefs that inform right and wrong within a person.\n\nSo where does \"The moral obligation\" come from since morals are subjective not objective - there cannot be \"the moral obligation\" unless they are objective.", "is_submitter": false, "distinguished": null, "created_utc": 1630359113.0, "parent_id": "t1_haz7uqt", "replies": []}]}]}]}]}, {"author": "roundearthervaxxer", "id": "hazl3tt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "peppz9", "stickied": false, "body": "Question authority became abandon authority and that is a problem", "is_submitter": false, "distinguished": null, "created_utc": 1630364123.0, "parent_id": "t3_peppz9", "replies": [{"author": "Least_Land", "id": "hazmj25", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "peppz9", "stickied": false, "body": "So, do you find loyalty to be morally imperative?", "is_submitter": true, "distinguished": null, "created_utc": 1630364767.0, "parent_id": "t1_hazl3tt", "replies": [{"author": "roundearthervaxxer", "id": "hazx63o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "peppz9", "stickied": false, "body": "No, I think it is earned.", "is_submitter": false, "distinguished": null, "created_utc": 1630369751.0, "parent_id": "t1_hazmj25", "replies": [{"author": "Least_Land", "id": "hazybv0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #226", "submission": "peppz9", "stickied": false, "body": "I’m guessing it’s because of trust?\n\nI’m going to assume so, correct me if I’m wrong.\n\nIf it’s trust based, and we should abandon bonds built on trust…\n\nWhat would be the requirements for abandoning authority?", "is_submitter": true, "distinguished": null, "created_utc": 1630370295.0, "parent_id": "t1_hazx63o", "replies": [{"author": "roundearthervaxxer", "id": "hb02v71", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "peppz9", "stickied": false, "body": "Only meaningful bonds are built on trust. I feel that loyalty and trust are hard-earned and easily lost.\n\nWhat I mean about abandon authority:\n\nIn the 60s, young people started waking up to a lot of realities. That is when you would see the \"Question Authority\" bumper stickers, because before this time people, largely, trusted authority. This was a good thing. Question the profit motives of health insurance companies. Question the role of lobbyists and if we were really helping to craft policy that helped individuals, etc.\n\nWe need to be wary of those who take this a step further and abandon authority altogether. When the polio vaccine was invented, few people questioned it. They were grateful. People were proud and happy that Americans landed on the moon. They didn't question that it even happened.\n\nNow you have over a third of the population questioning practically every respected scientist anywhere about climate change, public health, and other issues. These are career professionals that have spent their entire careers, every day, working to help people.\n\nYes, we need to be wary of corporate interests, but at the same time, we need to respect career professionals. We trust engineers. We trust electricians. in the main, we can trust scientists as well.\n\nPoliticians are one exception to this rule, in my opinion.", "is_submitter": false, "distinguished": null, "created_utc": 1630372425.0, "parent_id": "t1_hazybv0", "replies": []}]}]}]}]}]}