{"title": "Legitimate Question: Why are my opinions garbage? [TW talk of genocide]", "name": "t3_p3ouuf", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p3ouuf/legitimate_question_why_are_my_opinions_garbage/", "selftext": "I'm going to preface this post by stating that I'm going to try to word it as carefully and sensitively as possible.  I have a therapist and am not in danger, nor do I pose a danger to others.  I'm trying to convince myself of healthier ways of thinking, hence why I'm asking this on /r/TheFlyingTree, a place with a lot of diversity of opinion and where there's no pre-determined topic of the sub.  I am also not asking for medical advice (this is the internet and y'all're not medical professionals).  Nor am I advocating for violence.  Fair?  **I also hope that anyone who responds to this post reads it carefully and fully.  I say this because comments pushing at already-addressed points will appear as weak to my intuition and will be less likely to instill change.**\n\nSo I likely have either Narcissistic Personality Disorder or otherwise significant subclinical narcissistic personality traits.  Not diagnosed but seeking formal diagnosis.  I suffer from bouts of extreme hatred.  I discuss these with my therapist, but I kinda' would like to have them dissected in greater philosophical detail than can be found within a medical office.\n\nAnyway I have rather extreme views about what \"justice\" is.  Namely my views are largely genocidal, calling for people with Cluster B and C personality disorders, as well as other harmful psychological traits such as paedophilia / hebephilia / ephebophila, anti-vax views, tendencies to be sucked into harmful cults, etc., to just be rounded up and gassed.  Throw animal and child abusers in there too.  I don't feel empathy or remorse for such p... well, I don't view them as \"people\" either.  They're play things to me.  Toys for hard labor or just entertainment.  I've entirely dehumanized them.  This is the case *even while* I understand that people are shaped by their experiences and other factors they don't control.\n\nNow let me be very clear once again:  I am **not** endorsing my views.  But they are my sincerely-held views and much of the time I consciously believe in them.  And yes, I'm aware that gassing people with Cluster B PDs would include myself.  I will also be very clear that no I do **not** have self harm ideation.  I see it as a game of numbers:  harming myself does nothing and harms people I care about.  But a large-scale genocide makes people like me a non-factor and actually would solve many social ills... or so my thinking goes.  Put it this way:  if I were hypothetically given a position of total political power, I would definitely abuse that power to wipe human population down to a 4, maybe 5-digit number.  Why so low?  Didn't I just specify that my hate specifically targets specific clusters of people?  Well because my definitions of things like harmful cults, child abuse, and animal abuse are *very* encompassing.  Throw in climate deniers and anti-vaxxers and you've got a recipe for the near-extinction of humanity.  I sympathize with the Voluntary Human Extinction Movement.\n\nI am aware that my views are, shall we say, unpopular.  But I don't want to deny them \"merely\" because everyone else thinks they're wrong.  I'd feel insincere.  Rather, if I'm going to change my views, I'd rather do so wholeheartedly and be able to explain why the old views were wrong in detail.\n\nI've been able to partially convince myself that I'm wrong using a few lines of reasoning.  The first is that the process of genocide would likely make *more* traumatized people in the process, which would in turn make more people be predisposed to narcissism, cultlike behaviour, conspiratorial thinking, and so on.  Next, many factors for these problems are at least epigenetic, sometimes outright genetic.  So they won't go away via extermination attempts, especially the epigenetic ones since they're much harder to pin down and track.  Next, it doesn't *really* solve any problem because you can always say that some time in the future the problem, even if \"solved\" now will re-emerge.  As a matter of principle we may take this argument to the extreme: either the problems will re-emerge within humans, or whatever species comes next after us, or on some other planet.  You could eradicate social ills from the entire galaxy and still wonder about invasion from the next galaxy over.  Next I have another (granted extravagant and idiosyncratic) argument.  I see that merely investing in transhumanism and space travel would be a better utilization of the resources which would be spent on genocide.  Narcissism and other such issues cease to be an issue if the next physical individual is two light-years away and, like current social media, you have the ability to block users.  No physical harm of one person to another, and the ability to block out verbal harms.  Lastly is a Buddhist answer:  violence, anger, and aversion all stem from a wrong understanding of the self.  The concept of an intrasient, unconditioned self is illusory, and so any actions pursuant to that are based in delusion.  Violence is a manifestation of anger, a mental poison.  Hatred is addictive and violence releases dopamine, but neither resolves the problem of the cycle of coming and going, and discontentment or dukkha as a result of attachment to transient things.\n\nBut all these arguments have holes in them which my anger exploits.  Trying to heal or educate people out of these maladies is far too taxing on an already overburdened medical system.  Society still exists for the unenlightened.  Current advances in care for PDs and paedophiles and cult members have certain levels of success but are far from actually fixing anything.  We still see rampant misinformation everywhere and tonnes of people being sucked in, far more than can be easily taken back out.  Child abuse and malicious forms of parenting are so commonplace that while we fight spanking and telling children that they shouldn't have been born, we are forced to overlook other clearly injurious practices like fat shaming and less-obvious forms of Munchausen by Proxy (cases where for example the parent doctor shops until they get a \"legitimate\" diagnosis of *something* without any actual tampering of evidence or outright lying).  Technological advances to help in these matters is very far away.\n\nI know that I have a \"right\" to be upset by these things, but that means little to me.  I have a \"right\" to spread awareness and help support groups, but as I said above that doesn't even come close to enough.  And I know that I'll be asked \"well who draws the line?\"  My response is I don't care, we'll take a bunch of universally-hated traits and just roll with it.  And I know that things like psychiatric diagnoses can be varied and that different diagnosticians will give different diagnoses due to varying philosophies and experience.  I also don't care because a billion false positives leading to executions is better than even one false negative.  I have no empathy in this case, so appealing to my sense of empathy won't work.\n\nI'm a deeply religious person and I abhor violence.  Ironically I'm a Bahá'í (we are actively persecuted in many countries but particularly Írán).  And even more profoundly ironically I'm Jewish by matrilinial birth and lost family in the holocaust.  But... neither of those things factors into my thinking.  Antisemitic and anti-Bahá'í views are largely based in dumb beliefs.  Hitler espoused all sort of conspiratorial and unscientific drivel that got him recognized early by the scientific community as a lunatic.  North Korea's Juché and Korean supremacist thought is also almost entirely bunk.  Same with other racial supremacy theories such as black supremacy and white supremacy.  Race is a social construct that has no physical basis in reality, and ethnicity is only slightly better-defined.  Cultures, gender, and other things are very fluid.  Eugenics is also bunk because the idea of, for example, a deaf race or other disability \"harming the gene pool\" just doesn't numerically add up.  Neurotypicality is also just an idealized model.  My anti-Personality Disorder views are certainly in the eugenics genre, but things like NPD, ASPD, and BPD can actually correlate with having a lot of children, who in turn are also likely to have predispositions towards at least many types of maladaptive behaviour as well as genetic predispositions tomards various PDs.  On top of this, the upper echelons of business and politics also often have higher rates of personality disordered individuals, and while this doesn't account for the vast majority of PD individuals, it means that social power is more likely to be influenced significantly by personality disordered people.  This is also true when discussing things like familial social hierarchies and more local social groupings.  Beyond the medical side of the PDs, looking at non-clinical things like consipiratorial thinking, harmful cultlike behaviour, purchasing of meat from an extremely abusive meat industry while intentionally and consciously turning a blind eye to it, and authoritarian parenting makes me much more sympathetic to my genocidal views.\n\nSo...... why am I wrong?  I mean it, prove me wrong.  And not in the internet provocateur \"prove me wrong\" manner, either.  I actually *want* to be shown how ill-conceived my views are.  I should also note that any responses I receive will likely get pushback from me in \"support\" of my current maladaptive views.  This isn't me being argumentative or unwilling to change.  I use arguments in favour of my own views in order to push them until they break.  It's a method of learning.  My thoughts are sincere, so they won't go down without a fight.", "score": 0, "upvote_ratio": 0.5, "permalink": "/r/TheFlyingTree/comments/p3ouuf/legitimate_question_why_are_my_opinions_garbage/", "id": "p3ouuf", "author": "LilamJazeefa", "link_flair_text": "Question", "num_comments": 97, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628872828.0, "comments": [{"author": "Muroid", "id": "h8t0bg9", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p3ouuf", "stickied": false, "body": "So... you’re saying that you wish you lived in a world where you are going to be rounded up and gassed?", "is_submitter": false, "distinguished": null, "created_utc": 1628875111.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "gerkletoss", "id": "h8ua9us", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #291 | Ordo Cognitus", "submission": "p3ouuf", "stickied": false, "body": "That's how I read it.", "is_submitter": false, "distinguished": null, "created_utc": 1628893603.0, "parent_id": "t1_h8t0bg9", "replies": []}, {"author": "LilamJazeefa", "id": "h8t10rh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Basically, the way my mind puts it is that \"the needs of the many outweigh the needs of the few or one.\"  If I knew that systematically eradicating people like me was the answer, I would not feel sorrow or self-pity.\n\nNow, I can see clearly that such a drastical policy is, erm, unlikely.  But it's where my unwell mind goes.  So I have to walk along with it to try to convince it to turn around.", "is_submitter": true, "distinguished": null, "created_utc": 1628875389.0, "parent_id": "t1_h8t0bg9", "replies": [{"author": "Muroid", "id": "h8t3vc9", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p3ouuf", "stickied": false, "body": "When I read your post, what I see is “There are a lot of problems in the world that frustrate me because I don’t see a way for them to be resolved. I wish there was a button I could press to just make all of these problems go away. The closest scenario to that that I can imagine is if all of the people I see as contributing to these problems just died.”\n\nThe problems with this are manifold. To start with, who should die depends heavily on whose perspective on what an ideal world would look like. Second, it’s entirely possible that your concept of who to remove to achieve your goals is just wrong. That certain individuals would actually be better to remove than people who fit the chosen criteria and people who fit the criteria would better to be left alone, resulting in wholly unnecessary slaughter.\n\nAnd finally, this has been tried by various societies countless times throughout history. Removing the “problem people” through violence is a hallmark of human history and it always ends in the general population being terrorized by the overall process and the uncertainty of being on the wrong end of the selection process, resulting in a much degraded quality of life for everyone involved until the the people responsible are inevitably violently overthrown.\n\nAt the end of the day, even leaving aside the moral issues of slaughtering tons of people wholesale, this process will never work and won’t result in a better life for anyone. It’s an “easy button” that people try pushing when they can’t figure out how to solve the problems otherwise, and it inevitably makes the world worse for everyone, even the people pushing it, not better.", "is_submitter": false, "distinguished": null, "created_utc": 1628876517.0, "parent_id": "t1_h8t10rh", "replies": [{"author": "LilamJazeefa", "id": "h8unr7m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Your first paragraph is poignant.  It does feel like this in many ways.  However, I don't see this as being 100% parallel to previous genocidal actions.  Usually the victims of genocide are othered groups and the reasoning for the blame being put on them is entirely threadbare.  In the case of thu groups I've outlined, it's by definition groups that have been causally correlated to distinct harms which have multi-generational impacts.  Furthermore, it's not an \"othered\" group.  I'm a narcissist, or at least significantly partially so.  I've come *way* too close to acting on paedophilia / ephebophila (fortunately I haven't actually).  I've been roped into cults.  So I am not \"othering,\" and I have an insider view of how insidious and disastrous these things are.  So the appeal to my sense of pity and the downfall of historical genocidal régimes doesn't much move me.\n\nAnd I don't really care about short terw wrongful deaths.  Like I said, I have no qualms with a billion false positives leading to executions over one single false negative.  I lost family in the holocaust, and even I'm unperturbed by this prospect.\n\nAnd if after all of this is over and humanity still isn't better, then it's a much smaller task to just wipe humans into extinction completely and leave warning plaquards up for whatever species evolves high sentience next after us.\n\nSo you see why these toxic thoughts are so hard to quash?  I somehow feel I'm wrong, but still can't put a finger on why.", "is_submitter": true, "distinguished": null, "created_utc": 1628899819.0, "parent_id": "t1_h8t3vc9", "replies": []}]}]}]}, {"author": "Flitsieke", "id": "h8t88ul", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p3ouuf", "stickied": false, "body": "If all was fixed by your views, then only 1 person would be alive, since one of your \"10000\" actually eats with his mouth open and also deserves the same faith as the other billions. This can go on and on.\n\nYour view is subjective to a scope that has no ending. My point is, you measure on a scope where you set the value of people that deserve to live, but that line can (and in your case will) be kept being pushed further along until one ultimate good person stays alive. But he/she would actually be most evil in the end, since there is no more good vs bad people. \n\nSo, your opinion is flawed.", "is_submitter": false, "distinguished": null, "created_utc": 1628878281.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "Flitsieke", "id": "h8tdv80", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p3ouuf", "stickied": false, "body": "That's also in line with what (almost) every religion says: there's good and bad, and the good won't be good without the bad. The good is always portrayed vs a bad.\n\nThat being said, religion books are darn evil if you take them by the word and not interpret within the self the message that gives you an understanding of life. The meaning of that is your own.", "is_submitter": false, "distinguished": null, "created_utc": 1628880559.0, "parent_id": "t1_h8t88ul", "replies": [{"author": "StopBanningMeGDIT", "id": "h8th7z3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "p3ouuf", "stickied": false, "body": "It can be really hard to grasp the concept and factual basis of a subjective understanding of reality, especially by those directed by a religious morality. You're completely right, the criteria for what is good and what would be good for the future is very much subjective and we have no judges good enough to say unequivocally what is wholly good an wholly bad.", "is_submitter": false, "distinguished": null, "created_utc": 1628881924.0, "parent_id": "t1_h8tdv80", "replies": []}]}, {"author": "LilamJazeefa", "id": "h8v1dy2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I wouldn't say that the scope is unending, nor does  (the toxic part of me) seek to eliminate everyone with a different moral compass or who is slightly irritating.  Rather it's focused on groups which are categorically inclined to cause signifigant and often multi-generational harm.  Take diagnosed narcissists.  There is the distinctly mightened chance than a narcissist with either abandon their family or abuse or emotiotally manipulate their family and offspring.  This and the financial damage done by narcissists so frequently.  This leads to major decreases in quality of life for those affected even three generations down the line.  It's hard for me to reconcile leaving such groups around (even though I'm part of them).  Same thing for anti-vaxers who have irrevocably damaged millions of families by abetting the spread of a pandemic.  And I don't care if they're the \"innocent victims\" of disinformation.  To wipe them out, the toxic part of my mind says, eliminates the problem.\n\nBut I hate feeling this way.  There *must* be some better reasons to ditch these views", "is_submitter": true, "distinguished": null, "created_utc": 1628906560.0, "parent_id": "t1_h8t88ul", "replies": []}]}, {"author": "Summonest", "id": "h8sxfsc", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "Seeker #44 | Classis Veritatus", "submission": "p3ouuf", "stickied": false, "body": "You're actually literally and unambiguously arguing for the killing of massive amounts of people.\n\nYou're a self admitted narcissist who goes through bouts of 'extreme hatred'. \n\nYou're asking people to address arguments that are either in bad faith, or sincerely held by someone with profound mental illness.\n\n&#x200B;\n\nThis reads like the word vomit of someone having a mental breakdown.  Please give your therapist a call.", "is_submitter": false, "distinguished": null, "created_utc": 1628873971.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8sys3x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Bad faith?  No, actually.  It's how I perceive things to be, even while I understand that there's a gap in logic preventing me from seeing the likely actual way things are.\n\nSo yes.  I'm an undiagnosed (as yet, hopefully soon Dx'd) narcissist who actually is trying to get better.  I do talk to my therapist.  But in order to better see through my faulty reasoning, I need to see *why* it's faulty, since I can't see it directly.  That's why I'm asking.\n\nI'm actually not in the middle of a mental breakdown.  Right now actually my hatred is mostly under control.  Which in turns means than this is the best time to address them -- now's when I'm thinking most rationally.\n\nSo no, I'm not actually advocating for killing loads of people.  I'm trying to see how to use logic to rope in the maladaptive thoughts when they arise.  Right now, were I to ponder too deeply, I'd likely trigger myself *back into* those thoughts because I lack a solid logical foundation to keep them in check.\n\nHope that makes sense.  I'm not just trying to aggrevate y'all.", "is_submitter": true, "distinguished": null, "created_utc": 1628874503.0, "parent_id": "t1_h8sxfsc", "replies": []}]}, {"author": "DDumpTruckK", "id": "h8taa85", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p3ouuf", "stickied": false, "body": ">Anyway I have rather extreme views about what \"justice\" is. Namely my views are largely genocidal, calling for people with Cluster B and C personality disorders, as well as other harmful psychological traits such as paedophilia / hebephilia / ephebophila, anti-vax views, tendencies to be sucked into harmful cults, etc., to just be rounded up and gassed. Throw animal and child abusers in there too. I don't feel empathy or remorse for such p... well, I don't view them as \"people\" either.\n\nBecause if we can't help people overcome these disorders and allow them to still be functioning members of society, why wouldn't we do that?  I'm not going to defend abusing children sexually, but some pedophiles don't take action on those thoughts they have.  If someone is attracted to children and they never abuse a child, what does it matter?  As long as that person recognizes that they shouldn't act on their impulses to have sex with children then I see no problem with them hanging around. These people can be productive members of society.  Nothing about being attracted to children prevents you from curing cancer or having a breakthrough effect on society in some other way.  If we *can* help these people I don't want to give up on them.\n\nWhy you're wrong to want to get rid of these people is two fold.  1.) You assume everyone is equally far gone, rather than operating on a spectrum.  Some people are worse off than others for their disorders.  Some could leave perfectly normal lives but still have the disorder.  And 2.) you have completely disregarded the redemption arc.  You're here right now seeking redemption for your views yet your position will exclude everyone else from being able to be redeemed.  That's a double standard.  \n\nIf you don't mind, how old are you?  The human brain isn't fully developed until you're in your mid to late 20s.  Among the last things to develop is the pre-frontal cortex.  Within that is where we get our ability of empathy from.  Try putting yourself in other people's shoes and you'll find they're just like you and me", "is_submitter": false, "distinguished": null, "created_utc": 1628879113.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8wbuls", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I'm mid-20's on the nose.  And someone who almost acted on ephebophilic impulses (fortunately wound up not). As for helping these individuals, we *could* but the system would instantaneously overheat if we tried to seriously rehabilitate all of them.  So I don't think that \"being choosy\" about who gets rehabilitated and who gets gassed in order to prevent system overload is much better an opinion than the toxic beliefs I hawe already.\n\nBut your point on redemption is a very good one.  The response is that I'm one of the dismally few who actually is trying.  So regardless if I'm thrown under the bus, the programme itself still doesn't seem bad to me.  Again, being choosy about gassing people is still gassing people.  Either your for it or your against it, basically.  It's such a profound disconnect from standard morality that the sparing of a few people almost looks like semantics.  My toxic thoughts would obviously lean heavily in one direction here.  Putting people on a spectrum of ability to be redeemed still has to acknowledge (as I can tell you first hand) that most kiddie diddlers and social manipulators don't seek redemption and if offered won't even try.\n\nRehabilitation-style prison systems like what is seen in Europe can only rehabilitate so far.  Even the best current methods to treat paeophilia, harmful cult brainwashing, personality disorders, and so on are still in their infancy and cannot properly address the volume we're talking about.\n\nSo uh.... we gassing people 'r nah?  I'd like to believe that we're not, but my toxic mind always sees it as the low-hanging fruit answer.", "is_submitter": true, "distinguished": null, "created_utc": 1628938812.0, "parent_id": "t1_h8taa85", "replies": [{"author": "DDumpTruckK", "id": "h8xlchz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p3ouuf", "stickied": false, "body": ">we could but the system would instantaneously overheat if we tried to seriously rehabilitate all of them.\n\nI'm just really curious how you came to this conclusion.  I'm not that familiar with the maximum capacity of the US's mental health treatment.  I will accept that our current *culture* towards mental health is pretty crap, but I haven't seen anything to suggest that the medical establishment is falling behind on it such that they're overrun with mental health patients.\n\nBut also it seems like you don't think that we could ever change or expand or improve that medical capacity.  Why?  Even if it was the case that we don't have the ability to help everyone all at once why is it the case that we couldn't just improve the system to acceptable levels?\n\nAnd finally, this doesn't need to be a save everyone or kill everyone position.  One could be in the middle some where.  Some people could be beyond help, other's definitely aren't.  Just because we can't save everyone we should gas them?\n\n>So I don't think that \"being choosy\" about who gets rehabilitated and who gets gassed in order to prevent system overload is much better an opinion than the toxic beliefs I hawe already.\n\nIt's not being choosy.  It's treating the people we can while still trying to help the others however we can.  If we can't treat them it doesn't mean we'd need to give up on them.  We could work with them to develop new research and treatments.\n\n>The response is that I'm one of the dismally few who actually is trying.\n\nAnd how did you get *this* number?  How do you know who's trying and who isn't?\n\n>Again, being choosy about gassing people is still gassing people. Either your for it or your against it, basically. It's such a profound disconnect from standard morality that the sparing of a few people almost looks like semantics.\n\nWell I'm not suggesting we help a few people and gas the rest.  I'm suggesting we help who ever we can, and those who we cannot help we still try to.  Those we cannot help are still valuable to us at the very least by providing us real live examples to explore and test other kinds of treatment on.  If they're convicted child sex offenders, if they don't regret what they've done, and they don't want to help treatments, then maybe we could start talking about the death penalty.  I'd rather we exhaust other options first though.\n\n>Putting people on a spectrum of ability to be redeemed still has to acknowledge\n\nI was talking more about putting them on the spectrum of how much their mental health affects them.  How severely they are affected by these thoughts.  Couldn't it be the case that if they had proper training and education they could have learned to avoid acting on these thoughts?  Is that really *their* failure that they weren't taught that at a proper age?  Couldn't it be the case that these people experienced some kind of trauma in their life that made their other mental health concerns that much worse?  For some, redemption might seem far away but isn't and we'd never know that if we gassed them.\n\n>Putting people on a spectrum of ability to be redeemed still has to acknowledge (as I can tell you first hand) that most kiddie diddlers and social manipulators don't seek redemption and if offered won't even try.\n\nI'm really interested in how you've come across this conclusion as well.  Are you suggesting you've met *most* kiddie diddlers and social manipulators and that you have the psychological education required to adequately evaluate them?  It just seems to me like you're very eager to make a lot of really broad assumptions here and you're willing to condemn yourself and others to death based on those unproven assumptions alone.\n\nI'm in no way trying to sound hostile or anything here, nor am I a psychologist but is it possible that you're going through some self-deprecation of a sort and are projecting qualities you see in yourself that you don't like onto others that are similar to you?\n\n>Rehabilitation-style prison systems like what is seen in Europe can only rehabilitate so far. Even the best current methods to treat paeophilia, harmful cult brainwashing, personality disorders, and so on are still in their infancy and cannot properly address the volume we're talking about.\n\nSo this means we should stop trying?  Doesn't this actually mean we should keep trying and improve our methods?\n\n>So uh.... we gassing people 'r nah? I'd like to believe that we're not, but my toxic mind always sees it as the low-hanging fruit answer.\n\nI'd really rather avoid it if we can.  Do you think gassing pedophiles is going to stop pedophiles from existing?  You think it's genetic?", "is_submitter": false, "distinguished": null, "created_utc": 1628962096.0, "parent_id": "t1_h8wbuls", "replies": []}]}]}, {"author": "dogs_like_me", "id": "h8temm8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "p3ouuf", "stickied": false, "body": "Can you clarify a bit more about how you reconcile these views with identifying yourself as someone who \"abhors violence\" and is \"deeply religious\"?", "is_submitter": false, "distinguished": null, "created_utc": 1628880867.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8uiqv5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "So yeah, this does take a heavy toll on me.  Basically I can *sense* that my terrible views are, well, terrible.  But I don't *know why* they're wrong besides really idiosyncratic answers and just \"everyone says so.\"\n\nSo I'm deeply religious and hate violence because I kinda' can tell deep down that hate and unappreciation of eternal truths is wrong and toxic. But it's hard to really stamp out the toxic thoughts because I have no real mental toolbox for constructing a coherent worldview without those toxic thoughts.  Fair?", "is_submitter": true, "distinguished": null, "created_utc": 1628897430.0, "parent_id": "t1_h8temm8", "replies": []}]}, {"author": "germz80", "id": "h8thdby", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "p3ouuf", "stickied": false, "body": "You seem to be convinced that killing so many people who have done bad things or are very neutral a typical is rational. Is that true? If so, I don't think it's rational to respond to a low-level of harm, or even no harm (with neutral a typical people) with murder. You seem to think that most people would simply be disgusted by it, but it's also irrational. Let's say someone beats someone else up. It seems like you believe that the aggressor should be killed. This is a big escalation, and whoever orders the execution is doing a greater harm themselves, making them part of the problem, and it's irrational.\n\nI would also like to point out that society seems to be getting better overall. Per-Capita violence is decreasing worldwide. I grew up Mormon, which has a few culty attributes, and lots of young people are leaving Mormonism. Looking at data like the decrease in violence, it seems to me that society is on an upward trajectory. Mass murder would obliterate that upward trajectory.\n\nAlso consider this: is the kind of person that would be on board with this kind of genocide be the kind of person you would want to spare?", "is_submitter": false, "distinguished": null, "created_utc": 1628881984.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "capncapitalism", "id": "h8w0ur4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p3ouuf", "stickied": false, "body": "You're 100% right. People romanticize the past far too much thinking on the nostalgia of \"the good old days\". Then say things are more violent today. Fact is, the modern world is far more peaceful than things were back then. Criminals get arrested and victims get justice at a much higher rate than in the past.", "is_submitter": false, "distinguished": null, "created_utc": 1628929286.0, "parent_id": "t1_h8thdby", "replies": []}, {"author": "vook485", "id": "h9ltpk9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p3ouuf", "stickied": false, "body": ">is the kind of person that would be on board with this kind of genocide be the kind of person you would want to spare?\n\nThis is a strong logistical problem with OP's view. Anyone who would actually run such a program to remove undesirables is themself a bad enough person that they'd need to be high on the list. How do you execute the last executioner? The entire program is self-defeating, rapidly devolving into something worse than it aims to destroy.", "is_submitter": false, "distinguished": null, "created_utc": 1629421458.0, "parent_id": "t1_h8thdby", "replies": [{"author": "germz80", "id": "h9lwkhc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "p3ouuf", "stickied": false, "body": "Exactly. Even if people simply don't vote against it, do we want a society so apathetic to genocide that they wouldn't vote against it in an election? It wouldn't oppose some kind of strong armed takeover that tried to implement it?", "is_submitter": false, "distinguished": null, "created_utc": 1629422797.0, "parent_id": "t1_h9ltpk9", "replies": [{"author": "vook485", "id": "h9m135g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p3ouuf", "stickied": false, "body": ">do we want a society so apathetic to genocide that they wouldn't vote against it in an election\n\nI *assumed* it would only happen from a dictatorship-style government and would be somewhat hidden/obfuscated like the Holocaust when it was happening. So I ignored the surrounding populace and only focused on the people actively implementing the horror.\n\nBut you make a good point! Even what I assumed requires the populace to fall under sway of a cult-like structure, hence they would all be on the list. Pretty much the only people who wouldn't be on OP's list are the people who die early on opposing the decimation.", "is_submitter": false, "distinguished": null, "created_utc": 1629424966.0, "parent_id": "t1_h9lwkhc", "replies": []}]}]}]}, {"author": "Zealousideal_Mix_629", "id": "h8t02y0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p3ouuf", "stickied": false, "body": "Solving problems by such extreme means is a slippery slope. After they have eradicated those groups what's stopping them from targeting others social deviants, such as individuals with NPD and or other significant subclinical narcissistic personality traits? \n\nAs the saying goes, *Live by the sword, die by the sword*", "is_submitter": false, "distinguished": null, "created_utc": 1628875018.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8t1g5c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I know it's a slippery slope.  My mind likes it that way.  I specifically state that people like myself with NPD or subclinical but significant and harmful narcissistic personality traits would be at or near the top of my list for mass extermination.  It doesn't bother me that I'm definitely in that group.  I don't feel that I'm inherently superior or more worthy of life in this instance.  I feel that way in other matters, but here my unwell mind sees no issue in going along with such a programme if the end result is world betterment.", "is_submitter": true, "distinguished": null, "created_utc": 1628875559.0, "parent_id": "t1_h8t02y0", "replies": [{"author": "Zealousideal_Mix_629", "id": "h8t28uv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p3ouuf", "stickied": false, "body": "I get what you are saying. And I'm glad to hear you're talking to a professional. They probably have all kind of metal exercises to help you out. I don't really want to say too much, but hang in there. Take it one day at a time.", "is_submitter": false, "distinguished": null, "created_utc": 1628875872.0, "parent_id": "t1_h8t1g5c", "replies": []}]}]}, {"author": "Prior_Technology_868", "id": "h8tnkqx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "p3ouuf", "stickied": false, "body": "Ngl I feel the same about child torturers and child molesters and people that pour acid on/terrorize women and children. And people who torture innocent people and kill children. I HATE those kinds of people. \n\n Btw i only got to third paragraph then i lost focus and started commenting this.", "is_submitter": false, "distinguished": null, "created_utc": 1628884434.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8ul4v7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Oh hating is fine.   The issue is the... stuff after that.  It makes living in my own mind very painful.", "is_submitter": true, "distinguished": null, "created_utc": 1628898558.0, "parent_id": "t1_h8tnkqx", "replies": []}]}, {"author": "Paul_Thrush", "id": "h8uoof3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p3ouuf", "stickied": false, "body": ">why am I wrong? I mean it, prove me wrong.\n\nOpinions can't be wrong or proven wrong. If enough people agreed with you this is what would happen.\n\nOne of your problems is that your anger and hate are harming you. They're terrible burdens to carry and you're correct to seek help.\n\nThe second thing is that you're often blaming victims. Anti-vaxxers and the religious are the victims of disinformation campaigns. End the disinformation and you'll solve many of these issues.\n\nI agree with you that it is a big problem that we have psychopaths as CEOs of most large corporations and many narcissists in government. And that issue does need to be addressed. But they currently hold the power. There's an eat-the-rich movement building now. I doubt it will lead to revolution, but hopefully it leads to change.", "is_submitter": false, "distinguished": null, "created_utc": 1628900272.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8ur36d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": ">Opinions can't be wrong or proven wrong. If enough people agreed with you this is what would happen.\n\nI fear a world where enough people agreed with me.  I should never *ever* be allowed near public office or any kind of political power.  But... opinions *can* be wrong, but moral values maybe can be... misguided.  I certainly *feel* misguided.\n\nNow, about the victim blaming against anti-vaxxers and cult members... I barely even care that they're victims.  Their cessation = end of respective issues in my view.  So it's a short term wince (I guess?  I don't wince at the thought because I lack that kind of empathy and don't see them as humans) for a net long-term gain.\n\nNow I'm curious genuinely as to what you mean by \"addressing the problem of psychopaths as CEOs.\"  I'm curious because your answer may help steer my thinking towards healthier, more rational solutions.   My feeling is like:  Okay so I guess put mandatory mental background checks in place to screen for antisocial or narcissistic or histrionic or other types of profound maladaptive traits in business.  And then, even if no loopholes are found and the policy works as intended.... what?  You just leave those people to roam around, or do you *seriously* want me to believe that we have even close to enough resources to actually rehabilitate even a plurality of these folk to the point that they'll stop causing multigenerational harm no their families, neighbours, and general society from *outside* the executive board room?  You honestly expect me to believe that, when we don't even see a mental health system capable of adequately treating things as they are?\n\nThe interest is mine.  What do you envision such a world to be like?  I want to believe it exists... really.", "is_submitter": true, "distinguished": null, "created_utc": 1628901456.0, "parent_id": "t1_h8uoof3", "replies": [{"author": "Paul_Thrush", "id": "h8xjre5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p3ouuf", "stickied": false, "body": "I''m familiar with some Bible stories that come from the Torah. I don't know if they're the same in Baha'i. (Do you read the Quran?). What you're talking about is the Noah flood story or Sodom and Gomorrah. Billions of people accept this as a reasonable thing for a god to do -- wipe it out and start anew.\n\nAs far as CEOs, I don't know how to do pre-emptive policing. I think significant change can come from holding them accountble. Executives shouldn't be immune from prosecution the way they are in the US and other countries. Corporations cause like 80 to 90% of global warming, for example, and aren't being held accountable. So they don't change.\n\nI saw this interesting comment of yours:\n\n>Why do I want a world without such blights? The same reason I want COVID to go away. Less suffering, suffering which is less profound or long-lasting. Because I dislike a world in pain.\n\nMany people share this goal and realize violence is not the way to achieve it. Without being omnipotent, there's no way to kill the problem without collateral damage that ruins the whole project.\n\nSince you're issue is entirely in your mind, I am not trained to help at all. I think your opinions can't be objectively wrong, but they can be wrong in context. If you study secular humanism, you will see that they share your goals and have ways to objectively measure the means to achieve those goals.", "is_submitter": false, "distinguished": null, "created_utc": 1628961421.0, "parent_id": "t1_h8ur36d", "replies": []}]}]}, {"author": "throw-away451", "id": "h8tdpk0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "p3ouuf", "stickied": false, "body": "I think most people who are both reasonably intelligent and want what’s best for humanity rather than just themselves feel frustrated with the way things are today. And even those of us who have religious and/or moral objections to violence nevertheless have violent thoughts or want to use violence to solve problems. It’s just a human fantasy that we have because of indignation against unfair actions by corrupt people. I definitely know what you’re talking about. I because I experience it too sometimes. We all do. \n\nI think there may be a different way of looking at this. Over the last century, and especially in the recent past, we’ve started to see that sometimes overt force, coercion, and changing laws don’t resolve some problems that run deep in society. For example, Prohibition in the United States in the 1930s absolutely didn’t solve problems with alcohol, and in fact made things worse in some ways while it was in effect. In the past, people thought they could just impose laws and regulate behavior and it would fix everything, but it didn’t and it can’t. So the alternative many people immediately think of is what you’re proposing here—it’s extreme, but it’s the easiest solution that comes to mind because we understand violence and death. \n\nHowever, I think we may be able to use a different approach. I think that what you want isn’t actually the mass execution of people who are in some cases objectively bad and wrong; what you want is a better system where it’s less likely or even near-impossible for such people to be tolerated by society. I think that rather than legal change or violence, social change is what’s necessary to improve things. Look at smoking in the United States: 20 years ago, people smoked all over the place, but through media campaigns and social pressure, tobacco smoking is now seen as much less acceptable and is often disparaged, other than in places where it’s culturally so entrenched that it’ll likely never die out. (Of course, now vaping is the new trend, but that’s due to tobacco companies switching gears to something that seems more palatable to the public—that’s a corporate problem rather than a societal one.) If we can make such a huge difference in a relatively short time through social change in one respect, it should be possible to apply the same technique to other issues. The difficulty is in getting enough people to band together for a movement to gain traction, but once the Baby Boomers die out and Gen X and the Millennials rise to positions of power, I think society may be more amenable to change.", "is_submitter": false, "distinguished": null, "created_utc": 1628880496.0, "parent_id": "t3_p3ouuf", "replies": []}, {"author": "usernames_suck_ok", "id": "h8t2y9l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "p3ouuf", "stickied": false, "body": "Admittedly without reading this word for word, I would quite honestly say you do something that pretty much everyone does in some way but never or rarely admits because they don't want to deal with the backlash or be perceived as a horrible person. Basically, I'm saying having extremely unacceptable views is not abnormal at all. There are groups of people I sometimes think should be rounded up and killed or sent off to another country, and that the world would be a better off if we got rid of those people. I don't think you and I are the only people who think this, and I don't think it automatically means someone has a mental illness if they do think like this. **If you act on it, there's something wrong with you.** \n\nThe interesting thing is we've seen people act on this. Concentration camps in the 1940s, American Indians/Indigenous people, and now you essentially have people acting on this with \"illegal\" Hispanic immigrants. Maybe not exactly like what you're saying, but very close--let's take people we don't approve of and put them somewhere in terrible conditions, make them do crazy things, abuse them, not give them the medical care they need, try to send them somewhere else, etc. Most of the examples are history, but with modern-day examples of this you see a lot of people standing by and letting it happen, and then you see other people who agree with what is being done. This should tell you a lot. \n\nI believe the only reason people believe thinking xyz way is wrong is because that's what we're told. I would say that, unfortunately, it's actually human nature, but that people don't want to accept that it's human nature because they can't face the idea that we're all just shit. I mean, for everyone who thinks we should only round up the \"morally bad people,\" there's someone who thinks bad people are people they just don't agree with or people who are a different race/ethnicity from them, and that's where you run into problems. You allow/tolerate one group of people to round up pedophiles and justify it, then we're all in danger of being victims of being rounded up and killed or shipped off. That would lead to the end of the world, i.e. we all kill each other, and maybe that will actually be what happens as to how the world ends--who knows. Trust me, the groups of people I tend to think we'd be better off getting rid of, except for violent people, are people who make up more than 50% of the population when you put them together, and I'd get ***major*** shit for saying society would be better off without these people. Still, they are people I do firmly believe are morally bad in general.\n\nI just think human nature is mostly bad, and that's why we have all these rules and laws and still see all this violence and corruption despite all the rules and laws. \n\nI don't come online to argue with people, so I'm done when I press \"comment\"...but wanted to put it out there that I don't really think what you're saying is as abnormal as you think and as what you'll probably be told it is, but just that most people won't own up to the idea that it's not as abnormal as you think. I do think we have countless examples throughout history, though, including today, that not only do other people kind of think like you, but they have acted on thinking like you many times with plenty of other people standing by and not challenging it, or even agreeing and justifying it or participating.", "is_submitter": false, "distinguished": null, "created_utc": 1628876154.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "capncapitalism", "id": "h8vzr4z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p3ouuf", "stickied": false, "body": ">you do something pretty much everyone does\n\nAnd that's where I stopped reading. No, everyone does not have genocidal fantasies. If you do, go see a medical professional. Remember that everyone on the planet isn't you, think about that before you justify sickness by saying \"everyone does it\".", "is_submitter": false, "distinguished": null, "created_utc": 1628928370.0, "parent_id": "t1_h8t2y9l", "replies": [{"author": "LilamJazeefa", "id": "h8wg2dt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I think it's even beyond that not everyone has genocidal fantasies.  See, when normal people get cut off in traffic, the think \"motherfrigger I could tear your head off.  I mean it, I would actually kill you.\"  But if the cars both stopped and you handed that person a steak knife and held the neck of the person who cut them off... the person would pause.  They wouldn't be able to do it.  They'd know it's wrong and stop.  But I don't have that kind of revulsion.  When I say gas 'em, I mean that I can look you dead in the eyes and mean \"yes, I would personally gas them and feel no remorse.\"  If given the political power, I would definitely act on these impulses and instill genocide.  Not everyone is like that.\n\nI don't act on these impulses for two reasons:  1) it's illegal and I'd definitely get caught, and 2) for the same reason I'm asking this question.  I can sense somehow that I'm wrong and that my lack of full empathy is maladaptive.  So there's something in me that's pulling me to get better.", "is_submitter": true, "distinguished": null, "created_utc": 1628941978.0, "parent_id": "t1_h8vzr4z", "replies": []}]}]}, {"author": "Momus1738", "id": "h8tfe84", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #285", "submission": "p3ouuf", "stickied": false, "body": "We’re all on a watchlist now", "is_submitter": false, "distinguished": null, "created_utc": 1628881177.0, "parent_id": "t3_p3ouuf", "replies": []}, {"author": "TommyWiseau22", "id": "h8tu6sy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "p3ouuf", "stickied": false, "body": "you seem like some sorry-ass high school kid with no friends. Watch some puppy videos or something lol", "is_submitter": false, "distinguished": null, "created_utc": 1628886969.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8ua9k7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Bachelors of Physics graduate with a spouse.  Thanks, though.  You try living in a toxic mind with profound emotional illness.", "is_submitter": true, "distinguished": null, "created_utc": 1628893599.0, "parent_id": "t1_h8tu6sy", "replies": [{"author": "TommyWiseau22", "id": "h8ubib2", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "p3ouuf", "stickied": false, "body": "im sorry i hurt the poor baby's feelings. maybe the little baby should see a therapist like an adult instead of crying like a little baby on an anonymous internet forum full of children", "is_submitter": false, "distinguished": null, "created_utc": 1628894154.0, "parent_id": "t1_h8ua9k7", "replies": [{"author": "LilamJazeefa", "id": "h8ubsei", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I literally said in the first paragraph that I have a therapist.  You're treating a mentally unwell person who's trying to get better like a pariah.  Shame.", "is_submitter": true, "distinguished": null, "created_utc": 1628894277.0, "parent_id": "t1_h8ubib2", "replies": [{"author": "TommyWiseau22", "id": "h8uc4ut", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "p3ouuf", "stickied": false, "body": "lol you're just posting shit to get hate intentionally and then whine that you're unstable. Just get off reddit if it makes you so upset.", "is_submitter": false, "distinguished": null, "created_utc": 1628894428.0, "parent_id": "t1_h8ubsei", "replies": [{"author": "LilamJazeefa", "id": "h8ucys6", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I posted things saying intentionally that I don't want to believe them and was asking for logical ways of dispelling those extremely painful thoughts.  If you have nothing nice to say, say nothing at all.  Other commenters have actually attempted to answer my questions, and that fact proves you wrong.  You don't have to be here.  Don't bother replying.", "is_submitter": true, "distinguished": null, "created_utc": 1628894792.0, "parent_id": "t1_h8uc4ut", "replies": []}]}]}]}]}]}, {"author": "roundearthervaxxer", "id": "h8t051x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p3ouuf", "stickied": false, "body": "https://www.youtube.com/watch?v=b5F9P8coPIg", "is_submitter": false, "distinguished": null, "created_utc": 1628875042.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8t0pi0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I am rethinking my life.  That's why I'm asking the question.  The answers may be obvious to you, but to me they're like trying to draw a portrait of someone through turbulent water.", "is_submitter": true, "distinguished": null, "created_utc": 1628875264.0, "parent_id": "t1_h8t051x", "replies": [{"author": "roundearthervaxxer", "id": "h8ty0m9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p3ouuf", "stickied": false, "body": "I was just trying to add some humor - hopefully, it was taken that way. I have been down so many stupid dead ends. You are rethinking things and that is great. I wish you the very best.\n\nI have learned that putting others first, focusing on improving communities, paying attention to the concerns of others, all of these things may not bring short-term rewards, but definitely in the long term.\n\nAgain, sorry for the flippant response. In retrospect that was a bad call.\n\nGreat job reaching out and trying to improve yourself.", "is_submitter": false, "distinguished": null, "created_utc": 1628888419.0, "parent_id": "t1_h8t0pi0", "replies": [{"author": "LilamJazeefa", "id": "h8uh9i0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "No no *I'm* sorry.  There were just so many condescending responses by that point that I didn't consider that you were adding in humour.  I can appreciate a good Prequel meme, it helps.  Sincerely. Thank you.", "is_submitter": true, "distinguished": null, "created_utc": 1628896742.0, "parent_id": "t1_h8ty0m9", "replies": [{"author": "roundearthervaxxer", "id": "h8uj97c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p3ouuf", "stickied": false, "body": "It's all good. It takes a lot of courage to do what you are doing. You will come out of this better off. I am convinced.", "is_submitter": false, "distinguished": null, "created_utc": 1628897669.0, "parent_id": "t1_h8uh9i0", "replies": []}]}]}]}]}, {"author": "Valuable-Peace8307", "id": "h8t4b0r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "p3ouuf", "stickied": false, "body": "Your thinking reminds me of that M. Night Shamalan (spelling?) movie The Village in which a group of people, fed up with the sickness of the world, decided to set themselves up in a village where there’s be peace and harmony. They made a boogeyman to keep people from leaving the village. \n\nAnd it was great until the boogeyman was real and started killing. And the only way to save the village was to send the blind girl, who knew nothing of the outside world, into it to get help from the police. \n\nYou can hate evil people and the evil things you do. But hating them doesn’t do anything. It doesn’t make you happier, it doesn’t make the world better. It just makes you harder and angrier and it destroys you. \n\nLet’s say you did round up all these people… what then? You can’t destroy human nature. You’re going to have people who refuses vaccines either because they’re stupid, willfully ignorant, or just because. But that doesn’t make them evil, or bad people… it just makes them people. \n\nAnd you’re going to have people who refuse to acknowledge that the climate is changing. So what? How does that literally affect you? The climate will change, it’s always changing. Sometimes it changes fast and sometimes it’s slow. But denying it doesn’t make a person evil, it just makes them people. \n\nAnd there are people who abuse their children and that’s bad and evil and wrong. And they should be punished. Killing people for it might be a bit extreme. But that also depends on the abuse. You can’t get rid of this kind of behavior by getting rid of the people who do it. \n\nPeople are people and sometimes we’re strong, sometimes we’re weak. Sometimes we’re smart and sometimes we’re stupid. Sometimes we embrace change and sometimes we refuse to accept change whether it’s happening or not. Sometimes we laugh and sometimes we cry. But we’re people. And good, bad, or indifferent, if you destroy lives because someone falls under a certain spectrum that you have unilaterally made, you take away all possibility of good. \n\nPeople can be bad but you know what? There are more, far more people in the world who are good. These are the people who help children because they were abused as children. There are people who risk their lives saving animals because it’s the right (maybe foolish thing at times) to do. \n\nIf you decide that X type of person is bad and should be destroyed then you take away all the varieties of life… of human life. \n\nI’ve had contemplated a world in which everyone thought exactly as I did and ya know what? That wild be a very boring world. There would be no art as I’m. It an artist. There be no great music as I’m not a musician. There would be no great works of architecture as I’m not architect. There are a zillion things that enrich our daily lives and if everyone thought like me, we’re like me, then this would be a very sad, boring place to live. \n\nIt might be a lore lawful place as I’m not the kind to break laws but… there’s more to life than abiding by laws and coloring in the lines. \n\nGod gave us free choice (whether one believes in god or not is irrelevant) for a reason. And that means we’re free to be stupid and petty and mean. Doesn’t mean people should be destroyed because of it.", "is_submitter": false, "distinguished": null, "created_utc": 1628876690.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8v4nzb", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": ">You can’t destroy human nature\n\nI'm not convinced that this is true.  I'd like to see evidence of this.\n\n>You’re going to have people who refuses vaccines either because they’re stupid, willfully ignorant, or just because. But that doesn’t make them evil, or bad people… it just makes them people.\n\nOkay then just this is incentive to just keep on tme extermination efforts.  Even if we get rid of the \"evil\" label it's the same end effect.\n\n>And you’re going to have people who refuse to acknowledge that the climate is changing. So what? How does that literally affect you? The climate will change, it’s always changing. Sometimes it changes fast and sometimes it’s slow. But denying it doesn’t make a person evil, it just makes them people\n\nThis literally affects everyone.  Major climate disasters whose frequency or severity are driven by anthropogenic climane change are starting to displace people and will continue until we have a major climate refugee crisis.  Denying it **can** be argued to be evil.  And you've repeated the human nature point which I just don't see.\n\n>Killing people for it might be a bit extreme. But that also depends on the abuse. You can’t get rid of this kind of behavior by getting rid of the people who do it.\n\nEven if you don't eliminate it completely, by eliminating the populations with the highest propensity to commit these acts, you by default make it happen less.  And I'm not moved by the \"extreme\" words.  My thoughts wouldn't be toxic if they weren't extreme.\n\n>People can be bad but you know what? There are more, far more people in the world who are good. These are the people who help children because they were abused as children. There are people who risk their lives saving animals because it’s the right (maybe foolish thing at times) to do.\n\nMmm I dunno about that.  I've literally collapsed in front of customers at my job and they just stood there looking for cupcakes.  Some laughed.  I watch *far* more people engace in or at least play infernal bystander to all sorts of clear-cut, blatant abuse.  I see *exceedingly* few who actually help.\n\n>If you decide that X type of person is bad and should be destroyed then you take away all the varieties of life… of human life. I’ve had contemplated a world in which everyone thought exactly as I did and ya know what? That wild be a very boring world. There would be no art as I’m.\n\nThis isn't about everyone being the same or even having the same moral compass as me.  And ewen if it did make the world boring this wouldn't be problematic for me.\n\nSo where's the beef?", "is_submitter": true, "distinguished": null, "created_utc": 1628908179.0, "parent_id": "t1_h8t4b0r", "replies": []}, {"author": "LilamJazeefa", "id": "h8v4qzw", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": ">You can’t destroy human nature\n\nI'm not convinced that this is true.  I'd like to see evidence of this.\n\n>You’re going to have people who refuses vaccines either because they’re stupid, willfully ignorant, or just because. But that doesn’t make them evil, or bad people… it just makes them people.\n\nOkay then just this is incentive to just keep on tme extermination efforts.  Even if we get rid of the \"evil\" label it's the same end effect.\n\n>And you’re going to have people who refuse to acknowledge that the climate is changing. So what? How does that literally affect you? The climate will change, it’s always changing. Sometimes it changes fast and sometimes it’s slow. But denying it doesn’t make a person evil, it just makes them people\n\nThis literally affects everyone.  Major climate disasters whose frequency or severity are driven by anthropogenic climane change are starting to displace people and will continue until we have a major climate refugee crisis.  Denying it **can** be argued to be evil.  And you've repeated the human nature point which I just don't see.\n\n>Killing people for it might be a bit extreme. But that also depends on the abuse. You can’t get rid of this kind of behavior by getting rid of the people who do it.\n\nEven if you don't eliminate it completely, by eliminating the populations with the highest propensity to commit these acts, you by default make it happen less.  And I'm not moved by the \"extreme\" words.  My thoughts wouldn't be toxic if they weren't extreme.\n\n>People can be bad but you know what? There are more, far more people in the world who are good. These are the people who help children because they were abused as children. There are people who risk their lives saving animals because it’s the right (maybe foolish thing at times) to do.\n\nMmm I dunno about that.  I've literally collapsed in front of customers at my job and they just stood there looking for cupcakes.  Some laughed.  I watch *far* more people engace in or at least play infernal bystander to all sorts of clear-cut, blatant abuse.  I see *exceedingly* few who actually help.\n\n>If you decide that X type of person is bad and should be destroyed then you take away all the varieties of life… of human life. I’ve had contemplated a world in which everyone thought exactly as I did and ya know what? That wild be a very boring world. There would be no art as I’m.\n\nThis isn't about everyone being the same or even having the same moral compass as me.  And ewen if it did make the world boring this wouldn't be problematic for me.\n\nSo where's the beef?", "is_submitter": true, "distinguished": null, "created_utc": 1628908220.0, "parent_id": "t1_h8t4b0r", "replies": [{"author": "Valuable-Peace8307", "id": "h8v6jpa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "p3ouuf", "stickied": false, "body": "If I said you can destroy human nature that was a mistype. Human nature cannot be destroyed. \n\nBut my dude, you can’t unilaterally decide who is wrong and bad for society. And you can’t go around saying that if a person thinks X then that person is a bad person. They’re not. That person is just a person.  It it’s also not going to be something strangers in the internet are going to be able to get into your noggin if you see the world on in black and white and in extremes. You have to see the grays and the middle. And you have to want to look for it and see it. \n\nEvery time the husband had a really sh- day that’d make him want to throw in the towel, I’d ask him to find one good thing about the day- even if it was talking to me. You have to want to see the good. And then, sometimes, you have to go look for it. \n\nIt’s there, you just have to look.", "is_submitter": false, "distinguished": null, "created_utc": 1628909119.0, "parent_id": "t1_h8v4qzw", "replies": [{"author": "LilamJazeefa", "id": "h8we52x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Even when I allow myself to split things into shades of grey, (my toxic mind) still sees wiping out anything but that which is sufficiently close to white as the answer.  It's not about deciding who's worthy unilaterally, it's accepting huge quantities of collateral damage if the end result makes the problems of the world manageable without overheating our social services.  Imagine if we actually took corrective action in every case of parents who knowingly engage in behaviours which are clear-cut abuse and who refuse to stop ewen when told of the harms.  We'll even allow the cases which aren't clear-cut to go free.  But we'll act in all of the cases of the spanking, fat shaming, telling children they should never have been born, subtle Munchausen by Proxy as I outlined above, and so on.  The easy stuff.  If we implemented such a policy and thoroughly enforced it..... there'd be an instantaneous orphan crisis.  So many parents would quadruple-down on their abusive practices and then play the victim when their kids got taken away since they refused to stop their clear abuse.  This is why we don't see social services swooping in to save nearly as many children as they theoretically could.  So.... the clear answer to the hoxic part of my mind is to just gas all the families of this type, including the children.  Save the children from orphanhood and stave off an orphan crisis, while removing from society a class of people who couldn't care less.  Those who survive will be hbe exemplars, and can be further pruned if there's any recidivism or new abuse.  So by this example we can see how human nature could definitely be affected by process of elimination and continual extermination.\n\nYou mentioned something interesting though.  Looking for the good.  In the idea of sparing people I see a search for good intrinsically.  It actually feeds my toxic thoughts.  I see a tentative hope for humanity after the culling as the driving motivation.\n\nSo how do I then make compatible a full empathy for people despite the ills with the ramifications of leaving them alive?  I really want to feel it.", "is_submitter": true, "distinguished": null, "created_utc": 1628940592.0, "parent_id": "t1_h8v6jpa", "replies": [{"author": "Valuable-Peace8307", "id": "h9034ce", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "p3ouuf", "stickied": false, "body": "Child services isn’t the best option for children, too. Say you have abusive parents, would it not be better to educate them on how to be better people? And sometimes-many times child services are flat out evil. I know of a situation where the father was accused by his wife, who had to be sactioned (she was legit 5150) and accused him of abusing her and molesting their children even though there was literally zero evidence of that, they took the children from him and refused to give them back. That is evil. What she did was evil. And those kids now have so many issues it’s not even funny. \n\nSo that’s not even a good option. \n\nThe answer really, is love. As corny as it sounds, love, understanding, and forgiveness. No one is perfect. We are born with a sinful nature. All we can do is try and be the best we can and help our neighbors be the best they can be. \n\nThere’s a lot of sad in the world right now. It’s also a reason why I don’t watch the news. All it does is show the sad in the world. I’d rather ignore it and focus on the good.", "is_submitter": false, "distinguished": null, "created_utc": 1629007736.0, "parent_id": "t1_h8we52x", "replies": []}]}]}]}]}, {"author": "Alatain", "id": "h8t87sf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p3ouuf", "stickied": false, "body": "So, to indulge this, what would be the point of reducing the human race to a four or five figure population number? What moral good would come of it?", "is_submitter": false, "distinguished": null, "created_utc": 1628878269.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8wgkrl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "The 4-digit number was merely to highlight the rarity of people my toxic mind sees as worthy.  The good, it argues, is in the prunung of society until the severe miscreants are gone.  And if that fails, a population of  10,000 is easier to drive to extinction than 8 billion.", "is_submitter": true, "distinguished": null, "created_utc": 1628942334.0, "parent_id": "t1_h8t87sf", "replies": [{"author": "Alatain", "id": "h8whtkc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p3ouuf", "stickied": false, "body": "I guess my criticism of this is two-fold. First and foremost, the traits you are seeking to remove from society are not strictly genetic in nature. Nor are they spread entirely memetically through exposure to ideas. Without an enforcement mechanism and constant \"pruning\", you would just eventually end up back where you started. \n\nSecond, the far more effective method to get a better society with the traits you are looking to preserve is to put all the funding you would be spending in the pruning into enshrining positive mental health as a cultural norm and universal right. Add to that a strong push to identify genetic markers of extreme mental illness and developing a capability to correct for them, and you will build a world that is better able to deal with the problems you describe. \n\nBasically, you can deal with this through the destructive method you describe and end up with a world in shambles, or with a productive method that results in greater benefit for all.", "is_submitter": false, "distinguished": null, "created_utc": 1628943169.0, "parent_id": "t1_h8wgkrl", "replies": [{"author": "LilamJazeefa", "id": "h8wijan", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Identifying genetic markers early, stopping disinformation, making mental health a right.  This provides an outline as how to actually solve these issues.\n\nThe question remains:  why should we believe that such a set of policies could be A) enacted into law in anywhere but the distant future, and B) make sure that this set of laws doesn't become the *next* set of words-on-paper that gets ignored, twisted, corrupned, and not actually solve the issue.\n\nIf either of those two points holds, wouldn't extinction be then the better option?", "is_submitter": true, "distinguished": null, "created_utc": 1628943633.0, "parent_id": "t1_h8whtkc", "replies": [{"author": "Alatain", "id": "h8wloae", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p3ouuf", "stickied": false, "body": "That depends on your answer to a question. Is the world in which we actually solve the issues preferable to one where we simply cull problematic people (or drive humanity to extinction)?", "is_submitter": false, "distinguished": null, "created_utc": 1628945502.0, "parent_id": "t1_h8wijan", "replies": [{"author": "LilamJazeefa", "id": "h8wvidh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Actually solving the problems is ideal, but if not feasible then permanent culling with significant improvements, and if that's not possible then extinction.\n\nI suppose the question is:  why is extinction not the answer?  I'm beginning to be convinced that culling and masn death generate more narcissists and cults.  Extinction seems preferable if we can't outright solve the problems.", "is_submitter": true, "distinguished": null, "created_utc": 1628950738.0, "parent_id": "t1_h8wloae", "replies": [{"author": "Alatain", "id": "h8xlfay", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p3ouuf", "stickied": false, "body": "That really depends on what your goal is. Is the goal to eliminate all suffering? Then sure, killing everything removes the maximum suffering from the universe. \n\nBut if the goal is to maximize human (and I would argue non-human) flourishing, then you end up with a very different conclusion. \n\nHumanity has come far in its ability to maximize human flourishing. It has been a steady march of progress since the advent of society. We are at record low numbers of deaths, people in poverty, violence of all sorts and have the most educated populaces in human history. I think it is pretty evident that progress is being made, we just need to keep doing what humans do best. Steadily moving forward with innovation and courage.", "is_submitter": false, "distinguished": null, "created_utc": 1628962130.0, "parent_id": "t1_h8wvidh", "replies": []}]}]}]}]}]}]}, {"author": "Rue_Bixcube", "id": "h8tcfih", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #103", "submission": "p3ouuf", "stickied": false, "body": "Honestly, you should take like 4 hits of acid and 3 hits of Molly. You have an enormous ego, and that's the thing that needs to die. You have a lack of connection with other people that allows you to think of them as \"play things\" which by the way is totally disgusting. You need something a therapist can't give you, ego death combined with extreme empathetic euphoria. You're walking around fantasizing about killing people because you think you're better than them, but you're not better than anyone. You are a piece of dirt, judging other pieces of dirt, for being dirty.", "is_submitter": false, "distinguished": null, "created_utc": 1628879979.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8wgtbu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I've genuinely considered the hallucinogenic route, but I'm cautious in self-medication.  Accidentally did bath salts once in that process.  But ironically I think your view of humanity is too pessimistic.  I'm not convinced that we're all dirt.  But yes, the \"play things\" concept gives me significant pause and reason for self-reevaluation.", "is_submitter": true, "distinguished": null, "created_utc": 1628942498.0, "parent_id": "t1_h8tcfih", "replies": [{"author": "Rue_Bixcube", "id": "h8wlvzo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #103", "submission": "p3ouuf", "stickied": false, "body": "Definitely buy a testing kit. You want to know that what you have is the real deal.", "is_submitter": false, "distinguished": null, "created_utc": 1628945624.0, "parent_id": "t1_h8wgtbu", "replies": [{"author": "LilamJazeefa", "id": "h8wv9dn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Yes.  Always test before you take.", "is_submitter": true, "distinguished": null, "created_utc": 1628950619.0, "parent_id": "t1_h8wlvzo", "replies": []}]}]}]}, {"author": "baalroo", "id": "h8te4m0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #120 | Legio Virtus", "submission": "p3ouuf", "stickied": false, "body": "Besides giving you a reason to feel superior and somewhere to direct your anger, what exactly would be *the point*?", "is_submitter": false, "distinguished": null, "created_utc": 1628880664.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8wh147", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "The point would be a future where these categories of people can never dominate society again.  And this is including the fact that I would almost centainly be one of the people gassed under my own programme.  It's not just venting anger and a sense of superiority.  It's an inability to establish empathy and a lark of foresight into the real results of such a programme.  Due to other commenters, I feel like I'm actually starting to make some progress", "is_submitter": true, "distinguished": null, "created_utc": 1628942642.0, "parent_id": "t1_h8te4m0", "replies": [{"author": "baalroo", "id": "h8x24gw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #120 | Legio Virtus", "submission": "p3ouuf", "stickied": false, "body": "But you're only giving me the *what*, not the *why*.", "is_submitter": false, "distinguished": null, "created_utc": 1628953783.0, "parent_id": "t1_h8wh147", "replies": [{"author": "LilamJazeefa", "id": "h8x2svf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Why do I want a world without such blights?  The same reason I want COVID to go away.  Less suffering, suffering which is less profound or long-lasting.  Because I dislike a world in pain.", "is_submitter": true, "distinguished": null, "created_utc": 1628954091.0, "parent_id": "t1_h8x24gw", "replies": [{"author": "baalroo", "id": "h8x3wcw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #120 | Legio Virtus", "submission": "p3ouuf", "stickied": false, "body": "It sure doesn't sound like it. I think you're trying to convince *yourself* that is the why, but you've yet to show how this would lead to that. You're choosing a nonsensical belief that makes you feel superior and angry rather than anything you could actually *do* that could reasonably and realistically help move the world towards that future. It's quite clearly a fantasy you've constructed for your own selfish motives and to avoid doing the actual work of improving yourself and the world around you.", "is_submitter": false, "distinguished": null, "created_utc": 1628954569.0, "parent_id": "t1_h8x2svf", "replies": []}]}]}]}]}, {"author": "TotallySpaghettironi", "id": "h8te8w4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #235", "submission": "p3ouuf", "stickied": false, "body": "Is there a bot to remind me to read posts?", "is_submitter": false, "distinguished": null, "created_utc": 1628880712.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8wh55k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Yes, the RemindMe bot.", "is_submitter": true, "distinguished": null, "created_utc": 1628942715.0, "parent_id": "t1_h8te8w4", "replies": [{"author": "TotallySpaghettironi", "id": "h8xjv98", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #235", "submission": "p3ouuf", "stickied": false, "body": "How do I summon a bot?", "is_submitter": false, "distinguished": null, "created_utc": 1628961469.0, "parent_id": "t1_h8wh55k", "replies": [{"author": "LilamJazeefa", "id": "h8ypvn0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I'd show you how but it would then make the bot active for me.  A quick Google search would assist you.", "is_submitter": true, "distinguished": null, "created_utc": 1628980593.0, "parent_id": "t1_h8xjv98", "replies": []}]}]}]}, {"author": "UptightBean", "id": "h8u66vc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #122", "submission": "p3ouuf", "stickied": false, "body": "Gee, then people womder why the comment to upvote ratio is off in this sub", "is_submitter": false, "distinguished": null, "created_utc": 1628891804.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8u946m", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Well I mean I'm asking for *help*...", "is_submitter": true, "distinguished": null, "created_utc": 1628893084.0, "parent_id": "t1_h8u66vc", "replies": []}]}, {"author": "qwerty0981234", "id": "h8v1pxq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #7", "submission": "p3ouuf", "stickied": false, "body": "I used to think similar things. However as I grew older I started to see the value of a life. And since then I can only look back at my younger self as an absolute fool. It’s something you learn through experiencing life and no way it’s explained through text.", "is_submitter": false, "distinguished": null, "created_utc": 1628906726.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8v2p5w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "But that's just the thing... I see no intrinsic value of life.  I see value as earned and quantitative, nothing more.  I don't believe in fundamental human rights.  No free speech, no free association, no voting unless you can demonstrate literacy in a wide assortment of relevant topics.  No right to life.  No bodily autonomy.  No anything of that kind.\n\nI want to see the value in rights like these.", "is_submitter": true, "distinguished": null, "created_utc": 1628907212.0, "parent_id": "t1_h8v1pxq", "replies": [{"author": "qwerty0981234", "id": "h8xf1hi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #7", "submission": "p3ouuf", "stickied": false, "body": "It comes with experience not knowledge. If anything your own mind prevents you from seeing these things.", "is_submitter": false, "distinguished": null, "created_utc": 1628959388.0, "parent_id": "t1_h8v2p5w", "replies": []}]}, {"author": "LilamJazeefa", "id": "h8v2ocm", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "But that's just the thing... I see no intrinsic value of life.  I see value as earned and quantitative, nothing more.  I don't believe in fundamental human rights.  No free speech, no free association, no voting unless you can demonstrate literacy in a wide assortment of relevant topics.  No right to life.  No bodily autonomy.  No anything of that kind.\n\nI want to see the value in rights like these.", "is_submitter": true, "distinguished": null, "created_utc": 1628907201.0, "parent_id": "t1_h8v1pxq", "replies": []}]}, {"author": "TakeOffYourMask", "id": "h8v3ggq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p3ouuf", "stickied": false, "body": "Do you think people have their clearest thinking and make their best decisions when they’re stewing in anger and healing from trauma?\n\nI don’t. So why trust your instincts here?\n\nTo “prove” you wrong I would have to start from some axioms and/or facts and derive theorems from them. But we’d have to agree on the axioms and/or facts.\n\nWe can make some progress here by just being utilitarian and seeing if the hoped-for objective of your genocide schemes could actually be achieved. \n\nConsider the track record of previous genocide attempts. They have often had similar goals: removal of undesirables. The US tried to get rid of the “savage, warlike” American Indians, the Nazis tried to get rid of the “greedy parasitic” Jews, the Soviets had almost a century of total control and mass murder in an attempt to create the “New Soviet Man” who would exhibit only altruistic socialist values.\n\nNone of them succeeded despite pouring loads of resources into it. There are still American Indians, Jews, and non-altruistic Russians. They also failed at removing the traits they wanted to do away with. There are still savage, warlike people, greedy and manipulative people, etc. More to the point they had to exhibit all those negative qualities themselves in great excess to even attempt their genocide.\n\nAlso consider the fact that every human society, including ones with minimal contact with civilization, exhibits these traits. They are intrinsic to humanity and cannot be bred out.", "is_submitter": false, "distinguished": null, "created_utc": 1628907590.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8wf7h4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Your first paragraph is the most profound.  The trauma caused by this mass death would likely make the problems far worse.  This is a significant thorn in the side of my toxic thoughts.  All the rest of the points don't phase me:  the prevois track records and assinine views of previous genocidal tyrants mean lihtle to me because they were ill-conceived.  The groups I've outlined have consensus scientific proofs of categorical harm.  Pruning them wouldn't prevent new people of such type from arising, but we could just mandatorily screen all new people for such traits and continue pruning as we go.\n\nBut the trauma... we'd be selecting for hard-to-detect epigenetic variants who are unlikely to feel empathy during the mann death, and then subjecting them to trauma which would be likely to cause these malicious qualities to manifest psychologically.  Likely irreversibly.\n\nMy response then is.... why then isn't it incumbent upon all species that evolve high intelligence to just wipe themselves into extinction?  It'd take just one wealthy dictator with no self-preservation instinct to nuke the planet into sterility.", "is_submitter": true, "distinguished": null, "created_utc": 1628941384.0, "parent_id": "t1_h8v3ggq", "replies": [{"author": "TakeOffYourMask", "id": "h8x6ar6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p3ouuf", "stickied": false, "body": "You need to be in an institution.", "is_submitter": false, "distinguished": null, "created_utc": 1628955618.0, "parent_id": "t1_h8wf7h4", "replies": []}]}]}, {"author": "gr13fy", "id": "h8vzj0v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #223", "submission": "p3ouuf", "stickied": false, "body": "we are not going to be able to prove you wrong in a way you find sufficient. the reasons why you are wrong lie in an experience you claim not to have: empathy. \n\nin edition. there are always going to be personality disorders and abusers in the world. killing them all (which is logistecally impossible as you would also very likely be killing a lot of innocent people as well) isn't going to solve anything. \n\nwhich you've already identified-so i'm curious why that isn't a good enough reason for you. you claim not to have empathy and yet you are entertaining these thoughts as a method of \"curing societal ills\"-\n\nyou have no reason to be invested in curing society of anything, since you have no affective empathy. it just looks like you are enjoying thinking about killing large numbers of people. \n\nthat is why you are getting the responses you are getting.", "is_submitter": false, "distinguished": null, "created_utc": 1628928180.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8wcvk7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Mass death, even mass death of innocent people as a casualty of fully wiping out these malicious groups, doesn't phase me.  I look at Mao's actions against the landlords atd my stomach... doesn't turn.  At all. \n\nAs for the logistics, mmm nah.  You could just keep going and having mandatory screenings for young people once you had already wiped out all the pre-existing miscreants.  Like continuing to pluck small weeds after having torn out a big ivy plant suffocating your garden.\n\nAnd as for why I care about social ills while I have such a disconnect from empathy?  That.... is a good question.  I'm not entirely sure I can respond clearly.  It seems I have some form of empathy, but it's very conditional.  Knowing many other narcissistic and antisocial people, I can say that we do unually have at least some empathy, some care for others.  It's just... limited and twisted.  So we can look at a puppy being drowned and either wince or not depending the person (usually wince because it's what we're expected to do), but look upon the torture of people we don't like and not wince at all (unless it's socially advantageous to do so).  At least in my experience, we tend to think of people in very black and white terms. Shades of grey are there, but when it comes down to the brass tacks we'll throw anyone under the bus if we feel a need.  But otherwise we do actually care about social ills.  Someone who drowns a puppy still earns our anger.\n\nThis is exactly why I want to get better.  I can see in myself this exact \"partial empathy\" and can clearly see how it leads to all the other emotional ills of being a narcissist.  It frightens me so.  I can't live as that person, and I feel revolted living in my own mind.  Hence why I'm asking this question, and why I don't mind the strong responses (apart from the people just calling me a monster -- they are doing way more damage than they know).\n\nProviding me with a logical toolbox which either will help instill an intuition of full empathy or at least skirt around the fact that I don't have one is, I feel, possible.  At least I'd **hope** so.", "is_submitter": true, "distinguished": null, "created_utc": 1628939626.0, "parent_id": "t1_h8vzj0v", "replies": [{"author": "gr13fy", "id": "h8zz2m0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #223", "submission": "p3ouuf", "stickied": false, "body": "> Mass death, even mass death of innocent people as a casualty of fully wiping out these malicious groups, doesn't phase me.\n\nright, so as mentioned, we are not going to be able to convince you that your thought processes are illogical \n\nbecause they are illogical due to lacking empathy. \n\nempathy *is* logical. it's not divorced from logic. it's just a form of logic that you can't actually understand.", "is_submitter": false, "distinguished": null, "created_utc": 1629004844.0, "parent_id": "t1_h8wcvk7", "replies": []}]}]}, {"author": "SybariteAussie", "id": "h9as0dm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p3ouuf", "stickied": false, "body": "A few years ago I was chatting with a lady on Instagram. Then went to the photo feed bit. A disturbing clip involving a woman & a dog appeared & seared itself into my mind. I did a spew face emoji to it & tried to forget it. I couldn’t smoke fast enough. Put the iPad down. I tried to comprehend what people would involve themselves in the production of such a clip or movie. Imagining how the camera man had started his day. A cold rage grew & intensified. I ate way too much weed! Tried to chemically restrain myself before I imagined seeing the world from the woman in the clips eyes. Was blending it & making weed milkshakes. The active ingredients in weed will bond with milk or butter, so be digested easier. Unfortunately it didn’t kick in quickly enough. I felt a intense pure plasma hatred for the camera man. Took several days to work out what had happened. Cried big belly tears & roared with futile rage. Next morning I could barely move. I kinda crawled,swam my way along the floor to get to the toilet. Savage munchies but unable to get the food from the kitchen. Day 2 I could crawl. Ate dry multigrain pumpkin seed bread on the kitchen floor for breakfast & again at dinner. Day 3 I could walk again. I realised what had happened was that I had felt intense anger,hatred & frustration. All hatred was focused on the camera man. I then began to find flaws in my logic. How do I know it wasn’t a woman holding the camera? Still the rage was there. I then did some thought experiments that had disturbing results. If I knew where everyone involved in the production of the traumatic clip I seen was shooting their next movie & I was in the military. How many innocent people could I accept as collateral damage if I knew I could get them? Drop a nuke on a town of 5k? 10k?, 15k? At 20k intoxicated with irrational hatred & rage me,  began to balk. My responses were genetically & culturally programmed into me. Like the “Birkenhead drill”. My tears were from frustrated rage that I was unable to get to the camera man. Took a few days to realise that. I write on a notebook any negative thoughts or questions. Vent the poison. I then change seats & respond on a different notebook from the perspective of a former colleague I admire. Change seats again & respond from another perspective. The process itself is cathartic. Use music to vent some rage, slowly select more positive songs to manipulate your mood. Careful when hunting monsters that you yourself don’t become a monster. Quoting someone there. Best to find a way to process your anger. If you judge others & a mob forms. In time they would turn on you. Often deafness is coupled with dumbness. This doesn’t mean that they are not intelligent. With hearing aids they can learn to speak. You referring to someone’s beliefs as dumb leaves you vulnerable to criticism. I haven’t heard the utilisation of the word dumb in this context as hate speech yet. You calling anything dumb could offend a deaf person or even someone that knows a deaf person. I am not offended or judging you. Just offering counsel. Tribalism is normal. It exists in every city. There will be a north v south or east v west rivalry. In mini simulated wars (football) between 2 teams we celebrate this rivalry and call it a derby. The rugby scrum is a simulated shield wall push. Animals and insects also have wars for territory & access to food. Not just humans. Throughout history we have always fought for land,access to fresh water & food. Many inventions, innovations & medical breakthroughs have been made during wars", "is_submitter": false, "distinguished": null, "created_utc": 1629213347.0, "parent_id": "t3_p3ouuf", "replies": []}, {"author": "JaimelesBN", "id": "h8t3a49", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p3ouuf", "stickied": false, "body": "Degenerates like you belong on a cross.", "is_submitter": false, "distinguished": null, "created_utc": 1628876284.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8wj7s0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "This is offensive to me as a Jew, as a Bahá'í, and as a mentally ill person.  Way to go, you've somehow managed to be worse than I am.  You just gave my toxic thoughs vindication by both saying that some people belong dead and by being harmfully ignorant.  You need help, too.", "is_submitter": true, "distinguished": null, "created_utc": 1628944068.0, "parent_id": "t1_h8t3a49", "replies": [{"author": "JaimelesBN", "id": "h8wm00z", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p3ouuf", "stickied": false, "body": "Don't care that you're Jewish or from some obscure tribe. Attention whore like you deserve to be beaten the shit off to bring you back to reality. \n\nGo get a manual job and start working as hard as you can, this will make you feel better, idleness is bad for the mind.", "is_submitter": false, "distinguished": null, "created_utc": 1628945688.0, "parent_id": "t1_h8wj7s0", "replies": [{"author": "LilamJazeefa", "id": "h8wv6xn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I asked the question so I can improve.  Which so far I actually seem to be.  I have a physically intensive job (for me, I'm physically disabled, too).\n\nShame on you.", "is_submitter": true, "distinguished": null, "created_utc": 1628950586.0, "parent_id": "t1_h8wm00z", "replies": [{"author": "JaimelesBN", "id": "h8y2cn5", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p3ouuf", "stickied": false, "body": "Shame on me, but you're the one mentally unstable and disabled. Stop complaining and start improving, work on a manual job, stop thinking, turn the TV off and get off the internet. Go out with your friends and never talk politics at all.\n\nDo this simple things and you'll get better, be a normie and life will be easier. Stop being a pussy, and stop blaming god and the world for your problems.", "is_submitter": false, "distinguished": null, "created_utc": 1628969670.0, "parent_id": "t1_h8wv6xn", "replies": [{"author": "LilamJazeefa", "id": "h8ypnwe", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I'm... not complaining?  I'm literally improving as I am speaking here.  Am I not allowed to be mentally ill here according to you?  If so, then you're more psychopathic than I am.  I don't even watch television.  I'm Bahá'í and don't really discuss politics.  I use political power here as an analogy for the basis of my emotional issues. I'm...  not blaming the world or G-d for my problems.\n\nDon't bother replying.  You're doing damage.", "is_submitter": true, "distinguished": null, "created_utc": 1628980491.0, "parent_id": "t1_h8y2cn5", "replies": []}]}]}]}]}]}, {"author": "DELETED", "id": "h8tw6tg", "score": 0, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p3ouuf", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1628887723.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8whwk6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Wow.  I literally asked to be told that my views are garbage, but hearing those words from someone else still hurts, lol.  Irony.\n\nAs for why clusters B and C but not A, take a look at the diagnoses:\n\nA)  Paranoid PD, Schizotypal, and Schizoid\nB)  Narcissistic, Antisocial, Borderline, and Histrionic, and\nC)  Obsessive Compulsive, Dependant, Avoidant\n\nCluster A doesn't really correlate with higher rates of manipulation, lying, infidelity, violence, verbal abuse, and so on.  A is more about a person's relationship to active delusions.  B and C is where you see manipulation and the rest.  Especially B, but OCPD definitely has this too as well as DPD with manipulatiot in order to maintain dependency.\n\nAnd I'm not just reducing down to personality disorders.  I also put in paedophilia and related issues, harmful cult membership propensity, anti-vax views climate denialism, and so on.\n\nSee, my toxic thoughts gravitate towards these groups since there are real social harms proven conclusively to be originating exclusively in them.  Tell me that there's no intrinsic harms unique to paedophilia and anti-vax views.  And then tell me we have the resources to rehabilitate them all even if we spared them.\n\nOther commenters are starting to help me piece together how this works, and I am happy", "is_submitter": true, "distinguished": null, "created_utc": 1628943224.0, "parent_id": "t1_h8tw6tg", "replies": []}]}, {"author": "StopBanningMeGDIT", "id": "h8u65f4", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "p3ouuf", "stickied": false, "body": "Pretty sure this is what Hitler and his followers believed they were doing. In their worldview, it was just to purge the earth of people they thought were less than themselves, and in their worldview this was obvious. The danger is that there is no consensus as to what would be allowed and what wouldn't, and nobody's worldview is totally unbiased. There is no objective, fair measurement of what a good person is.", "is_submitter": false, "distinguished": null, "created_utc": 1628891786.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8upi9x", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Hitler's reasoning was understood to be assinine by outside observers from the get-go.  His racial and social views were viewed even by his contemporaries as extremist and incoherent.\n\nBut I'm not really concerned about what gets universally condemned or not, or whether the views of the executors was biased or not.  I'd just go ahead and gas the core groups at least and then keep going if there's a positive effect and stop when we reach significant improvement, or continue on until extinction if we don't see any improvement.\n\nI can tell you, as a person struggling with norcissistic feelings and many other injurious maladies, that I can *easily* see the utility of a more final solution to the problem of our existence.\n\nSo I am stuck with these terrible thoughts.  Hopefully I can find a good explanation which will keep them down better.", "is_submitter": true, "distinguished": null, "created_utc": 1628900682.0, "parent_id": "t1_h8u65f4", "replies": [{"author": "StopBanningMeGDIT", "id": "h8uv7nk", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "p3ouuf", "stickied": false, "body": "So essentially what you're saying is that your moral compass is the correct way to live and people that are not aligned to your rhetoric ate not worthy of the space they take up. Sounds like a god complex honestly, which fits the NPD and has been used to commit all sorts of atrocities", "is_submitter": false, "distinguished": null, "created_utc": 1628903503.0, "parent_id": "t1_h8upi9x", "replies": [{"author": "LilamJazeefa", "id": "h8uys7p", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "I can see god complex, but I wouldn't agree that (the toxic part of my mind) just wants to kill everyone with a different moral compass.  I am fine with vegans and omnivores.  And I'm fine with those who would return a briefcase full of money and those who would use it to pay for their dog's life-saving surgery.  I'm fine with many moral views.  I'm specifically concerned with my thoughts about groups of people who cause clear and excessive and often multi-generational harms.  And granted that's a ***LOT*** of people in my view, it's not in a way in which I would agree with your assessment.  If that makes sense?", "is_submitter": true, "distinguished": null, "created_utc": 1628905268.0, "parent_id": "t1_h8uv7nk", "replies": []}]}]}]}, {"author": "AndrewIsOnline", "id": "h8yz3eb", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "p3ouuf", "stickied": false, "body": "By your own rules we would be throwing you to the gas chamber", "is_submitter": false, "distinguished": null, "created_utc": 1628985180.0, "parent_id": "t3_p3ouuf", "replies": [{"author": "LilamJazeefa", "id": "h8za92l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #102", "submission": "p3ouuf", "stickied": false, "body": "Yeah I know.  Had you read my full post you'd know I've already considered that and have a way of emotiotally processing that fact.", "is_submitter": true, "distinguished": null, "created_utc": 1628990843.0, "parent_id": "t1_h8yz3eb", "replies": []}]}]}