{"title": "\"The Egg\" by Andy Weir.", "name": "t3_pgzlmh", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pgzlmh/the_egg_by_andy_weir/", "selftext": "To those who are not familiar with this short story, [you can read it here.](http://www.galactanet.com/oneoff/theegg_mod.html) To those who are, I want to ask- what do you think about this?\n\nWell, I think that its quite a unique philosophy. The idea that we all are one being, just living life from different perspectives, is just crazy to think about. And the fact that we will mature and become a God ourselves is so crazy we can't even think about it.\n\nBut what I actually wanted to talk about is the fact that this story conveys a really common message, in an uncommon way. \"Treat others like the way you want to be treated.\" This must have been what Weir intended to tell us. He wanted us to look at others and just imagine ourselves being there. Everytime we shouted at someone, he wanted us to think that we shouted at ourselves. Everytime we made fun of someone, he wanted us to think that we made fun of ourselves. Everytime we made someone cry, he wanted us to think that we made ourselves cry. I can't help but think that this was his true aim.\n\nHumans are naturally self-centered beings. We care, but most of the times, we don't care enough. So how do you tell a self-centered being to care for others? Simple, you tell them that the other person, is you.\n\nEdit: [Link to the video Kurzgesagt made on this, for people who prefer videos.](https://www.youtube.com/watch?v=h6fcK_fRYaI)", "score": 18, "upvote_ratio": 0.91, "permalink": "/r/TheFlyingTree/comments/pgzlmh/the_egg_by_andy_weir/", "id": "pgzlmh", "author": "LordNavneet", "link_flair_text": "Fascinating", "num_comments": 26, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630650429.0, "comments": [{"author": "neolthrowaway", "id": "hbf0jgx", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #338", "submission": "pgzlmh", "stickied": false, "body": "The kurzgesagt video on this is pretty cool.", "is_submitter": false, "distinguished": null, "created_utc": 1630650540.0, "parent_id": "t3_pgzlmh", "replies": [{"author": "LordNavneet", "id": "hbf0v8s", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #534", "submission": "pgzlmh", "stickied": false, "body": "Agreed. Well all Kurzgesagt videos are cool but this one was really cool. And that was actually where I found this story from.", "is_submitter": true, "distinguished": null, "created_utc": 1630650787.0, "parent_id": "t1_hbf0jgx", "replies": []}]}, {"author": "LeastAction_", "id": "hbfc9mg", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #130", "submission": "pgzlmh", "stickied": false, "body": "I just finished reading it. I feel a little... scared? But also relieved?   \nI don't know. It's a bit overwhelming. I should probably drink a coffee and let these ideas sink in before I'll be able to form an opinion about them", "is_submitter": false, "distinguished": null, "created_utc": 1630660370.0, "parent_id": "t3_pgzlmh", "replies": [{"author": "Nakotadinzeo", "id": "hbfom8y", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #553", "submission": "pgzlmh", "stickied": false, "body": "Think about Windows XP for a moment... I guess you could think of another OS, but XP had an unusually long lifespan and had the greatest adoption, so that's what I chose.\n\nEvery copy of XP was exactly the same, barring the changes that came with updates and service packs but you'd still say, that it was XP.\n\nThe thing is, even though every copy of XP started out exactly the same, experience made it unique. One copy would be running on the desk of a fortune 500 CEO, showing stocks or a background of their newest sports car. Another would be owned by a teenager, an icon for kazaa, several games, and a link to 4chan b. Another would be installed on a military laptop in Afghanistan, sending a Skype call of a solder to yet another copy his wife would be using to show him his newborn son. A copy would be installed in a MRI machine, where it may still be 20 years on showing people's insides to doctors.\n\nSo, even if you were the egg, you're experiencing it like Windows XP. A fresh copy every time, no memory of the hours of Morrowind nor being exhibit A of a hanus computer crime. Fresh, and ready for what's next.", "is_submitter": false, "distinguished": null, "created_utc": 1630669624.0, "parent_id": "t1_hbfc9mg", "replies": []}, {"author": "LordNavneet", "id": "hbfj2qx", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #534", "submission": "pgzlmh", "stickied": false, "body": "Yeah thats the usual reaction. A crazy concept, it takes a while to settle.", "is_submitter": true, "distinguished": null, "created_utc": 1630665911.0, "parent_id": "t1_hbfc9mg", "replies": []}]}, {"author": "eliminating_coasts", "id": "hbfgudz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #129", "submission": "pgzlmh", "stickied": false, "body": "I think I may have read too much scifi for this concept to have much weight with me; implicitly it transforms interpersonal cooperation into \"inter-temporal\" cooperation, the general way that we try to make the world a better place for our future self, but it also implies that there's actually no value to human life; no individual is unique or important because killing someone just lessens their period in a given configuration and moves them on to another one.\n\nIt becomes like deciding you want to throw back a hand of cards because it didn't come out too well, hoping the next one is better.\n\nIn contrast, if every human being is a unique consciousness generated under their own processes, that is like you by analogy but irreplacable, then this results in a completely different attitude to human life; each person is a new and distinct element of the multiplicative factor of the experienced universe: A universe is doubled, tripled, quadrupled by every experiencing human being, and each version of that subjective universe is slightly different.\n\nThen, by understanding your own uniqueness and desire to continue, you can understand the value of others, not because they are you, but because you could be in their position, viewing the world from their perspective and wanting to live.\n\nSo this transposition is a mental one not a metaphysical one, and means you don't end up treating other people as just bad-roll versions of yourself.", "is_submitter": false, "distinguished": null, "created_utc": 1630664198.0, "parent_id": "t3_pgzlmh", "replies": [{"author": "Sandlicker", "id": "hbgq3vx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #567", "submission": "pgzlmh", "stickied": false, "body": "I appreciate your perspective on this. Just goes to show that there's no one way to reach all people with the same idea or intention.", "is_submitter": false, "distinguished": null, "created_utc": 1630686704.0, "parent_id": "t1_hbfgudz", "replies": []}, {"author": "LordNavneet", "id": "hbfi922", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #534", "submission": "pgzlmh", "stickied": false, "body": "That is certainly an interesting perspective. The points you state are perfectly valid and make sense. But an average human (including myself) has never thought so deep into this, which is why this philosophy still works. \n\nI love the last two paragraphs. But that's just loving an ideal mindset. It's something that most of us humans have never thought about, and I doubt we will in the future.\n\nAnyway, thanks for the comment. Reading such a view on this story was a lot of fun.", "is_submitter": true, "distinguished": null, "created_utc": 1630665288.0, "parent_id": "t1_hbfgudz", "replies": []}]}, {"author": "Ice_Nade", "id": "hbftfsl", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #123", "submission": "pgzlmh", "stickied": false, "body": "i re-read it now but i heard it first from the kurzgesagt video, pretty interesting, i guess in an extremely egotistical kind of way, which i guess by definition it is, the dagoth ur philosophy, not \"I am all\" but \"All is me\" and though while this if everyone took it as gospel, which i dont think its meant to be, it would lead to more kindness.  \n\n\nBut kindness given out of a purely self-serving reason, is that bad though? i dont really think so. But while i may believe that, this all just felt a bit... stiff? i cant explain it that well. i was extremely annoyed at the statement that asking the point of it all was stereotypical though as of course it is, it's one of the big mysteries, everyone wants to know. But thats just a nitpick. None of this was especially new to  me, not that i can remember where ive seen the same before.", "is_submitter": false, "distinguished": null, "created_utc": 1630672393.0, "parent_id": "t3_pgzlmh", "replies": [{"author": "throw-away451", "id": "hbg49tg", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "pgzlmh", "stickied": false, "body": "Upvoted for “Dagoth Ur philosophy.” Are we getting recruited from r/Morrowind?", "is_submitter": false, "distinguished": null, "created_utc": 1630677585.0, "parent_id": "t1_hbftfsl", "replies": [{"author": "Ice_Nade", "id": "hbg7p0d", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #123", "submission": "pgzlmh", "stickied": false, "body": "Lmao i hope not", "is_submitter": false, "distinguished": null, "created_utc": 1630679059.0, "parent_id": "t1_hbg49tg", "replies": [{"author": "throw-away451", "id": "hbg8h49", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "pgzlmh", "stickied": false, "body": "“Come and look upon the subreddit, and the community info. And bring your upvote, I have need of it.”\n\n“What a fool you are! I’m a mod! How can you ban a mod? What a grand and intoxicating innocence! How could you be so naive? There is no escape. No unsubscribe or unfollow can work in this place!”", "is_submitter": false, "distinguished": null, "created_utc": 1630679392.0, "parent_id": "t1_hbg7p0d", "replies": [{"author": "Ice_Nade", "id": "hbgcwbn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #123", "submission": "pgzlmh", "stickied": false, "body": "sexiest voice in gaming, no contest.", "is_submitter": false, "distinguished": null, "created_utc": 1630681250.0, "parent_id": "t1_hbg8h49", "replies": []}]}]}]}]}, {"author": "celtic_cuchulainn", "id": "hbgxwxl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #168", "submission": "pgzlmh", "stickied": false, "body": "I’m gonna get downvoted on this sub, but if you’re interested in learning more about the philosophy and spirituality behind The Egg and its many interpretations, I’d recommend checking out:\nr/Gnosticism\nr/LawofOne\nWatching Midnight Gospel, specifically episode 5\n\nOn some level, we are absolutely all one being. The more you see it that way, the easier it becomes to treat others as yourself. It’s a statement that won’t resonate with many yet because we’re still learning and it’s a scary concept. After splitting from oneness, our individual egos pick a path.\n\nIn Law of One, that path splits into being centred on service to self or service to others (generally western vs eastern thought). In both cases, you are serving the whole (it’s not good vs evil). It’s like a good story needs a villain, so you’d thank them for their role after all is said and done.\n\nThese concepts of non-duality turn some people off, but I’ve found them incredibly helpful in tackling my own personal issues and aiding my growth.", "is_submitter": false, "distinguished": null, "created_utc": 1630689941.0, "parent_id": "t3_pgzlmh", "replies": [{"author": "LordNavneet", "id": "hbh6yqx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #534", "submission": "pgzlmh", "stickied": false, "body": "Thank you for the recommendations! I'll be sure to visit those subreddits.", "is_submitter": true, "distinguished": null, "created_utc": 1630693801.0, "parent_id": "t1_hbgxwxl", "replies": []}]}, {"author": "Aubreebee", "id": "hbi5nk2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #560", "submission": "pgzlmh", "stickied": false, "body": "Absolutely loved it. I agree on the ‘treating others as you want to be treated’ but what Was far more intriguing to middle school me was..\n\nExperiential Expansion. The idea that we are here to learn and grow, experiencing a countless number of lifetimes where both good and evil deeds are needed. If not for the disenfranchised, we’d never have the experience of being philanthropic. If not for the authoritarian, we’d never experience persecution. To view existence in this manner takes away the pity and judgment most of us have toward eachother. Why judge if you don’t know the purpose or what that soul is looking to learn in this life?\n\nAndy Weir has a few other [one shots](http://www.galactanet.com/writing.html) on his website. There’s also a really great story of a mermaid, though I am not sure I he ever finished it.", "is_submitter": false, "distinguished": null, "created_utc": 1630709541.0, "parent_id": "t3_pgzlmh", "replies": []}, {"author": "DoglessDyslexic", "id": "hbf0ze3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pgzlmh", "stickied": false, "body": "See also \"Factoring Humanity\" by Robert Sawyer.", "is_submitter": false, "distinguished": null, "created_utc": 1630650874.0, "parent_id": "t3_pgzlmh", "replies": [{"author": "LordNavneet", "id": "hbf1htk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #534", "submission": "pgzlmh", "stickied": false, "body": "Sounds interesting...I'll be sure to check that out. Thank you!", "is_submitter": true, "distinguished": null, "created_utc": 1630651263.0, "parent_id": "t1_hbf0ze3", "replies": [{"author": "DoglessDyslexic", "id": "hbf5cks", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pgzlmh", "stickied": false, "body": "It's a slightly different take.  Rather than sequential existence, it postulates that humanity is a 4 dimensional single entity and that individuals are 3 dimensional extensions of that same 4 dimensional entity.  There's more to it than that of course, but that's the gist.", "is_submitter": false, "distinguished": null, "created_utc": 1630654309.0, "parent_id": "t1_hbf1htk", "replies": []}]}]}, {"author": "FalconRelevant", "id": "hbg47n9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "pgzlmh", "stickied": false, "body": "Another way to interpret it is that we're all the same person, so \"killing\" each other is completely OK.", "is_submitter": false, "distinguished": null, "created_utc": 1630677559.0, "parent_id": "t3_pgzlmh", "replies": [{"author": "LordNavneet", "id": "hbg8mkq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #534", "submission": "pgzlmh", "stickied": false, "body": "Well...legally speaking, suicide (is this suicide though?) is illegal in many countries. But, I get your point. It is OK to kill each other, but we would also experience death when we live life from the other body. So, you take life, you get death (and most likely lots of pain).", "is_submitter": true, "distinguished": null, "created_utc": 1630679456.0, "parent_id": "t1_hbg47n9", "replies": []}]}, {"author": "Sandlicker", "id": "hbgpszn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #567", "submission": "pgzlmh", "stickied": false, "body": "I think it's a great thought experiment for basing a moral worldview off of. Obviously it is not true in any literal sense, but it's pretty thought-provoking for something so short.", "is_submitter": false, "distinguished": null, "created_utc": 1630686580.0, "parent_id": "t3_pgzlmh", "replies": [{"author": "LordNavneet", "id": "hbgru0j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #534", "submission": "pgzlmh", "stickied": false, "body": "Exactly what I thought!", "is_submitter": true, "distinguished": null, "created_utc": 1630687411.0, "parent_id": "t1_hbgpszn", "replies": []}]}, {"author": "BuccaneerRex", "id": "hbh4y1o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pgzlmh", "stickied": false, "body": "I don't care for the mysticism, but it's a pretty idea.", "is_submitter": false, "distinguished": null, "created_utc": 1630692920.0, "parent_id": "t3_pgzlmh", "replies": []}, {"author": "LukeM1066", "id": "hbiko20", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #240", "submission": "pgzlmh", "stickied": false, "body": "Okay reading this while tipsy was definatly a mistake", "is_submitter": false, "distinguished": null, "created_utc": 1630717111.0, "parent_id": "t3_pgzlmh", "replies": []}, {"author": "DaBaiterr", "id": "hbj9b0a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #132", "submission": "pgzlmh", "stickied": false, "body": "I love this philosophy in a weird way as it’s also slightly frightening. I’m technically talking to my self", "is_submitter": false, "distinguished": null, "created_utc": 1630730732.0, "parent_id": "t3_pgzlmh", "replies": []}]}