{"title": "Glitch in the matrix?", "name": "t3_oni4o6", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oni4o6/glitch_in_the_matrix/", "selftext": "Follow me for a short mind play: When people say \"There's a glitch in the matrix\" they usually refer to something unusual or something happening in this world that seems \"odd\".\n\nBut who says it can't be the other way around?^(1) Maybe it's a matrix in the glitch. Maybe this \"odd\" moment we temporarily experienced is actually \"reality\". A moment of system in the chaos we got so used to that we've been mistaking it for reality for so long^(2). We are basically damned to use our perception. Our brains are full of bias and deception so we never perceive reality but still have to trust our minds and senses because we have no choice. Our minds are not capable of comprehending another dimension or even reality. Can you imagine a color you've never seen before? No? Good. Proves that you're human.\n\nSome things we can't explain. We have theories and concepts for why things are like they are just for the sake of finding out who we are. Theology. Philosophy. Science. But these fields are, due to our perception, limited.  \n\n&#x200B;\n\n&#x200B;\n\n>!1 No, I'm not Vsauce.\n2 No, I'm also not Plato.!<", "score": 2, "upvote_ratio": 0.67, "permalink": "/r/TheFlyingTree/comments/oni4o6/glitch_in_the_matrix/", "id": "oni4o6", "author": "LostInTheWoods1219", "link_flair_text": "Idea", "num_comments": 15, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1626713786.0, "comments": [{"author": "Zealousideal_Mix_629", "id": "h5rvdqo", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oni4o6", "stickied": false, "body": "What did you smoke, and did you bring enough for the entire class?", "is_submitter": false, "distinguished": null, "created_utc": 1626715089.0, "parent_id": "t3_oni4o6", "replies": [{"author": "Cregaleus", "id": "h5rxj5d", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "oni4o6", "stickied": false, "body": "Guess nobody told OP that he's supposed to read his psychology book, not smoke it.\n\nAssociative memory is consistent enough such that reproducible and predictable tests can be conducted. These \"glitch in the matrix\" phenomena are adequately explained by modern models of memory. It is common for the occurrence if a new stimuli to add new context to some past experience and yield an entirely new comprehension of that previously categorized experience.\n\nThere's nothing magical about this. If anyone finds this sort of thing interesting then they'd be better off opening a textbook on cognitive science than spreading unsubstantiated mysticism online.\n\nEdit:\n\nI shouldn't be so dismissive, there does seem to be some good philosophical observations in OP's post that are for whatever reason conflated with a claim on deja vu and other uncanny experiences. That our senses are imperfect instruments is a well explored idea within philosophy - do our senses give us any kind of correspondence with underlying truths, or can this all just be hallucinatory (the matrix)? If these sorts of questions interest you then I highly recommend reading up on Enlightenment philosophy, starting perhaps with Descartes.", "is_submitter": false, "distinguished": null, "created_utc": 1626715998.0, "parent_id": "t1_h5rvdqo", "replies": [{"author": "LostInTheWoods1219", "id": "h5s3ube", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oni4o6", "stickied": false, "body": "I see. Thank you a lot for the insight but I'm afraid there might be a misunderstanding: I am not referring to deja-vus. I'm referring to things we can't explain in general. Actually mysterious things that occur, where we find ourselves guessing what it could be or mean. Maybe it was my wording that led to this misunderstanding.", "is_submitter": true, "distinguished": null, "created_utc": 1626718670.0, "parent_id": "t1_h5rxj5d", "replies": [{"author": "Zealousideal_Mix_629", "id": "h5s7c6y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oni4o6", "stickied": false, "body": "It's called Apophenia, and it's just a quirk of how our brains work. Seeing patterns where there are none.\n\nhttps://www.masterclass.com/articles/how-to-avoid-apophenia-bias#what-is-apophenia", "is_submitter": false, "distinguished": null, "created_utc": 1626720163.0, "parent_id": "t1_h5s3ube", "replies": []}]}]}]}, {"author": "Rocknocker", "id": "h5rwdph", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #180", "submission": "oni4o6", "stickied": false, "body": ">But these fields are, due to our perception, limited.\n\n\"Non sequitur. Your facts are uncoordinated.\"\n\nThat's we devise devices to take over where our senses fail, like microscopes, telescopes, anemometers, scintillation counters, *ad infinitum*.", "is_submitter": false, "distinguished": null, "created_utc": 1626715508.0, "parent_id": "t3_oni4o6", "replies": [{"author": "bernpfenn", "id": "h5soybr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "oni4o6", "stickied": false, "body": "i second that. we have tools!", "is_submitter": false, "distinguished": null, "created_utc": 1626727740.0, "parent_id": "t1_h5rwdph", "replies": []}, {"author": "1i_rd", "id": "h5tfqj0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #199", "submission": "oni4o6", "stickied": false, "body": "Virgo and Ligo as well. Observing gravitational waves is like a whole new way of looking at the universe.", "is_submitter": false, "distinguished": null, "created_utc": 1626740289.0, "parent_id": "t1_h5rwdph", "replies": []}, {"author": "LostInTheWoods1219", "id": "h5s7oe0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oni4o6", "stickied": false, "body": "It's not necessarily about the visuals only. I am talking about the whole. The process of perception (to simplify it let's only concentrate on visual perception right now):\n\nPerception is basically when you look at something and your brain takes that information and edits it in a way you can actually understand it. Means: Since your mind contributes to the picture there is always the chance you have memories, experiences or thoughts in general that influence it.\n\n And except for that: I am also not talking about microscopic particles etc. I am talking about possible another dimensions or phenomenons we can't explain. I am aware that we have instruments being able to make things visible we can't see when observing just through our eyes. But that was not my point.\n\nAlso keep in mind that this is just a mind play. I don't necessarily believe in other dimensions. But after all I can't exclude this possibility.", "is_submitter": true, "distinguished": null, "created_utc": 1626720308.0, "parent_id": "t1_h5rwdph", "replies": [{"author": "solongfish99", "id": "h5sr1ag", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "oni4o6", "stickied": false, "body": "If you can't exclude a possibility, but also cannot demonstrate it and it adds layers of unexplained complexity to our understanding of the world, it's likely not true/real.", "is_submitter": false, "distinguished": null, "created_utc": 1626728655.0, "parent_id": "t1_h5s7oe0", "replies": [{"author": "LostInTheWoods1219", "id": "h5vdat9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oni4o6", "stickied": false, "body": "Like I said: I don't search for \"the truth\" here. It was just something that came to my mind. It's not supposed to be something I actually believe.", "is_submitter": true, "distinguished": null, "created_utc": 1626786680.0, "parent_id": "t1_h5sr1ag", "replies": []}]}]}]}, {"author": "BuccaneerRex", "id": "h5sg57y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "oni4o6", "stickied": false, "body": "It is far more likely that our brains are shittier at memory and cognition than we naively imagine they are than it is that reality isn't real.", "is_submitter": false, "distinguished": null, "created_utc": 1626723958.0, "parent_id": "t3_oni4o6", "replies": []}, {"author": "bernpfenn", "id": "h5sqauq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "oni4o6", "stickied": false, "body": "we have mathematical proof of 11 dimensions.\nour perception is way past our senses.\nwe detect gravity variations which are predicted by math.\n\nwhat you are referring to as glitch is synchronicity. Events of seconds define whole life times, like when you met your life partner. when you are in a car crash halting 50 cm before a tree. short moments in ones life triggering a long line of cause and reactions. families etc..", "is_submitter": false, "distinguished": null, "created_utc": 1626728330.0, "parent_id": "t3_oni4o6", "replies": [{"author": "1i_rd", "id": "h5tfye7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #199", "submission": "oni4o6", "stickied": false, "body": "I'd like to see this \"proof\". If you're referring to one of the forms of string theory, that is not a proof but just a theory that can explain some parts of reality mathematically. It doesn't mean that's the only way to do it though since there are multiple theories all based in math and all having different amounts of dimensions.", "is_submitter": false, "distinguished": null, "created_utc": 1626740397.0, "parent_id": "t1_h5sqauq", "replies": []}, {"author": "LostInTheWoods1219", "id": "h5vduab", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oni4o6", "stickied": false, "body": "What I am referring to as a \"glitch\" is something we can't explain in general. But what this glitch actually is shouldn't be that much of a topic anyway", "is_submitter": true, "distinguished": null, "created_utc": 1626786974.0, "parent_id": "t1_h5sqauq", "replies": []}]}, {"author": "FreeBiskit", "id": "h5swtmu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "oni4o6", "stickied": false, "body": "Couldn’t the original phrase still apply? I get what you mean though and I like it. \n\nAlso, I am way over my head here but I’ve heard/read that our brains are literally filtering out a ton of information that we could otherwise perceive. I wonder what this other information looks or feels like? Is my color red the same color red as yours? Hey Vsauce, Michael here.", "is_submitter": false, "distinguished": null, "created_utc": 1626731236.0, "parent_id": "t3_oni4o6", "replies": []}]}