{"title": "Social media is weird", "name": "t3_pijdan", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pijdan/social_media_is_weird/", "selftext": "Stating your thoughts to the public and then random strangers respond to it and then you just exchange some words and it doesn’t really matter and it’s a waste of time instead of real, deep and meaningful social interaction yet we still all do it and love to do it and waste a ton of time doing it.", "score": 4, "upvote_ratio": 0.75, "permalink": "/r/TheFlyingTree/comments/pijdan/social_media_is_weird/", "id": "pijdan", "author": "LT125", "link_flair_text": "Debate", "num_comments": 13, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630869501.0, "comments": [{"author": "Cognizant_Psyche", "id": "hbq3l8t", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "pijdan", "stickied": false, "body": "Social Media is ~~weird~~ terrible.  FTFY.\n\nReddit doesn’t really count in what I perceive as “social media” as it’s more of a chat room with nothing but anons.  Things like Facebook, tictok, and the like where you have your name and face attached is what I’m referring to and it’s the worst.  I don’t know it’s just a different vibe, I guess since it’s attached more to the “real” you the ego is more easily spurred to action for recognition and fame so more stupidity is spewed and performed in order to get recognition or to “defend” your stance, and when someone disagrees there is a face and name to attach to whatever dis or hurt you perceived to be directed to you, even if it’s not.  You don’t really hear about Reddit challenges where people hurt or kill themselves and others for views and get convicted of crimes.  Not to say this is a Mecca of purity, an anon environment has its own pitfalls and issues, but I would argue not as toxic as say Facebook…", "is_submitter": false, "distinguished": null, "created_utc": 1630872022.0, "parent_id": "t3_pijdan", "replies": []}, {"author": "Momus1738", "id": "hbqhkkb", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #285", "submission": "pijdan", "stickied": false, "body": "What I hate about social media sites like Twitter is you almost never see people admit that they’re wrong.", "is_submitter": false, "distinguished": null, "created_utc": 1630878396.0, "parent_id": "t3_pijdan", "replies": []}, {"author": "Alatain", "id": "hbqto4t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pijdan", "stickied": false, "body": "You basically just described pubs and public squares through a lot of human history. \n\nThis one is just bigger and we need to figure out how to navigate it.", "is_submitter": false, "distinguished": null, "created_utc": 1630884277.0, "parent_id": "t3_pijdan", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "hbqxqnm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pijdan", "stickied": false, "body": "It's the new normal, welcome to the future.", "is_submitter": false, "distinguished": null, "created_utc": 1630886303.0, "parent_id": "t3_pijdan", "replies": [{"author": "LT125", "id": "hbrvvd1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #210", "submission": "pijdan", "stickied": false, "body": "I’m the generation that doesn’t know anything else - the “normal life”. But if I could choose when I lived, I’d want to live in 1980 - 2005 for example.", "is_submitter": true, "distinguished": null, "created_utc": 1630903989.0, "parent_id": "t1_hbqxqnm", "replies": [{"author": "Zealousideal_Mix_629", "id": "hbt07hn", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pijdan", "stickied": false, "body": "That era wasn't perfectly either tey had its own problems. Everybody blamed the 24 hour news cycle rather than social media for people being people.", "is_submitter": false, "distinguished": null, "created_utc": 1630934394.0, "parent_id": "t1_hbrvvd1", "replies": []}]}]}, {"author": "SybariteAussie", "id": "hbr1k35", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pijdan", "stickied": false, "body": "At some point I will likely delete this app & not use the email connected to it again. I can see the commercial & propaganda value that social media has. For me the social aspects are limited. Ignorance of internet jargon & the tech dexterity of a sloth in winter are likely explanations. Instincts suggest a strategic retreat is advisable. Turtle mode is best during troubled times! Undaunted by the revelation of what the glockenspiel is, will continue to research the history of all the instruments in the orchestra. Glockenspiel just rolls off the tongue & caresses the ears! However the reality is incredibly drab! Orchestral bells that resemble bars of metal. Sigh. Today I will learn about the hurdy  gurdy. Dipping my toe in the pool of public opinion does not inspire me to jump right in. Will return to my blanket & umbrella near the exterior fence & observe from there. Each of us is weird & capable of behaviour that is out of character, given the right stimuli or circumstances. Everything is random. Human nature is predictable. Am not sufficiently interested in myself to investigate all the nuances of mbti for self analysis. Have existing but proven methods for reading others. When doing job interviews, I read the person more than their resumes. Words printed are even more unreliable than words verbalised as a guide for judging a person. Body language, eyes, facial expressions and voice are more reliable for perceiving the colour of a persons soul. Deliberate deception causes a subconscious twang. Like one musician in a orchestra playing out of tune or time. Change subject and discuss something random to thwart the use of pre planned statements or set plays. For people in the psychology industry it could be useful?", "is_submitter": false, "distinguished": null, "created_utc": 1630888178.0, "parent_id": "t3_pijdan", "replies": [{"author": "Happy_Weirdo_Emma", "id": "hbssgnq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #616", "submission": "pijdan", "stickied": false, "body": "The way you wrote this reminds me of the stuff on the side of my bottle of Dr Bronner's soap", "is_submitter": false, "distinguished": null, "created_utc": 1630929790.0, "parent_id": "t1_hbr1k35", "replies": []}]}, {"author": "floofandmemes", "id": "hbro9si", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "pijdan", "stickied": false, "body": "This is the truth, I really need to get off reddit....ah well. I guess...I'll try to make this my last comment.\n\nMight hop in once a week to stay here though to avoid culling.", "is_submitter": false, "distinguished": null, "created_utc": 1630899586.0, "parent_id": "t3_pijdan", "replies": []}, {"author": "MisanthropicScott", "id": "hbqbvkp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pijdan", "stickied": false, "body": "It's not \"real, deep, and meaningful social interaction\", but neither is some of the social interaction that takes place in meatspace.\n\nIt feels like sort of social interaction lite, most of the time.\n\nThough, I have had numerous occasions on which I have felt that the social interaction has actually been at least somewhat deep and meaningful.\n\nA lot depends on the sub, the participants, and how much you're willing to open up.", "is_submitter": false, "distinguished": null, "created_utc": 1630875753.0, "parent_id": "t3_pijdan", "replies": []}, {"author": "FreeBiskit", "id": "hbqz41r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #174", "submission": "pijdan", "stickied": false, "body": "This is how I feel about real life.", "is_submitter": false, "distinguished": null, "created_utc": 1630886987.0, "parent_id": "t3_pijdan", "replies": [{"author": "1000100001", "id": "hbr0q8i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #623", "submission": "pijdan", "stickied": false, "body": "I share in this feeling as well.", "is_submitter": false, "distinguished": null, "created_utc": 1630887778.0, "parent_id": "t1_hbqz41r", "replies": []}]}, {"author": "Yaboibaka", "id": "hbtxqsz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pijdan", "stickied": false, "body": "i hate conversations on the internet. conversations irl feel better since i have a hold over them with social cues and stuff which is never translated online. DMs are like a game of hot potato where the goal is to be the one who gets left on seen. ive never been the one to post pics of myself so i never used instagram or facebook but i still have them because my friends have them and they say that thats the only way to contact them. i wanna say more but ill make a separate post cause i wanna elaborate more", "is_submitter": false, "distinguished": null, "created_utc": 1630949578.0, "parent_id": "t3_pijdan", "replies": []}]}