{"title": "Should we transcend humanity?", "name": "t3_oreuru", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oreuru/should_we_transcend_humanity/", "selftext": "I want to start a discussion inspired by the paper _Moral Transhumanism_ ([readable here](https://www.researchgate.net/publication/47791493_Moral_Transhumanism), ~13 pages). To summarize the paper:\n\n* A \"species\" is a poorly defined concept, and you cannot draw clear species boundaries based on inter-fertility or parenthood\n\n* If we cannot define \"humanity\" by a genetic boundary, then we should define humanity by traits we ascribe to humanity: self-awareness, conscious thought, rationality, morality\n\n* We should therefore not fear changing human beings until they are no longer genetically Homo Sapiens, because the things we value in humanity are the above essential traits of humanity, which will remain\n\n* We therefore _should_ change humanity to further emphasize these \"biological and psychological dispositions to believe, feel, sense, think, act, and be that are typical of human beings\"\n\n* These improvements to empathy and compassion will allow us to live amongst larger populations with less conflict, and will dilute our bias towards near-future impacts (and against individually small contributions) that make long-term problems like climate change difficult to combat\n\nI find this to be an appealing argument, and I agree insofar as \"a posthuman who is genetically distinct and incompatible with present-day humans should still be respected as human so long as they possess human traits like empathy and rational thought.\" I think the implementation falls into the trap common to most eugenics discussions: who gets to choose what traits are emphasized or de-emphasized? Who is making the genetic changes, and what groups or geographic regions will benefit from them?\n\nSo, what are The Flying Tree's thoughts? Should we shed our biological humanity and become transhumanist or posthuman? If yes, what traits should be emphasized for a brighter future? What does that future look like? If no, what are the potential harms that make you question this path?", "score": 1, "upvote_ratio": 0.67, "permalink": "/r/TheFlyingTree/comments/oreuru/should_we_transcend_humanity/", "id": "oreuru", "author": "milo-trujillo", "link_flair_text": "Discussion", "num_comments": 2, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1627230994.0, "comments": [{"author": "Btankersly66", "id": "h6hnwhj", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "oreuru", "stickied": false, "body": "When you boil us down to our molecules we're just self aware machines. Our greatest trait is adaptation. We're uniquely aware of our lifespan. And our physical weaknesses. All that said, it's very likely that we will continue striving towards living longer disease free lives and we'll do what ever is necessary, ie genetic mods and tech mods, to achieve that goal.", "is_submitter": false, "distinguished": null, "created_utc": 1627232163.0, "parent_id": "t3_oreuru", "replies": []}, {"author": "Happy_INTP", "id": "h6jjl5f", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #69", "submission": "oreuru", "stickied": false, "body": "I don't think should even comes in to play.  As soon as someone with the will obtains the means it will happen.  I think it is farther off than most people think though.\n\nAs an aside: We've already modified the genome by making wealth a heritable trait.  Real money doesn't marry outside of real money.  ;)", "is_submitter": false, "distinguished": null, "created_utc": 1627266534.0, "parent_id": "t3_oreuru", "replies": []}]}