{"title": "That story I always wanted to write", "name": "t3_pgiw8r", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pgiw8r/that_story_i_always_wanted_to_write/", "selftext": "Since 2018 I've had this idea for a story I've always wanted to write but I've never finished it and never gotten as far as I wanted and I can never let this idea go, it just keeps up with me even as I write other short-stories I just keep wanting to write this one but I never do. \n\n***This is gonna be long and just a description of a story that doesn't exist and also might get personal. If you read all of this, thank you***\n\nThe very basic premise of the world is such: a nuclear war between NATO and the CSTO occurs in November 2018, this leads to the creation of a semi-sentient fungus entity somewhere within the British Isles. Whenever this entity encounters a living creature *(including humans, animals, insects, plants and every other form of life)* it mutates them. Fittingly, they're called *Mutants*. Most of them die or can't reproduce but a very small fraction evolve mutations that make them adapt at surviving. Whether that's through being very adept at hunting prey or they can survive without direct contact with sunlight *(very useful in a post-nuclear world)* or they can hiberate for vast swaths of time and live on surprisingly few nutrients. \n\nDue to Radiation, reproductive rates among humanity and basically everything has plummeted. So the world is mostly isolated, there are large scale human communities who engage in trade with eachother and some infastructure has been rebuilt here and there but it's only been 30 years so the world is still very much a smoking hell-whole. That fungus I mentioned earlier spread pretty much everywhere leading to a large biodiversity of new creatures despite the relatively low chance of successful mutations. The only thing that keeps things in balance is that every human born after the Nuclear War is immune to the mutations and so Mutants can only reproduce among themselves\n\n**That's the background to the world in-which this story occurs**\n\nThe basic premise is this, it follows two men called Patrick and Aidan who travel over vast swaths of land together in the hope of reaching a farm that Aidan remembers from his childhood where there's a vast collection of drinking water and mutated edible plants. Over their journey they open up to eachother, appreciate eachother and learn to deal with/process any potential regrets/trauma they may have. \n\nThey run into a wide variety of roadblocks in their way, including: Slavery, plague, a lovecraftian-cult, a mutant hoarding drug-gang and the various beasts who might be stalking them along the way. Patrick mainly being kinda stupid but very naturally strong due to him working as a fighter in a betting-ring for many years and Aidan being very intelligent/witty but physically scrawny since he spent his youth conning and screwing over the gullible in order to survive. In the end I wanted them to actually arrive at that Farm and actually find happiness, both deeply changed by their experience.\n\n***Now this story obviously ain't original and you can tell where I got these ideas from***\n\nI got a lot of these ideas from the media I consume and this includes *Fallout*, *Mad Max*, *The Road* and probably from other places. I did once have a huge motivation to finish this thing, I wrote 50 pages in Google Docs of this story but I was unhappy with what I made so I deleted it all and started again. Rince and repeat for 3 years. 2021 and the Pandemic was finally the year that made me decide to just stop trying to write it. \n\nI'm just putting this here as a sort of vent, just so someone can finally read about this thing that I've been thinking about for way too long. I hope you get something out of this. And thank you for reading this far\n\n**TL;DR** I spent 3 years trying to write this story and I was never happy with it until this year when I decided to stop working on it and I've just written out my idea publically in the hopes that someone gets something out of this.", "score": 9, "upvote_ratio": 0.77, "permalink": "/r/TheFlyingTree/comments/pgiw8r/that_story_i_always_wanted_to_write/", "id": "pgiw8r", "author": "Mr--Elephant", "link_flair_text": "Discussion", "num_comments": 1, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630592561.0, "comments": [{"author": "SybariteAussie", "id": "hbbqfma", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pgiw8r", "stickied": false, "body": "Sometimes these blends of themes are successful. The writing process itself is cathartic. Keep it, old you in the future can read it 👍", "is_submitter": false, "distinguished": null, "created_utc": 1630596036.0, "parent_id": "t3_pgiw8r", "replies": []}]}