{"title": "Will the English language exist 100 years from now; what will it look like?", "name": "t3_pgxfye", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pgxfye/will_the_english_language_exist_100_years_from/", "selftext": "Right now, English is widely used, but will it be as useful in 2121? Will English be supplemented by another language, such as Chinese or Hindu, or will it split into different languages, much as after the fall of Rome?", "score": 10, "upvote_ratio": 0.92, "permalink": "/r/TheFlyingTree/comments/pgxfye/will_the_english_language_exist_100_years_from/", "id": "pgxfye", "author": "naivenb1305", "link_flair_text": "Discussion", "num_comments": 38, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630640983.0, "comments": [{"author": "CarpenterOk8125", "id": "hbet7m4", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #478", "submission": "pgxfye", "stickied": false, "body": "English has been heavily codified so the basics will remain. 100 years isn't that long for a language so I presume we will still be able to understand it. \n\nEnglish is a mutually intelligible language that many trade negotiations from different countries use E.G. A Chinese business and a Dutch business will use English as a language to speak in when making deals because it is mutually intelligible. I don't think English will be replaced by an already established language I believe it will be changed\n\n\nInvention of new technology would be the main communication difficulty between our two times as even a person who dies 30 years ago would not know what Google it, screenshot and social media meant. This would be a main change as the current acceleration of invention of new technologies is high.", "is_submitter": false, "distinguished": null, "created_utc": 1630645557.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbfudvt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "If I had made the prompt be of what will English be like a thousand years from now. (except that would increase uncertainty). I agree. English is too imbedded to be replaced with another global language. The issue in meaning predictions is that English is evolving much faster with the rise of technology. (and we don't know for sure what that technology will be).", "is_submitter": true, "distinguished": null, "created_utc": 1630672887.0, "parent_id": "t1_hbet7m4", "replies": []}]}, {"author": "amitym", "id": "hbffd3p", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pgxfye", "stickied": false, "body": "Well okay these are several very different questions.\n\n&#x200B;\n\n>**Will the English language exist 100 years from now**\n\nWhy on Earth would it not?!?  It's been around in various forms, some more recognizable than others, for 1500 years.  Native speakers now number close to half a billion worldwide.  So I have to ask ... what are you expecting to have happen to all those people in the next few decades?  >\\_>\n\n&#x200B;\n\n>**what will it look like?**\n\nAha, that is a somewhat different question.  One of the delightful things about language is that it's impossible to predict with certainty what it's going to do next.  We can see current trends and extrapolate them but there's nothing that says that the trends have to continue -- something may disrupt them and a new, different trend may emerge.\n\nNonetheless, prediction is fun.  I will predict something:  over the next 100 years, a form of formal, or international, or \"high\" English is going to emerge as separate from more colloquial forms spoken natively in different parts of the Anglophonic world.\n\nWe already see some signs of this happening.  For one thing, it's an old story in Great Britain, so it's not like this is even a new concept.  For another, we already have a distinct vocabulary people use when trying to speak formally.  They will replace certain words, like saying \"state\" instead of \"say,\" or \"individual\" instead of \"person.\"  Another example is that as people get used to speaking English online with other English speakers all over the world, they seem to instinctively learn to strip out colloquialisms that would not make sense to their audience.\n\nA linguist would probably say that right now, today, those are probably more just modes of speech, or codes or something.  But they could in the next 100 years become more divergent and formalized into different dialects.  Pronoun shifts might be part of that too.  There might be a standard form of English in which you refer to everyone in the 3rd person as \"they.\"  But when you are with your buds from your neighborhood, you revert to gendered language.  Or something like that.\n\n&#x200B;\n\n>**will it be as useful in 2121?**\n\nSo, the crazy thing about English in 2021 is that more people on Earth speak it as fluent non-natives (600m) than native speakers (400m), and even more than that speak it subfluently (>1bn).  Contrast that with French, an incredibly popular foreign-language choice around the world:  subfluent speakers of French are still only about ¼ of the population of fluent speakers.\n\nThe reason I point that out is that not long ago, it was French that was as close as it came at the time to being *the* international language.  French is still spoken natively or fluently by almost a quarter billion people around the world, but it doesn't have that same \"penumbra\" of secondary speakers anymore.\n\nWhat changed?\n\nI read somewhere that the Treaty of Versailles marked the end of French primacy as the world's international language -- it was the first time in the modern era that a treaty had been formally written in another language (English) alongside French.  I don't know if that's actually true, but if so, it suggests that French cultural authority might have been one of the many battlefield casualties of the First World War.\n\nSo I guess maybe the question to ask is:  what could happen in the next 100 years that would be comparable, that would render English less influential, or would lessen Anglophonic cultural authority?\n\n&#x200B;\n\n>**Will English be supplemented by another language, such as Chinese or Hindu**\n\nAssuming you mean \"supplanted,\" \"Mandarin,\" and \"Hindi,\" it seems clear that the real question is why people all over the world would find that they suddenly (because 100 years is pretty sudden for these things) need to learn one of those other languages to function as part of the world, instead of English.\n\nToday, English is influential because native English-speaking nations do a lot of business around the world, they are online in large numbers, and their countries are appealing places to go to study, work, and even live.\n\nBy contrast, Hindi is very useful if you already live in a Hindi-speaking part of India, and Mandarin is very useful if you already live in the right part of China, but if you don't already live in those places, the utility drops off rather steeply.  People around the world aren't vying to study computer systems or engineering at rural universities in China's interior.\n\n&#x200B;\n\n>**will it split into different languages, much as after the fall of Rome?**\n\nThis will not happen, for the simple reason that widespread literacy and the wide dispersion of printed writing has made modern languages much more stable.  And that doesn't even take into account the impact of ubiquitous global electronic communication.  We just aren't going to see the kind of demographic isolation that led to the linguistic fragmentation of the Latin-speaking world.\n\nAnd certainly not in 100 years -- not even back then did languages change that much in that short of a time.  Rather, as I understand it, the regional differences were already there, and had been widening all along.  If we notice them suddenly after the fall of Rome, it's only because Latin literacy and the printed output of the \"ruling language\" plummeted.", "is_submitter": false, "distinguished": null, "created_utc": 1630663016.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbfteu6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "(1) I agree\n\n(2) I agree. I think that s a language becomes more widespread, it becomes more simplified. I've done that just over the course of the last few months I've been on social media; I've used abbreviations more.\n\n(3) I think English would become more useful, if current tends continue.\n\n(4) I agree, Mandarin and Hindi might stay within their respective countries more.\n\n(5) I didn't focus on literacy making more of a linguistic glue. However, I think that some of the local vernaculars are evolving away from each other. 'Chinglish' is an example. English was imported, and was molded to fit Chinese society. However, I agree that there will continue to be a simplified international from of English. International English today takes two forms; one is American English, the other English English. I think over time American English will displace English English for int'l communications.", "is_submitter": true, "distinguished": null, "created_utc": 1630672378.0, "parent_id": "t1_hbffd3p", "replies": [{"author": "amitym", "id": "hbgqnct", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pgxfye", "stickied": false, "body": "> 'Chinglish' is an example.\n\nBlended language is a great topic.  One of the things I think a linguist would ask is, who is using the blended language and with whom are they speaking it?  Where I live, in the US, blended languages are a phenomenon of bilingual subgroups, and you use them internally, to speak with one another.  That might not be true everywhere, I don't know.\n\nAnyway the thing about a true blended language is that the speakers know they are blending two distinct things, and can switch modes to speaking only one or only the other with breathtaking ease.\n\nSo if you're doing that as a local language mode, but you still switch to \"just English\" at a moment's notice, is it really a new language?", "is_submitter": false, "distinguished": null, "created_utc": 1630686925.0, "parent_id": "t1_hbfteu6", "replies": []}]}]}, {"author": "sparant76", "id": "hbeupmp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #51", "submission": "pgxfye", "stickied": false, "body": "Yes.  It will look like German", "is_submitter": false, "distinguished": null, "created_utc": 1630646501.0, "parent_id": "t3_pgxfye", "replies": [{"author": "amitym", "id": "hbfgf01", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pgxfye", "stickied": false, "body": "More than it already does?", "is_submitter": false, "distinguished": null, "created_utc": 1630663860.0, "parent_id": "t1_hbeupmp", "replies": []}, {"author": "naivenb1305", "id": "hbfuilm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "I thought English was having more romantic derived loanwords?", "is_submitter": true, "distinguished": null, "created_utc": 1630672955.0, "parent_id": "t1_hbeupmp", "replies": []}]}, {"author": "SybariteAussie", "id": "hbfe9k6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pgxfye", "stickied": false, "body": "Finding honest answers during the war on reality is unlikely. My questions are what are the merits of each individual language? Being a novice, I don’t have answers. Latin based languages are conducive to romance, poetry & the arts, which language is best suited to engineering & industry? Is there a language/dialect that is best for strategy/military, a language that favours Science? Only benefit that English has is that it’s widespread. It may have others? I am not a linguist. A 10 question quiz to test for ideological/religious intoxication will be necessary to weed out activists. Interview 5k academics & we could find one cultural anthropologist and a linguist about to retire that gives no f*cks if they get canceled. Is prepared to be honest and forthright?", "is_submitter": false, "distinguished": null, "created_utc": 1630662111.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbfrq3q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "I think English is easy to learn, since it was Romanticized in multiple waves. I know that Latin is used in philosophy, law. (Justinian Code) and biology, and some religion. English is the language of international affairs, even something as simple as online. It is extremely useful to know English to be involved in international affairs. I think there should be studies for this question.... (but it's a sensitive issue, b/c in my view, the future f English rets on America's foreign policy.)\n\nNot to mention that Romance languages comprise most of the foreign language taught (Spanish, French, Italian, Latin).", "is_submitter": true, "distinguished": null, "created_utc": 1630671457.0, "parent_id": "t1_hbfe9k6", "replies": []}, {"author": "SybariteAussie", "id": "hbg13md", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pgxfye", "stickied": false, "body": "One global language or culture sounds as exciting as everyone wearing overalls all the time in the same drab colour. Same haircut, same boots or sandals, cheddar the only cheese etc", "is_submitter": false, "distinguished": null, "created_utc": 1630676167.0, "parent_id": "t1_hbfe9k6", "replies": []}]}, {"author": "_night_cat", "id": "hbfl3sh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #520", "submission": "pgxfye", "stickied": false, "body": "Yes and it will continue to evolve in grammar and spelling over time. It will continue to borrow words from other languages as they become part of the zeitgeist for that time and be the origin of new ones that other languages will either clumsily try to shoehorn in or just give up and use the English word. It’s like Latin and then French used to be, the universal language.", "is_submitter": false, "distinguished": null, "created_utc": 1630667368.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbftqva", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "I agree. I think a sign that English is thriving is that it is acquiring many loan words. Although English is ascendant today, at some point, that will come to an end.", "is_submitter": true, "distinguished": null, "created_utc": 1630672551.0, "parent_id": "t1_hbfl3sh", "replies": []}]}, {"author": "DoglessDyslexic", "id": "hbfswxz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pgxfye", "stickied": false, "body": "Sort of depends on the tech singularity and whether it occurs, as well as whether mankind even exists.  \n\nBarring a tech singularity and human extinction, I strongly suspect we will still be speaking comprehensible (to us) English in 100 years.  There will undoubtedly be some idioms and phrases that would be unfamiliar, but probably not a lot.\n\nIf there is a tech singularity, it depends a lot on how frame shifted we are and how ubiquitous that is.  Frame shifting is our relative perception of time.  If, for instance, I download my brain pattern to a computer that can operate 100 times the speed of my neurons, then 100 real world years becomes 10000 years worth of experiences.  10000 years is roughly the same timeframe as human civilization.  If that computer can operate at 10000x the speed of my neurons, then 100 years becomes a million years of subjective time, which is longer than humans have been humans.  With that said, you can always slow down your frame, and at least initially it seems doubtful that everybody would elect to be digital.  For many people and communities, it seems likely that they would elect to remain on a relatively human normal frame most of the time, at least until the majority of humankind abandons organic meatsuits.  Which, given that the meatsuits with their original consciousness will probably still persist after we download our consciousnesses, seems unlikely to be very quick.\n\nAlthough some of that depends on how competitive future humans are.  Clearly faster frames offer competitive advantages, thus it seems likely that some individuals or communities would run their clocks as fast as possible.  Of course, since a digital copy of our consciousness isn't actually us but a separate entity, competitive humans would run the risk of having their digital copies diverge to the point where they no longer have the same goals.  If they're overclocked and competitive, then it seems likely to spawn an entirely different culture with entirely different goals in a likely very small amount of human normal time.\n\nIn any case, the more subjective time passes, the further the language will diverge as the culture evolves to include new concepts, stories, and themes.  A subjective 100 years isn't enough to change language significantly, but the more zeros you add to that number of subjective time the greater that divergence will be.  Add to that the fact that digital entities don't need actual speech, but are free to develop entirely divergent and more efficient digital means of communications. and you can get English being abandoned wholesale by digital beings.", "is_submitter": false, "distinguished": null, "created_utc": 1630672111.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbfvd5f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "Certain simplifications are already incomprehensible to me. I often have to ask wat certain abbreviations are. I think that humans will abandon their bodies. Rn, computers utilize shorter frames, while humans' minds have a very high limit as well (the vast array of as yet unthought thoughts). \nDivergence between copies and biology might result in cyborgs, then transplanted minds placed in machine bodies.", "is_submitter": true, "distinguished": null, "created_utc": 1630673388.0, "parent_id": "t1_hbfswxz", "replies": [{"author": "DoglessDyslexic", "id": "hbfwge2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pgxfye", "stickied": false, "body": "> Certain simplifications are already incomprehensible to me. I often have to ask wat certain abbreviations are.\n\nThat's not really a factor in linguistic shift.  The fact of the matter is that you can understandably ask what an acronym means and comprehend the response.  Not memorizing acronyms you don't use isn't language shift so much as not speaking in a specialized subfield.\n\n> I think that humans will abandon their bodies.\n\nWell the thing there is that those of us with bodies are somewhat stuck with them.  Digital copies of us may have more freedom there, but us originals are stuck with the meatsuit.\n\n>  Divergence between copies and biology might result in cyborgs, then transplanted minds placed in machine bodies.\n\nWell the nice thing about digital copies is that you can typically use it in both real and virtual spaces.  In other words, if you have a digital copy of your consciousness, there's no reason you can't copy or transfer that consciousness into a mechanical or biomechanical form specifically engineered to house digital consciousnesses and them back out to a virtual space or another form as you wish.", "is_submitter": false, "distinguished": null, "created_utc": 1630673941.0, "parent_id": "t1_hbfvd5f", "replies": [{"author": "naivenb1305", "id": "hbg5xl3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "That's true; it was just my informal xp. English Professionals from around the world are sill intelligible. \n\nIdk if it'll head toward full machine bodies or digital. I think you are correct in that at some pt, needed time frames will outpace human bodies.", "is_submitter": true, "distinguished": null, "created_utc": 1630678305.0, "parent_id": "t1_hbfwge2", "replies": []}]}]}]}, {"author": "HobbitFoot", "id": "hbg7k33", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #530", "submission": "pgxfye", "stickied": false, "body": "English will probably still be used as a lingua franca unless China really cranks out its educational efforts. I don't see Hindi being an option given that India hasn't standardized on Hindi.\n\nI don't see a split unless the world cuts the internet into several independent networks. What will probably happen instead is that there will be a minimaly intelligible English with several forms of localization similar to the split between American and British English. If anything, I see English becoming simpler as more users won't have the time to develop a full vocabulary.\n\nI see emoticons becoming part of the language.", "is_submitter": false, "distinguished": null, "created_utc": 1630679000.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbgbhcp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "I agree. I think emoticons officially becoming part of the language could simplify matters further.", "is_submitter": true, "distinguished": null, "created_utc": 1630680659.0, "parent_id": "t1_hbg7k33", "replies": []}]}, {"author": "Trzef", "id": "hbgsa2f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #19 | Classis Veritatus", "submission": "pgxfye", "stickied": false, "body": "I will dare to make some quick guesses:\n\nParticiples will become more regular\n\nProbably the third person singular -s will be lost\n\nSome vowels will be merged, and /θ/ will be transformed regionally\n\nI think mass instruction slows language change, but internationalization are the new source of transformations.", "is_submitter": false, "distinguished": null, "created_utc": 1630687593.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbh29oi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "It's ironic that Sates may try to regulate grammar in schools, but these very same students connect from around the world utilizing a more simple, unregulated language (today's slang).", "is_submitter": true, "distinguished": null, "created_utc": 1630691773.0, "parent_id": "t1_hbgsa2f", "replies": []}]}, {"author": "Botwmaster23", "id": "hbh8lhn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "pgxfye", "stickied": false, "body": "I think it’s already falling apart with different dialects, you have English, American English, German English, Australian English, all the countries where children learns English has their own dialect (except for countries with the same/similar languages.) But I most certainly think that it will still be a understandable language for English speakers around the world just that the dialects will turn into languages, but people still understand them (like the Swedes Norwegians and the Danes, they all have their own language but if you know one of them you can understand all of them.)", "is_submitter": false, "distinguished": null, "created_utc": 1630694514.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbhaux1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "I agree that this is starting to happen, but they have not been split into different languages.\n\nMutual intelligibility is likely to remain in the future; I agree.\n\nI gave the (imperfect) example f Latin. I think that American English will continue to be used as an international langue for some time to come.\n\nI brought up creole languages, like Chinglish. The higher levels of literacy today would seemingly prevent a split from occurring, since there are grammatical standards today.\n\nHowever you brought up the fact that the dialects that are around today have no reason not to evolve on their own.\n\nTherefore, I think that Creoles will make up the vulgate of each non Anglosphere country, and the upper classes will speak 'proper' English for their county, but it will be 'Vulgar' by the standards of Int English.\n\nAt some point, I think that US/UK English will be spoken only as an international language.\n\nI think this because UK/US English are always changing, and this is sped up by technology. At some pt, the daily English of those countries will differ enough from the, 'proper' English that they will be different languages.\n\nUS/UK English could die this way.", "is_submitter": true, "distinguished": null, "created_utc": 1630695494.0, "parent_id": "t1_hbh8lhn", "replies": [{"author": "Botwmaster23", "id": "hbhbvqb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "pgxfye", "stickied": false, "body": "I agree, something like this is probably going to happen, maybe not a hundred years in the future but maybe a little longer.", "is_submitter": false, "distinguished": null, "created_utc": 1630695942.0, "parent_id": "t1_hbhaux1", "replies": [{"author": "naivenb1305", "id": "hbhfs5e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "I think it's the most likely outcome, but idk how long or even if it will happen.", "is_submitter": true, "distinguished": null, "created_utc": 1630697665.0, "parent_id": "t1_hbhbvqb", "replies": []}]}]}]}, {"author": "wondering-soul", "id": "hbelr92", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #539", "submission": "pgxfye", "stickied": false, "body": "In 100 years I think it’s safe to say English will be widely used. The US and other English speaking countries will continue to be dominant through 2121 simply because of how advanced they are now they more less float through the next 100 years (not long if you think about it). 1,000 years? That’s highly unlikely, even assuming humans are still around at that point.", "is_submitter": false, "distinguished": null, "created_utc": 1630641185.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbenfiz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "I agree; I think that the US will continue to be dominant then. I think there's a good chance that English will end up like Latin. The US will prob not face a stronger power for the foreseeable future.\n\nChina and India may be more populous, but they don't try to change global culture.", "is_submitter": true, "distinguished": null, "created_utc": 1630642094.0, "parent_id": "t1_hbelr92", "replies": []}]}, {"author": "Hawke-Not-Ewe", "id": "hbf9cck", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #547", "submission": "pgxfye", "stickied": false, "body": "English is the most spoken language on the planet. Its also got the most words allowing endless and variable expression. Further while there is drift between saw NYC and Yorkshire, or Perth and Capetown, and Hong Kong and Kansas City they are all still intelligible to each other.", "is_submitter": false, "distinguished": null, "created_utc": 1630657743.0, "parent_id": "t3_pgxfye", "replies": [{"author": "naivenb1305", "id": "hbfqrdj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "Yes, they are- currently. But I thought the same was true of Latin before the Western Roman Empire imploded. I think that there is a slow motion political implosion of the US Empire. At the end of the process, each country will have inherited American English, and will be free to go their own ways.", "is_submitter": true, "distinguished": null, "created_utc": 1630670906.0, "parent_id": "t1_hbf9cck", "replies": []}, {"author": "doegred", "id": "hbl5zy4", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #191", "submission": "pgxfye", "stickied": false, "body": ">  allowing endless and variable expression.\n\nThis is not specific to English.", "is_submitter": false, "distinguished": null, "created_utc": 1630774872.0, "parent_id": "t1_hbf9cck", "replies": [{"author": "Hawke-Not-Ewe", "id": "hblc9w3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #547", "submission": "pgxfye", "stickied": false, "body": "Whole sentences carry whole meanings.", "is_submitter": false, "distinguished": null, "created_utc": 1630777649.0, "parent_id": "t1_hbl5zy4", "replies": [{"author": "doegred", "id": "hbleeal", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #191", "submission": "pgxfye", "stickied": false, "body": "Yes, that's what language does. Not just English.", "is_submitter": false, "distinguished": null, "created_utc": 1630778601.0, "parent_id": "t1_hblc9w3", "replies": [{"author": "Hawke-Not-Ewe", "id": "hblyaso", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #547", "submission": "pgxfye", "stickied": false, "body": "You chopped half of mine. That changes meaning. \n\nMore words with more gradients of meaning means more variability.", "is_submitter": false, "distinguished": null, "created_utc": 1630787627.0, "parent_id": "t1_hbleeal", "replies": []}]}]}]}]}, {"author": "Kelyaan", "id": "hbepexj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pgxfye", "stickied": false, "body": "Ofc it will, it was just be more colloquial as it's getting like that now, It would never be supplemented with Hindu - Have you heard Hindu? vast parts of their language is supplemented with English.", "is_submitter": false, "distinguished": null, "created_utc": 1630643226.0, "parent_id": "t3_pgxfye", "replies": [{"author": "neolthrowaway", "id": "hbeqzov", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #338", "submission": "pgxfye", "stickied": false, "body": "*Hindi\n\nAnd it actually goes both ways.\n\nBoth Hindi and English are from the Indo-germanic family of languages. So a lot of structures and words are common.\n\nEnglish is already an Amalgam of bunch of languages.", "is_submitter": false, "distinguished": null, "created_utc": 1630644169.0, "parent_id": "t1_hbepexj", "replies": []}, {"author": "naivenb1305", "id": "hbeppps", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #561", "submission": "pgxfye", "stickied": false, "body": "Oh yeah. Forgot about the whole colonialism thing w/ India.", "is_submitter": true, "distinguished": null, "created_utc": 1630643403.0, "parent_id": "t1_hbepexj", "replies": []}]}, {"author": "neolthrowaway", "id": "hber1qb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #338", "submission": "pgxfye", "stickied": false, "body": "Like Belter creole in the expanse", "is_submitter": false, "distinguished": null, "created_utc": 1630644204.0, "parent_id": "t3_pgxfye", "replies": []}, {"author": "SuperWeebLegend", "id": "hbeuhmv", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #281", "submission": "pgxfye", "stickied": false, "body": "It will probably be like modern English, but significantly more retarded.", "is_submitter": false, "distinguished": null, "created_utc": 1630646360.0, "parent_id": "t3_pgxfye", "replies": []}]}