{"title": "Have you ever had to cut someone from your life and felt like you're stone hearted?", "name": "t3_onit29", "url": "https://www.reddit.com/r/TheFlyingTree/comments/onit29/have_you_ever_had_to_cut_someone_from_your_life/", "selftext": "This happens to me a lot so I wanna ask you guys what you think about that.\n\nWhen I decide to cut someone off from my life, that person literally becomes nonexistent life form for me. I no longer feel any attachment to that person, I feel like he/she no longer exists. So that makes me question myself, maybe I had zero emotional attachment to that person in the first place. That is why it is easy for me to cut them off with no emotional resistance. Maybe all the emontions I thought I had was a mere illusion. \n\nWhat you think?", "score": 35, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/onit29/have_you_ever_had_to_cut_someone_from_your_life/", "id": "onit29", "author": "Newbie_Cookie", "link_flair_text": "Question", "num_comments": 59, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1626715700.0, "comments": [{"author": "SmileFirstThenSpeak", "id": "h5rzpzh", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "onit29", "stickied": false, "body": "I think if you’re ready to cut someone out of your life, it’s so much better if it’s a clean break mentally and emotionally for you. However, it’s a bit concerning that you’ve had to cut *that many* people from your life. Are you ok?", "is_submitter": false, "distinguished": null, "created_utc": 1626716919.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5s0h21", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "It's actually not that many, but I'm not really that much a social person so it is kinda lot for me. (7-8 friends so far) but I felt all of them are precious for me so cutting them off this easily makes me question myself. Thanks for telling me your opinion.", "is_submitter": true, "distinguished": null, "created_utc": 1626717232.0, "parent_id": "t1_h5rzpzh", "replies": [{"author": "SmileFirstThenSpeak", "id": "h5s0ykc", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "onit29", "stickied": false, "body": "I’m in my 60’s and I’ve cut 1 person out of my life.  7-8 seems like a lot. Maybe just be more selective of who you hang out with in the first place.", "is_submitter": false, "distinguished": null, "created_utc": 1626717438.0, "parent_id": "t1_h5s0h21", "replies": [{"author": "Newbie_Cookie", "id": "h5s1nyj", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "Yes, you're right. But it is hard for me to select people without knowing them beforehand. Do you have any suggestion for selecting part?", "is_submitter": true, "distinguished": null, "created_utc": 1626717737.0, "parent_id": "t1_h5s0ykc", "replies": [{"author": "SmileFirstThenSpeak", "id": "h5s4uak", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "onit29", "stickied": false, "body": "Just because you get to know someone doesn’t make them your friend. Take your time. Consider what qualities you want in a friend.", "is_submitter": false, "distinguished": null, "created_utc": 1626719101.0, "parent_id": "t1_h5s1nyj", "replies": [{"author": "Newbie_Cookie", "id": "h5s77oz", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "Yes there should be line, but unfortunately it seems like I have been unaware about that until now. Thanks", "is_submitter": true, "distinguished": null, "created_utc": 1626720110.0, "parent_id": "t1_h5s4uak", "replies": []}]}]}]}, {"author": "ryguyt", "id": "h5t50gy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #99", "submission": "onit29", "stickied": false, "body": "I've done it twice. Both were during flashpoints in the relationship where emotions were high, and I was feeling manipulated into giving more than I was getting back. I probably shouldn't have allowed either of those relationships to go so long with resentment building, but the culmination both times was me making a clear cut. And honestly, each time it was like a weight lifted from my shoulders. No regrets. I'm back to having casual online interactions with the first one, after close to 10 years of NC. Sometimes though, I think about how severe going total NC is, and I question my own integrity, for having just two of these experiences. \n\nLook, I can't say what you did wasn't what's right for you at the time. But I think you should spend some time and analyze those relationships for patterns. Other folks here have been saying to be more selective, and hopefully that works for you too. Just make sure you aren't holding on to too much baggage, because if there's a piece of you that's uncomfortable with all those relationships you lost, it could haunt you", "is_submitter": false, "distinguished": null, "created_utc": 1626735055.0, "parent_id": "t1_h5s0h21", "replies": []}]}]}, {"author": "sarini11", "id": "h5s1fba", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #56 | Ordo Cognitus", "submission": "onit29", "stickied": false, "body": "Well, I'm just someone who doesn't waste time with the wrong people, and it just so happens finding the right people can take years.", "is_submitter": false, "distinguished": null, "created_utc": 1626717635.0, "parent_id": "t3_onit29", "replies": []}, {"author": "shig23", "id": "h5s6ojt", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "onit29", "stickied": false, "body": "Sometimes life just deals you a bum hand. Good on you for discarding the bad cards. It sounds to me like you’re keeping a healthy attitude about it.", "is_submitter": false, "distinguished": null, "created_utc": 1626719884.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5s6yh5", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "Hearing this made me feel much more better. Thank you for your opinion.", "is_submitter": true, "distinguished": null, "created_utc": 1626720001.0, "parent_id": "t1_h5s6ojt", "replies": []}]}, {"author": "Keikira", "id": "h5s74nb", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #36", "submission": "onit29", "stickied": false, "body": "I've done it to maybe 3 people ever who were REALLY bad for me. To me it's an absolute last resort, because it can really come back to bite you.\n\nThere are no cultural behavioural archetypes for dealing with being cut off. Yeah we can moralise abstractly about boundaries and rights, but grief can lead people to do crazy shit, especially if it becomes anger. \n\nWe evolved to be tight knit emotional monkeys. Breaking social bonds by choice can be interpreted as an act of hostility whether you see it that way or not.", "is_submitter": false, "distinguished": null, "created_utc": 1626720074.0, "parent_id": "t3_onit29", "replies": [{"author": "ciaomoose", "id": "h60a6nu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "This. I always hear people online cheering on cutting people out of their lives. But my former best friend did it to me without warning years ago, and I’m still not over it. The grief and pain was insane. It’s like she died. Absolutely the worst heartbreak I’ve ever suffered, way worse than any romantic breakup. I wish she would’ve just talked to me about it first.", "is_submitter": false, "distinguished": null, "created_utc": 1626878279.0, "parent_id": "t1_h5s74nb", "replies": []}]}, {"author": "TatianaAlena", "id": "h5s2huy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #11", "submission": "onit29", "stickied": false, "body": "People keep saying I should give Poop Friend another chance because it was a mistake. Nope. He knew what he was doing. I actually just made someone delete her enabling comment on Quora because I called her out on it, so of course I edited my comment to include her original comment and her name. Name and shame!", "is_submitter": false, "distinguished": null, "created_utc": 1626718091.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5s4ag8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "People never told me such things. I don't know what kind of behaviour I would take if there were one.", "is_submitter": true, "distinguished": null, "created_utc": 1626718863.0, "parent_id": "t1_h5s2huy", "replies": [{"author": "TatianaAlena", "id": "h5s4ebe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #11", "submission": "onit29", "stickied": false, "body": "Yeah, that's understandable.", "is_submitter": false, "distinguished": null, "created_utc": 1626718910.0, "parent_id": "t1_h5s4ag8", "replies": []}]}]}, {"author": "BuccaneerRex", "id": "h5sftik", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "onit29", "stickied": false, "body": "No, you're just the one in charge of your emotions instead of the other way around. I'm the same way. Once you've indicated to me that you don't want to be a part of my life, I oblige.", "is_submitter": false, "distinguished": null, "created_utc": 1626723818.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5t004w", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "I am glad to know that there's some people like me.", "is_submitter": true, "distinguished": null, "created_utc": 1626732687.0, "parent_id": "t1_h5sftik", "replies": []}]}, {"author": "DDumpTruckK", "id": "h5sad0y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "onit29", "stickied": false, "body": "Once, but they didn't really deserve it and I constantly feel a discordant regret and cognitive dissonance over the choice.\n\nGenerally if I don't really like someone, they won't become a part of my life, so I've never had to remove someone from my life because I didn't like them.", "is_submitter": false, "distinguished": null, "created_utc": 1626721453.0, "parent_id": "t3_onit29", "replies": []}, {"author": "arokace", "id": "h5sbtfe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "onit29", "stickied": false, "body": "Cut someone out, yes.  Some hearted for it, eh, not really.  I understood that it was gonna remove a lot of stress from my life.  I tried to get them to stop doing the things that were creating issues but they felt they HAD to talk about it.  So I cut them out for the betterment of myself. \n\nThe things I'm taking about is politics (they were a trump supporter) and I just didn't want to talk about it at all.", "is_submitter": false, "distinguished": null, "created_utc": 1626722081.0, "parent_id": "t3_onit29", "replies": []}, {"author": "buttcoinballer", "id": "h5sdpfr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "Yup, I kinda relate to what you say but I also dont like cutting people from my life. I see it as a failure on my own part of not being strong enough (mentally, emotionally, maturity) to deal with them or guide them. Sure, theres a breaking point and infinite hypothetical scenarios you could argue that would justify keeping them on your life or cutting them out but the point is, if you are going to cut someone out, it's usually a mix of relief (toxic person gone) with guilt (I couldn't 'save' them). Of the experiences I've had with cutting people out, ive had two more prominent ones that I dont regret but still dont enjoy how it went down. First one consisted of a very aggressive and arrogant and fragile guy (definition of fragile masculinity) who was a childhood friend, and I had a hard time watching him degrade, degenerate, and give himself and myself a bad name. I wish I had been able to more clearly communicate my feelings but with him, he never would've understood anything other than being a victim. Second one, was a severely socially underdeveloped guy who sorta latched into my in highschool because although he annoyed me, I'm generally not a dick or a bully. To him, that meant I liked him (really sad if you think about it). I took him under my wing for a while but he was to clingy and paranoid after a lifetime of being discarded. Once he started getting into meth I had to cut ties, he genuinely made me worried for my own safety from the direction he was going. I feel bad for him, I wish I had the patience to be a better role model but I got my own issues too", "is_submitter": false, "distinguished": null, "created_utc": 1626722903.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5t21mn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "I also think that I've failed in that relationships. I could have explained myself better, I could have been more mature but it is what it is. I can't change the people, even if I can it is not my job to do so.", "is_submitter": true, "distinguished": null, "created_utc": 1626733647.0, "parent_id": "t1_h5sdpfr", "replies": [{"author": "buttcoinballer", "id": "h5ti2n0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "Yeah all you can do is move on and try and learn. I like to think by demonstrating a mature way to act, people will learn from that and try and recreate that behavior. As gratifying as it is to be combative and petty, it encourages that kind of response. Buuuut I'm not ghandi and being a dick often gets more immediate results, so I'll indulge from time to time", "is_submitter": false, "distinguished": null, "created_utc": 1626741446.0, "parent_id": "t1_h5t21mn", "replies": []}]}]}, {"author": "boringlesbian", "id": "h5sgn5k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "onit29", "stickied": false, "body": "I’ve had to cut many people out of my life for mental health reasons. It takes a lot of thought and reflection in order to make that decision and I don’t do it lightly. I discovered that I tend to attract people in my life that reinforce the negative thoughts and opinions I have of myself and as I go through therapy I slowly realize how self defeating that is.\n\nIf my relationship with them is more painful than joyful, I can cut them out and not feel bad about it.", "is_submitter": false, "distinguished": null, "created_utc": 1626724169.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5szvv0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "I feel like I attract that kind of people as well. I have never been socially good with people, it is hard for me to define who is good or who is bad for me.(I'm on the autism spectrum) \n\nMay I ask how did you deal with that situation? (About attracting people that reinforces negative thoughts)", "is_submitter": true, "distinguished": null, "created_utc": 1626732632.0, "parent_id": "t1_h5sgn5k", "replies": [{"author": "boringlesbian", "id": "h5top53", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "onit29", "stickied": false, "body": "The first trick is learning to recognize it. Anyone that rolls their eyes at my stories or criticize how I look or what I'm eating, but always in very subtle ways. One person only wanted to see me when they needed something from me, which confirms my feeling that I only have value when I'm helping or sacrificing myself for others. One person that I cut out constantly judged me because I have PTSD and would have panic attacks. I cut off contact when they said \"Just get over it already.\" Which, I tell myself all the time and is very counter productive to my therapy.", "is_submitter": false, "distinguished": null, "created_utc": 1626744720.0, "parent_id": "t1_h5szvv0", "replies": []}]}]}, {"author": "Zealousideal_Mix_629", "id": "h5srxut", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "onit29", "stickied": false, "body": "✂️ I routinely prune the dead wood from my social life. The first few were hard after that it's much easier.", "is_submitter": false, "distinguished": null, "created_utc": 1626729055.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5t2hh6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "I feel ya.", "is_submitter": true, "distinguished": null, "created_utc": 1626733856.0, "parent_id": "t1_h5srxut", "replies": []}]}, {"author": "lisenpapier", "id": "h5t36my", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "When I’ve had to cut people off it’s typically been something I’ve thought a lot about & genuinely believe it’s the right decision so not really. I don’t feel regret about it. I don’t hate the person either, they just weren’t conducive to my well being or life plan. I try to avoid attachments because they inevitably lead to suffering, but I’m human & it happens. I have friends, I have a s/o, I love my family & my pets. It will inevitably lead to pain one way or another due to attachment. Learning how to love without attachment is something a lot of people can benefit from. I still wish the best for the people I no longer allow into my life.", "is_submitter": false, "distinguished": null, "created_utc": 1626734185.0, "parent_id": "t3_onit29", "replies": []}, {"author": "CielTheEarl", "id": "h5t72ty", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #172 | Consortii Concordus", "submission": "onit29", "stickied": false, "body": "If being around that person, or texting the person is effecting negatively for you, its better to cut them off rather than continue the friendship.\n\nIts sad to do sometimes, but if its harmful, you do what you gotta do. Cutting off doesn't necessarily mean abruptly stopping all communication, it could be a slow process as well.", "is_submitter": false, "distinguished": null, "created_utc": 1626736044.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5t9bbz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "This. I agree every word you've said. If someone is effecting me negatively, I don't hesitate to cut them off. That doesn't necessarily means that they're bad person or I hate them. It just means we are not good for each other.", "is_submitter": true, "distinguished": null, "created_utc": 1626737135.0, "parent_id": "t1_h5t72ty", "replies": []}]}, {"author": "sailshonan", "id": "h5tgzry", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "I’ve cut out my whole family. I am so much happier without them in my life. And it wasn’t a hard decision.", "is_submitter": false, "distinguished": null, "created_utc": 1626740919.0, "parent_id": "t3_onit29", "replies": []}, {"author": "DELETED", "id": "h5tqgjm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "onit29", "stickied": false, "body": "*\"When I decide to cut someone off from my life, that person literally becomes nonexistent life form for me. I no longer feel any attachment to that person\"*\n\nI don't relate to this. I've had to cut people out of my life that will probably feel close to me forever.", "is_submitter": false, "distinguished": null, "created_utc": 1626745609.0, "parent_id": "t3_onit29", "replies": []}, {"author": "bethcano", "id": "h5utqoq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #40", "submission": "onit29", "stickied": false, "body": "I do the exact same thing and always felt concerned about this. For me, when I cut people off, it's not a light decision. It's not an impulsive one. It took thought and consideration. I may have been incredibly close to a person and loved them a lot, but once I've reached the decision to cut them off, there has been a series of events to reach that point and I have made peace with the loss of this person. Hence, I've already done the emotional processing so the act of completely cutting them out doesn't register as anything extraordinary.", "is_submitter": false, "distinguished": null, "created_utc": 1626772592.0, "parent_id": "t3_onit29", "replies": [{"author": "Newbie_Cookie", "id": "h5uuecy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "Yes. I think a lot before the act itself, it is not impulsive or emotional-burts kind of decision. It is well planned, calculated and every piece of it got analysed kind of decision. Maybe that's why I don't feel any regrets, because it is not a decision that my emotional side did.", "is_submitter": true, "distinguished": null, "created_utc": 1626773188.0, "parent_id": "t1_h5utqoq", "replies": []}]}, {"author": "WeebBalzacDeFromage", "id": "h5vjky8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #274", "submission": "onit29", "stickied": false, "body": "I've done it maybe 4 times, and I've never felt any sort of obligation or emotion towards them since. For me, at least, I feel like they were just so unimportant that I was only making contact with them for my own gain, not to actually make long lasting friendships. If I spent a day or so, I could probably get in touch, but I don't even care about them, and even if I contacted them, they may as well be just a stranger. It was easy to semi-forget them, and looking back on it, I definitely didn't really have any true emotions for them, aside from apathy, if that even counts.\n\nSo looking at what you said, I feel like the emotions could have been real, but just not important enough to you for you to bother paying attention to them.", "is_submitter": false, "distinguished": null, "created_utc": 1626789808.0, "parent_id": "t3_onit29", "replies": []}, {"author": "DrEvyl666", "id": "h60coyp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #153", "submission": "onit29", "stickied": false, "body": "There are people that I've cut out of my life for being absolutely toxic. Lately it's mostly been people who have latched on to a cult of personality based on lies and conspiracy theories, or people who have shown me quite clearly that I cannot trust them in a situation like a pandemic.\n\nI can't say I miss any of them, they were pretty damn aggrivating.", "is_submitter": false, "distinguished": null, "created_utc": 1626879375.0, "parent_id": "t3_onit29", "replies": []}, {"author": "dashingThroughSnow12", "id": "h5sa22a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "onit29", "stickied": false, "body": "If you find yourself doing that often, you need some introspection.", "is_submitter": false, "distinguished": null, "created_utc": 1626721321.0, "parent_id": "t3_onit29", "replies": []}, {"author": "PurpleDevilR", "id": "h5s5tpb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #18 | Ordo Cognitus", "submission": "onit29", "stickied": false, "body": "I’ve never cut anyone out from my life.", "is_submitter": false, "distinguished": null, "created_utc": 1626719520.0, "parent_id": "t3_onit29", "replies": []}, {"author": "Kelyaan", "id": "h5sarzs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "onit29", "stickied": false, "body": "I cut people a lot, if the friendship seems one sided then yeet.", "is_submitter": false, "distinguished": null, "created_utc": 1626721634.0, "parent_id": "t3_onit29", "replies": [{"author": "raedr7n", "id": "h5tgoul", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #49 | Legio Virtus", "submission": "onit29", "stickied": false, "body": "Why would you even spend the time to develop a relationship that isn't two-sided? Seems like a waste of time to me.", "is_submitter": false, "distinguished": null, "created_utc": 1626740766.0, "parent_id": "t1_h5sarzs", "replies": [{"author": "Kelyaan", "id": "h5tl4vm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "onit29", "stickied": false, "body": "It's basic psychology - No connection is balanced, there is always one side that takes more and one side that offers more. When it get's too one sided then as I said... yeet.", "is_submitter": false, "distinguished": null, "created_utc": 1626742951.0, "parent_id": "t1_h5tgoul", "replies": []}]}]}, {"author": "haz_mat_", "id": "h5sfntl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "onit29", "stickied": false, "body": "Yes. I can only give someone so many second chances, even when it's family.", "is_submitter": false, "distinguished": null, "created_utc": 1626723748.0, "parent_id": "t3_onit29", "replies": []}, {"author": "Houdinii1984", "id": "h5t9zwu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #57", "submission": "onit29", "stickied": false, "body": "I've been accused of being stone-hearted, but I don't necessarily feel stone-hearted. The people that I've removed from my life needed to go. I've been around a lot of abuse, mainly mentally, and rather than a heart of stone, my heart of jello always sticks around way too long. It's lead me down a path of addiction and crime, and my own abuse towards others, and that's not how I was designed. \n\nHow I go about it, though, is rather cold-blooded. Once I've made up my mind to walk away, it's set and I go. I don't say goodbye, I don't hope they notice, I just go about my way never to be heard from again. I hate that about myself, but the alternative brings up way too much emotion that I don't know how to deal with. It's not like I don't look back on the good times, or don't appreciate what we had, but all of that goes in the same box buried deep that all my deceased pets and family members go. A memory bubbles up, I dwell on it until it hurts, and I put it back in the box.\n\nIt's not that I'm unemotional, not by a long shot. The issue is I have too many emotions and whether it's from previous trauma, the undiagnosed ADHD, or just my INTP personality type, I don't know what to do. I'm a logical person, sometimes a bit robotic, and feelings/emotions to me do little to make sense of the world. To me, they just get in the way and I don't know what they always mean, and after years of repetition, I've learned it's easier (not necessarily better, but easier) to just turn them off and deal with the issue at hand until I can't anymore and freak out on my husband for something small like asking why I seem upset.\n\nAt the end of the day, it's protection. It's the same reason I chronically fold my arms across my chest, which most people take as aggression but is really a self-hug. If I didn't just walk away, the people who were holding my mental health captive would have certainly convinced me to stay, and after a decade+ of putting the pieces back together, I just can't risk it and ultimately it was the right thing to do. Also keep in mind, it's hard for most people to walk away, but once they do, they feel better. But folks like myself, it's easy to walk away, but hard to live with. People who are void of emotions would never have been moved enough to make a Reddit post, therefore your display of emotions on Reddit kinda proves the emotions are not, in fact, illusion.", "is_submitter": false, "distinguished": null, "created_utc": 1626737469.0, "parent_id": "t3_onit29", "replies": []}, {"author": "BrynneRaine", "id": "h5tb3x8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #13", "submission": "onit29", "stickied": false, "body": "I’m not sure I would care or miss the person a whole lot but I’m pretty sure I’d feel some guilt.", "is_submitter": false, "distinguished": null, "created_utc": 1626738010.0, "parent_id": "t3_onit29", "replies": []}, {"author": "1i_rd", "id": "h5tfi12", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #199", "submission": "onit29", "stickied": false, "body": "I cut both my parents and a fair bit of my family. I feel a lot better about it. The first few months I felt like of shitty but eventually it went away. Too much toxicity and I don't want my kids growing up seeing that.", "is_submitter": false, "distinguished": null, "created_utc": 1626740173.0, "parent_id": "t3_onit29", "replies": [{"author": "sailshonan", "id": "h5thali", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "I cut my parents out of my life. Very easy decision. Cutting my brother out was more difficult, but he still has a relationship with my parents, and I don’t want to get sucked back into that. He hasn’t done anything wrong, but I can’t be around my parents or news of my parents.", "is_submitter": false, "distinguished": null, "created_utc": 1626741067.0, "parent_id": "t1_h5tfi12", "replies": [{"author": "1i_rd", "id": "h5torz6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #199", "submission": "onit29", "stickied": false, "body": "I'm glad you could get away from that. My parents are so emotionally immature it's unreal.", "is_submitter": false, "distinguished": null, "created_utc": 1626744760.0, "parent_id": "t1_h5thali", "replies": [{"author": "sailshonan", "id": "h5weize", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "Well an addendum to my comment. My brother called me today to tell me that my father is going to hospice today. Since we were estranged, I didn’t know he was sick. Neither of us is sure how we feel about this. I don’t know if I will visit or go to the funeral. Funerals are for the benefit of the living, not the dead. I don’t grieve nor mourn him; people who grieve, grieve what they had. But I am grieving the relationship I never had.", "is_submitter": false, "distinguished": null, "created_utc": 1626802906.0, "parent_id": "t1_h5torz6", "replies": [{"author": "1i_rd", "id": "h5wihb6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #199", "submission": "onit29", "stickied": false, "body": "I can relate completely to this. I've still got about 20 years before I have to worry about this hopefully. \n\nBest of luck in whichever decision you make. \n\nIf you want to talk, feel free :)", "is_submitter": false, "distinguished": null, "created_utc": 1626804567.0, "parent_id": "t1_h5weize", "replies": []}]}]}]}]}, {"author": "raedr7n", "id": "h5tfz6e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #49 | Legio Virtus", "submission": "onit29", "stickied": false, "body": "I've never had a reason to do that before. If I don't like someone, I just don't form a relationship with them to begin with.", "is_submitter": false, "distinguished": null, "created_utc": 1626740408.0, "parent_id": "t3_onit29", "replies": []}, {"author": "Golden-Snowflake", "id": "h5tjkef", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "onit29", "stickied": false, "body": "Folks age, they change, and sometimes when they change, its not for the better.   \n\n\nSometimes, its you who change, and sometimes you find a lot of the things folks do, to be cringe worthy.   \n\n\nBest to separate yourself, from them, and vice versa, so as to let folks live their lives, without constant nagging.", "is_submitter": false, "distinguished": null, "created_utc": 1626742179.0, "parent_id": "t3_onit29", "replies": []}, {"author": "risisas", "id": "h5to8cs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #280", "submission": "onit29", "stickied": false, "body": "I would worry about the ammout of people you have to cut off, because if it's that many, maybe don't consider being stone hearted, but not good at choosing friends? It's concerning 7-8 even if you were in your 70s, one thing is if a friendship dies out, another if you have to cut, that is some heavy stuff\n\nIt happened once to me, actually he cut me out, but he was such an arse about it that I didn't feel bad at all, great friend", "is_submitter": false, "distinguished": null, "created_utc": 1626744489.0, "parent_id": "t3_onit29", "replies": []}, {"author": "risisas", "id": "h5togn8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #280", "submission": "onit29", "stickied": false, "body": "Are you supposed to feel bad when you take out the trash?", "is_submitter": false, "distinguished": null, "created_utc": 1626744603.0, "parent_id": "t3_onit29", "replies": []}, {"author": "iloveregex", "id": "h5tv7xz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #148", "submission": "onit29", "stickied": false, "body": "I am an INFJ and this is called the doorslam.", "is_submitter": false, "distinguished": null, "created_utc": 1626748044.0, "parent_id": "t3_onit29", "replies": []}, {"author": "Skastrik", "id": "h5twr08", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "onit29", "stickied": false, "body": "Yeah cutting people off always brings doubts to me and I have to remind myself of the why behind it all.\n\nBut when I'm done I don't feel bad about it.", "is_submitter": false, "distinguished": null, "created_utc": 1626748832.0, "parent_id": "t3_onit29", "replies": []}, {"author": "ennovyelechim", "id": "h5u3vjr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "onit29", "stickied": false, "body": "When my first marriage broke down (he cheated) I moved away, luckily our son was an adult. What you all should know is I gave everything to this man, I worked 2 jobs, always put his needs above mine. I loved him more than life itself. When he cheated it destroyed me but I picked up and moved on. From that moment it was like the feelings never existed. \n\nIts not like I even hate him, we were together 25 years but I feel absolutely nothing. Last year our son was moving home and he came over with some furniture, I hadn't seen him in 7 years I expected to feel something, anything really after all those shared memories but nothing, not a thing my emotions were turned off. He was friendly and nice but it's like I never even knew him. It felt so wrong that I couldn't even russle up being mildly annoyed I really did feel stonehearted. My heart threw up a wall of protection and he is now on the outside of that wall. \n\nI wonder what that says about me and all the years I spent devoted to him.", "is_submitter": false, "distinguished": null, "created_utc": 1626752736.0, "parent_id": "t3_onit29", "replies": []}, {"author": "PsychologicalGroup86", "id": "h5uhf1e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #152", "submission": "onit29", "stickied": false, "body": "yeah, i mean some people just dont get it. you really gotta lay in to a certain kinda person (verbally) before they get any kind of hint. \n\nit shouldnt be like that but it do.", "is_submitter": false, "distinguished": null, "created_utc": 1626761850.0, "parent_id": "t3_onit29", "replies": []}, {"author": "ace_in_training", "id": "h5zudoq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #1", "submission": "onit29", "stickied": false, "body": "A lot of times, but my mental health is much better", "is_submitter": false, "distinguished": null, "created_utc": 1626870423.0, "parent_id": "t3_onit29", "replies": []}, {"author": "FearlessDance6839", "id": "h62uqx0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "onit29", "stickied": false, "body": "I think everyone's strengths and weaknesses to eliminate people out of our life is more complicated than asking if you maybe weren't emotionally attached.", "is_submitter": false, "distinguished": null, "created_utc": 1626919348.0, "parent_id": "t3_onit29", "replies": []}]}