{"title": "Guesses on how much longer U.S. society has before collapse?", "name": "t3_pc14ul", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pc14ul/guesses_on_how_much_longer_us_society_has_before/", "selftext": "Coupled with the climate crisis, income inequity, mass ignorance and apathy as well as this first of several (future) pandemics how much longer can our society hold up? Even the Roman's had a brief day in the sun and by the looks of it we are the Roman empire with Wifi.\n\nPart of me wants to prep for any one the realistic scenarios to manifest (food shortages, civil violence, etc) but I get lost in the thought of how much good that can possible make when that day comes.\n\nAnyone else have their anxiety up to a 9.5?  \n\n\nEdit: My guess, based off readings (not social media) but obviously I am no expert, makes me think something civilization changing (ending) will occur within the next 20-30 years. Admittedly this has a lot to do with the IPCC report a couple of weeks ago.", "score": 6, "upvote_ratio": 0.71, "permalink": "/r/TheFlyingTree/comments/pc14ul/guesses_on_how_much_longer_us_society_has_before/", "id": "pc14ul", "author": "no-i", "link_flair_text": "Discussion", "num_comments": 48, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629989683.0, "comments": [{"author": "Alirezahjt", "id": "hafjl75", "score": 17, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "pc14ul", "stickied": false, "body": "The Soviet Union collapsed 2 years after retreating from Afghanistan.\n\nSo...\n\nSarcasm aside, I don't think anything too drastic would happen, some apocalyptic level stuff I mean. At least, I hope it does not.\n\nI know saying it might not help since psychological matters need professional assistance, but don't let your mind spiral into madness, OP. Take care of yourself and your loved ones.", "is_submitter": false, "distinguished": null, "created_utc": 1629989880.0, "parent_id": "t3_pc14ul", "replies": [{"author": "SybariteAussie", "id": "haio8wj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pc14ul", "stickied": false, "body": "Soviet economy was struggling before this. Was the Space & arms race the cause of its swift rise & fall? I watch urban explorers sometimes. They visit & film abandoned places. There’s a abandoned Soviet space shuttle. Many abandoned Soviet military bases etc. Abandoned towns, mines, vehicle graveyards. The $ wasted makes one think", "is_submitter": false, "distinguished": null, "created_utc": 1630039083.0, "parent_id": "t1_hafjl75", "replies": []}]}, {"author": "usernames_suck_ok", "id": "hag3yz5", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "pc14ul", "stickied": false, "body": "I understand the \"it's the media\" line of thinking, but, honestly...I think our society has been shit for a long time, but it's just getting more attention now and it's becoming more obvious to people who have had their head in the sand or have been in denial. Even the \"it's the media\" answer is a form of burying your head/denial, in my opinion. The media and social media are just showing you more of what has been true for a long time. A lot of the horrible things that are happening have happened before in some form or have been the case all along, and with the things that have happened before if you know something about history watching those things now feels like that saying \"history repeating itself.\"\n\nWith that being the case, I don't think we're going anywhere any time soon. I do think life will be worse for anyone's young kids or kids who have not been born yet in some ways, just like the media keeps telling you \\[the truth\\] about some of the ways in which life is worse for millennials than it was for their parents at the same age. I agree, I could not imagine bringing kids into this.", "is_submitter": false, "distinguished": null, "created_utc": 1629997994.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "s1gnalZer0", "id": "hafm4im", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "pc14ul", "stickied": false, "body": "I heard somewhere that the average lifespan of an empire is around 200 years, so we are on borrowed time. \n\nI think the next couple presidential election cycles and the reactions to them will have a major hand in determining how much longer we have. \n\nI don't think it will be a total collapse of society so much as a breakup of the nation. There will probably be some shifting of state borders (for example, eastern parts of WA and OR separating from the western parts due to political differences), regional coalitions (the old confederacy getting the band back together), and bigger states like CA, TX, and maybe NY going independent and maybe taking neighbors with them. \n\nStates with better organized governments like CO, MN, and New England states will probably see less immediate effects, but places like AL, FL, MS, or TX will probably be hit harder.\n\nMy hope is that we have an orderly breakup like Czechoslovakia, and not a mess like Yugoslavia.", "is_submitter": false, "distinguished": null, "created_utc": 1629990932.0, "parent_id": "t3_pc14ul", "replies": [{"author": "claimstoknowpeople", "id": "hahy88w", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #104", "submission": "pc14ul", "stickied": false, "body": "I hear what you're saying on the 200 year thing, but I'm not sure I would clarify 19th century US as an empire yet compared to the other nations of the age. Post-WW2 it definitely is. Though some people speak of a kind of English speaking empire that just changed capitals around then from London to Washington.", "is_submitter": false, "distinguished": null, "created_utc": 1630026151.0, "parent_id": "t1_hafm4im", "replies": []}]}, {"author": "Paul_Thrush", "id": "hafmo4x", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "pc14ul", "stickied": false, "body": "Your anxiety is caused by the media. Death sells news and they exploit your fears for every click. Take a break from it for a week, spend more time outdoors, and with friends. Recharge.\n\nThey invented the \"Doomsday Clock\" when I was a teen and it's been 11:59 pm the entire time.", "is_submitter": false, "distinguished": null, "created_utc": 1629991159.0, "parent_id": "t3_pc14ul", "replies": [{"author": "Alirezahjt", "id": "hag49b4", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "pc14ul", "stickied": false, "body": "I read an article years ago about the human mind being negative centric as an evolutionary trait, we prefer to seek and retain bad news more as a means to learn and survive.\n\nThe media exploits this. The \"Mainstream\" media has been having it badly recently. They are going out of business. Do young people watch Fox or CNN anymore? No. We have our own sources, twitter, youtube, freelance reporters.\n\nSo they have to spread this anxiety and fear as you mentioned to stay relevant.", "is_submitter": false, "distinguished": null, "created_utc": 1629998104.0, "parent_id": "t1_hafmo4x", "replies": []}, {"author": "JungleCatHank", "id": "hafyezu", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #173", "submission": "pc14ul", "stickied": false, "body": "This.  Things aren't as bad as \"they\" would have you believe.\n\n\"Save the ozone layer!\", \"Save the whales!\", \"Paper, not plastic!\", \"Wait! Plastic, not paper!\" Blah, blah, blah...  \n\nThere's always some crisis to sell.", "is_submitter": false, "distinguished": null, "created_utc": 1629995841.0, "parent_id": "t1_hafmo4x", "replies": [{"author": "epicgabe01", "id": "hagph8p", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #108", "submission": "pc14ul", "stickied": false, "body": "To be fair, however, there's a lot of things people probably should keep an eye on if they don't want to be blindsided. The economy's terrible. There's pandemic measures that make little sense that politicians ignore yet freak out when others don't follow them. There's the military crisis in Afghanistan. There's the increasing hyperpartisanship and hyperpolerization in politics, and the amping up of rhetoric, which probably won't end well. There's a rather massive rise in authoritarianism combined with apathy and borderline acceptance amongst many people. The reason why there's always some crisis to sell is a) alarmism over situations that aren't that bad and b) the downplaying of situations that require more attention than they're getting (at least, until the issue at hand's blown put of proportion). Looking at everything going on in the world right now as objectively as humanly possible really does not inspire confidence, but I'm hopeful that in the long run, things will get better.", "is_submitter": false, "distinguished": null, "created_utc": 1630006560.0, "parent_id": "t1_hafyezu", "replies": []}]}]}, {"author": "luckyindigo12", "id": "hafj9wm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #155", "submission": "pc14ul", "stickied": false, "body": "Guesses on how much longer the whole world has before collapse?", "is_submitter": false, "distinguished": null, "created_utc": 1629989751.0, "parent_id": "t3_pc14ul", "replies": [{"author": "Altourus", "id": "hafl5ug", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pc14ul", "stickied": false, "body": "Honestly I've been saying about 20 years before the civil wars in the third world become completely unmanageable, but that might just be my optimism", "is_submitter": false, "distinguished": null, "created_utc": 1629990532.0, "parent_id": "t1_hafj9wm", "replies": [{"author": "throw-away451", "id": "hag7nl4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "pc14ul", "stickied": false, "body": "Why do you say they’ll become unmanageable? Eventually there just won’t be enough people around in those areas for the civil wars to continue, and it’s not like local warlords are going to set their sights on any of the more powerful nations—if they’re struggling to win a civil war they certainly don’t have the means to invade anywhere else, especially when their target has allies of its own.", "is_submitter": false, "distinguished": null, "created_utc": 1629999416.0, "parent_id": "t1_hafl5ug", "replies": []}, {"author": "luckyindigo12", "id": "hafluom", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #155", "submission": "pc14ul", "stickied": false, "body": "Yeah let's be honest 20 years might be a little too optimistic. Currently the world is not a nice place to live in, but humanity will manage and make it through. Tho I am certain the situations won't improve in the next few decades or so. Maybe after the 3rd ww lol.", "is_submitter": false, "distinguished": null, "created_utc": 1629990819.0, "parent_id": "t1_hafl5ug", "replies": []}]}]}, {"author": "step-lego-wat-u-doin", "id": "haflimq", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pc14ul", "stickied": false, "body": "Wait... It hasn't yet?", "is_submitter": false, "distinguished": null, "created_utc": 1629990679.0, "parent_id": "t3_pc14ul", "replies": [{"author": "nergalelite", "id": "haifu0w", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #84", "submission": "pc14ul", "stickied": false, "body": "1984 shit still going on; it's not a healthy society, but the common folk enjoy pretending that it works", "is_submitter": false, "distinguished": null, "created_utc": 1630034592.0, "parent_id": "t1_haflimq", "replies": []}]}, {"author": "Bearha1r", "id": "hahgwmv", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #195", "submission": "pc14ul", "stickied": false, "body": "US is in an intriguing position as although its international influence may wain it is unlikely to be invaded by an occupying force. In this way its similar to the UK. A couple of hundred years of dominance and then settle back into middle age and finally senility but still a top economy. Obviously whilst the UK has dropped back to 5/6/7 in the world the US would remain in the top 2 although ceding ground to China economically and seeing China dominate international affairs by the middle of the century. Its been a decent 100 years of so from arriving on the world stage for WW1 to falling back now.", "is_submitter": false, "distinguished": null, "created_utc": 1630018055.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "04221970", "id": "hag0an9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #110", "submission": "pc14ul", "stickied": false, "body": "first you have to define what is meant by \"U.S. society\". Is it the tossing of the constitution and rewriting a new one?  Is it massive civil unrest....and by that do you mean worse than the 1960's; 1930's or the civil war?\n\n\nI can't speculate because if you say 3 years from now, you can define that as the discontent from the next presidential election; when others will say, \"Meh\" just another election.\n\nTHat being said...U.S. societal collapse has been predicted as often as usable fusion energy.\n\n\nI started prepping when my home town was a target for soviet missiles.  I also got more serious after I learned about the fall of Rome and the inevitability of a society declining.  Now, I'm so old that it doesn't matter to me anymore, and I'm giving my stuff away to the next generation of wise forward thinking paranoid survivors.\n\nedit: forgot to answer the question......not in your lifetime.  I'd bet there's a 50% chance that if something happened you would be in favor of the changes and not call it a 'collapse.'", "is_submitter": false, "distinguished": null, "created_utc": 1629996576.0, "parent_id": "t3_pc14ul", "replies": [{"author": "no-i", "id": "hag23b4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #259", "submission": "pc14ul", "stickied": false, "body": "Part of what pushed me to materialize the question in this post is my forward projection of what to expect in regards to my two children who will undeniably face the worst of the climate crisis. \n\nOnce upon a time I reveled in the thought that I could be a grandfather one day, now I hope my children don't bring about any new life that has the very real possibility of seeing a full blown eradication of earths habitability in the coming decades.\n\nWhile is is true there have always been doomsayers throughout any civilizations existence, and despite how I used to (within the privacy of my thoughts) view those people as complete whacks (and many MANY still are) I can't help but see the writing on the wall as it is painfully narrated by the worlds leading experts. I find myself nowadays thinking how it's possible my wife and I might be able to miss the \"absolute worst\" based on our lifespan, while at the same time feeling defeated my children will not have easy lives.", "is_submitter": true, "distinguished": null, "created_utc": 1629997263.0, "parent_id": "t1_hag0an9", "replies": [{"author": "SybariteAussie", "id": "hairaxj", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pc14ul", "stickied": false, "body": "Climate crisis used to be called global warming. They had to change banners due to whispering about the solar minimum that began recently. It became climate change. It’s a broader banner & is ambiguous. Our climate is constantly changing. Geological evidence is compelling. Our galaxy follows a path. The Earths axis has a precession which influences rainfall, weather etc. The hype is to justify new taxes methinks. Those with “the vision of the anointed” have a dream. The cost of which will be carried by those who work & survive on wages alone. Lucrative gaps in the taxation system are exploited by the wealthy to emancipate them from the tyranny of paying taxes.", "is_submitter": false, "distinguished": null, "created_utc": 1630040846.0, "parent_id": "t1_hag23b4", "replies": []}]}]}, {"author": "Tenacious-Tea", "id": "hag4foi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pc14ul", "stickied": false, "body": "The USA’s demise is probably going to be a slow drawn out process by my estimation.  I don’t think anyone will be able to miss it coming, once it is on the horizon.  That being said, it could easily be 400 years from now or 30 years from now, no real way to know.", "is_submitter": false, "distinguished": null, "created_utc": 1629998172.0, "parent_id": "t3_pc14ul", "replies": [{"author": "NoSuchKotH", "id": "hahayiu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pc14ul", "stickied": false, "body": "Watching the US decline for the past 30 years, I think it will take at least another 30 to 50 years, probably even more than that.... Unless there is another Trump or two.", "is_submitter": false, "distinguished": null, "created_utc": 1630015403.0, "parent_id": "t1_hag4foi", "replies": []}]}, {"author": "amitym", "id": "hahvq9r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pc14ul", "stickied": false, "body": "If you are feeling this anxious, seek help.  It isn't helping you prepare for the future in any way.", "is_submitter": false, "distinguished": null, "created_utc": 1630024972.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "grandpassacaglia", "id": "hahy9i4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #215", "submission": "pc14ul", "stickied": false, "body": "The fuck are you smoking", "is_submitter": false, "distinguished": null, "created_utc": 1630026168.0, "parent_id": "t3_pc14ul", "replies": [{"author": "SybariteAussie", "id": "hairl7e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pc14ul", "stickied": false, "body": "White rhino", "is_submitter": false, "distinguished": null, "created_utc": 1630041020.0, "parent_id": "t1_hahy9i4", "replies": []}]}, {"author": "sparant76", "id": "hahd4vs", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #51", "submission": "pc14ul", "stickied": false, "body": "When is trump running for president again?  That’s my vote", "is_submitter": false, "distinguished": null, "created_utc": 1630016365.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "shig23", "id": "haflye0", "score": -4, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pc14ul", "stickied": false, "body": "My prediction is that next year the Republicans—the party that has been working to subvert democracy for years now—will retake Congress in the usual midterm turnabout. \n\nOnce they’re back in power it’s pretty much curtains for free and fair elections. They’ll use their Big Lie narrative to justify their refusal to certify Biden’s reelection, and may even try to remove him from office before his term is up. Trump, or someone indistinguishable from him, will be installed as president for life, and the American Experiment will be over.", "is_submitter": false, "distinguished": null, "created_utc": 1629990862.0, "parent_id": "t3_pc14ul", "replies": [{"author": "Tenacious-Tea", "id": "hag598b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pc14ul", "stickied": false, "body": "Meh. I agree with the first part, namely that republicans will retake congress to some degree. A lot of this election BS, that has certain states and talking heads are pushing,is going to fall by the wayside though.  No way will it hold up in higher courts.", "is_submitter": false, "distinguished": null, "created_utc": 1629998485.0, "parent_id": "t1_haflye0", "replies": []}, {"author": "SybariteAussie", "id": "haipuro", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pc14ul", "stickied": false, "body": "Are they feeding rope, to the left? All the ugly aspects that were kept to the rear on full display. For the world to see. World wide. When the pendulum swings, they will have lost all credibility. Like the boy that cries wolf. Perhaps my fecund imagination perceives,”build back better” as a negative? People in charge are going to behave as their fiscal backers tell them to. The war on reality is surreal. Words having their meaning altered by gifted linguistic gymnasts & the herd follows. It truly is something to behold! *grabs popcorn*", "is_submitter": false, "distinguished": null, "created_utc": 1630040002.0, "parent_id": "t1_haflye0", "replies": []}]}, {"author": "throw-away451", "id": "hag6wmc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "pc14ul", "stickied": false, "body": "I don’t know that old examples still hold up. The world is no longer what it was even 150 years ago, when wars of conquest were common and the subjugation of foreign peoples was the norm. Since then, technology has advanced to such a degree that we don’t necessarily run on a human-powered economy now that machines can handle a lot of things for us. The American Civil War, for example, was mostly about the South claiming it had a right to slavery. Slavery is now formally illegal across the planet (though it does happen informally and illegally in plenty of places) because the Industrial Revolution changed everything; human labor alone was no longer essential to productivity. You also no longer need massive numbers of soldiers to take or defend an area if you have sufficiently advanced technology. And we now have a concept of globalism—the UN and other multinational organizations exist and (sometimes) help keep situations relatively stable.\n\nWhat I mean to say is that the way humans lived from the beginning of history up through the mid-1800s is no longer how we live. I think that society has changed to such a degree that, barring some event, whether manmade or natural, that sends us all back to the Stone Age, there will always be factors in place that will more or less guarantee a certain degree of order in developed nations. The US may change, but I don’t think it will collapse.", "is_submitter": false, "distinguished": null, "created_utc": 1629999126.0, "parent_id": "t3_pc14ul", "replies": [{"author": "NoSuchKotH", "id": "hahb2ja", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pc14ul", "stickied": false, "body": ">I don’t know that old examples still hold up. The world is no longer what it was even 150 years ago, when wars of conquest were common and the subjugation of foreign peoples was the norm.\n\n\\**points at Krim*\\*", "is_submitter": false, "distinguished": null, "created_utc": 1630015453.0, "parent_id": "t1_hag6wmc", "replies": [{"author": "throw-away451", "id": "hai328y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "pc14ul", "stickied": false, "body": "Do you mean Crimea? Russia sort of got away with that one, but only because Crimea was an area that had already been associated with Russia in the past, and even then it wasn’t without criticism. What I’m saying is that it’s not like some European nation can just decide to take over half of Africa just because it wants the territory—all but a few nations these days have sovereignty and the likes of the Scramble for Africa or Napoleon’s attempts to conquer Europe won’t happen again absent something really drastic happening.", "is_submitter": false, "distinguished": null, "created_utc": 1630028461.0, "parent_id": "t1_hahb2ja", "replies": [{"author": "NoSuchKotH", "id": "haj7oep", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pc14ul", "stickied": false, "body": "I would not be so sure about someone invading some backwater country.\n\nJust look at what the US has done in the past 30 years. So. Many. Invasions. Yes, there was criticism (remember Freedom Fries?), but overall, nothing happened but some rich dude getting richer while millions of people in some far away country died for it.", "is_submitter": false, "distinguished": null, "created_utc": 1630053519.0, "parent_id": "t1_hai328y", "replies": []}]}]}]}, {"author": "Transparency2Thee", "id": "haga22o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #32", "submission": "pc14ul", "stickied": false, "body": "Well, as much as we hate to admit it, evolution favors life that is hardened by adversity. Unchallenged success does have an expiration date. Whether it’s a remote island full of Dodos, or a kingdom of the obese, there will always be those who like the Huns of old are battle-hardened and hungry. The pendulum always returns.\n\nThe US has been rotting for decades. Like the Dodo, we are both unable to correctly identify a threat and lack the ability to survive even if we did. \n\nWith nukes having changed conflicts among the juggernauts, how that war is fought will look different. It’s already in progress. A war where the assailants are ideas. Where the battlegrounds are lit with the flash of screens instead of gun fire. And yet, the siege will still leave those inside fighting amongst themselves as the hope dries up. This is the end of an empire. \n\n“Another one bites the dust” lol (I couldn’t help myself)", "is_submitter": false, "distinguished": null, "created_utc": 1630000353.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "Prior_Technology_868", "id": "hagqor4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #141", "submission": "pc14ul", "stickied": false, "body": "50-100 years or so", "is_submitter": false, "distinguished": null, "created_utc": 1630007042.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "zuma15", "id": "hagtcca", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #250", "submission": "pc14ul", "stickied": false, "body": "4-5 years.", "is_submitter": false, "distinguished": null, "created_utc": 1630008110.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "Houdinii1984", "id": "hagxmxz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #57", "submission": "pc14ul", "stickied": false, "body": "I think capitalism is going to collapse, but I think the legal infrastructure of our govt would still be intact (assuming we get over our current political crisis and learn to work together rather than usher in some kind of civil war). I think younger generations are figuring it out, just like the millennials did, except they'll actually get voted into power because the baby boomers will be in their 90s. They love crypto, they hate banks, They aren't afraid of radical ideas but seem to be realistic when it comes to actually implementing things.\n\nFor instance, defund the police. That phrase got adults all twisted out of shape and quick. Everybody had an opinion one way or another, and most of the time it was a very strong opinion. It was only from the younger than 20 crowds that I heard \"perhaps we should stop calling it defunding police and start calling it funding mental health and education.\"\n\nThat may or may not be the answer, and I'm not trying to argue the underlying merits, but rather point to the shift in perspective and the ease of changing opinions with new information past the teen years in the youngest generations. I'm hoping that they stay this way and I find myself wondering if I was like that as a teen but grew out of it as apathy set in.\n\nEven if I'm right, though, in 20-30 years, it's gonna suck. We're not listening to reason right now and there are no takebacks. I'm personally gathering data, like the entirety of Wikipedia and a ton of medical and engineering books. I'm also learning how to generate both power (water-driven machinery without electricity for instance) and electricity. I think the best way to ensure my survival is to be able to teach others how to ensure their own. In that regard, information is the only currency that can't collapse and only goes up in value when others do.\n\nEDIT: I forgot to mention robotics and automation. Robots will be the workforce eventually and capitalism has no solution to that. Some form of socialism (I know, the evil word) or some novel solution will be required because actual jobs will be gone. It sounds like hyperbole, but if you really take time and dwell on it, the current way we handle money just won't work.", "is_submitter": false, "distinguished": null, "created_utc": 1630009846.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "TrickyLemons", "id": "hah634r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #85", "submission": "pc14ul", "stickied": false, "body": "Eh, 30-40 years?", "is_submitter": false, "distinguished": null, "created_utc": 1630013324.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "Espumma", "id": "hah7s8v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #12", "submission": "pc14ul", "stickied": false, "body": "If societal collapse is giving you anxiety, you might want to subscribe to /r/CollapseSupport", "is_submitter": false, "distinguished": null, "created_utc": 1630014047.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "claimstoknowpeople", "id": "hahxlgz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #104", "submission": "pc14ul", "stickied": false, "body": "The global semiconductor shortage is going longer than anyone expected, really wonder what the effects will be if technological progress just gets frozen for the next few years. This is definitely affecting day to day engineering decisions at my workplace currently, I wonder how long until it starts affecting casual tech consumers...\n\nI mean, probably production will catch up again like it did for toilet paper etc, but there's no way to know for sure.", "is_submitter": false, "distinguished": null, "created_utc": 1630025850.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "areyouseriousdotard", "id": "haioalx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "pc14ul", "stickied": false, "body": "Collapse is a slow process which we have already started...", "is_submitter": false, "distinguished": null, "created_utc": 1630039109.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "NevaDinova", "id": "haknwlx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #275", "submission": "pc14ul", "stickied": false, "body": "check out the book The Storm Before The Storm, which lays out and compares the end of the Roman republic with the current state of the good ol us of a. spoiler: it's the same story but all the names are changed", "is_submitter": false, "distinguished": null, "created_utc": 1630081421.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "GLXC_AUS", "id": "ham1roc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #260", "submission": "pc14ul", "stickied": false, "body": "Maybe it has already started?", "is_submitter": false, "distinguished": null, "created_utc": 1630102162.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "smartasspie", "id": "hanpic6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #299", "submission": "pc14ul", "stickied": false, "body": "As a Spaniard. You'd be surprised about how bad can be things and still somehow half work. I mean, my country has like 1 third of active population unemployed, you guys earn 3 times what people earn here, and have less population, and believe or not, less corrupt politicians. But it's not so bad here", "is_submitter": false, "distinguished": null, "created_utc": 1630136443.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "Shroom-TheSelfAware", "id": "hag5sax", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pc14ul", "stickied": false, "body": "If you’re really worried, buy some prepper food kits  in addition to guns and LOTS of ammunition.", "is_submitter": false, "distinguished": null, "created_utc": 1629998691.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "NepoMi", "id": "hagapcs", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #170", "submission": "pc14ul", "stickied": false, "body": "Before a major revolt, I'd say 3-4 years.\nAnd now stop asking for advice on reddit, Joe.... It's your job to bring the country to the end, not ours. You're doing great BTW, the end is near, the USA will be cleansed soon.", "is_submitter": false, "distinguished": null, "created_utc": 1630000607.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "hafti34", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pc14ul", "stickied": false, "body": "Things will be fine, it will outlast all of us.", "is_submitter": false, "distinguished": null, "created_utc": 1629993898.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "R5Cats", "id": "hahkyul", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #14", "submission": "pc14ul", "stickied": false, "body": "Climate change? LOLZ! Yeah, no.  \n\nIt is likely to collapse now with the grotesquely incompetent in charge.  There will never be another free and fair election, it will be a one-party dictatorship. Any States which attempt to separate will be invaded, China will become the sole World Power as the EU and Russia fall farther and farther behind. \n  \nHow long can the USA hold on? It's been underway a while now, the end will come suddenly though. Like Venezuela, Zimbabwe and now South Africa: it will get really bad really fast.", "is_submitter": false, "distinguished": null, "created_utc": 1630019913.0, "parent_id": "t3_pc14ul", "replies": []}, {"author": "SybariteAussie", "id": "hain8tr", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pc14ul", "stickied": false, "body": "Yes, a feeling of impending doom. It began at the beginning of the media frenzy. Can only eat small meals when hunger begins to bite or the food seems to turn to sand in my throat. It took the Roman Empire around 200 years to crumble. Western culture has only been in decline for about 60 years. Everyone having phones, social media, internet etc could hasten things? We recently entered solar minimum phase which could result in reduction of grain harvests. Could cause food shortages? Combine with inflation, high unemployment, febrile media hysteria, lockdowns, real estate crash or war. Chaos. Then leaders say in unison it’s time to “build back better!” New global government comes to the rescue", "is_submitter": false, "distinguished": null, "created_utc": 1630038524.0, "parent_id": "t3_pc14ul", "replies": []}]}