{"title": "Is anyone else going through a drastic self realization moment recently?", "name": "t3_pir6y4", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pir6y4/is_anyone_else_going_through_a_drastic_self/", "selftext": "I’ve been actually looking at myself. Like actually looking. I’ve never done that before. Judging myself harshly on some things and proud of my genetics on other things. What a strange feeling. I have never actively tried to look at myself from another perspective. I took a video of me alone just being exactly myself. It was terrifying to me to actually look at myself. \n\nGood experience tho - would recommend.", "score": 8, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/pir6y4/is_anyone_else_going_through_a_drastic_self/", "id": "pir6y4", "author": "NoMeowAllow", "link_flair_text": "Idea", "num_comments": 13, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630898044.0, "comments": [{"author": "floofandmemes", "id": "hbrnzdf", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "pir6y4", "stickied": false, "body": "Yep. Today I realized I waste my life on reddit and I don't even enjoy being here.", "is_submitter": false, "distinguished": null, "created_utc": 1630899433.0, "parent_id": "t3_pir6y4", "replies": []}, {"author": "OMGokWhy", "id": "hbrvynw", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #255", "submission": "pir6y4", "stickied": false, "body": "I had a similar experience once when I heard my own voice in a recording and realize I hate it lol.\n\n\nBut I constantly try to look at myself from an outside perspective and analyze how other people may see me or think of me. It’s a good exercise sometimes, you just have to try to not be too hard on yourself.", "is_submitter": false, "distinguished": null, "created_utc": 1630904046.0, "parent_id": "t3_pir6y4", "replies": []}, {"author": "DragonFromHell", "id": "hbs1cvm", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #22", "submission": "pir6y4", "stickied": false, "body": "My drastic self realization began somewhere around two years ago and I can't stop being self-conscious about everything I do.\n\nThis is my life now.", "is_submitter": false, "distinguished": null, "created_utc": 1630907609.0, "parent_id": "t3_pir6y4", "replies": [{"author": "NoMeowAllow", "id": "hbs25nl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #533", "submission": "pir6y4", "stickied": false, "body": "I hope you’re able to find the opposite side of that. Bit crazy but, do good things and view yourself like the player in a game. Remember you’re in reality and follow morals, but it’s easier than you think to stop caring whatsoever what people think. When you’re being a genuine person following the compass of your morality, it’s easy to write people off if they don’t give you a good response because you KNOW, inherently that their lives maybe aren’t going so good, and they probably struggle with the same emotions you do but you’ve become just a bit better at handling them. Another tangent there, but hope it helps", "is_submitter": true, "distinguished": null, "created_utc": 1630908171.0, "parent_id": "t1_hbs1cvm", "replies": []}]}, {"author": "venustrine", "id": "hbs4upc", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pir6y4", "stickied": false, "body": "Yes. I feel I haven’t been myself for sometime and am only recently rediscovering who that might be.\n\nI might do the video thing but I’m afraid of what I might see…", "is_submitter": false, "distinguished": null, "created_utc": 1630910093.0, "parent_id": "t3_pir6y4", "replies": []}, {"author": "FirstUser", "id": "hbs9jkz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #127", "submission": "pir6y4", "stickied": false, "body": "I don't think you can be 100% candid if you know you are being filmed. There's bound to be some self-consciousness, maybe that's what weirds you out.", "is_submitter": false, "distinguished": null, "created_utc": 1630913777.0, "parent_id": "t3_pir6y4", "replies": []}, {"author": "Concrete_Grapes", "id": "hbrxx3o", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pir6y4", "stickied": false, "body": "Curiosity has the better of me here, what'd the video of yourself show you?  \n\n\nI think if i did that, how little i move, and how little i express might actually freak me out. Not sure though.   \n\n\nI've narrated myself in youtube videos and found listening quite odd, like--not that it's my voice, but the way i speak didnt convey the confidence i had in what i was talking about, and that mismatch was weird. It's like even though i was locked in, 100% cared, i STILL sounded ... slightly dismissive and as if i wasnt serious.", "is_submitter": false, "distinguished": null, "created_utc": 1630905298.0, "parent_id": "t3_pir6y4", "replies": [{"author": "NoMeowAllow", "id": "hbs13av", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #533", "submission": "pir6y4", "stickied": false, "body": "To answer your question about the video, I attempted to make my movements and body language to be as natural as possible when running through a scenario in my mind. I’ll visualize and experience the incident or if it’s a happy memory, the fleeting feeling, and give it a genuine smile. Most the time it’s a nod or a bored look though lol. When I watched myself, it was like watching a stranger. The way my mind works and what I look like are two separate entities. I have never tried to actually look at myself because I’ve been scared of being a narcissist. \n\nI can also relate to not recognizing your own voice. I sound so weird bro. Like it’s scary. I’ve never actually listened to myself so in my second video I simply talked about what came to mind without caring I was filming, because no one will ever see it besides me. I literally view it as a case study or whatever on myself. This was a ramble but hopefully you’ll be able to make some sense out of it if you actually care. If not, I don’t care because I’m an ENTP. Brains are weird man.\n\nEdit : grammar", "is_submitter": true, "distinguished": null, "created_utc": 1630907426.0, "parent_id": "t1_hbrxx3o", "replies": [{"author": "Concrete_Grapes", "id": "hbs4wq8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pir6y4", "stickied": false, "body": "Brains ARE weird. I have Shizoid personality disorder (NOT related to schizophrenia), and it makes me appear really fucking weird to most people.   \n\n\nI'm happy and no one can tell, sad, and no one can tell, none of my emotions ever cross my face, i have a flat affect. It unnerves the shit out of most people, and the few times i've seen a video of it, it spooks ME too--because i know what was going on in my head and it's NOT on my face. Not even a little, even if i think i was trying at the time.   \n\n\nAnd it's in my voice. It's flat too. 'eeyore' is what coworkers and family call me, and i mean, MOST people end up calling me this, even if they've never met each other.   \n\n\nSo, i may have to some day try to intentionally do what you've done to see if i can 'mask up' better, or learn to give up trying, lol.", "is_submitter": false, "distinguished": null, "created_utc": 1630910135.0, "parent_id": "t1_hbs13av", "replies": [{"author": "NoMeowAllow", "id": "hbs62lh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #533", "submission": "pir6y4", "stickied": false, "body": "I would honestly recommend it. I’ve struggled a long time with the feeling of being “fake” when being happy because I don’t truly feel it. So put on a mask and pretend and before too long you actually become happy. You are what you eat right? If you feel like you’re coming across as happy then you are and screw everyone else judging you. It doesn’t matter. Like unless there going to physically assault you I don’t think there needs to be a second thought. You can judge real quick if someone is really going to fuck with you or if they just peacocking. Most the time it’s peacocking and I’ll just let them take the win and I’ll back off. It’s not cowardice, it’s simply realizing it doesn’t fucking matter and it’s a waste of your time to even deal with. You got better stuff to do and you’re probably more successful at life than this peacocker. All bark no bite. First step Is of course just follow basic courtesy and respect social norms. But sometimes shit happens. I drunkenly stumbled back onto a guy once (kinda sketchy dude) and he said “I’m not playin.” When I laughed and apologized for falling into him. I just nodded seriously at him and walked away. What the point. Got nothing to prove to him or anyone else there. For you though, with the schizoid, I literally cannot imagine what that’s like. I express stuff on my face and I have a hard time. I guess the whole point of this was to say don’t worry if you’re making a “mask” or not. If it’s coming from the heart than it’s real regardless of if you’re forcing yourself into that facial expression", "is_submitter": true, "distinguished": null, "created_utc": 1630911006.0, "parent_id": "t1_hbs4wq8", "replies": []}]}]}]}, {"author": "Jacqummhm", "id": "hbs6bx2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pir6y4", "stickied": false, "body": "I have a few lengthy candid recordings of me. lol, who I think I am is very different from how I come across. I also recommend it.", "is_submitter": false, "distinguished": null, "created_utc": 1630911206.0, "parent_id": "t3_pir6y4", "replies": []}, {"author": "BuccaneerRex", "id": "hbtat7l", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pir6y4", "stickied": false, "body": "The unexamined life is not worth living. -  Socrates", "is_submitter": false, "distinguished": null, "created_utc": 1630939608.0, "parent_id": "t3_pir6y4", "replies": []}, {"author": "AndrewIsOnline", "id": "hbuzjkv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "pir6y4", "stickied": false, "body": "This is why I always do my drugs in a mirrored closet with bright lights", "is_submitter": false, "distinguished": null, "created_utc": 1630966455.0, "parent_id": "t3_pir6y4", "replies": []}]}