{"title": "What do you prefer, capitalism or socialism? Why.", "name": "t3_pg9e6m", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pg9e6m/what_do_you_prefer_capitalism_or_socialism_why/", "selftext": "I have noticed that many of you are socialists, so I thought it would be a good idea to get some insight into why you prefer socialism or capitalism. I would also like to hear what you think the downsides are to the other system. I personally prefer capitalism, but I don't know much about the two. If there are any other systems (ex. anarchy or communism) that you like or dislike, I would love to hear your views on them.", "score": 0, "upvote_ratio": 0.5, "permalink": "/r/TheFlyingTree/comments/pg9e6m/what_do_you_prefer_capitalism_or_socialism_why/", "id": "pg9e6m", "author": "obiwanlenobi", "link_flair_text": "Question", "num_comments": 37, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630552048.0, "comments": [{"author": "sleepyj910", "id": "hb9x10p", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seeker #141", "submission": "pg9e6m", "stickied": false, "body": "I don't believe they are mutually exclusive.  Pretending the rainbow of economic policy has like 4 options is insane to me. (And just rewards extremists).\n\nI want the correct amount of socialism and the correct amount of capitalism for each specific year, which is never going to be the same amount, because we don't live in a static existence where a single idea is always optimal.\n\nI love McDonalds.  I love Social Security.  They aren't in conflict.", "is_submitter": false, "distinguished": null, "created_utc": 1630554992.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "Kelyaan", "id": "hb9sjio", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pg9e6m", "stickied": false, "body": "I live in the UK therefor I prefer that which I am part of, So that would be capitalism since it's given me the life I have.  \n\n\nI have no lived experience of other systems so I can only go with this.", "is_submitter": false, "distinguished": null, "created_utc": 1630552584.0, "parent_id": "t3_pg9e6m", "replies": [{"author": "obiwanlenobi", "id": "hb9ss6j", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pg9e6m", "stickied": false, "body": "Good comment. The same is true for me as I live in the U.S.", "is_submitter": true, "distinguished": null, "created_utc": 1630552710.0, "parent_id": "t1_hb9sjio", "replies": []}]}, {"author": "neolthrowaway", "id": "hba4sd5", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #338", "submission": "pg9e6m", "stickied": false, "body": "Welfare capitalism like Netherlands.\n\nIt works and people are happy. And it makes sense without changing human tendencies.", "is_submitter": false, "distinguished": null, "created_utc": 1630559603.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "usernames_suck_ok", "id": "hb9tmti", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "pg9e6m", "stickied": false, "body": "I am not sure it's accurate to say many of us are \"socialists\"--some of us are just not capitalists.\n\nDon't really want to get into this discussion, but just wanted to make this distinction. I'm not a capitalist, socialist, anarchist or whatever else.", "is_submitter": false, "distinguished": null, "created_utc": 1630553154.0, "parent_id": "t3_pg9e6m", "replies": [{"author": "obiwanlenobi", "id": "hb9tt70", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pg9e6m", "stickied": false, "body": "I think a saw a post of political views and many people said they were socialists, that were I got the idea. Thanks for the comment.", "is_submitter": true, "distinguished": null, "created_utc": 1630553248.0, "parent_id": "t1_hb9tmti", "replies": [{"author": "LMA73", "id": "hbbogp2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #4", "submission": "pg9e6m", "stickied": false, "body": "I think it is very American to polarise the two and I find it unnecessary. Look at the Nordics, we have balanced the two pretty well.", "is_submitter": false, "distinguished": null, "created_utc": 1630595237.0, "parent_id": "t1_hb9tt70", "replies": []}]}]}, {"author": "roundearthervaxxer", "id": "hb9y6p1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pg9e6m", "stickied": false, "body": "social capitalism", "is_submitter": false, "distinguished": null, "created_utc": 1630555636.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "Concrete_Grapes", "id": "hb9vm82", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pg9e6m", "stickied": false, "body": "I am going to have to say, with a big sigh, 'socialist' because what i really believe is more left than that. The exact name, i dont know. Imagine you cross a socialist, a libertarian, and a communist.   \n\n\nLike, capitalism is pretty much--if you dont make a profit, you can just fuck off and die. The sooner you do either one, the better. If you can turn a profit AND die, whoa boy, REALLY do that, it'll make room for the next customer. Just die before you can let them know we killed ya.  It's brutal.   \n\n\nSo, when a capitalist or righty hears 'free college' they're all shitting bricks about their whole 60 cents in taxes they may have to pay for that, thinking we'll just give money to people who go. No, what it means is that--in order to create a better, higher educated, licensed, trade-certified and apprenticed workforce, NO ONE should be paying for secondary education/trades/apprenticeships. We're not giving you money, but there's no fucking reason to pay tuition in this country. I suppose THAT.   \n\n\nHigh speed transit--not a hard concept, if we can get it going the pressure we take off of roads, and the ease with which people in rural communities can get to education and higher paying jobs becomes extraordinary. Due to high speed rail, people in Japan can live HUNDREDS of miles from where they work. When people bitch about 'down town' traffic, or hate how the city's always a clusterfuck, mass and high speed transit is the solution to this. I suppose that. Yes it costs money.   \n\n\nI also support investing in systems and businesses that are for public benefit. Some of these are a no brainer--fire, police, roads, DOT, food safety, BUT--health insurance, prisons, and education, those things should not be FOR PROFIT driven. When you let profits make the choices in those environments, you end up with the fucked up shit we have now.   \n\n\nI'm for workers having a greater say in the operation of businesses. Frankly, Unions. We need more, they need to be stronger. Oddly, this is something many in the right CAN support, but they keep voting for rich business oligarchs that strip away union rights ...   \n\n\nI'm for as little government mandate, and tinkering as possible, but where it IS--should stand as an open door to make it possible for everyone to do better. That doesnt mean i expect everyone to do that, some people are just lazy pricks--what ever, we need those too. It's just that--no one should ever NOT get a secondary education because money was a factor. No one should skip going to a DR because they cant pay. No one should ever feel like living 35 miles out of a city is a death sentence for their careers due to commute times.   \n\n\nTHAT's the 'socialism' i support.   \n\n\nThere's more, but it's already too wordy", "is_submitter": false, "distinguished": null, "created_utc": 1630554219.0, "parent_id": "t3_pg9e6m", "replies": [{"author": "El_Duque_Caradura", "id": "hbc4gy2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #296", "submission": "pg9e6m", "stickied": false, "body": "Very well, come to Argentina, we do as you ask and more... We got 50% of poverty and corruption in all levels of politics", "is_submitter": false, "distinguished": null, "created_utc": 1630601669.0, "parent_id": "t1_hb9vm82", "replies": []}]}, {"author": "celtic_cuchulainn", "id": "hb9yviy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #168", "submission": "pg9e6m", "stickied": false, "body": "Socialism isn’t mutually exclusive of capitalism, that’s communism. The best way I heard it described simply is:\n\nCommunism is where everybody is treated the same and nobody can be rich or poor.\n\nCapitalism is where anybody can be rich or poor.\n\nSocialism is where anybody can be rich, but no one is poor.\n\nGranted poor is a relative term, I think Scandinavian countries have nailed it the best. Give someone food, housing, and treat any potential medical concerns and you can live a life outside of poverty.", "is_submitter": false, "distinguished": null, "created_utc": 1630556025.0, "parent_id": "t3_pg9e6m", "replies": [{"author": "LMA73", "id": "hbbp2ci", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #4", "submission": "pg9e6m", "stickied": false, "body": "👆👆👆 This.", "is_submitter": false, "distinguished": null, "created_utc": 1630595483.0, "parent_id": "t1_hb9yviy", "replies": []}]}, {"author": "Muroid", "id": "hb9v8k5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "pg9e6m", "stickied": false, "body": "I prefer policy proposals that have some empirical backing showing that they will benefit people and society without causing undue harm, and I’m not terribly concerned with matching my policy preferences to a specific ideology, or supporting policy proposals because they tick a particular ideological box.", "is_submitter": false, "distinguished": null, "created_utc": 1630554013.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "SybariteAussie", "id": "hba6e11", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pg9e6m", "stickied": false, "body": "Am not familiar with the Central & Southern American versions of socialism. I am with the others. Most were as bad as, if not worse than nazi Germany. Go too far left, or right & you arrive at a similar spot with politics. We need the yin & the yang. Balance is best! I would have voted Labour Party/Democrats, Until recently, when I couldn’t ignore that many seemed incandescent with rage and hate. I don’t think it matters anymore.", "is_submitter": false, "distinguished": null, "created_utc": 1630560671.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "vanillaandzombie", "id": "hbalgit", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #154", "submission": "pg9e6m", "stickied": false, "body": "This is a false dichotomy which has been supported by US political parties for advantage.", "is_submitter": false, "distinguished": null, "created_utc": 1630572842.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "claimstoknowpeople", "id": "hbbdiks", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #104", "submission": "pg9e6m", "stickied": false, "body": "This is like asking a carpenter, \"which do you prefer, saws or clamps?\" Choose the right tool for the job, the more tools in your toolbox the more jobs you can cleanly finish.", "is_submitter": false, "distinguished": null, "created_utc": 1630590565.0, "parent_id": "t3_pg9e6m", "replies": [{"author": "obiwanlenobi", "id": "hbbeq39", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pg9e6m", "stickied": false, "body": "I'm just asking, which of the two would you prefer if they were the only ones you could choose. Of course there's way more different ones, but I mainly just asking about the two. I'm just asking about your preference. Thank you for the comment.", "is_submitter": true, "distinguished": null, "created_utc": 1630591094.0, "parent_id": "t1_hbbdiks", "replies": [{"author": "claimstoknowpeople", "id": "hbbft5v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #104", "submission": "pg9e6m", "stickied": false, "body": "But that's the point, it doesn't make any more sense than choosing between saws and clamps. No society has ever been purely socialist, nor has any society ever been purely market-based. The pure, ideal forms probably can't exist in a world of actual humans.\n\nSo if it's just a question of aesthetics I guess I prefer hanging out with people with socialist aesthetics, because people with capitalist aesthetics often use competition or financial success as an excuse for being a dick.", "is_submitter": false, "distinguished": null, "created_utc": 1630591567.0, "parent_id": "t1_hbbeq39", "replies": []}, {"author": "LMA73", "id": "hbbot3o", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #4", "submission": "pg9e6m", "stickied": false, "body": "But the point is, why choose when you can have the best of both.\nThis is a very American polarisation.", "is_submitter": false, "distinguished": null, "created_utc": 1630595377.0, "parent_id": "t1_hbbeq39", "replies": [{"author": "obiwanlenobi", "id": "hbdc7x7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pg9e6m", "stickied": false, "body": "Let me put this another way. If you absolutely had to choose between the two ideologies, which would you choose. Of course there's more ideologies and there's a bunch of fancy adaptations.\n\nEdit: I apologize if my post caused confusion, I'm not saying that they're too polarities and that they're the only ideologies. I'm just asking out of the two, which do you think is better? It's like me asking you if you would prefer a grape flavored lollipop or a root beer flavored lollipop, it's not saying that those are the only two, I'm just asking which one you prefer; don't make the mistake of overthinking this.", "is_submitter": true, "distinguished": null, "created_utc": 1630619540.0, "parent_id": "t1_hbbot3o", "replies": [{"author": "LMA73", "id": "hbeurw2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #4", "submission": "pg9e6m", "stickied": false, "body": "Well then Socialism (the real thing, not propaganda) as there anybody can be rich, but no one is poor. It is a more stable and equal ideology. Not built on abuse, unfairness and \"grab the money no matter what\" mentality. \nLook at America. Super rich and super poor. And no one seems to give a damn about the poor, whereas even the vain, self-centered, vapid rich are idolised. \nI call that dystopian hell.", "is_submitter": false, "distinguished": null, "created_utc": 1630646540.0, "parent_id": "t1_hbdc7x7", "replies": []}]}]}]}]}, {"author": "maxime7567", "id": "hba6mij", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #83", "submission": "pg9e6m", "stickied": false, "body": "I don't like these names. All of them are flawed. I personally lean more towards capitalism since that gives more freedom, you aren't dependent on the government as much, but it definitely has its flaws. I am for a true democracy, with freedom as the main ideal. Where crime is taking away the freedom of others. With the government being very weak. They shouldn't have power. The people should.", "is_submitter": false, "distinguished": null, "created_utc": 1630560830.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "DoglessDyslexic", "id": "hba6y1u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pg9e6m", "stickied": false, "body": "I think both systems have benefits in different settings.  It's more accurate to say that I'm not for unregulated capitalism and I'm for limited socialism.  I think when it comes to critical services, capitalism is a poor system.  Thus education, healthcare, and infrastructure should likely be using socialist systems.  This way nobody is in a position to have services they absolutely need denied to them because a company wants to gouge them.  For most other things I think capitalism makes a pretty good system.", "is_submitter": false, "distinguished": null, "created_utc": 1630561044.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "amitym", "id": "hbag1tx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pg9e6m", "stickied": false, "body": "Capitalism is just a set of practices around the trade and ownership of profit shares.  It isn't really a \"system,\" at least not in the sense that contradicts socialism.\n\nFor example, I live in a country with robust free-market capitalism, and also highly developed socialist institutions:  a free highway system, national public pension system, minimum wage set by law rather than by market forces, legal protection for organized labor activities, heavy regulation of many industries, large amounts of land held collectively, pretty extensive public healthcare, heavy subsidies for agricultural workers, that kind of thing.\n\nBut don't think we live in some monolithic statist society -- at the same time as all of that, our political system is fairly diffuse, with many of the important political decisions that affect everyone on a day to day basis made on a local level by people in the same community.\n\nIt would be crazy to say that we are not capitalist.  It would be equally crazy to say that we aren't socialist.  And if you describe the concept of an ideal anarchist society, many of those elements are here too.  We're not purely any one thing.  It's a blend of ideas.\n\nAnd by the way, it wasn't always like this.  150 years ago, we had almost no socialist elements whatsoever -- including no protections to prevent capitalism from devouring the free market.  This is all a chosen system, chosen deliberately by citizens over many decades.  It doesn't just \"happen,\" and none of it is written in stone.", "is_submitter": false, "distinguished": null, "created_utc": 1630568077.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "germz80", "id": "hbbhttk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "pg9e6m", "stickied": false, "body": "It seems like capitalism is more robust than socialism, so I prefer capitalism. But I also think that anytime there is a market failure, where capitalist interests clearly harm the public good, it often makes sense for democracy to intervene and fix the market failure. I think in the US, Democrats and Republicans tend to agree on this general idea, but disagree on where to draw the line on when the government should intervene.", "is_submitter": false, "distinguished": null, "created_utc": 1630592436.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "logoyahoo", "id": "hbbtji2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #80", "submission": "pg9e6m", "stickied": false, "body": "Capitalism because it incentivizes and rewards personal drive and ambition and generates the capital needed to fund social programs to help those who are unable to help themselves.", "is_submitter": false, "distinguished": null, "created_utc": 1630597332.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "El_Duque_Caradura", "id": "hbc3i8a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #296", "submission": "pg9e6m", "stickied": false, "body": "I live in Argentina. No. Socialism isn't the way, once you put tons of money *and powerin the hands of a few politicians just to be \"solidary\" you turn them into practically kings and you are putting your future in the hands of that person. And they'll love money and power given, so even if the first socialist leader you had was geninuely a good man, definitely the next one will be an authoritarian, and if you doubt me, look for goverment socialist examples, most of them suck. You can do cherry picking of two or three cases of \"good result\" but you would be missing on purpouse hundreds of bad results (this lasts words go for anyone who want to go on favor).\n\nI think that socialism can be good, but in small dose and as a second lead, not first. Seriously, the idea of \"social justice\" applied during decades take my country to a massive poverty and misery, the speeches about equality are beautiful, but the practices and result it's what we should care of\n\nBtw: if you ask for examples, look my country again, Argentina -> we got J.D. Perón (like a god amongst mortals, dare to discuss that and you face an angry mob like medieval catholicism). A prom of 35% of general poverty (sometimes 50%) and leaders of unions and politicians who power and wealth surpass similar kind of countries a lot bigger and wealthier then mine.", "is_submitter": false, "distinguished": null, "created_utc": 1630601290.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "Gullible-Chemical471", "id": "hbczdlj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #321", "submission": "pg9e6m", "stickied": false, "body": "American capitalism is broken. It enslaves the worker population for low wages, no holidays, just so the few rich people can have their money and get richer. The system is all about money.\n\nWestern European stuff is a lot better, as the system cares for the human, with decent wages, obligatory holidays, good payable healthcare and more.", "is_submitter": false, "distinguished": null, "created_utc": 1630613966.0, "parent_id": "t3_pg9e6m", "replies": []}, {"author": "rambling_RN", "id": "hb9wnz9", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #258", "submission": "pg9e6m", "stickied": false, "body": "Socialism would be the perfect society if you could figure out a way to remove the human influence. If we all got rewarded equally for the top achievers results, before long we would all do the minimum and expect grand results.   Kind of like participation trophies today.", "is_submitter": false, "distinguished": null, "created_utc": 1630554791.0, "parent_id": "t3_pg9e6m", "replies": [{"author": "S_thyrsoidea", "id": "hba9tkb", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "pg9e6m", "stickied": false, "body": "You say that like participation trophies are some sort of crime against humanity.\n\nIf the worst thing about socialism is that it would be as benign as participation trophies... dayum, that's the best argument *for* socialism I've heard in a while.\n\nDo you realize that you're arguing that it's a *bad* thing not to have winners and losers in society?  You might feel that way, but do you have any idea how ridiculously unconvincing that is to most morally normal people?  Like, if you were to take twenty starving homeless people and make the cage-match for a sandwich, most reasonable people would be horrified at you; if you argued in your own defense, \"But what are you objecting to? I had to make them fight for the sandwich, how else could we have winners and losers?\" that would convince most people not that what you did was a good idea, but that you were a sociopath.", "is_submitter": false, "distinguished": null, "created_utc": 1630563132.0, "parent_id": "t1_hb9wnz9", "replies": [{"author": "rambling_RN", "id": "hbdmdkn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #258", "submission": "pg9e6m", "stickied": false, "body": "No, I'm arguing that it is a bad thing to make everyone feel like a winner.\n I'm guessing you believe it to be a good idea to raise minimum wage as well?", "is_submitter": false, "distinguished": null, "created_utc": 1630624193.0, "parent_id": "t1_hba9tkb", "replies": [{"author": "S_thyrsoidea", "id": "hbee4zk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "pg9e6m", "stickied": false, "body": "> No, I'm arguing that it is a bad thing to make everyone feel like a winner.\n\nThat's not a contradiction of what I wrote.  We get it.  You want there to be losers.  It's very important that there be winners and losers to you, and, indeed, that the basic necessities of life be allocated in a competitive way.", "is_submitter": false, "distinguished": null, "created_utc": 1630637323.0, "parent_id": "t1_hbdmdkn", "replies": []}]}]}]}, {"author": "Golden-Snowflake", "id": "hba4fzo", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pg9e6m", "stickied": false, "body": "Neither, they are both flawed systems.", "is_submitter": false, "distinguished": null, "created_utc": 1630559382.0, "parent_id": "t3_pg9e6m", "replies": [{"author": "obiwanlenobi", "id": "hbdcflf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pg9e6m", "stickied": false, "body": "Why is he getting downvoted, he's completely right.", "is_submitter": true, "distinguished": null, "created_utc": 1630619637.0, "parent_id": "t1_hba4fzo", "replies": [{"author": "Golden-Snowflake", "id": "hbf4tk1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pg9e6m", "stickied": false, "body": "folks don't like folks outside the \"Tribe\".", "is_submitter": false, "distinguished": null, "created_utc": 1630653874.0, "parent_id": "t1_hbdcflf", "replies": [{"author": "obiwanlenobi", "id": "hbg9cvb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pg9e6m", "stickied": false, "body": "Unfortunately you're right. What your original comment said was so broad and provable, I genuinely don't know why someone would down vote it other than closed-mindedness. Thank you for sharing your opinion by the way.", "is_submitter": true, "distinguished": null, "created_utc": 1630679768.0, "parent_id": "t1_hbf4tk1", "replies": [{"author": "Golden-Snowflake", "id": "hbgq3no", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pg9e6m", "stickied": false, "body": "Thank you for understanding both systems have a long way to go till perfection is reached.", "is_submitter": false, "distinguished": null, "created_utc": 1630686701.0, "parent_id": "t1_hbg9cvb", "replies": []}]}]}]}]}]}