{"title": "A theory about many popular \"stupid\" people.", "name": "t3_pfiu1v", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pfiu1v/a_theory_about_many_popular_stupid_people/", "selftext": "You may have been scrolling through YouTube, Twitter, or other social media and noticed that there are many popular people who are often criticized for being extremely stupid. Some of the ones you may know include the vegan teacher and Nick avocado. My theory (although I'm sure I'm not the first to come up with it) is that these so-called stupid people, are actually quite smart and know exactly what they're doing. I will use the example of the vegan teacher in this discussion. The vegan teacher has radical views that are so out of place that it kind of throws one off (she's radical even for a vegan). I think she makes up these opinions and statements and has all these public freakouts to gather the attention of several commentator channels and other forms of criticizing people. This in turn attracts people to her channel, not because they enjoy her content, but because it's fun to make fun of her. Thing is she's getting all these views on YouTube, and that means that she gets more money. I believe the same is true for Nick avocado, but he went to such a great extent that he'd give up his physical health for the money.\n\nSo what do you think of my theory, do you agree or is it not valid?", "score": 26, "upvote_ratio": 0.94, "permalink": "/r/TheFlyingTree/comments/pfiu1v/a_theory_about_many_popular_stupid_people/", "id": "pfiu1v", "author": "obiwanlenobi", "link_flair_text": "Discussion", "num_comments": 29, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630457151.0, "comments": [{"author": "OccamsRazorstrop", "id": "hb4rcpw", "score": 15, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #180", "submission": "pfiu1v", "stickied": false, "body": "Jerry Lewis, Stan Laurel, all of the Stooges, all of the Marx Brothers, Lou Costello, Marilyn Monroe, Goldie Hawn, and Tracy Morgan: not even close to being a comprehensive list of smart people who laughed all the way to the bank by playing stupid people.", "is_submitter": false, "distinguished": null, "created_utc": 1630459031.0, "parent_id": "t3_pfiu1v", "replies": [{"author": "zebediah49", "id": "hb4wip1", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #131", "submission": "pfiu1v", "stickied": false, "body": "Actually stupid people usually make stupid mistakes, and that puts them behind.\n\nSmart people can appear stupid, but evade it.\n\n----\n\nOne of the cleanest examples of this I know of, happening in realtime on video, comes from Bush:\n\n> \"There's an old saying in Tennessee—I know it's in Texas, probably in Tennessee—that says, 'Fool me once, shame on... shame on you. Fool me—you can't get fooled again.\n\nEveryone probably knows this, but the normal saying is: \"Fool me once, shame on you.  Fool me twice, shame on me.\"  The point is basically victim blaming, but is that if someone scams you, they're a bad person.  However, if you fall for it again, it's kinda your fault for not learning the first time.\n\nSo, this can be taken two ways: (1) this guy that 10 years before was quite a clean debater, making strong intellectual arguments in formal debates, suddenly is a complete idiot that can't remember a standard saying, or --\n(2) he realized halfway through the sentence that he was about to provide a recorded copy of the phrase \"shame on me\".  That's a next-level abusable clip to pull out of context, which was just becoming common at the time (2002) .  I suspect he realized that at the first gap.  At that point, he's searching for a solution, and comes up with a stupid fumble across the second.\n\nThe end result is an awkward \"lol he's so dumb he can't even proverb\".  But it ended there.  I don't think that was an accident.", "is_submitter": false, "distinguished": null, "created_utc": 1630461372.0, "parent_id": "t1_hb4rcpw", "replies": []}, {"author": "NoMeowAllow", "id": "hbej57z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #533", "submission": "pfiu1v", "stickied": false, "body": "Here’s a question I’ve always subconsciously had. Is it morally apprehensible to take advantage of stupid people or is it a fundamental necessity for personal growth and success?", "is_submitter": false, "distinguished": null, "created_utc": 1630639831.0, "parent_id": "t1_hb4rcpw", "replies": []}]}, {"author": "armyprof", "id": "hb4nv4n", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #372", "submission": "pfiu1v", "stickied": false, "body": "There’s an old term that sums this up nicely.  “Crazy like a fox.”  Because some people know that acting like an idiot can get attention, and attention can mean money.", "is_submitter": false, "distinguished": null, "created_utc": 1630457424.0, "parent_id": "t3_pfiu1v", "replies": [{"author": "eghhge", "id": "hb6l8f0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #424", "submission": "pfiu1v", "stickied": false, "body": "I think so much of their behavior us driven by the need for attention, 'more me now'.", "is_submitter": false, "distinguished": null, "created_utc": 1630501628.0, "parent_id": "t1_hb4nv4n", "replies": []}]}, {"author": "tessapotamus", "id": "hb54owc", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #35", "submission": "pfiu1v", "stickied": false, "body": "This Veritasium video, [Clickbait is Unreasonably Effective](https://www.youtube.com/watch?v=S2xHZPH5Sng), mentions how the annoying reaction faces on YT thumbnails do measurably drive clicks, even for a science channel. Comments do too, regardless of their tone, which is why “if you xyz, let me know in the comments” is ubiquitous.\n\nWith these analytical tools you must be right that some creators are seeing more engagement the more controversial they are, and amplifying that on purpose.", "is_submitter": false, "distinguished": null, "created_utc": 1630465330.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "SybariteAussie", "id": "hb4t2vp", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pfiu1v", "stickied": false, "body": "I haven’t heard of either person sorry. 🐢I exist mostly in my shell. Poke head out occasionally, gasp at the dramastic (combo of dramatic & drastic, either I invented this word or read it somewhere?) opinions and strange events occurring. Interesting times…..", "is_submitter": false, "distinguished": null, "created_utc": 1630459808.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "MysticTheMeeM", "id": "hb5t43n", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Druid #16", "submission": "pfiu1v", "stickied": false, "body": "Monetised insanity.", "is_submitter": false, "distinguished": null, "created_utc": 1630481245.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "Akarzen", "id": "hb64reh", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #81", "submission": "pfiu1v", "stickied": false, "body": "I often have paranoidal thoughts. I sometimes believe that almost everything I see in media is staged/made this and that way precisely to affect this and that auditory.\n\nI learned to just watch things I enjoy when I'm in normal mind state, preferably without hyping and shit. Just don't let other hyping dumb people clutter your views of life.", "is_submitter": false, "distinguished": null, "created_utc": 1630491458.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "BelowAvgPhysicist_02", "id": "hb4pexc", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #267", "submission": "pfiu1v", "stickied": false, "body": "> she's radical even for a vegan\n\nThis made me laugh", "is_submitter": false, "distinguished": null, "created_utc": 1630458144.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "Top_Oil_9497", "id": "hb5sah5", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #288", "submission": "pfiu1v", "stickied": false, "body": "It's just like how Nirvana put up this \"we don't know what we do, we don't know music\" type of look, and then created one of the most iconic albums in history. You can't just be this lucky, you know.\n\n\n\nBusiness is everything, especially these days and what they're doing is a marketing strategy imho", "is_submitter": false, "distinguished": null, "created_utc": 1630480553.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "TesseractToo", "id": "hb67txf", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "pfiu1v", "stickied": false, "body": "Yeah... stupid like a fox. I know the idiom is \"crazy like a fox\" and that also applies but wouldn't have made sense.  \n\n\nI haven't seen this vegan teacher before. Is she on youtube? I'm old and tiktok scares me.", "is_submitter": false, "distinguished": null, "created_utc": 1630493747.0, "parent_id": "t3_pfiu1v", "replies": [{"author": "obiwanlenobi", "id": "hb6uyus", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pfiu1v", "stickied": false, "body": "I think she is on both YouTube and TikTok. I'm guessing she has a huge audience on TikTok because most people on TikTok aren't exactly intelligent. Although there's still a lot of idiots on YouTube as well.", "is_submitter": true, "distinguished": null, "created_utc": 1630506041.0, "parent_id": "t1_hb67txf", "replies": [{"author": "TesseractToo", "id": "hb7cmej", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "pfiu1v", "stickied": false, "body": " 'Think of how stupid the average person is, and realize half of them are stupider than that.' -George Carlin  \n\n\nYou don't have to be intelligent to be influential (look at all the politicians hehe)  \n\n\nI need to start making more YT accounts so I can watch bullshit without it getting in the recommendations of my main profile :D", "is_submitter": false, "distinguished": null, "created_utc": 1630513340.0, "parent_id": "t1_hb6uyus", "replies": []}, {"author": "nonexistentgrape", "id": "hba9mkg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #481", "submission": "pfiu1v", "stickied": false, "body": "She did have a massive platform (over a million) on TikTok, but was banned and I haven't seen her since.", "is_submitter": false, "distinguished": null, "created_utc": 1630562986.0, "parent_id": "t1_hb6uyus", "replies": []}]}]}, {"author": "Vercouine", "id": "hb6c8rd", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #125", "submission": "pfiu1v", "stickied": false, "body": "Of course most of them are smart. At least marketing and show-business smart.\n\nMarilyn Monroe studied litterature at LA University.\n\nParis Hilton showed once at a red carpet with a kinkajou, which helped an association raise much more funds for them in a few days than what they did on a regular year.\n\nThe Kardashians - Jenner family became insanely fortunate just by cashing on their notoriety. And boy do they have the stupid tag attached to them...\n\nJean-Claude Van Damme just made some stupid or weird declarations but was still welcome on TV shows,obviously because of this.\n\nAll those \"real\" TV shows that help unknown people get famous for just being stupid. Stupidity sells. A lot of TV want stupid people to show, because people wathh them being stupid to feel smart.\n\nBTW, sometimes they're not the smart ones, but are well supported. Still, they have to be smart enough to find a good network.\n\nThat's why you don't see people with low IQ or being deficient getting famous, because those are pityed and if someone try to use them, people won't follow. Human want to see stupidity, but not \"disabled\" one, that would cross a red line. They want people who should be smart enough to know better but don't due to lack of common sense and lack of trying to get better. You know, people you can despise and look down with self satisfaction.\n\n(English is my third language, so I had trouble to find some words. If I offended anyone : I'm sorry, that's absolutely not my intention. If I worded things poorly and you have a better way to put it, feel free to tell me, I'm always happy to better myself and learn)", "is_submitter": false, "distinguished": null, "created_utc": 1630496696.0, "parent_id": "t3_pfiu1v", "replies": [{"author": "BuccaneerRex", "id": "hb77ewa", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pfiu1v", "stickied": false, "body": ">That's why you don't see people with low IQ or being deficient getting famous, because those are pityed and if someone try to use them, people won't follow.\n\nTo put it in movie terms: 'You never go full retard'. - Tropic Thunder has commentary about this exact statement.", "is_submitter": false, "distinguished": null, "created_utc": 1630511211.0, "parent_id": "t1_hb6c8rd", "replies": []}, {"author": "obiwanlenobi", "id": "hb7jdgl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pfiu1v", "stickied": false, "body": "Your English was excellent. Great comment", "is_submitter": true, "distinguished": null, "created_utc": 1630516071.0, "parent_id": "t1_hb6c8rd", "replies": [{"author": "Vercouine", "id": "hba7l68", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #125", "submission": "pfiu1v", "stickied": false, "body": "Thank you. I was tired and struggled to find some words.", "is_submitter": false, "distinguished": null, "created_utc": 1630561498.0, "parent_id": "t1_hb7jdgl", "replies": []}]}]}, {"author": "Kelyaan", "id": "hb560e5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pfiu1v", "stickied": false, "body": "Oh some of them definitely know wtf they are doing and ride it out for the money they're gaining from it. Same with the stupid people who go to the most radical extremes of politics, they may not believe it but they make money from it - Looking at the famous \"hardcore gamer\" that doesn't game ... Anita Sarkisian who got nearly $30,000 in funds because she claimed that's how much it cost to open a discord server, Spoilers - They still didn't make it and just took the money.", "is_submitter": false, "distinguished": null, "created_utc": 1630466009.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "CryptographerNo1073", "id": "hb57rsl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #332", "submission": "pfiu1v", "stickied": false, "body": "Yeah, I agree. Some may just actually be stupid, but there's definitely a few who know exactly what they're doing.", "is_submitter": false, "distinguished": null, "created_utc": 1630466931.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "lunarnity", "id": "hb593in", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #331", "submission": "pfiu1v", "stickied": false, "body": "Well, to be honest, you never know. They could actually be fucking stupid, which is why they do what they do or they could be doing it all for the attention. Thing is, we may never know their intentions unless they let us.", "is_submitter": false, "distinguished": null, "created_utc": 1630467638.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "GuyGuy2727", "id": "hb5awh1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #286", "submission": "pfiu1v", "stickied": false, "body": "I can almost guarantee Nick and the Vegan Teacher aren't playing a character. I'm not saying they don't embellish things for a youtube audience but they're still being themselves. Granted, the Vegan Teacher is more up in the air than Nick who i'm 100% sure is just himself, but still. It's usually really, really easy to tell when someone's playing a character and when someone isn't. Your giving both of these people more credit than they deserve. They're just normie versions of lolcows. They're people on the internet that act really strange or do strange things that strangers like to watch because it makes them some form of 'interesting' from a morbid curiosity perspective. That, or they just like being angry at how wrong they are, like the Vegan Teacher audience.", "is_submitter": false, "distinguished": null, "created_utc": 1630468624.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "ash918", "id": "hb5m45q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #441", "submission": "pfiu1v", "stickied": false, "body": "I 100% agree. The biggest example would be Kim Kardatian, that woman is smart AF. But has capitalized on her over-dramatized stupidity, and thru that she has made millions!\n\nPlenty of people do the same thing in many different variations, not just on TV but also in person- in order to gain some form of gratification from the attention", "is_submitter": false, "distinguished": null, "created_utc": 1630475727.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "CorpseJuiceSlurpee", "id": "hb5mswq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #434", "submission": "pfiu1v", "stickied": false, "body": "Hate watching *is* a thing. YouTube dosen't know fans or haters, it just sees clicks. I wouldn't totally doubt if some of the react YouTubers were cooperating with the outrageous YouTubers.\n\nThen there's Chris Chan as the outlier...", "is_submitter": false, "distinguished": null, "created_utc": 1630476229.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "The-Primes", "id": "hb61mll", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #438", "submission": "pfiu1v", "stickied": false, "body": "My take on your theory goes beyond YouTube. Life has a way coming to polarities despite intentions or craftiness.", "is_submitter": false, "distinguished": null, "created_utc": 1630488835.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "sister-goose", "id": "hb76036", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #458", "submission": "pfiu1v", "stickied": false, "body": "Dolly Parton was confronted by an interviewer about her \"dumb blonde\" persona. She said, \"people think the joke's on me, but it's really on the public. I know exactly what I'm doin' and I can change it at any time😊\"", "is_submitter": false, "distinguished": null, "created_utc": 1630510640.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "Qwopie", "id": "hb6leff", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #13", "submission": "pfiu1v", "stickied": false, "body": "I used to think this of a certain ex president, but he kinda proved the opposite pretty quickly.", "is_submitter": false, "distinguished": null, "created_utc": 1630501710.0, "parent_id": "t3_pfiu1v", "replies": []}, {"author": "CarpenterOk8125", "id": "hbaa801", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #478", "submission": "pfiu1v", "stickied": false, "body": "100% agree, playing the fool can be helpful in a myriad of ways", "is_submitter": false, "distinguished": null, "created_utc": 1630563434.0, "parent_id": "t3_pfiu1v", "replies": []}]}