{"title": "I find it interesting that the most usefull items in fiction are super rare, while in real life those are the more easily accessible and cheap. For example Salt and Glass. But it is possible that we interact with those on a daily basis that we accept them as given. What do you think?", "name": "t3_pfhjba", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pfhjba/i_find_it_interesting_that_the_most_usefull_items/", "selftext": "", "score": 1, "upvote_ratio": 0.56, "permalink": "/r/TheFlyingTree/comments/pfhjba/i_find_it_interesting_that_the_most_usefull_items/", "id": "pfhjba", "author": "OscarOzzieOzborne", "link_flair_text": "Discussion", "num_comments": 6, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630452591.0, "comments": [{"author": "solongfish99", "id": "hb4gi40", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "pfhjba", "stickied": false, "body": "I'm not sure I've read a work of fiction that involves rare salt or glass... can you elaborate?", "is_submitter": false, "distinguished": null, "created_utc": 1630453986.0, "parent_id": "t3_pfhjba", "replies": [{"author": "OscarOzzieOzborne", "id": "hb4gnal", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #121", "submission": "pfhjba", "stickied": false, "body": "I was giving them as an example as common materials to ciment my point about how in real life the cheap and accessible things are the usefull once rather then the obscure and rare.", "is_submitter": true, "distinguished": null, "created_utc": 1630454053.0, "parent_id": "t1_hb4gi40", "replies": [{"author": "solongfish99", "id": "hb4hdx1", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "pfhjba", "stickied": false, "body": "Generally, in fiction, and stories in general, characters have high wants and/or high needs. In other words, stories aren't usually told about people who are satisfied with their lives or who find themselves in mundane circumstances. Because of this, there is usually some objective, whether that be a rare artifact, relationship, or life/community goal that is unique (not mundane) in some way. During these stories, the mundane parts of the character's lives generally aren't discussed (eating lunch, using the bathroom, trimming facial hair, etc), but that doesn't mean they wouldn't be as valuable to those characters if they were real.\n\nAlso, keep in mind that many things that exist in fiction simply *don't* exist in the real world, so they're *beyond* rare in that sense.", "is_submitter": false, "distinguished": null, "created_utc": 1630454398.0, "parent_id": "t1_hb4gnal", "replies": []}]}]}, {"author": "DeathByThousandCats", "id": "hb4pgxq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #204", "submission": "pfhjba", "stickied": false, "body": "Water, tap or bottle-packaged. The third-world countries have serious problems accessing uncontaminated water in majority of locations. Even for the contaminated water people would have to go out of their ways to make an hour’s trip everyday on feet with gallons of water.", "is_submitter": false, "distinguished": null, "created_utc": 1630458170.0, "parent_id": "t3_pfhjba", "replies": []}, {"author": "SchoggiToeff", "id": "hb6mtzc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #114", "submission": "pfhjba", "stickied": false, "body": "In real life the items which I needed were pretty common but in the given situation still rare. Some examples, when you are travelling with a motorcycle there comes the time where you need something urgently.\n\nOne example is a bed. Now, nearly everyone has a bed, or knows someone which has a bed. There are even stores which sell beds and also houses which rent beds for a night. The latter are known by various names. While a brothel might rent you a bed, it properly is neither cheap nor what you are really looking for. \n\nDepending where and when you are, getting a bed for a night is pretty easy and cheap. Maybe even free. But it can also be very expensive or even impossible to get a bed for a single night. Hotels might be fully booked or charge outrageous prices because of an event or their prime location. Been there, suffered from that.\n\nNow, I could you tell you many stories were it was pretty easy to get a bed. Are they interesting? Maybe, at least a few of them. Are the stories where it was hard to get a bed more interesting? Pretty sure they are. I could also tell you some stories when I just needed gas, or a friend needed water for the cooling system, or I just needed a plier to fix something, or that time were I needed one of the most abundant stuff possible: air - because one of my tire was lacking it.\n\nHow many times to you see in a movie a dude buying milk? I mean, apart from the time the Dude actually bought milk. If it is about mundane and trivial things, the story is usually more complex. See for example Harold & Kumar Go To White Castle, where the thing they want are just simple burgers, but it is still a future length film and not a short SNL skit. Now, if i want some White Castle burgers as well it would also make a good story, as the there are no White Castles serving the iconic small burgers outside the USA - and I am outside the USA.", "is_submitter": false, "distinguished": null, "created_utc": 1630502403.0, "parent_id": "t3_pfhjba", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "hb84l8z", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pfhjba", "stickied": false, "body": "No, There are far more useful materials that could revolutionize the world if they were easier to obtain, manufacturers or refine in large quantities. For example, Gold, platinum, and graphine.", "is_submitter": false, "distinguished": null, "created_utc": 1630524746.0, "parent_id": "t3_pfhjba", "replies": []}]}