{"title": "I'm horrible at memes...", "name": "t3_phthp0", "url": "https://www.reddit.com/r/TheFlyingTree/comments/phthp0/im_horrible_at_memes/", "selftext": "As I just said I'm horrible at making memes, so I don't know what to post...  \nMaybe we can talk about some of the things that I've been thinking about in the last few weeks; which mostly consists of calculating how much energy is needed to spin cylindrical shaped objects on one of their axis to store energy like a battery...\n\nI've discovered that although it might be slightly more expensive than normal Li-ion batteries(in large scales, and considering the implementation of a vacuum room) and the same density of energy to volume(MWh/m\\^3) and considering how they work they most probably won't blow up like chemical batteries and the energy transfer(speed of storing/using the energy stored) is higher.\n\nThis is all based on my sloppy calculations which I can share if you want but there is no actual evidence that my calculations are right...  \nJust thought this might be an interesting thing to talk about.\n\nJust wanted to say that this is not an original idea many of you might have heard about these rotating batteries but I'm just obsessed with this subject and I wanted to talk about it.", "score": 5, "upvote_ratio": 0.73, "permalink": "/r/TheFlyingTree/comments/phthp0/im_horrible_at_memes/", "id": "phthp0", "author": "PBlague", "link_flair_text": "Idea", "num_comments": 25, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630768882.0, "comments": [{"author": "prajnadhyana", "id": "hbkyxc0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "phthp0", "stickied": false, "body": "Plenty of work has been done on this idea. Pretty sure it's even being used on smaller scales. \n\nAs for not blowing up, that actually is a real possibility in the case of structural failure. There is a LOT of kinetic energy in one of those and if a bearing fails it basically explodes.", "is_submitter": false, "distinguished": null, "created_utc": 1630771769.0, "parent_id": "t3_phthp0", "replies": [{"author": "PBlague", "id": "hbl6w4x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "I think I didn't word my post properly because what I meant by \"blow up\" was an explosion with fire, not just things flying around...Because if a fire is involved and liquids turning into gasses it means that the chamber would be filled with gasses with pressures way more than the ambient pressure of outside and it's a lot more dangerous but if it's only shards of metal flying around they will be mostly neutralized by the walls of the container.\n\nAlthough after saying all this I don't mean that it is not dangerous but that it is a lot safer and probably more stable than the chemical batteries.\n\nEdit: Oh and forgot to add that I believe in smaller scales(which implies more portable implementations) they will be super heavy in contrast to the amount of energy they store(which is not as much of a concern when stationary) and they will cost more because making vacuum container in a smaller scale would be a lot more expensive per unit of energy than the larger ones.\n\nIt's interesting to talk about this stuff with other people thanks for commenting...", "is_submitter": true, "distinguished": null, "created_utc": 1630775260.0, "parent_id": "t1_hbkyxc0", "replies": [{"author": "prajnadhyana", "id": "hbl9a9g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "phthp0", "stickied": false, "body": "The weight isn't the only concern when thinking of portable units. As any unit large enough to be practical will have gyroscopic effects that will make them difficult to move while also making the very act of moving them sap energy from the system.", "is_submitter": false, "distinguished": null, "created_utc": 1630776310.0, "parent_id": "t1_hbl6w4x", "replies": [{"author": "PBlague", "id": "hblpxps", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "I wanted to address that but I decided not to because there are ways to combat that.\n\nAnyway thanks for replying :)", "is_submitter": true, "distinguished": null, "created_utc": 1630783831.0, "parent_id": "t1_hbl9a9g", "replies": []}]}]}]}, {"author": "maxime7567", "id": "hbnumtk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #83", "submission": "phthp0", "stickied": false, "body": "Ok", "is_submitter": false, "distinguished": null, "created_utc": 1630825911.0, "parent_id": "t3_phthp0", "replies": [{"author": "PBlague", "id": "hbo6djw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "Ok", "is_submitter": true, "distinguished": null, "created_utc": 1630836254.0, "parent_id": "t1_hbnumtk", "replies": []}]}, {"author": "GreyShuck", "id": "hbkxrsu", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #201", "submission": "phthp0", "stickied": false, "body": "I have never delved into the maths behind them, but I know that flywheel energy storage systems are a viable solution for a number of applications - particularly mobile ones - and have been used in certain urban rail transit systems for several decades now. An intriguing technology altogether.\n\nAs you say, I'd imagine that they are less likely to blow up as a result of electro-chemical reactions, but I have no idea what a mechanical failure looks like at the kind of rotation speeds involved. I could imagine some high-velocity fragments being involved.", "is_submitter": false, "distinguished": null, "created_utc": 1630771258.0, "parent_id": "t3_phthp0", "replies": [{"author": "PBlague", "id": "hbkymf3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "Yes, although I have not tested anything like this before to make sure if my calculation can predict the maximum rotating speed or not; it seems that if the flywheel is in an enclosed space(which is needed to make a vacuum and preferably using magnetic levitation to reduce drag) I think it would be fine.", "is_submitter": true, "distinguished": null, "created_utc": 1630771633.0, "parent_id": "t1_hbkxrsu", "replies": []}]}, {"author": "PBlague", "id": "hbksjcw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "Is this enough to not get purged out on Monday!?", "is_submitter": true, "distinguished": null, "created_utc": 1630768924.0, "parent_id": "t3_phthp0", "replies": [{"author": "justausername22222", "id": "hbkvkby", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "phthp0", "stickied": false, "body": "Even just commenting on someone else's post is enough to not get purged.", "is_submitter": false, "distinguished": null, "created_utc": 1630770290.0, "parent_id": "t1_hbksjcw", "replies": [{"author": "PBlague", "id": "hbkxxiz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "Oh ok... But were you interested in the subject!?", "is_submitter": true, "distinguished": null, "created_utc": 1630771327.0, "parent_id": "t1_hbkvkby", "replies": [{"author": "justausername22222", "id": "hbkyd85", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "phthp0", "stickied": false, "body": "No", "is_submitter": false, "distinguished": null, "created_utc": 1630771521.0, "parent_id": "t1_hbkxxiz", "replies": [{"author": "PBlague", "id": "hbkyqnq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "Ok", "is_submitter": true, "distinguished": null, "created_utc": 1630771686.0, "parent_id": "t1_hbkyd85", "replies": []}]}, {"author": "MisanthropicScott", "id": "hblccax", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "phthp0", "stickied": false, "body": "I was.", "is_submitter": false, "distinguished": null, "created_utc": 1630777679.0, "parent_id": "t1_hbkxxiz", "replies": [{"author": "PBlague", "id": "hblqonv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "Interesting... I would love to know your opinion on this subject...", "is_submitter": true, "distinguished": null, "created_utc": 1630784168.0, "parent_id": "t1_hblccax", "replies": [{"author": "MisanthropicScott", "id": "hblrszd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "phthp0", "stickied": false, "body": "I don't have the detailed math and physics to evaluate the concept. I would assume that this would not be for long term storage as the friction loss would be excessive over time.\n\nI would expect more advances in batteries, which are already quite good, and the use of hydrogen as a battery. Hydrogen is not a fuel because you put more energy into separating the hydrogen than you get back from burning it. But, hydrogen created by using solar power to separate the water into hydrogen and oxygen could be very good.\n\nOn other weird energy topics, I read about an [electric dump truck](https://www.wired.com/story/this-huge-electric-dump-truck-never-needs-to-plug-in/) used in mining that is always carrying a full load down the mountain and charging its batteries by regenerative breaking. Then it uses the battery power to take the empty truck back up for the next load. Despite the energy loss in charging, since it is always bringing the full load downhill, there is plenty of energy to go back up empty.\n\nI've also heard of various conveyor type devices similar to ski lifts, except that they're are always taking the load downhill, that also make use of the potential energy to not require any energy put in. \n\nOf course, these types of solutions are very specific to mining.", "is_submitter": false, "distinguished": null, "created_utc": 1630784675.0, "parent_id": "t1_hblqonv", "replies": [{"author": "PBlague", "id": "hblv0es", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "You're right about the energy loss but considering that a vacuum chamber is used and the flywheel is magnetically levitating(although expensive) it means that the energy loss would be minimal but I don't think there is a way for me to actually calculate that; maybe the only way is to actually do it, although there might be some research papers about this subject, but I don't want to spend time looking for them.\n\nAbout the electric dump truck, I actually didn't know this existed but I have seen a similar thing done from a \\[video\\]([https://youtu.be/npn7pbVMPTM](https://youtu.be/npn7pbVMPTM)) from Tom Scott which was a really old mechanism to bring mined materials downhill without using any extra energy at all which I think is going to get shut down in a few years because the mining project will be done.\n\nAnd also about the hydrogen, actually that is something that I really don't like working on because I want to store energy fast and use it fast and be highly efficient and especially I don't want it to light on fire or explode and dissipate heat. That is in general one of the reasons that fuels like coal and gas are not in my options, first of all, because use them once(hydrogen is kind of reusable but not fast which makes it bad) and second of all, they have all the properties that are listed above although having a really high energy density, the same for nuclear power.\n\nEDIT: Why the fuck I can't make a hyperlink!?", "is_submitter": true, "distinguished": null, "created_utc": 1630786133.0, "parent_id": "t1_hblrszd", "replies": [{"author": "MisanthropicScott", "id": "hblw057", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "phthp0", "stickied": false, "body": "It is interesting. I don't think anyone has truly solved perpetual motion. Nor has anyone created a perfect vacuum (to my knowledge). So, you've certainly done a good job minimizing the loss. But, I doubt it can be reduced to zero. And, maybe it doesn't have to be. No energy storage mechanism is perfect.\n\nSince you're looking to minimize risk of explosions from actions you take in your daily life, I'd also suggest buying organic foods, especially produce. Cow shit is much less likely to explode than fertilizers created by the [Haber Process](https://en.wikipedia.org/wiki/Haber_process), which is the process by which we eat natural gas and sometimes petroleum. Yum!\n\nBut, this source of industrial fertilizer is why it's also used by terrorists.", "is_submitter": false, "distinguished": null, "created_utc": 1630786592.0, "parent_id": "t1_hblv0es", "replies": [{"author": "PBlague", "id": "hblx7aq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "Oh... I don't think I mentioned perpetual motion!?  \nIt doesn't need to be a complete vacuum, I mean neither is space a perfect vacuum, it just needs to be low enough to reduce the drag from air to something as little as under 1 percent per month and the other problem would be the friction from the rod connecting the flywheel to the container which I have some ideas on how to make it have less friction but I don't know how much it'll affect it.\n\nWell, that took a dark turn. I should stop drinking explosives.", "is_submitter": true, "distinguished": null, "created_utc": 1630787128.0, "parent_id": "t1_hblw057", "replies": [{"author": "MisanthropicScott", "id": "hblxjw5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "phthp0", "stickied": false, "body": "> I don't think I mentioned perpetual motion!?\n\nYou didn't. But, spinning cylinders that spin indefinitely as a way to store energy comes pretty close to it.", "is_submitter": false, "distinguished": null, "created_utc": 1630787286.0, "parent_id": "t1_hblx7aq", "replies": []}]}]}]}]}]}]}]}]}, {"author": "MisanthropicScott", "id": "hblcpe0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "phthp0", "stickied": false, "body": "Actually, this is a moderate effort quite decent post. It beats the crap out of all of the \"what is this place and why am I hear\" stuff that is often a person's first post in this sub.\n\n(Crap! I didn't notice you were the OP.)", "is_submitter": false, "distinguished": null, "created_utc": 1630777843.0, "parent_id": "t1_hbksjcw", "replies": [{"author": "PBlague", "id": "hblqiol", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "Oh lmao, well I wanted to make one of those posts just like I did when I was added to another subreddit a few months ago but after seeing that one of the pinned posts were addressing how people are constantly asking why they are here and stuff I thought to myself maybe not to do that but I really wanted to make a post and here we are...", "is_submitter": true, "distinguished": null, "created_utc": 1630784094.0, "parent_id": "t1_hblcpe0", "replies": []}]}]}, {"author": "TatianaAlena", "id": "hblt72t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #11", "submission": "phthp0", "stickied": false, "body": "Please don't post memes here.", "is_submitter": false, "distinguished": null, "created_utc": 1630785307.0, "parent_id": "t3_phthp0", "replies": [{"author": "PBlague", "id": "hblw2dn", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #378", "submission": "phthp0", "stickied": false, "body": "What!?", "is_submitter": true, "distinguished": null, "created_utc": 1630786620.0, "parent_id": "t1_hblt72t", "replies": []}]}]}