{"title": "Decriminalization of drugs", "name": "t3_p6e27d", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p6e27d/decriminalization_of_drugs/", "selftext": "I'm wondering what y'alls thoughts are on decriminalization of all drugs in the US (or your own country). Ill share my opinion real quick:\n\nPersonally, I'm for it. If we stopped incarcerating drug offenders and used that money instead on treatment and proper (not D.A.R.E) education programs, i beleive we could significantly reduce the drug problem we have in this country. Just look to Portugal to see what happens when drugs are decriminalization. Drug deaths plummeted.\n\nI will add in that I am biased. I like drugs, they interest me. I use psychadelics, smoke weed and enjoy kratom. Drink alcohol? None of this feel morally reprehensible to me. I don't use hard drugs, but I still beleive it shouldn't be a crime to do so, and wish we could help treat those who fall prey to addiction instead of locking them up. I beleive decriminalization is the best course of action. To me it seems logical but when I bring this up, most people look at me like I'm insane. \n\nAnyway, thats all I'm gonna say on this incredibly complex issue. Thoughts?", "score": 27, "upvote_ratio": 0.89, "permalink": "/r/TheFlyingTree/comments/p6e27d/decriminalization_of_drugs/", "id": "p6e27d", "author": "PhilboBaggins111", "link_flair_text": "Discussion", "num_comments": 63, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629239057.0, "comments": [{"author": "DELETED", "id": "h9cy8ui", "score": 9, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p6e27d", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1629249821.0, "parent_id": "t3_p6e27d", "replies": [{"author": "modernzen", "id": "h9dvt9q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #46", "submission": "p6e27d", "stickied": false, "body": "I mean, the war on drugs was never really about drugs. It was a racist policy aiming to arrest black citizens and use felonies as the new way to legally discriminate against them.", "is_submitter": false, "distinguished": null, "created_utc": 1629271704.0, "parent_id": "t1_h9cy8ui", "replies": [{"author": "Flitsieke", "id": "h9e4woh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p6e27d", "stickied": false, "body": "Jeez get outside your bubble man, what about European war on drugs? Are they targeting black? It's like saying apples are only grown so we can catch them worms infesting it. Dumb.", "is_submitter": false, "distinguished": null, "created_utc": 1629280299.0, "parent_id": "t1_h9dvt9q", "replies": []}]}]}, {"author": "bogon64", "id": "h9cr4qx", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #77", "submission": "p6e27d", "stickied": false, "body": "OP, does your same laissez-faire attitude apply to medicinal drugs like antibiotics as well? In other countries I’ve found if I can pronounce the drug I can get it, but these are also prescription-only in the USA. I have some genuine public health concerns if we allowed indiscriminate use of all drugs.", "is_submitter": false, "distinguished": null, "created_utc": 1629246175.0, "parent_id": "t3_p6e27d", "replies": [{"author": "MisanthropicScott", "id": "h9csnbi", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p6e27d", "stickied": false, "body": "I'm not sure criminalization or even making the drugs illegal is the answer.\n\nPerhaps just educate people on why they need to take a full course of antibiotics and why antibiotics can't cure viruses.\n\nOh crap! That is going to be hard.", "is_submitter": false, "distinguished": null, "created_utc": 1629246959.0, "parent_id": "t1_h9cr4qx", "replies": []}, {"author": "KuriousKhemicals", "id": "h9dbv5u", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "p6e27d", "stickied": false, "body": "Not OP, but hold the same position as OP on recreational drugs roughly. I think this is an interesting question and I think most medicinal drugs should be subject to informed use; basically, if it's the sort of thing that's not OTC under the current paradigm then you might have to at least sign a paper saying you understand the risks and benefits, depending on the level of risk maybe a documented information session with a doctor or pharmacist, but there wouldn't be a prescriber who can stand in the way and say no to a person who's legally competent.\n\nBut antibiotics are one of the few drugs I'd advocate excepting from that policy (after fixing health care accessibility so people don't just go buy FishMox bc they can't afford a doctor). With recreational drugs and other drugs that act on the human body itself, you're only hurting yourself if you use it wrong. Drugs that are made to act on an infectious organism are another story because it hurts us all if they're spoiled by overuse. Ironically, DDT is one of the oldest insecticides that's still effective for anti malarial efforts bc it was banned from agricultural use due to the environmental concerns, and fewer mosquitoes were exposed to it. We need to keep our anti microbials protected in that way too.", "is_submitter": false, "distinguished": null, "created_utc": 1629256979.0, "parent_id": "t1_h9cr4qx", "replies": [{"author": "PhilboBaggins111", "id": "h9dgsn9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "p6e27d", "stickied": false, "body": "This exactly. Couldn't agree more!", "is_submitter": true, "distinguished": null, "created_utc": 1629259914.0, "parent_id": "t1_h9dbv5u", "replies": []}]}, {"author": "PhilboBaggins111", "id": "h9cycti", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "p6e27d", "stickied": false, "body": "I do not beleive in making substances illegal in any sense. I beleive a substance is not inherently bad, it is how we use them. I think we should put more of an emphasis on educating people on substances so they can make educated decisions. If you know a substance is potentially harmful/addictive you will be less likely to abuse it. \n\nWe legalize guns in this country. People die from them constantly and can harm others with them. Why should we not at least look at drugs similarly. Give people their freedom", "is_submitter": true, "distinguished": null, "created_utc": 1629249876.0, "parent_id": "t1_h9cr4qx", "replies": [{"author": "raedr7n", "id": "h9d8tt4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #49 | Legio Virtus", "submission": "p6e27d", "stickied": false, "body": "Plutonium is a substance.", "is_submitter": false, "distinguished": null, "created_utc": 1629255286.0, "parent_id": "t1_h9cycti", "replies": []}, {"author": "Muroid", "id": "h9d28k3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p6e27d", "stickied": false, "body": "Antibiotic abuse doesn’t just hurt the people taking them. It speeds up the rate of antibiotic-resistant bacteria appearing, which is bringing us closer to the point where we no longer have effective treatments for many infections, and things which could have been cleared up in a matter of days at minimal cost will instead kill you.\n\nI imagine over the counter antibiotics are liable to make something that is already a serious concern much, much worse.", "is_submitter": false, "distinguished": null, "created_utc": 1629251834.0, "parent_id": "t1_h9cycti", "replies": [{"author": "PhilboBaggins111", "id": "h9d4v7i", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "p6e27d", "stickied": false, "body": "Which is why I lean more towards decriminalization rather than legalization. I dont think there should be over the counter meth, heroin, antibiotics, etc. I dont think we should criminalize the behavior but I dont think every substance should should easily be accessible to everyone either.", "is_submitter": true, "distinguished": null, "created_utc": 1629253192.0, "parent_id": "t1_h9d28k3", "replies": []}]}]}, {"author": "Aunty_Polly420", "id": "h9crwy5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #133", "submission": "p6e27d", "stickied": false, "body": "why would ppl abuse antiobics? is there antibiotic out there that gets you buzzn?", "is_submitter": false, "distinguished": null, "created_utc": 1629246583.0, "parent_id": "t1_h9cr4qx", "replies": [{"author": "DELETED", "id": "h9cyego", "score": 3, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "p6e27d", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1629249898.0, "parent_id": "t1_h9crwy5", "replies": [{"author": "Aunty_Polly420", "id": "h9dw7de", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #133", "submission": "p6e27d", "stickied": false, "body": "oh right yeah, well i think OP is on about the drugs that get you buzzed. Also gotta consider our meat which is being pumped full of antibiotics, i think thats also leading to anti-biotic resistance - but not sure if true!", "is_submitter": false, "distinguished": null, "created_utc": 1629272057.0, "parent_id": "t1_h9cyego", "replies": []}]}, {"author": "Concrete_Grapes", "id": "h9cwxp7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "p6e27d", "stickied": false, "body": "hypochondriacs.  \n\n\nMunchausen syndrome by proxy --child abusers would TOTALLY give kids antibiotics and DESTROY their immune systems so they could get attention. This would be a real serious thing. RARE, but it'd happen, and it'd happen to kids.   \n\n\nYeah there'd be some abuse.", "is_submitter": false, "distinguished": null, "created_utc": 1629249166.0, "parent_id": "t1_h9crwy5", "replies": []}, {"author": "bernpfenn", "id": "h9hzugc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "p6e27d", "stickied": false, "body": "eat chicken", "is_submitter": false, "distinguished": null, "created_utc": 1629350657.0, "parent_id": "t1_h9crwy5", "replies": []}]}, {"author": "AlieanBreac", "id": "h9e47j2", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p6e27d", "stickied": false, "body": ">I have some genuine public health concerns if we allowed indiscriminate use of all drugs.\n\nI say we deal with those concerns on a case by case basis because whatever the fallout, I can't imagine it being worse than the situation we currently have.", "is_submitter": false, "distinguished": null, "created_utc": 1629279661.0, "parent_id": "t1_h9cr4qx", "replies": []}, {"author": "arokace", "id": "h9ed9xq", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p6e27d", "stickied": false, "body": "Decriminalization doesn't mean drugs are legal.  Common misconception.  Means of you get caught doing them, instead of getting b punished, you receive help.  Addiction is an illness and most of us can't overcome it on our own.", "is_submitter": false, "distinguished": null, "created_utc": 1629287094.0, "parent_id": "t1_h9cr4qx", "replies": []}]}, {"author": "bogon64", "id": "h9cpyti", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #77", "submission": "p6e27d", "stickied": false, "body": "OP, what benefit do you derive from Kratom use?", "is_submitter": false, "distinguished": null, "created_utc": 1629245578.0, "parent_id": "t3_p6e27d", "replies": [{"author": "PhilboBaggins111", "id": "h9cxzim", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "p6e27d", "stickied": false, "body": "Personally I just love the way it makes me feel. It feels socially lubricating and relaxing, helps me fall asleep. Best part of it is that it is MILD! It acts on your opioid receptors but is not an opoid. I'm too afraid to actually do real opiates, I'd like them too much.", "is_submitter": true, "distinguished": null, "created_utc": 1629249690.0, "parent_id": "t1_h9cpyti", "replies": [{"author": "patricktoba", "id": "h9dcahr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #39", "submission": "p6e27d", "stickied": false, "body": "Can confirm, kratom naps are beyond rejuvenating.", "is_submitter": false, "distinguished": null, "created_utc": 1629257222.0, "parent_id": "t1_h9cxzim", "replies": []}, {"author": "arokace", "id": "h9ed4xw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p6e27d", "stickied": false, "body": "Can confirm,  don't do real deal opiates.  I'm clean from H but I had one tiny slip up for a 2 days where I took just some vicodin and realized the kind of power opiates have on me and will forever have.  Luckily who I was taking them from noticed very quickly and I stopped.", "is_submitter": false, "distinguished": null, "created_utc": 1629286997.0, "parent_id": "t1_h9cxzim", "replies": []}]}]}, {"author": "MisanthropicScott", "id": "h9cfk5n", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p6e27d", "stickied": false, "body": "I am strongly in opposition to the very concept of victimless crime.\n\nTherefore, I strongly support legalization of all drugs (though probably not advertising of them). I would tax them, regulate them, earmark the tax dollars for public service announcements and drug related healthcare, etc.\n\nHere's an article on what Portugal did that seems to be working way better than the war on drugs. (In case others are unaware; you obviously mentioned it in the OP.)\n\nhttps://www.theguardian.com/news/2017/dec/05/portugals-radical-drugs-policy-is-working-why-hasnt-the-world-copied-it\n\nHere's a blog post I wrote in 2007 on the subject. I think we can easily put all of the drug lords out of business with the stroke of a pen. Though my blog is mostly defunct now, I still agree with this position. I can't guarantee that any links in the post will still work.\n\n[Let's win the war on drug lords](https://misanthropicscott.wordpress.com/2007/10/03/lets-win-the-war-on-drug-lords/)\n\nP.S. True legalization rather than simple decriminalization would allow us to replace existing drug lords making inconsistent products with the drug lords we know and love from the pharmaceutical industry who at least mostly know how to make the product consistent. This would probably reduce accidental overdoses by quite a lot. It would also allow the aforementioned taxation on the industry to fund the programs that help with the problems of addiction. Leaving it illegal but decriminalized does not allow this and also leaves existing drug lords in place.", "is_submitter": false, "distinguished": null, "created_utc": 1629240409.0, "parent_id": "t3_p6e27d", "replies": [{"author": "qwerty0981234", "id": "h9e2s8p", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #7", "submission": "p6e27d", "stickied": false, "body": "How victimless do you consider deaths from addiction and/or people’s life ruined through addiction, someone going on a stabbing spree because of a bad trip? Hell even things that are legal now like alcohol? Too many times I have read news like a young family dying in a car crash because of a alcohol induced ghost rider.\nI hate to say it but some of these laws are required to protect people from themselves. \n\nI’m not a huge fan of just copy the system this or that country uses because that doesn’t take in consideration of cultural differences. Weed is legal in my country and most Americans I spoke with about it were surprised that weed users are looked down upon here. I think your stance is a bit too simple for how complex the problem is.", "is_submitter": false, "distinguished": null, "created_utc": 1629278333.0, "parent_id": "t1_h9cfk5n", "replies": [{"author": "ianovic69", "id": "h9e4tq6", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #216", "submission": "p6e27d", "stickied": false, "body": ">deaths from addiction and/or people’s life ruined through addiction\n\nThis is exactly what is addressed by legalisation.\n\nIt is well known that control of legal heroin reduces the user base to minimal levels.\n\nThis applies to all substance use. The levels of alcohol abuse and other substances such as tobacco, coffee etc, are also significantly reduced.\n\nLegalisation means that all parts of the chain are regulated, including education. The more educated, the less stigma, the less use, the less abuse.\n\nI have little hope for any legalisation in the UK, capitalism won't allow it. For example, right now, the laws dictate that only licenced companies can produce and sell cannabis for medical use.\n\nThe only companies that do that here are chums and family of the Tory government currently in power. They also happen to be some of the largest suppliers in Europe. \n\nMoney talks. Legalisation puts little into Tory pockets. And no, they don't care about the taxes because they can't take from that so easily.", "is_submitter": false, "distinguished": null, "created_utc": 1629280225.0, "parent_id": "t1_h9e2s8p", "replies": []}, {"author": "MisanthropicScott", "id": "h9eslxi", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p6e27d", "stickied": false, "body": "> How victimless do you consider deaths from addiction\n\nSelf-harm is victimless.\n\n> and/or people’s life ruined through addiction\n\nCan you be specific about who these other people are and who you think the victimizers are? I'm not fully understanding this question.\n\n> someone going on a stabbing spree because of a bad trip?\n\nLike drunk driving, punish the crime that creates victims or has a high risk of creating victims.\n\nStabbing people would remain illegal.\n\n> Hell even things that are legal now like alcohol? Too many times I have read news like a young family dying in a car crash because of a alcohol induced ghost rider.\n\nHence we have laws against drunk driving.\n\n> I hate to say it but some of these laws are required to protect people from themselves.\n\nHow well are they working at doing that? Is locking someone up for drug use really the best fix for the problem?\n\n> I’m not a huge fan of just copy the system this or that country uses because that doesn’t take in consideration of cultural differences.\n\nOK.\n\n> Weed is legal in my country and most Americans I spoke with about it were surprised that weed users are looked down upon here.\n\nAs am I. Why do you look down on weed users? Who are they harming?\n\n> I think your stance is a bit too simple for how complex the problem is.\n\nMaybe. But, I think legalizing, taxing, and regulating drugs can do a lot of good.\n\nHow do you stop drug dealers from selling to kids? Put them out of business, make an age restriction, sell them only in pharmacies?\n\nHow do you stop accidental overdoses of drugs like heroin? Try having them made by companies that will produce a consistent quality and strength.\n\nHow do you really fight addiction? With programs that work funded by the tax dollars charged on the drugs themselves.\n\nMany more problems can be solved when everything is aboveboard instead of hidden and illegal and run by drug lords with fully automatic weapons.", "is_submitter": false, "distinguished": null, "created_utc": 1629295746.0, "parent_id": "t1_h9e2s8p", "replies": []}]}, {"author": "Upstairs_Ad_1126", "id": "h9cpzpv", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #32", "submission": "p6e27d", "stickied": false, "body": "This is the answer, every other option isn't based in reality. It's so obvious that this is the way.", "is_submitter": false, "distinguished": null, "created_utc": 1629245591.0, "parent_id": "t1_h9cfk5n", "replies": []}, {"author": "epicgabe01", "id": "h9cpbq9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #108", "submission": "p6e27d", "stickied": false, "body": "I'm not particularly well-informed about this topic, but I think you're onto something. Unfortunately, though, I don't see the US government ending the war on drugs because of privatized prisons and all the bullshit that comes with that.", "is_submitter": false, "distinguished": null, "created_utc": 1629245247.0, "parent_id": "t1_h9cfk5n", "replies": [{"author": "MisanthropicScott", "id": "h9cs7cc", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p6e27d", "stickied": false, "body": "Agreed that it cuts into the profits of the Prison Industrial Complex. But, that's just an extremely positive side effect.", "is_submitter": false, "distinguished": null, "created_utc": 1629246732.0, "parent_id": "t1_h9cpbq9", "replies": []}, {"author": "Cheomesh", "id": "h9drknr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6e27d", "stickied": false, "body": "Less than 10% of prisoners are in private prisons.", "is_submitter": false, "distinguished": null, "created_utc": 1629267952.0, "parent_id": "t1_h9cpbq9", "replies": []}]}]}, {"author": "Aunty_Polly420", "id": "h9crssv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #133", "submission": "p6e27d", "stickied": false, "body": "id legalise most, apart from stuff like meth and opioids which are a just detrimental to people and society.", "is_submitter": false, "distinguished": null, "created_utc": 1629246524.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "kindasortasalty", "id": "h9jd1ug", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #33", "submission": "p6e27d", "stickied": false, "body": "I am for it as well. It would have a much more positive effect than people are willing to admit", "is_submitter": false, "distinguished": null, "created_utc": 1629383820.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "dashingThroughSnow12", "id": "h9cn9b3", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p6e27d", "stickied": false, "body": "If drugs are legalized with say a 100-200% VAT tax or similar, I can be convinced to the side of legalization. That is similar to the mark up of say cigarettes and alcohol and other dangerous substances where I live.", "is_submitter": false, "distinguished": null, "created_utc": 1629244201.0, "parent_id": "t3_p6e27d", "replies": [{"author": "Cheomesh", "id": "h9drncd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6e27d", "stickied": false, "body": "Say \"no\" to sin taxes.", "is_submitter": false, "distinguished": null, "created_utc": 1629268015.0, "parent_id": "t1_h9cn9b3", "replies": []}, {"author": "MisanthropicScott", "id": "h9csdh7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p6e27d", "stickied": false, "body": "Agreed! And, happy ~~cake~~ brownie day.", "is_submitter": false, "distinguished": null, "created_utc": 1629246819.0, "parent_id": "t1_h9cn9b3", "replies": []}]}, {"author": "Walking_the_Cascades", "id": "h9cos1q", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #68", "submission": "p6e27d", "stickied": false, "body": "Legalize, not decriminalize. And treat health problems as health problems, not as an excuse to fill prisons. \n\nVictimless crimes should not be crimes.", "is_submitter": false, "distinguished": null, "created_utc": 1629244972.0, "parent_id": "t3_p6e27d", "replies": [{"author": "MisanthropicScott", "id": "h9csfj3", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p6e27d", "stickied": false, "body": "1000% agree!", "is_submitter": false, "distinguished": null, "created_utc": 1629246849.0, "parent_id": "t1_h9cos1q", "replies": []}]}, {"author": "RiderHood", "id": "h9d85sb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "p6e27d", "stickied": false, "body": "Legalize, tax, and educate.", "is_submitter": false, "distinguished": null, "created_utc": 1629254928.0, "parent_id": "t3_p6e27d", "replies": [{"author": "patricktoba", "id": "h9dchfc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #39", "submission": "p6e27d", "stickied": false, "body": "Much emphasis on the educate portion.", "is_submitter": false, "distinguished": null, "created_utc": 1629257335.0, "parent_id": "t1_h9d85sb", "replies": [{"author": "Alirezahjt", "id": "h9dribw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "p6e27d", "stickied": false, "body": "Just like we educated the people to take the vaccine... wait a second.", "is_submitter": false, "distinguished": null, "created_utc": 1629267897.0, "parent_id": "t1_h9dchfc", "replies": [{"author": "AlieanBreac", "id": "h9e4eut", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p6e27d", "stickied": false, "body": "We did educate people on the vaccine and the people who took it did fine. The people who refused have only themselves to blame for whatever happens to them. The same will hold true of drugs, which will serve a similar purpose in culling the herd. Perhaps that sounds heartless but it is the natural order. The fit replace the unfit.", "is_submitter": false, "distinguished": null, "created_utc": 1629279849.0, "parent_id": "t1_h9dribw", "replies": []}]}]}]}, {"author": "SybariteAussie", "id": "h9d9uyu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p6e27d", "stickied": false, "body": "Some research to discover less harmful & addictive social lubricants seems logical to me. If governments regulated & controlled the drug market it would have several benefits. Less deaths from toxic addictions that some ruthless people sometimes make. Government could see who was consuming & how much. They could then intervene at appropriate times. Take too many hallucinogens and you start wearing wizard robes & struggling with reality. LSD takes 13 years to leave your body. Experiment if you like, but not often. The profits could be used to assist guiding & rebuilding the broken people. Prohibition has failed every time it has been attempted. Cigarettes and alcohol get a pass but less harmful & addictive options are already available. Best to discourage recreational opioid usage as it has valuable medical use & is addictive. Animals also enjoy getting high or drunk. Have been filmed getting wasted. The only positive result from prohibition I can think of is when Tsar Nicholas banned vodka. His finances suffered. He sold Alaska to America in the real estate bargain of the century.", "is_submitter": false, "distinguished": null, "created_utc": 1629255850.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "andero", "id": "h9dn1qx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #167", "submission": "p6e27d", "stickied": false, "body": "I support legalization of all substances, not just illicit \"drugs\", but also medications.  Something like Hamilton Morris' stance: maybe there should be restrictions on radioactive materials, but otherwise, open it up.\n\nOn top of that, I think we should go for a **licensing model**.  \nThink about cars. They are legal, but extremely dangerous. How do we handle those? You need a license to drive one, and you can get driver's education that includes in-car training. I think that's a smart approach.  \n(Naturally the specifics for car licenses are going to be different in different places, but the analogy holds)\n\nAdditionally, I think we should need a **specific, class-based license** for drugs. This is for harm-reduction purposes.   \nAgain, think about cars. if you have a license to drive a regular car, you are not automatically qualified to drive a motorcycle, an 18-wheeler transport truck, or a school-bus. The different vehicles are different enough that you need specialized skills and additional training, which gets tested and accredited with the additional license.  \n\nI think we should do the same for drugs. The default normal license would be for alcohol, cannabis, and nicotine. You could have that training in high-school and have people take the test to get the basic license in high-school. That would act as an introduction to the legal system of drug licenses and you're on your way.  \nYou want to take psychedelics? Great, take the test for the license. If you want help to get it, go to \"user's education\" to learn more about the substances, then take the test. Same with stimulants, same with opioids, same with everything.  \nThere could also probably be a \"level 2\" license for administering and overseeing other people on a substance. For example, you want to be a psychedelic \"guide\"? Okay, take the psychedelic \"level 2\" license so you can administer them to other people. I think mandatory training makes sense here since you become responsible for other people under your care. \n\nThere would also be an exception for prescriptions: if your doctors wants you to take antibiotics, you don't need the license because you're operating under the doctor's guidance, which would probably be some kind of \"level 3\" license where you can prescribe to others, but are overseen by the College of Physicians or whatever body. This could also provide a mechanism for Clinical Psychologists (PhD) to prescribe medication without working with a Psychiatrist (MD).\n\nAdditionally, having the government agency that oversees regular medication also oversee the safe manufacture and distribution of substances would be key (e.g. the FDA in the USA). That would make substances pure, and it would undercut illegal markets that sell drugs to fund criminal organizations' other operations, which also avoid taxes.  \nNaturally, some kind of \"decriminalize nature\" thing would apply here as well: you could grow cannabis, mushrooms, poppies, cacti, etc. without issue, and you could grow them with the purpose of consumption so long as you've got the appropriate license to consume.\n\n\n\nYes, this would be a government program rather than free reign. I know some people hate that idea. My thinking is that this provides the best **pragmatic** option, even if the idealist might argue for \"cognitive liberty\". I don't disagree exactly, but I'm also a pragmatist when it comes to policy ideas.  \nThis license solution would make substance use (i) vastly safer through purity, (ii) vastly safer through education, (iii) vastly more available because of wider markets, and would have additional benefits of (iv) providing tax revenue that could directly fund safe-injection sites and addiction/rehabilitation programs (like how Fish & Game tags directly fund Fish & Game conservation efforts), and (v) undercut the economic power or criminal organizations engaged in way worse things that \"selling drugs\".\n\nPlus, there should be a program of appeals started where non-violent drug-related crimes, especially simple possession but also trafficking etc., should be fast-tracked for review and release/pardon.  \nNot a blanket because I get that sometimes police forces catch a violent criminal on a lesser charge so you don't just want to release everyone at once. Still, people in prison for \"crimes\" that should not be crimes should get fast-tracked for review to be released with expungement of their records.", "is_submitter": false, "distinguished": null, "created_utc": 1629264274.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "Arisdoodlesaurus", "id": "h9do363", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #102", "submission": "p6e27d", "stickied": false, "body": "All drugs should be de criminalized. Banning something just pushes it into an unregulated market where it is more prone to be abused", "is_submitter": false, "distinguished": null, "created_utc": 1629265086.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "ennovyelechim", "id": "h9dw7en", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "p6e27d", "stickied": false, "body": "In my small and unexpert opinion if they are decriminalised then you could go to a pharmacy to get an untainted and safe dose. The problem with the party drugs is you can never be sure of the dose and what it's been cut with. If it was done in a clinical setting then safety information could be given, hydration etc at the point of sale. I've never taken ecstasy, mdma or LSD but if someone is going to experiment at least it should be made as safe as it can be. As for weed if a person can be bothered to grow a plant for personal use then crack on with it, the stronger strains should be dispensed like the party drugs. I'm nearly 50 now and the war on drugs was declared when I was at school, it hasn't worked we need new thinking on this. Addicts are ill, it should be treated as an illness the same way alcoholism is. Tax from the legally prescribed drugs could pay for this. Opioids are more tricky but let's face it in the US the opiod crisis was brought on by big pharma they made billions they should pay for therapy for the poor souls who got addicted by doctors after having accidents and being put on opiods long term when they should only be administered for short term use. We already have programs for people addicted to opiods this should be expanded with the tax on over the counter drugs. Like I said we've being tying to defend this hill from illegal drugs for over 30 years, the casualties are uncountable in wasted lives its time to cut the criminal element out of the equation and find a new way forward.", "is_submitter": false, "distinguished": null, "created_utc": 1629272058.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "metalhev", "id": "h9f1a4i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p6e27d", "stickied": false, "body": "Criminalization makes a lot of sense. If I was the boss of a drug cartel, I too would lobby the government to make it harder for competition to grow, drive supply down and prices up.  \nIt's kind of obvious.", "is_submitter": false, "distinguished": null, "created_utc": 1629299790.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "TommyWiseau22", "id": "h9dm4v4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "p6e27d", "stickied": false, "body": "The only drug I need is this hot, hip new street dig called Borth Sampson", "is_submitter": false, "distinguished": null, "created_utc": 1629263581.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "iamgarlic", "id": "h9dwpjy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #129", "submission": "p6e27d", "stickied": false, "body": "My life is fine without them and I've seen many people's lives get worse with them but that's just anecdotal and the data suggests that there are plenty of successful and stable people using soft drugs. All considered, I'm still on the fence.", "is_submitter": false, "distinguished": null, "created_utc": 1629272529.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "logoyahoo", "id": "h9f9key", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #80", "submission": "p6e27d", "stickied": false, "body": "As I observe the incredible rise of homelessness in my state and the way many of the homeless behave on the streets, crippling drug addiction and mental illness seems to be quite prevalent among them. I can’t help but wonder if many of them would be better off if they had been imprisoned for rampant drug abuse or placed in a mental facility for severe mental impairment. At least they’d be off the street and receiving direct support.", "is_submitter": false, "distinguished": null, "created_utc": 1629303494.0, "parent_id": "t3_p6e27d", "replies": [{"author": "PhilboBaggins111", "id": "h9fc6sw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "p6e27d", "stickied": false, "body": "What support do you imagine they would be receiving in prison? Are you aware that drug users problems often worsen when they are sent to prison? Partially because they are surrounded by other drug offenders and the fact that prisons are rampant with drugs. \nI beleive these people would be far better off in treatment programs and harm reduction practices which we could fund with the money we are currently using to imprison them and make their lives far worse.", "is_submitter": true, "distinguished": null, "created_utc": 1629304651.0, "parent_id": "t1_h9f9key", "replies": []}]}, {"author": "FiannaTheBard", "id": "h9fcddc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #196", "submission": "p6e27d", "stickied": false, "body": "I mean, maybe slightly regulated? Has worked well with weed in a lot of places.", "is_submitter": false, "distinguished": null, "created_utc": 1629304731.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "rafaellvandervaart", "id": "h9i7cei", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p6e27d", "stickied": false, "body": "Portugal's experiment with decriminalization of all drugs was a huge success", "is_submitter": false, "distinguished": null, "created_utc": 1629356366.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "Stand_kicker", "id": "h9ctls6", "score": -4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "p6e27d", "stickied": false, "body": "Nope. Completely eradicate all recreational drugs including cigarettes and alcohol. Too many adverse effects, even if it's just the minority that abuse them. \n\nAnyway, thats all I'm gonna say on this incredibly complex issue.\n\nP.S. Yes. You are biased. And your reasons selfish. No holistic thinking.", "is_submitter": false, "distinguished": null, "created_utc": 1629247455.0, "parent_id": "t3_p6e27d", "replies": [{"author": "Pleaseusesomelogic", "id": "h9d0b2i", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p6e27d", "stickied": false, "body": "“Eradicate all recreational drugs”. LOL. \n\nThis is not a complex issue. People have been using drugs for recreational use since the dawn of time.  This might be the hottest take of all time.", "is_submitter": false, "distinguished": null, "created_utc": 1629250865.0, "parent_id": "t1_h9ctls6", "replies": []}, {"author": "PhilboBaggins111", "id": "h9d5s5e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "p6e27d", "stickied": false, "body": "Honestly I can't even tell if you are being sarcastic. But if not, you do not seem like a thoughtful, reasonable person.\n\nI would love for you to elaborate though, if you mean what you say. I wanted more dissenting opinions when I asked. Turns out most people agree with me on this sub, but I am fascinated with the opinions of people who actually think like this.\n\nP.S. Everyone is biased, at least I can admit it. No, my reasons are not selfish, they do not stem from a desire to legally do all the drugs I want. If I want to do a drug, I'll do it. Simple as that. I do wish for humanity to better itself though. Prohibition is clearly not the correct rout as it simply does not work, anywhere it has been applied, anytime throughout history. People will do what they want. If you cannot see that you are clearly the one who lacks holistic thinking.", "is_submitter": true, "distinguished": null, "created_utc": 1629253667.0, "parent_id": "t1_h9ctls6", "replies": []}, {"author": "Cheomesh", "id": "h9drpf1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p6e27d", "stickied": false, "body": "That'll totally work.  No one has ever tried that before.", "is_submitter": false, "distinguished": null, "created_utc": 1629268064.0, "parent_id": "t1_h9ctls6", "replies": []}, {"author": "brian9000", "id": "h9dplhm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p6e27d", "stickied": false, "body": "What do you even mean by holistic thinking?", "is_submitter": false, "distinguished": null, "created_utc": 1629266290.0, "parent_id": "t1_h9ctls6", "replies": []}]}, {"author": "Concrete_Grapes", "id": "h9cwnim", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "p6e27d", "stickied": false, "body": "Sure, sarms, peds and steroids should totally be decriminalized.   \n\n\nI think that there should be a shift to seeing addiction as a mental health issue, rather than a criminal one. Get busted on an OD?--get a court date where you have to come on in and talk to a judge, and get assigned a healthcare person or counselor that can direct you to resources, and make you aware they exist, but NOT come with the obligation that you seek treatment. It should be a 'make you aware you dont have to die' sort of deal, rather than a punishment.   \n\n\nI think dealing and selling drugs outside of a certified structure to do so should still be criminal. That's how people die--thinking they bought oxy's and end up taking fentanyl. I've even got ahold of pot that had been laced in shit that was not OK--so, the 'wild west' of decriminalization would be a step too far, but the punishment of end-users should stop.   \n\n\nIf there's no victim, if it's a self contained problem, it shouldnt be a crime. We shouldnt be legislating personal morality on that level.", "is_submitter": false, "distinguished": null, "created_utc": 1629249021.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "jmcsquared", "id": "h9dp5ys", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "p6e27d", "stickied": false, "body": "I wouldn't care at all and would agree with you... if drugs weren't addictive. \n\nYou said drug usage doesn't feel morally reprehensible. Obviously, because you use them and (apparently) suffer no unintended consequences. I drink sometimes, and I'm just fine. \n\nThe issue is, too many people don't have nearly as much control over themselves as they like to think. Conscientiousness and mindfulness are unfortunately not that common.\n\nThe fact that drugs can and do ruin so many people's lives makes me skeptical. Of course, I don't think they should be criminalized, at least the way we're doing it now. But that's because what we're doing now is *punitive justice* \\- punishment. Whereas, what we need to be doing is *rehabilitative justice -* healing people who've harmed themselves, often unwittingly. We need resources to be funneled away from the drug war and towards rehabilitation programs. Then, and only then, will decriminalization of drugs work the way its intended to.", "is_submitter": false, "distinguished": null, "created_utc": 1629265938.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "AlieanBreac", "id": "h9e441q", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p6e27d", "stickied": false, "body": "The only reason to continue criminalizing them is to feed the prison industrial complex a steady stream of warm bodies at the price of empowering the cartels, whom we have turned into collective billionaires. That's the situation we currently have and it sucks.", "is_submitter": false, "distinguished": null, "created_utc": 1629279571.0, "parent_id": "t3_p6e27d", "replies": []}, {"author": "arokace", "id": "h9ecsac", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p6e27d", "stickied": false, "body": "Decriminalization yes, but if a cop finds you doing them or what ever you still get arrested in a sense.. Just instead of going to jail which provides no criminal with help.  You get sent somewhere where you can get help.  When I was doing drugs I heard so many stories of finding new hookups, advice, etc for the drug world.  Jail never helps the criminal...", "is_submitter": false, "distinguished": null, "created_utc": 1629286756.0, "parent_id": "t3_p6e27d", "replies": [{"author": "Kweldulf", "id": "h9eskao", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "p6e27d", "stickied": false, "body": "The thing is not all drug users require help. You don't need help if you have a few beers once a week, just as you don't need help if you take acid once in a few months. A cop has no business or authority (medical knowledge) necessary to diagnose addiction. The only drugs for which it would work are heavy opiates (e.g. heroin), which cause strong psycho-chemical addiction.", "is_submitter": false, "distinguished": null, "created_utc": 1629295723.0, "parent_id": "t1_h9ecsac", "replies": [{"author": "arokace", "id": "h9fs609", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #48", "submission": "p6e27d", "stickied": false, "body": "Coming from an addict in recovery... Opiates are far from the only drug one can be addicted to.  And you must certainly can be addicted to psychedelics.  I know you didn't say using acid every day.  But people can even be addicted to weed, I've seen it before.", "is_submitter": false, "distinguished": null, "created_utc": 1629311714.0, "parent_id": "t1_h9eskao", "replies": [{"author": "Kweldulf", "id": "h9g9ieq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "p6e27d", "stickied": false, "body": "I don't claim that opiates are the only drug causing addiction. One can be addicted to virtually anything which relates to dopamine or serotonin release in brain. Running, internet, caffeine, driving, weed, psychedelics, hell even drinking juice for some people. This is why I specified psycho-chemical addiction. One dose of heroin causes a person to be addicted, this is not a psychological mechanism, but a psycho-chemical one. A person after one dose of heroin will undergo withdrawal symptoms and (in general) is already in need of rehab. This is precisely why the overuse of opiates in the US is taking such a dramatic toll on the population.\n\nOne cannot be psycho-chemically addicted to weed or psychodelics. It's a different mechanism. Don't get me wrong weed addiction is just as serious, however it is harder to acquire it. It requires regular, often habitual use of the substance and whether or not a person will actually end up addicted still strongly varies between individuals.\n\nNot every addiction is the same. People who become addicted to running still undergo mild withdrawal symptoms and what is more tend to run to the point its detrimental to their health (Chapman, de Castro; 1990). People who become addicted to weed or psychodelics run a higher risk of developing schizophrenia for example (Hjorthoj; 2021). But its not guaranteed that a user will become an addict. This is why I said that a cop has no authority to decide if someone should go to rehab. We don't put every person who enjoys the runner's high to rehab, and we shouldn't do that for people who use weed. For people who take strong opiates this option would be viable. Which is what I expressed in my previous comment, as it seems you misread it.\n\nI come from a family where addiction is a high risk, and I've studied the subject extensively taking psychology and neurochemistry courses at my local uni. Addiction sucks, but the only way to tackle it properly is to first be informed.", "is_submitter": false, "distinguished": null, "created_utc": 1629319482.0, "parent_id": "t1_h9fs609", "replies": []}]}]}]}, {"author": "Summonest", "id": "h9evgbn", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #44 | Classis Veritatus", "submission": "p6e27d", "stickied": false, "body": "Decriminalization has worked for pretty much everyone who has tried it.  The fact that the USA won't do it is because of stupid politics.", "is_submitter": false, "distinguished": null, "created_utc": 1629297096.0, "parent_id": "t3_p6e27d", "replies": []}]}