{"title": "MMA tonight. (Sat) Guida-Madsen fight looked fake/staged.", "name": "t3_p969fe", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p969fe/mma_tonight_sat_guidamadsen_fight_looked/", "selftext": "Especially the third round. Literally zero significant strikes landed in the third round. It legitimately looked like they were sparring and not trying to hurt each other.  There was like 12 strikes in a row from Guida who was literally just tapping Madsen. Honestly no force at all behind any of the strikes. There were a lot of big Roundhouse strikes thrown, but none of those even came close to landing on either side. I think this was staged.", "score": 1, "upvote_ratio": 0.6, "permalink": "/r/TheFlyingTree/comments/p969fe/mma_tonight_sat_guidamadsen_fight_looked/", "id": "p969fe", "author": "Pleaseusesomelogic", "link_flair_text": "Debate", "num_comments": 3, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629607575.0, "comments": [{"author": "Karrion8", "id": "h9z9v3w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p969fe", "stickied": false, "body": "I watched the fight, but I don't think it was fake.  I think it was a shitty match.  \n\nGuida did everything he could to not get taken down to the mat. While he's won with submission, he's also lost a lot due to being submitted.  He estimated he had no chance with Madsen on the ground.  \n\nLikewise, Madsen really either can't strike or is gun shy because of his broken jaw. I mean he was pretty much only throwing his left and kept his guard with his right almost the whole fight. Which you think Guida would have figured out a way to take advantage of that.  \n\nExcept for the times where Madsen held out his right hand and for some reason Guida kept hitting it.  Weird.  It's like they were touching gloves through the whole thing.  \n\nMadsen just stood there the whole time trying to find a way to trap Guida.  I haven't seen his other fights, but he seems like a one trick pony.  Get them to the ground.  He has poor timing and poor reactions to punches simply because he just stands there.  A couple times you can see Madsen go to punch and fail to commit.  By the time he starts to punch, Guida was already out of range.  \n\nThey both kept punching air because they really didn't engage.  Not a great match.  \n\nIf they could both lost by decision it would have been better.  Frankly, I think Guida landed more interesting hits and really controlled the fight.  Not sure he should have lost that decision. Neither one came into that fight with any guts.  They played it safe and had a lukewarm, at best, bout.", "is_submitter": false, "distinguished": null, "created_utc": 1629681636.0, "parent_id": "t3_p969fe", "replies": [{"author": "Pleaseusesomelogic", "id": "h9zkmc6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p969fe", "stickied": false, "body": "It did feel weird. But there were a lot of kicks that were not meant to do any damage at all. And all of the supposedly offensive big swings in air. Looked like they were not trying to connect. I don’t know.\n\nThis seems significantly different from all the fights that I’ve watched. And I’ve watched hundreds. \n\nJust saying\n\nAgree it was a shite fight. Both should lose.", "is_submitter": true, "distinguished": null, "created_utc": 1629687047.0, "parent_id": "t1_h9z9v3w", "replies": []}]}, {"author": "Pleaseusesomelogic", "id": "h9vjg9d", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p969fe", "stickied": false, "body": "I just re-watched the third round.  There were maybe five legitimate leg kicks. Zero punches landed. This was a fake fight.", "is_submitter": true, "distinguished": null, "created_utc": 1629608247.0, "parent_id": "t3_p969fe", "replies": []}]}