{"title": "Are the weather person in New Orleans just said the school will be out for two more days. Meaning school will be in session on Thursday?WTF?", "name": "t3_pewlf0", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pewlf0/are_the_weather_person_in_new_orleans_just_said/", "selftext": "Oh why are parents so obsessed with kids missing a couple of school days?  When I was a youngster, my dad wanted me to skip a school day and go to a baseball game. (To this day still one of my favorite days). My mom was all worried that I would fall behind in school. \n\nMy question is, how do parents not remember how monotonous and boring school actually is.  Missing 1 day of school means NOTHING. Missing two or three days of school literally does nothing to hinder any progress. Hell you could probably get by with missing a whole month and still be able to catch up in a couple of days.", "score": 4, "upvote_ratio": 0.75, "permalink": "/r/TheFlyingTree/comments/pewlf0/are_the_weather_person_in_new_orleans_just_said/", "id": "pewlf0", "author": "Pleaseusesomelogic", "link_flair_text": "Discussion", "num_comments": 10, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630375862.0, "comments": [{"author": "justausername22222", "id": "hb0cub5", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "pewlf0", "stickied": false, "body": "\n\nYou seem to be viewing it from the kids' perspective but I think the decision was also made from the perspective of freeing up adults to do whatever they need to do to recover from the flood and get back to things. Having kids in school frees up parents to go to work, arrange home repairs, etc without worrying about taking care of the kids all day.", "is_submitter": false, "distinguished": null, "created_utc": 1630377122.0, "parent_id": "t3_pewlf0", "replies": [{"author": "PalatableNourishment", "id": "hb3gnq7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "pewlf0", "stickied": false, "body": "On top of this, schools often provide food and safety for underprivileged children. Some kids can’t count on their parents to provide them 3 meals a day, or heating in the winter/cooling in the summer. At least the time at school is a reprieve from that. And in the cases where child abuse is happening, it’s often teachers at school that notice the signs.", "is_submitter": false, "distinguished": null, "created_utc": 1630438634.0, "parent_id": "t1_hb0cub5", "replies": []}, {"author": "LooseDoctor", "id": "hb0uz7p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #292", "submission": "pewlf0", "stickied": false, "body": "This. Handling the countless appointments that come with natural disaster clean up is a lot easier without a kid in tow.", "is_submitter": false, "distinguished": null, "created_utc": 1630387307.0, "parent_id": "t1_hb0cub5", "replies": []}]}, {"author": "amaznlps", "id": "hb3x7rd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #235", "submission": "pewlf0", "stickied": false, "body": "Aside from emergency services schools are a top priority during any disaster. Schools being operational, even in limited capacity, brings a sense of normalcy and structure during otherwise hugely stressful and disruptive situations. It's part of the psychology of disaster management.", "is_submitter": false, "distinguished": null, "created_utc": 1630445428.0, "parent_id": "t3_pewlf0", "replies": [{"author": "Pleaseusesomelogic", "id": "hb5bkzu", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "pewlf0", "stickied": false, "body": "Cool theory. Doubt civic leaders think that far into it. \n\nAlso, do you think the schools have power?? So to counter everybody’s arguments above, nobody has power. Including schools.  All of the schools were flooded just like every other house and business in the area.  \n\nHowever, so glad to have comments about hurricanes from people in Oklahoma and Minnesota. Thanks for your input.", "is_submitter": true, "distinguished": null, "created_utc": 1630469011.0, "parent_id": "t1_hb3x7rd", "replies": [{"author": "amaznlps", "id": "hb5nvj9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #235", "submission": "pewlf0", "stickied": false, "body": "Why do you doubt civic leaders think that far into it?  In your post you say they're speaking about this, and where do you think I learned this information?  School restoration is absolutely part of disaster planning that municipalities prepare for.  \n\nSchool might not look like traditional school, but a safe space where any children left in town can gather with a shool official, educator, supportive parents, etc. That can help children through the trauma of disaster.  Maybe this just looks like a mixed age group of kids drawing and talking about their experiences for a few hours during the week. Community leaders and educators alike are typically trained to listen and help in these types scenarios- they'll probably be ensuring children present have had lunch, have water, and gathering information about the child's environment to ensure they're safe, reaching out with resources to families, etc. \n\nIf you've never taken a CERT course I'd recommend you (everyone) look into one. They're community based emergency response team courses. They're typically taught by your local emergency or city officials. The aim is to teach basic emergency first aid, and introduce community members ideas that enable them to be more effective to their community in an emergencies. Part of this training typically includes outlining what the city's plan is, which will include getting some semblance of school operational- it's usually quite high on the list.", "is_submitter": false, "distinguished": null, "created_utc": 1630477046.0, "parent_id": "t1_hb5bkzu", "replies": []}]}]}, {"author": "iloveregex", "id": "hb15x18", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #148", "submission": "pewlf0", "stickied": false, "body": "Maybe 5 years ago there was such a big snowstorm where I live that we were out of school for a whole week!!", "is_submitter": false, "distinguished": null, "created_utc": 1630395939.0, "parent_id": "t3_pewlf0", "replies": []}, {"author": "SybariteAussie", "id": "hb1g6vq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pewlf0", "stickied": false, "body": "🔮 Soon teachers could be culled & replaced by iPad/tablets,for the fiscally challenged children. Private schools will pick the best teachers & big tech replace the bulk of Police, citizens phones behave as detectives & alert authorities if someone requires scrutiny? 🤔. Hope things are going well in Wyoming! No explanation for my fondness for Wyoming? I do like the way the word sounds, but in Summer in Australia. It’s snowing in Wyoming.🖖", "is_submitter": false, "distinguished": null, "created_utc": 1630405001.0, "parent_id": "t3_pewlf0", "replies": []}, {"author": "CamelBorn", "id": "hb1vrez", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #186", "submission": "pewlf0", "stickied": false, "body": "In Australia, you have the gov get involved if the kid misses too much school. If they say its a school day and the kid doesnt go, you eventually have social services or similar knocking on your door. It does not go well to have kids out of school.\n\nI agree with the others, send the kids back where they can be ‘normal’ and give the others a chance to sort things out.", "is_submitter": false, "distinguished": null, "created_utc": 1630414754.0, "parent_id": "t3_pewlf0", "replies": [{"author": "Pleaseusesomelogic", "id": "hb5btom", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "pewlf0", "stickied": false, "body": "Yes, every normal school system has that kind of government oversight. But it doesn’t happen over four absences over three months. It Has to show a pattern of absences.  Obviously.", "is_submitter": true, "distinguished": null, "created_utc": 1630469148.0, "parent_id": "t1_hb1vrez", "replies": []}]}]}