{"title": "Yet another reason I do not need weather news.", "name": "t3_p4ltxf", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p4ltxf/yet_another_reason_i_do_not_need_weather_news/", "selftext": "I am equally proficient at looking at a satellite every day and discerning what weather will be in the next few days or hours.  I have as much information as they do. Perhaps I don’t have the training but how much training do you need to see a storm on a radar.  \n\nBut to be so wrong about the path of a potential hurricane is egregious.  They are currently wrong by about 900 miles on the path of potential hurricane Fred. To continue to give credence to these idiots is shameful.  \n\nSure they can provide a little insight into forming tropical situations but to think that they know what the fuck they are doing with respect to what is going to happen is foolish. They have no fucking clue.\n\nJust look at your weather app and you’ll know as much as they do.", "score": 0, "upvote_ratio": 0.33, "permalink": "/r/TheFlyingTree/comments/p4ltxf/yet_another_reason_i_do_not_need_weather_news/", "id": "p4ltxf", "author": "Pleaseusesomelogic", "link_flair_text": "Discussion", "num_comments": 27, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628997071.0, "comments": [{"author": "Muroid", "id": "h91e38x", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p4ltxf", "stickied": false, "body": "I mean, yeah. It’s meteorologists who put the information on the weather app. Of course you can check the app that they are updating with all the information they have and know as much as they do. They’re literally telling you what they know. It’s just a different format, not different information or people.", "is_submitter": false, "distinguished": null, "created_utc": 1629040215.0, "parent_id": "t3_p4ltxf", "replies": [{"author": "Pleaseusesomelogic", "id": "h93m2w2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "I am saying I don’t need any of their information. All I need is a radar and it’s easy to predict as accurately as any weather person out there.", "is_submitter": true, "distinguished": null, "created_utc": 1629075485.0, "parent_id": "t1_h91e38x", "replies": []}]}, {"author": "justausername22222", "id": "h8zmo4d", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "p4ltxf", "stickied": false, "body": ">They are currently wrong by about 900 miles on the path of potential hurricane Fred.\n\nWhere do you think it's going to go? \n\nIf the experts' predictions turn out to be largely correct would you feel at all humbled?", "is_submitter": false, "distinguished": null, "created_utc": 1628997333.0, "parent_id": "t3_p4ltxf", "replies": [{"author": "shig23", "id": "h8zob2o", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "p4ltxf", "stickied": false, "body": "I somehow doubt that \"humbled\" is in this person’s vocabulary, except for use on others.", "is_submitter": false, "distinguished": null, "created_utc": 1628998243.0, "parent_id": "t1_h8zmo4d", "replies": [{"author": "Pleaseusesomelogic", "id": "h8zqpsv", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "See my response below. “humbled” in response to my opinion of storm path predictions. Lol. I also severely doubt that I will be humbled by storm path predictors.", "is_submitter": true, "distinguished": null, "created_utc": 1628999623.0, "parent_id": "t1_h8zob2o", "replies": []}]}, {"author": "Pleaseusesomelogic", "id": "h8znq52", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "This is a stupid question. I don’t get paid to predict storm paths. But I can see that other people who do get paid to predict these paths are ridiculously incorrect.\n\nYou are falling into the common fallacy of, if you can’t do it how can you criticize others.  The obvious and easy answer is that you can critique someone else in their performance without being able to do that specific job or skill.", "is_submitter": true, "distinguished": null, "created_utc": 1628997916.0, "parent_id": "t1_h8zmo4d", "replies": [{"author": "justausername22222", "id": "h8zp00c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "p4ltxf", "stickied": false, "body": ">The obvious and easy answer is that you can critique someone else in their performance without being able to do that specific job or skill.\n\nOkay, but where do you think the storm is going to go? You just said that their prediction is 900 miles off. Presumably there's some sort of basis for that claim. So where's it going to end up?", "is_submitter": false, "distinguished": null, "created_utc": 1628998627.0, "parent_id": "t1_h8znq52", "replies": [{"author": "Pleaseusesomelogic", "id": "h8zpt53", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "Yeah. I looked at their prediction. And then I looked at their prediction a few days later. It’s 900 miles from where they said it was going to be.\n\nHow are you confusing this as to whether where I think the storm is going to go? I don’t get paid to predict storms nor do I predict storms at all. I only looked at their prediction and correctly deduced that they were wrong by at least 900 miles. It has nothing to do with where I think the storm may go.", "is_submitter": true, "distinguished": null, "created_utc": 1628999094.0, "parent_id": "t1_h8zp00c", "replies": [{"author": "145676337", "id": "h8ztty1", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #116", "submission": "p4ltxf", "stickied": false, "body": "You've admitted your busy googling weather things. I don't know much but the little I know makes me realize there's a metric shit ton of things to consider. So they consider all of those for the first minute/hour into the future. Then they do that again and again and again. They've certainly improved but the sheer complexity of predicting weather exactly is still beyond us past a certain point (a few days I believe).\n\nThey could tell a storm was developing, they could tell the intensity it was roughly going to develop to, they could tell it would likely make landfall. Heck, they made a rough guess where it would and missed but could certainly have missed more.\n\nYou're absolutely right that you can get the weather from your phone and it's basically the same thing. Not everyone can or wants to do that. Some people like seeing the person. So yeah, you don't need it but others do so just ignore it? Like, it's not hard not to watch a single TV channel.", "is_submitter": false, "distinguished": null, "created_utc": 1629001491.0, "parent_id": "t1_h8zpt53", "replies": [{"author": "Pleaseusesomelogic", "id": "h8zwmoz", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "I have no idea what your argument is. You kind of seem to agree with me. At the end you say I’m right but not everybody wants to (paraphrasing) look at the Internet like I am suggesting. \n\nThat’s generational.  (Kind a like 70-year-olds don’t like to text or email) In 30 years everybody will simply look at their phone for the weather. (Or whatever popular tech is at that time) \n\nEverything evolves. I’m simply predicting the weatherman will cease to exist. I don’t know why that’s controversial.", "is_submitter": true, "distinguished": null, "created_utc": 1629003234.0, "parent_id": "t1_h8ztty1", "replies": [{"author": "ianovic69", "id": "h90lvz2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #216", "submission": "p4ltxf", "stickied": false, "body": ">In 30 years everybody will simply look at their phone for the weather.\n\nThere's a good chance I'll be gone by then but I think there's also a good chance that almost everyone else will be gone as well. \n\nIf I had to guess, I'd say that the weather will be somewhat predictable by then. Long periods of lethal heat followed by long periods of devastating storms. \n\nGlobal warming is going to seriously effect climate change within fifty years. We've already passed some of the major tipping points that we can now only hope to mitigate.\n\nIf there's anyone around beyond that, I doubt there will be much time to do anything except survive. You won't be getting the weather forecast on your phone. \n\nI give the human race 100 years, tops. That's being optimistic. \n\nOf course I hope I'm wrong. And for the record, on behalf of my Generation X cohorts, I apologise without reservation.", "is_submitter": false, "distinguished": null, "created_utc": 1629023585.0, "parent_id": "t1_h8zwmoz", "replies": []}]}]}]}]}]}, {"author": "Pleaseusesomelogic", "id": "h8zo97s", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "The other answer is the weatherman/women are becoming obsolete. They are currently obsolete with respect to day to day weather but are still on the news because old people expect it. The News weather person will die out faster than the eight track.", "is_submitter": true, "distinguished": null, "created_utc": 1628998214.0, "parent_id": "t1_h8zmo4d", "replies": []}]}, {"author": "BasilDream", "id": "h8zms3u", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #163 | Classis Veritatus", "submission": "p4ltxf", "stickied": false, "body": "And it seems there are no repercussions for their terrible forecasting.  They just say...welp, we really missed that one!  And then go on.", "is_submitter": false, "distinguished": null, "created_utc": 1628997395.0, "parent_id": "t3_p4ltxf", "replies": []}, {"author": "Rude_Ladder_9474", "id": "h90dlwh", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #266", "submission": "p4ltxf", "stickied": false, "body": "Less accurate than coin flip", "is_submitter": false, "distinguished": null, "created_utc": 1629016223.0, "parent_id": "t3_p4ltxf", "replies": []}, {"author": "Alatain", "id": "h93gqz2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p4ltxf", "stickied": false, "body": "I would hazard a guess that you have not taken any actual courses in meteorology. \n\nA lot of the issue with people having the opinion that meteorologists are always so wrong, is the implicit bias to only notice things when they are out of the ordinary. A weather reporter could be spot on 80% of the time, and you only take note when they get it wrong. So you get pissed about those times when they steered you wrong and ignore every time they were right and you did not take note.", "is_submitter": false, "distinguished": null, "created_utc": 1629072866.0, "parent_id": "t3_p4ltxf", "replies": [{"author": "Pleaseusesomelogic", "id": "h93l15r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "It’s actually the complete opposite. It’s not what they get wrong. It’s how much we agree. I can easily predict the weather just by looking at a radar as well as any meteorologist.  I am in Florida and I think that even makes it easier.  However, I believe most regions have seasonal weather patterns that are fairly easy to predict. It’s possible that most people aren’t smart enough or observant enough to realize this.", "is_submitter": true, "distinguished": null, "created_utc": 1629074961.0, "parent_id": "t1_h93gqz2", "replies": [{"author": "Alatain", "id": "h93qvf3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p4ltxf", "stickied": false, "body": "What radar are you using? Can you link something? Because if it is an app that is giving you info from a weather service, I hate to break it to you, but that is being built by meteorologists that are able to take the actual raw data and put it into a form that the layperson can understand. \n\nAgain, I ask, have you actually taken a course that explains how weather models and the \"radar\" data you see is plotted? It is a bit more complicated than you seem to be making it out to be. \n\nI could be wrong, and you might be a weather-protégé, but just looking at the maps that the weather app gives and making a guess is not meteorology.", "is_submitter": false, "distinguished": null, "created_utc": 1629077873.0, "parent_id": "t1_h93l15r", "replies": [{"author": "Pleaseusesomelogic", "id": "h93urgv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "I’m not a weather protégé. I can just use some logic, apparently better than some others. It’s not hard to look at the radar and see when it’s going to rain. Combine that with literally just stepping outside of your door and if you see rain clouds you might deduce that it might rain soon.\n\nAny app with radar will do. Those are not generated by meteorologists. There’s satellites in space that beams down information to my computer letting anybody see rain and clouds. (As well as Doppler radar) As well as movement over time.   \n\nI haven’t watched a weather person forecast on TV for at least 15 years. How did I even survive?", "is_submitter": true, "distinguished": null, "created_utc": 1629079799.0, "parent_id": "t1_h93qvf3", "replies": [{"author": "Alatain", "id": "h93xfsg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p4ltxf", "stickied": false, "body": "If you don't mind please link what radar source you use in your predictions. Better yet, if you can provide a radar source, and your five-day prediction based solely on the raw data, that would be a really good scientific comparison against similar meteorological predictions.", "is_submitter": false, "distinguished": null, "created_utc": 1629081144.0, "parent_id": "t1_h93urgv", "replies": [{"author": "Pleaseusesomelogic", "id": "h93yp2b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "What are you talking about. Just go look up a weather radar. They’re all the same. It’s probably going to rain tomorrow in Florida. There is my prediction. Let’s see if I’m right.\n\nBut we’re missing the point here. The real point is that even if someone was 100% correct in predicting the weather, It wouldn’t change anything for anybody’s day-to-day activities.  The point is not about being correct, it’s about being irrelevant. We don’t need meteorologist at all. We’ve just been conditioned to watch the weather. We simply don’t need to. Nothing is going to change.", "is_submitter": true, "distinguished": null, "created_utc": 1629081778.0, "parent_id": "t1_h93xfsg", "replies": [{"author": "Alatain", "id": "h941mwn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p4ltxf", "stickied": false, "body": "The weather radar displays that you are citing are literally the product of meteorologists interpreting the raw data and creating a graphic that you then get to \"reinterpret\" to make a \"prediction\". \n\nGo get some raw data from the NOAA radar or satellite data and make a five-day prediction. We can then compare it against a trained meteorologist.", "is_submitter": false, "distinguished": null, "created_utc": 1629083273.0, "parent_id": "t1_h93yp2b", "replies": [{"author": "Pleaseusesomelogic", "id": "h9441wg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "A. No it’s not. It’s just a radar. Meteorologists have nothing to do with this.\n\nB. The secondary point is that even if they were 100% correct, It would not change anything in anybody’s day-to-day activities.(except in the event of a hurricane, which anybody can see it coming on the radar and does not need a weather person to displaying it)\n\nC. It’s exactly like traffic news. Sure to the uneducated, that seems helpful. But it really isn’t to 99.9% of the people listening to traffic news. It may let you know early that a traffic jam is coming up but it is not actionable or helpful information. You’re still going to stay on the highway because there’s no other viable option. That doesn’t help or change anybody’s actions.  \n\nD. As I think about it now, traffic reporting is substantially like weather reporting. Even if they are 100% correct it doesn’t help or change anybody’s day.\n\nE. Everybody wants to challenge if I’m as correct as a Weather Person. The whole point is it doesn’t matter. It’s not gonna change anything in your day today life.  They do not provide any usable service whatsoever.", "is_submitter": true, "distinguished": null, "created_utc": 1629084568.0, "parent_id": "t1_h941mwn", "replies": [{"author": "Alatain", "id": "h945xu3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p4ltxf", "stickied": false, "body": "Then once again. I ask you to please link this raw data radar information you are using for your predictions. Then based solely on this data make a five-day prediction. \n\nWe can then compare that to actual meteorologists and their predictions. Then we can see if there is any \"useable service whatsoever' that they could provide over your \"predictions\".", "is_submitter": false, "distinguished": null, "created_utc": 1629085603.0, "parent_id": "t1_h9441wg", "replies": [{"author": "Pleaseusesomelogic", "id": "h948v76", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "Twice again. Let’s say it’s going to rain for the next 10 days every single day.  And I am 100% correct. What would you do differently? It’s not going to change anything that you would do day to day. Because the reality is in Central Florida it is going to rain every single day for 75 days in a row. The meteorologist predict every single day that it’s going to rain. And it doesn’t change anybody’s life at all. Nobody does anything differently. The prediction could be 100% correct but it’s not helpful. \n\nBy the way, I live in Central Florida, and I think it has rained every day for the last 75 days. And the predictions were that it rains every single day for the last 75 days. Nobody has altered their behavior at all. Therefore those 100% predictions don’t mean anything. Anybody can look at the radar and see that it’s going to rain every single day.  And still nobody modifies their habits or does anything differently at all. So those predictions aren’t helpful to anyone. \n\nSo, even if meteorologists are 100% correct, it does not mean anything and nobody alters their day to day activities based on that. Therefore meteorologist predictions don’t mean anything. They are not helpful or useful.\n\nAnd to the specific idiot who keeps asking me about my predictions. It’s going to rain for the next hundred days in Florida. Go buy a fucking umbrella. Other than that it’s not going to change anything. That is why we don’t need daily rain predictions. They mean fucking 0.", "is_submitter": true, "distinguished": null, "created_utc": 1629087295.0, "parent_id": "t1_h945xu3", "replies": []}]}, {"author": "Alatain", "id": "h946i0k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p4ltxf", "stickied": false, "body": "And another aside, I used the weather service in my area today to plan my crop watering on an hourly basis.\n\nIf I did not have that info, I would have under-watered my crops. If I chose to fully water them, I would have over watered.\n\nCould you have predicted my watering needs within a four-hour period?", "is_submitter": false, "distinguished": null, "created_utc": 1629085918.0, "parent_id": "t1_h9441wg", "replies": [{"author": "Pleaseusesomelogic", "id": "h947rmv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "p4ltxf", "stickied": false, "body": "If you’re using the news to water your crops within a four hour period, You’re a fucking idiot.  If you think that I believe you use weather updates to water a crop, you’re dumber than a bag of hammers.  \n\nPlease quit trying to prove a stupid point and go out and water your crops. I’m sure that’s exactly what 99.9% of the world is thinking about when they watch the news for crop watering info. How am I gonna water my crops if I don’t have the news telling me when it’s going to rain.\n\nSuper relevant comment! Good job. \n\n(This may be the stupidest argument I’ve ever heard).", "is_submitter": true, "distinguished": null, "created_utc": 1629086650.0, "parent_id": "t1_h946i0k", "replies": []}]}]}]}]}]}]}]}]}]}]}