{"title": "FaceTime (video chat) vs long distance phone calls 25 yrs ago.", "name": "t3_oxinyf", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oxinyf/facetime_video_chat_vs_long_distance_phone_calls/", "selftext": "Today you can FaceTime from Tokyo to America in real time HD with zero cost.  Mind blowing. \n\nAs little as 25 years ago, there was such a thing as long-distance calls. They would bill you by the minute depending on how far you were and how many exchanges it went to and so on and so on.  So I went to college 80 miles away from my home. Whenever I would call home I would be billed at $.32 per minute.  That’s crazy.  If I remember correctly, long-distance charges started going away around 2000.  (I could look it up but I didn’t.). \n\nAnd for you youngsters who have never even talked on a payphone, you would dial a number and they will tell you how many quarters to put in so you could talk for X amount of minutes. And then when you exceeded those minutes they would break in and say please deposit X quarters to continue talking.", "score": 40, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/oxinyf/facetime_video_chat_vs_long_distance_phone_calls/", "id": "oxinyf", "author": "Pleaseusesomelogic", "link_flair_text": "Fascinating", "num_comments": 64, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628043102.0, "comments": [{"author": "IonOtter", "id": "h7mvh6e", "score": 18, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #112", "submission": "oxinyf", "stickied": false, "body": "When I was in the Navy, I got assigned to the USS Reuben James, and we went on WestPac from December 96 to April 97.  And while we were in the Gulf, you could get calling cards to call home.  An AT&T $20 card would last about 10 minutes.\n\nOn base, they had DSN phone banks where you could call a military base or government office that was within the same area code as your home, and they would hookflash you to the number.  But sometimes, they weren't allowed to do that, because even though they were in the same area code, it could still rack up some steep charges.\n\nThe first time I ate through a $20 card, I thought there just HAD to be a better way.  I tried the DSN thing, and the base that was closest to home would not hookflash me, as it was still too far away.\n\nIn a flash of utter brilliance, I asked them to hookflash me to the AT&T *operator.*  That was a free call, so they did so.  I got the automated menu and dialed my home phone number, then the pin code, and the call went through.  \n\nAnd I got to talk with mom and dad for the better part of 30 minutes...\n\n...*and only spent $2.50*\n\nYou see, by using the DSN system to connect to a base in the same area code, I bypassed all the civilian international trunks, and made the equivalent of a local call within the same area code.\n\nNeat, huh?\n\nAlso, when 9/11 happened, all of the phone trunks on the East Coast were down, because WTC was a HUGE central office and communications hub, and people were flooding the lines that were still working.\n\nI was at Norfolk Naval Base for school, and I wanted to get through to mom and dad to let them know I was okay.  No matter how hard I tried, I could not get through.\n\nOn a hunch, I tried calling my friend in England, and it worked!  The international trunks were still working!  I spoke to him for a bit, then asked him to try and get through to mom and dad.  He made it through and let them know I was okay and safe.\n\nSo there you go.  If the local and continental long distance lines are down or overloaded, try international.  They go over different systems, and you might be able to get through.", "is_submitter": false, "distinguished": null, "created_utc": 1628046779.0, "parent_id": "t3_oxinyf", "replies": [{"author": "iamnotroberts", "id": "h7n03oz", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxinyf", "stickied": false, "body": "Served in the Marine Corps and Army, also worked with the AF and Navy, and foreign militaries. Calling home from Iraq was a bitch. You would get calling cards in care packages, but they would only be worth like a quarter or half (if you were lucky) of what the card said.", "is_submitter": false, "distinguished": null, "created_utc": 1628049364.0, "parent_id": "t1_h7mvh6e", "replies": []}, {"author": "Pleaseusesomelogic", "id": "h7mzc8v", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "oxinyf", "stickied": false, "body": "That’s interesting.   The vagaries of the primitive US calling system.   \n\nOn a side note, I lived in Norfolk for a year when I was 5. My a dad was a navyman.", "is_submitter": true, "distinguished": null, "created_utc": 1628048926.0, "parent_id": "t1_h7mvh6e", "replies": []}, {"author": "TheLittlestHibou", "id": "h7mz3rw", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "oxinyf", "stickied": false, "body": ">Neat, huh?\n\ncleverness is hot af, and i mean that with utmost respect and platonic vibez\n\nbut why did it cost you $2.50?", "is_submitter": false, "distinguished": null, "created_utc": 1628048794.0, "parent_id": "t1_h7mvh6e", "replies": [{"author": "justausername22222", "id": "h7oq24r", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "oxinyf", "stickied": false, "body": "There were different tiers of long-distance charges. \"Local long-distance\" (e.g. across the state) still cost extra compared to local calls within your county or local area, but not  as much as long-distance long distance (e.g. across the country) and even that was a lot less expensive than international calls.\n\nSometimes even calls within the same area code fell under \"local long distance\"  if the call required routing to a different telephone exchange", "is_submitter": false, "distinguished": null, "created_utc": 1628090294.0, "parent_id": "t1_h7mz3rw", "replies": [{"author": "TheLittlestHibou", "id": "h7os0pn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "oxinyf", "stickied": false, "body": "Makes sense. I forgot there are long distance zones between provinces and states within the same country til someone else in this thread mentioned it... great story, by the way, thanks for posting it.", "is_submitter": false, "distinguished": null, "created_utc": 1628091109.0, "parent_id": "t1_h7oq24r", "replies": []}]}]}]}, {"author": "kubigjay", "id": "h7mvl7q", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #64", "submission": "oxinyf", "stickied": false, "body": "For me growing up, my house was at the edge of one phone company and the rest of my school on another.  That meant calling anyone from my school cost a lot of money.  \n\nThen there was a time when texts costs $0.10 each.  It doesn't sound like much but if you s nd 2000 text a month that's an extra $200.  This is why us oldies have an aversion to a lot texts.", "is_submitter": false, "distinguished": null, "created_utc": 1628046840.0, "parent_id": "t3_oxinyf", "replies": [{"author": "Cheomesh", "id": "h7o078i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "oxinyf", "stickied": false, "body": ">This is why us oldies have an aversion to a lot texts.\n\nIt was, along with roaming, still a thing in the mid/late 2000s, too.  I was quite poor growing up and didn't get my first cell until like 2010 because I associated it with being so expensive to just own (and when I finally got a proper plan, I still am super frugal with things like data, texts, and calls unless I'm on Wifi).", "is_submitter": false, "distinguished": null, "created_utc": 1628077409.0, "parent_id": "t1_h7mvl7q", "replies": []}, {"author": "Dr_TLP", "id": "h7o0aeu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #72", "submission": "oxinyf", "stickied": false, "body": "I got some big text phone bills growing up! My parents were unhappy.", "is_submitter": false, "distinguished": null, "created_utc": 1628077468.0, "parent_id": "t1_h7mvl7q", "replies": []}]}, {"author": "claimstoknowpeople", "id": "h7mx2z9", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #104", "submission": "oxinyf", "stickied": false, "body": "Around the same time we used to have LAN parties where you'd literally lug your giant tower computer and heavy CRT monitor, plus all necessary cables and accessories, to a friend's house so you could shoot each other over a game", "is_submitter": false, "distinguished": null, "created_utc": 1628047660.0, "parent_id": "t3_oxinyf", "replies": [{"author": "RevRagnarok", "id": "h7ntg3p", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #110", "submission": "oxinyf", "stickied": false, "body": "LOL I still do (well, re-pandemic, hopefully resuming soon).", "is_submitter": false, "distinguished": null, "created_utc": 1628072306.0, "parent_id": "t1_h7mx2z9", "replies": [{"author": "AKnightAlone", "id": "h7oads9", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxinyf", "stickied": false, "body": "Alright, folks, Delta is extinct. Grab your CRTs.", "is_submitter": false, "distinguished": null, "created_utc": 1628083243.0, "parent_id": "t1_h7ntg3p", "replies": [{"author": "RevRagnarok", "id": "h7ofasx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #110", "submission": "oxinyf", "stickied": false, "body": "LOL we have flat panels now. At least two guys have beefy enough laptops too.", "is_submitter": false, "distinguished": null, "created_utc": 1628085582.0, "parent_id": "t1_h7oads9", "replies": []}]}]}, {"author": "TheLittlestHibou", "id": "h7ngyam", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "oxinyf", "stickied": false, "body": "My brother and I, mostly my brother, used cassette tapes as hard drives to record scripts and programs. I was between 8-11 years old, early 1980's. We also recorded music and  spliced bits of cassette tape together to physically \"mix\" music/audio.\n\nWe write a script using a keyboard and monitor, record the script on a cassette, and play the cassette in order to run the program on the monitor.\n\n[https://en.wikipedia.org/wiki/Tape\\_drive](https://en.wikipedia.org/wiki/Tape_drive)\n\nMy brother also figured out how to log in to local university and company intranets in the early 1980's. My brother was 9-12 during this time, very bright and easily bored. We could also make long distance calls by routing them through local university/company phone systems, I don't know how my brother figured that one out but he did, I'm guessing from info he gleaned at one of these LAN parties or from his DnD group. Someone must have given him that information and the codes we used to get into the systems.\n\nAt 12 years old he was placed in a juvenile prison. A few years after, when he was 17-18, he was on welfare and begging for money, then a kindhearted senior manager from Aon got into a conversation with my brother, took him under his wing and quick started his IT career.\n\nMy brother changed from a punkass street beggar and rebel, to a preppie IT geek, almost overnight. Even cut off his long hair and refuses to grow it back now... sigh. Traitor rebel.\n\nI miss my brother the way he used to be... before he was... *civilized*.\n\nWhat can ya do.\n\nHe's happy in his life right now, and he deserves it, and I'm sincerely happy for him, even if I miss his old punkass self.", "is_submitter": false, "distinguished": null, "created_utc": 1628061227.0, "parent_id": "t1_h7mx2z9", "replies": [{"author": "artsymarcy", "id": "h7nva0a", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxinyf", "stickied": false, "body": "Did he go to juvie because of the workaround he found for the long-distance calls, or was it for something else? The guy who thought of phone phreaking ended up going to prison for a long time, which is why I'm curious.", "is_submitter": false, "distinguished": null, "created_utc": 1628073794.0, "parent_id": "t1_h7ngyam", "replies": [{"author": "TheLittlestHibou", "id": "h7oy3q4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "oxinyf", "stickied": false, "body": "He went to juvie because he was being violently abused in foster care and bullied by his classmates because he is super bright and has a large birth mark (AVM) on the side of his face. Instead of protecting him from violent child abusers and these boys who were bullying him, instead of giving him the help he needed, child protective services punished him for \"acting out\" and getting into fist fights.\n\nBut they never sent the Catholic nun who had violently abused most of her foster children and a number of her students who she taught at local elementary and high schools to prison, this nun assaulted so many children it's ludicrous that she was never even INVESTIGATED never mind charged.\n\nMy brother needed help. He needed love and safe, sane, healthy emotional support, and instead they threw him in juvie where he was abused even more. It's a bloody miracle he's functional and doing well with his career and is in therapy and is actively working on his issues so he can be a better father and partner to his gf. He could have been another Columbine statistic and the fact that he didn't turn out that way is entirely due to his personality and kind spirit. It could been much worse, and gone very differently.", "is_submitter": false, "distinguished": null, "created_utc": 1628093613.0, "parent_id": "t1_h7nva0a", "replies": []}]}, {"author": "NoSuchKotH", "id": "h7q7v3p", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oxinyf", "stickied": false, "body": ">At 12 years old he was placed in a juvenile prison. A few years after, when he was 17-18, he was on welfare and begging for money,\n\nHoly cow! Prison? For a 12 year old? For something minor like this?\n\nBack in the days, plenty of kids would do something like this where I lived. All they got was a slap on the wrist and their parents a bill of the cost they caused. I guess I should be glad I didn't grow up where ever you grew up.", "is_submitter": false, "distinguished": null, "created_utc": 1628112663.0, "parent_id": "t1_h7ngyam", "replies": [{"author": "TheLittlestHibou", "id": "h7sqmtd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "oxinyf", "stickied": false, "body": "My foster mother was a violently abusive Catholic nun, she is widely known for this. She got off on hurting children, especially my brother and I, sending my brother to juvie was a punishment for speaking out about the abuse he was experiencing, straight up.\n\nThis is the way Quebec treats people, especially victims of Catholic clergy abuse, they really seem to get off on hurting people here and making us suffer for no good reason.\n\n[https://en.wikipedia.org/wiki/Grande\\_Noirceur](https://en.wikipedia.org/wiki/Grande_Noirceur)\n\n&#x200B;\n\n>The Duplessis Orphans (French: les Orphelins de Duplessis) were 20,000 Canadian children\\[1\\] who were wrongly certified as mentally ill by the provincial government of Quebec and confined to psychiatric institutions in the 1940s and 1950s. The children were deliberately miscertified in order to misappropriate additional subsidies from the federal government. They are named for Maurice Duplessis, who served as Premier of Quebec for five non-consecutive terms between 1936 and 1959. The controversies associated with Duplessis, and particularly the corruption and abuse concerning the Duplessis orphans, have led to the popular historic conception of his term as Premier as La Grande Noirceur (\"The Great Darkness\") by its critics.  \n>  \n>The Duplessis Orphans have accused both the government of Quebec and the Roman Catholic Church of wrongdoing. The Catholic Church has denied involvement in the allegations, and disputes the claims of those seeking financial compensation for harm done.\\[2\\]\n\n[https://en.wikipedia.org/wiki/Duplessis\\_Orphans](https://en.wikipedia.org/wiki/Duplessis_Orphans)\n\nThis attitude comes from the Catholic concept of the *mortification of the flesh*, the idea that pain and suffering \"perfects\" the human spirit and brings us closer to God.\n\n[https://en.wikipedia.org/wiki/Mortification\\_of\\_the\\_flesh](https://en.wikipedia.org/wiki/Mortification_of_the_flesh)\n\n[https://en.wikipedia.org/wiki/Self-flagellation](https://en.wikipedia.org/wiki/Self-flagellation)\n\nThe Catholic clergy who raised us believed sadism was acceptable behaviour that brought children closer to God.\n\nThe Marquis de Sade himself developed a pleasure response to pain, humiliation and sexual assault because he was beaten and tortured by Jesuit priests when he was a kid. The Catholic clergy abuse he experienced turned him into a LIFELONG serial rapist and abuser. The Marquis de Sade kept kidnapping and raping innocent people and believed he had a God-given right to do so, to rape and torture people without consent, he tortured and raped so many people without their consent that he spent most of his life in prisons and mental institutions.\n\n&#x200B;\n\n>Later in his childhood, Sade was sent to the Lycée Louis-le-Grand in Paris,\\[12\\] a Jesuit college, for four years.\\[11\\] While at the school, he was tutored by Abbé Jacques-François Amblet, a priest.\\[13\\] Later in life, at one of Sade's trials the Abbé testified, saying that Sade had a \"passionate temperament which made him eager in the pursuit of pleasure\" but had a \"good heart.\"\\[13\\] At the Lycée Louis-le-Grand, he was subjected to \"severe corporal punishment,\" including \"flagellation,\" and he \"spent the rest of his adult life obsessed with the violent act.\"\\[12\\]\n\n[https://en.wikipedia.org/wiki/Marquis\\_de\\_Sade](https://en.wikipedia.org/wiki/Marquis_de_Sade)\n\nBDSM is most certainly NOT founded on the principle of consent, this is a myth and a lie. The Marquis de Sade, the founder of the modern BDSM movement, did not believe in consent, he believed he had the right to rape any person he wanted to.\n\nWe were introduced to this world as very young children.\n\nNeedless to say, boycott the Catholic church and the Jesuits.\n\nAnd maybe stop promoting the idea that sadism is good and healthy for people. Or the myth that sadism is consentual when it most certainly is not.", "is_submitter": false, "distinguished": null, "created_utc": 1628166840.0, "parent_id": "t1_h7q7v3p", "replies": [{"author": "NoSuchKotH", "id": "h7t2eqm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oxinyf", "stickied": false, "body": "Holy fucking cow!\n\nI did not know these things!\n\nHow did anyone come to believe that this is ok? What was wrong with people??", "is_submitter": false, "distinguished": null, "created_utc": 1628172460.0, "parent_id": "t1_h7sqmtd", "replies": []}]}]}]}]}, {"author": "bittercode", "id": "h7mrtp3", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #157", "submission": "oxinyf", "stickied": false, "body": "My wife and I moved from Phoenix to Orlando in 2006. We had our cell phones from Phoenix and when we drove with our kids to Orlando it took 3 days. We'd check in with family each night and let them know we were o.k.\n\nWhen our phone bill came later that month it was over $600 because of all the roaming.", "is_submitter": false, "distinguished": null, "created_utc": 1628044841.0, "parent_id": "t3_oxinyf", "replies": [{"author": "Pleaseusesomelogic", "id": "h7mytsx", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "oxinyf", "stickied": false, "body": "Lol. Roaming. I forgot about that. So stupid.", "is_submitter": true, "distinguished": null, "created_utc": 1628048636.0, "parent_id": "t1_h7mrtp3", "replies": [{"author": "clovepod", "id": "h7n2u1l", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "oxinyf", "stickied": false, "body": "oh yes! in 2000 when i took a road trip from the east coast out west to new mexico, i got a new phone and went with Sprint PCS because at the time all of their interstate coverage was no-roaming.", "is_submitter": false, "distinguished": null, "created_utc": 1628050977.0, "parent_id": "t1_h7mytsx", "replies": []}, {"author": "NoSuchKotH", "id": "h7q8bjl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oxinyf", "stickied": false, "body": "Roaming still exists. Most countries are not as big as the US and crossing the country causes roaming. Heck, in most of Europe you only have to be within 10-20km of the border to run the risk of roaming and its exorbitant charges.", "is_submitter": false, "distinguished": null, "created_utc": 1628112862.0, "parent_id": "t1_h7mytsx", "replies": [{"author": "Pleaseusesomelogic", "id": "h7r41as", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "oxinyf", "stickied": false, "body": "Thanks for the input. That’s crazy.", "is_submitter": true, "distinguished": null, "created_utc": 1628127619.0, "parent_id": "t1_h7q8bjl", "replies": []}]}]}]}, {"author": "dogs_like_me", "id": "h7mwdqo", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "oxinyf", "stickied": false, "body": "Remember collect calls? From *payphones*??\n\nhttps://www.youtube.com/watch?v=9JxhTnWrKYs", "is_submitter": false, "distinguished": null, "created_utc": 1628047271.0, "parent_id": "t3_oxinyf", "replies": [{"author": "I_Am_Anjelen", "id": "h7ngjs2", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #297", "submission": "oxinyf", "stickied": false, "body": "\"You have a collect call from. 'himomi'mokayjustlettingyouknowiloveyoubyealsopleasesendmoney'. If you choose to accept these charges, press One. If you choose to decline these charges, hang up the call now.\"\n\n<click>", "is_submitter": false, "distinguished": null, "created_utc": 1628060882.0, "parent_id": "t1_h7mwdqo", "replies": []}, {"author": "clovepod", "id": "h7n2zk5", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "oxinyf", "stickied": false, "body": "when i went abroad to europe in 1990, i had a deal i would call my mom collect once a week to check in at home. that was the only way we had to contact each other. it was always from pay phones.\n\nmy stepfather died quite unexpectedly while i was away, and they had already had the funeral by the time i called in for the week, and found out.", "is_submitter": false, "distinguished": null, "created_utc": 1628051071.0, "parent_id": "t1_h7mwdqo", "replies": [{"author": "dogs_like_me", "id": "h7n7z4v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "oxinyf", "stickied": false, "body": "crazy imagining how off the map I'd have to be today for news like that to evade me for week.", "is_submitter": false, "distinguished": null, "created_utc": 1628054287.0, "parent_id": "t1_h7n2zk5", "replies": [{"author": "clovepod", "id": "h7ozvak", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "oxinyf", "stickied": false, "body": "Oh yeah. Even if my phone didn’t work for mobile call/text/data in a given area, I could still get on WiFi somewhere and have a variety of options.", "is_submitter": false, "distinguished": null, "created_utc": 1628094325.0, "parent_id": "t1_h7n7z4v", "replies": []}, {"author": "NoSuchKotH", "id": "h7q8kca", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oxinyf", "stickied": false, "body": "Depending where you lived, until the 80s or 90s, the main way of communication was still mail. Handwritten. With a fountain pen.", "is_submitter": false, "distinguished": null, "created_utc": 1628112969.0, "parent_id": "t1_h7n7z4v", "replies": [{"author": "dogs_like_me", "id": "h7qbdy5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "oxinyf", "stickied": false, "body": "I still regret not sending any telegrams while I had the chance.", "is_submitter": false, "distinguished": null, "created_utc": 1628114213.0, "parent_id": "t1_h7q8kca", "replies": [{"author": "NoSuchKotH", "id": "h7qe2xh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oxinyf", "stickied": false, "body": "Telegrams have gone out of fashion a very long time ago. While I still learned how one would do a telegram back in elementary school, it was already clear then, that none of us would likely use that ever, with almost everyone having phones at home. Especially considering the cost. They were something like $20-30 in today's money. \n\nBut you can still send telegrams. There are still services that allow those. Though I don't know whether they work still the same way.", "is_submitter": false, "distinguished": null, "created_utc": 1628115423.0, "parent_id": "t1_h7qbdy5", "replies": [{"author": "dogs_like_me", "id": "h7qlyf5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "oxinyf", "stickied": false, "body": "I suspect they don't, at least not in the US anyway. Here's what I consider the death of the technology in the US: https://www.nytimes.com/2006/02/06/technology/telegram-falls-silent-stop-era-ends-stop.html", "is_submitter": false, "distinguished": null, "created_utc": 1628119062.0, "parent_id": "t1_h7qe2xh", "replies": []}]}]}]}]}]}, {"author": "Meep42", "id": "h7nan1d", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #28", "submission": "oxinyf", "stickied": false, "body": "We did it from home phones too. Most of my friends were in a different area code and I was required to call and check in to let my folks know I'd gotten there since I was riding the bus across town (by myself, as a young teen!). I was already embarrassed enough that I had to call in, I wasn't going to also then make a long distance call! Gah! \n\nIt really just hit me though that I was riding my bike and taking hours-long bus rides across the city with no parental supervision. People will say \"times were different then\" but...um...all the really interesting serial killers I keep hearing about were prowling around then too...yay for being too uninteresting for everyone, I guess.", "is_submitter": false, "distinguished": null, "created_utc": 1628056151.0, "parent_id": "t1_h7mwdqo", "replies": []}, {"author": "horse_loose_hospital", "id": "h7osxcz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #128", "submission": "oxinyf", "stickied": false, "body": "When I was a young scrungy punk kid in NYC I used to call my parents collect and *then* ask them to Western Union me money lol...that was the norm in my particular rag tag bunch tho, we were way too bougie to panhandle. / **dies of self-inflicted cringe wound* *", "is_submitter": false, "distinguished": null, "created_utc": 1628091485.0, "parent_id": "t1_h7mwdqo", "replies": []}]}, {"author": "TheLittlestHibou", "id": "h7mymwy", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "oxinyf", "stickied": false, "body": "I remember this. We had to call the operator and ask how much a call would cost before we could place a long distance call because the rates changed depending on the *time of day*. Which is wild to me now.\n\nWe had a rotary phone when my childhood started and cell phones when my childhood ended.\n\nAlso had 8-track cassettes and vinyl when my childhood started, through beta and VHS, k7 cassettes, then CD's and DVD's when my childhood ended.\n\nI feel like I was born in a charmed period of time (late 1970's) and am super privileged to have owned both analog and digital tech as a kid.\n\nThere are still millions of people without electricity and hot water in their homes, millions of people living in slums TODAY, right now. Meanwhile I had all of these things and more.\n\nSure I was in foster care, but I was still very privileged compared to millions of other people.\n\nThat's what I take away from all this.", "is_submitter": false, "distinguished": null, "created_utc": 1628048529.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "SilverDem0n", "id": "h7n0nvy", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #105", "submission": "oxinyf", "stickied": false, "body": "I now spend all day chained to the desk doing video calls, summoned any time of day or night at the capricious whim of managers in distant continents. I am not sure I consider this progress. Paying big $ per minute helped to filter out a lot of the unnecessary junk.", "is_submitter": false, "distinguished": null, "created_utc": 1628049688.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "Btankersly66", "id": "h7n1lpy", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "oxinyf", "stickied": false, "body": "Phone books used to be like 4 inches thick, were dropped at your door each year and were free. And if you didn't know someone's address you'd have to call all 637 Joe Smith to find him.", "is_submitter": false, "distinguished": null, "created_utc": 1628050243.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "enhtie", "id": "h7n080y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #67", "submission": "oxinyf", "stickied": false, "body": "i kind of miss this though (despite never having it). when i was a kid my mom would call my grandparents and try to minimise the time of the conversation because it was so expensive, and in a way, it made these small intersections more meaningful. plus, this was a great excuse to not interact with someone hahah.\n\nnowadays, we take these things for granted way too much, i remember having only one home phone in my house for the longest time, and now we each have one (or two, three, four) of our own.", "is_submitter": false, "distinguished": null, "created_utc": 1628049433.0, "parent_id": "t3_oxinyf", "replies": [{"author": "Pleaseusesomelogic", "id": "h7n0uq8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "oxinyf", "stickied": false, "body": "It gets way more expensive than you think. Because you can’t keep up with it whatsoever. Then 25 days later you get a bill for $73 for 1 phone call. Also nowadays it’s much more common to just not answer your phone anymore. We did not have text back in the day so anytime your home phone rang everybody would jump to answer because you could never know who was calling.  \n\nIt’s a wild thought now to answer your phone without knowing who is calling.  And still to this day, when I call my mom, she answers hello? Like she doesn’t know that it’s me calling. It’s mildly irritating.\n\nThen came call waiting,  and *69.", "is_submitter": true, "distinguished": null, "created_utc": 1628049796.0, "parent_id": "t1_h7n080y", "replies": [{"author": "enhtie", "id": "h7n4nnl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #67", "submission": "oxinyf", "stickied": false, "body": "that is true. i guess it’s different being a kid in that time period than being an adult.", "is_submitter": false, "distinguished": null, "created_utc": 1628052105.0, "parent_id": "t1_h7n0uq8", "replies": []}, {"author": "artsymarcy", "id": "h7nvuon", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxinyf", "stickied": false, "body": "About your mum answering hello, that's so cool that even though that's not necessary anymore, it's still a part of her speech. I answer \"hello?\" whenever I get a call because to me, that's just what you do, I didn't even realise it served the function of seeing who was calling, and I was born in 2004 so I have no experience with not knowing who was calling. We had a landline when I was a kid but even that had a screen with the caller ID.", "is_submitter": false, "distinguished": null, "created_utc": 1628074243.0, "parent_id": "t1_h7n0uq8", "replies": []}]}, {"author": "PM-ME-YOUR-HANDBRA", "id": "h7o8ygo", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #15", "submission": "oxinyf", "stickied": false, "body": "Honestly I kinda miss how you could just be unreachable for parts of the day. I could go to work and have no expectation of dealing with family/friend issues until I got home. Now, I'm always \"available\" via my cell phone, and if if don't respond within a \"reasonable\" time then obviously something is wrong and they'll start calling until I pick up.\n\nTechnology is terrific and terrible.", "is_submitter": false, "distinguished": null, "created_utc": 1628082522.0, "parent_id": "t1_h7n080y", "replies": [{"author": "enhtie", "id": "h7oajhv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #67", "submission": "oxinyf", "stickied": false, "body": "yeah i’d definitely agree. maybe i’m just too introverted but it’s far too convenient how we can reach one another. i just want to be left alone sometimes you know", "is_submitter": false, "distinguished": null, "created_utc": 1628083319.0, "parent_id": "t1_h7o8ygo", "replies": []}]}]}, {"author": "bernpfenn", "id": "h7n1rdn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "oxinyf", "stickied": false, "body": "AT&T owned and controlled all underwater cables  google map of undersea cables or whatever that is called.", "is_submitter": false, "distinguished": null, "created_utc": 1628050338.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "notdeepee", "id": "h7n7n6v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #80 | Legio Virtus", "submission": "oxinyf", "stickied": false, "body": "I'm 20, but I remember all of this. I've even used a Dial Telephone, and a Payphone.", "is_submitter": false, "distinguished": null, "created_utc": 1628054058.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "DoglessDyslexic", "id": "h7nmtln", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "oxinyf", "stickied": false, "body": "I typically travel with a tablet (iPad) whenever I'm away from home for a significant period.  My wife and I do either video or audio calls (depending on the quality of the wifi where I'm at) through various chat apps.  I could theoretically do it from anywhere using my phone and/or phone hotspot tech, but I'm not so chatty that I usually need to outside of hotel/friend accommodations.", "is_submitter": false, "distinguished": null, "created_utc": 1628066436.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "jcooli09", "id": "h7nrjke", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #101", "submission": "oxinyf", "stickied": false, "body": "Yes, I remember when we had to have a local carrier and a long distance carrier for our land line phones.", "is_submitter": false, "distinguished": null, "created_utc": 1628070680.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "RevRagnarok", "id": "h7ntayy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #110", "submission": "oxinyf", "stickied": false, "body": "Remember the BS that was _intra_-state long distance? My school district growing up was two non-adjacent towns put together. Limited the dating pool by half if you can't call them! The schools had two phone numbers, one in each exchange.", "is_submitter": false, "distinguished": null, "created_utc": 1628072187.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "YashinNashi", "id": "h7o15d7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #226", "submission": "oxinyf", "stickied": false, "body": "When competition from calling cards came around, I think prices started dropping.  OR, I could have it backwards and cheap calling cards became a thing because the te hnology improved and it was cheaper to make long-distance calls.", "is_submitter": false, "distinguished": null, "created_utc": 1628078030.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "ryguyt", "id": "h7obc5k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #99", "submission": "oxinyf", "stickied": false, "body": "There was a payphone in my jr highschool that someone figured out how to \"hack\" into giving free phone calls. The process involved some sequence of steps like lifting the reviewer, half pressing the hook a couple times or something like that, I can't remember. We would then use that phone to make prank calls, including the school's office itself, or dial into those intimate chat lines. Even as a hyper-hormonal teen I never really understood the appeal of those chat lines 🤷 internet porn wasn't quite as big, a video had to be \"downloaded\" for like half a day and they were always janky and low res anyways", "is_submitter": false, "distinguished": null, "created_utc": 1628083714.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "BuccaneerRex", "id": "h7obj4k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "oxinyf", "stickied": false, "body": "I tried to get my first cellphone as a young sailor in 1997. Before they'd even consider selling me a phone, they required a $1000 deposit on the PLAN because they'd had so many people screw themselves on fees. \n\nI worked for Verizon a few years ago and even in the mid 2010s there were still people hanging on to old per-minute and pay-per-text plans. \n\nThe number of people who had to have the difference between wifi and 4G explained to them was also pretty stunning. As were their bills. Especially the lucky few who were dumb while travelling. Yes, you really do owe Verizon $25,000 for watching a movie in HD on your phone in Venezuela. \n\nAnyway, the speed of technological growth is frankly astounding.", "is_submitter": false, "distinguished": null, "created_utc": 1628083809.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "atlasgaveup", "id": "h7oczt4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "oxinyf", "stickied": false, "body": "I remember watching one of the alien movies...maybe Aliens where they did video calls. I remember thinking how absolutely badass technology would be where you could video call on a telephone over long distances. It is fun seeing that technology become common and far better than what they showed in the movie.", "is_submitter": false, "distinguished": null, "created_utc": 1628084509.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "NoSuchKotH", "id": "h7q74hc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oxinyf", "stickied": false, "body": "Fun fact #1: most of the world still bills you for phone calls, even for local calls. And most of these are still distance based.\n\nFun fact #2: until about early 90s, you could hear other people talking in the \"background\" when doing international calls.\n\nFun fact #3: Switzerland got rid of coin based pay phones in the early 90s and replaced them with card based phones. The rest of (west) Europe soon followed.\n\nFun fact #4: on the very old pay phones, you could dial by banging the cradle in quick succession, without the need to pay. Though these disappeared in the early 80s.\n\nFun fact #5: Japanese pay phones still, to this day, have an RJ11 socket so you can connect a modem.\n\nFun fact #6: Most countries, with the notable exception of the US, had paper phone books in all public phone booths. It is still possible to find these in secluded places, even in west Europe, where paper phone books went the way of the Dodo in the late 1990s/early 2000s.\n\nFun fact #7: Most places/countries had a service, where you could ask them to call you at a specific time, in lieu of an alarm clock. Some still do.\n\nFun fact: #8: until the 60s/70s, lots of places in the world did not have phones at home, but at the post office. Villages often had just a single phone, if at all. If you wanted to call someone, you'd arrange a time with that person so both of you could be at the post office at that time.", "is_submitter": false, "distinguished": null, "created_utc": 1628112343.0, "parent_id": "t3_oxinyf", "replies": [{"author": "Pleaseusesomelogic", "id": "h7r3v3y", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "oxinyf", "stickied": false, "body": "Very interesting. Thanks for the fun facts.\n\nIn the years before cell phones became the norm, most payphones in the US had phonebooks attached as well.", "is_submitter": true, "distinguished": null, "created_utc": 1628127536.0, "parent_id": "t1_h7q74hc", "replies": [{"author": "NoSuchKotH", "id": "h7rwgyl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "oxinyf", "stickied": false, "body": "Interesting. I've only ever seen phone booths without phone books in the US. Must have been sampling bias then.", "is_submitter": false, "distinguished": null, "created_utc": 1628143728.0, "parent_id": "t1_h7r3v3y", "replies": []}]}]}, {"author": "Zealousideal_Mix_629", "id": "h7ms5ra", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "oxinyf", "stickied": false, "body": "Well it's not really \"0 cost\", as you pay a monthly fee for access.", "is_submitter": false, "distinguished": null, "created_utc": 1628045014.0, "parent_id": "t3_oxinyf", "replies": [{"author": "justausername22222", "id": "h7mtrow", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #165", "submission": "oxinyf", "stickied": false, "body": "You also paid a monthly fee for access to the  telephone system before you started racking up the  per-minute long-distance charges. We  know what OP meant.", "is_submitter": false, "distinguished": null, "created_utc": 1628045860.0, "parent_id": "t1_h7ms5ra", "replies": []}]}, {"author": "Gundamu0079", "id": "h7mvf9j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #257", "submission": "oxinyf", "stickied": false, "body": "nice", "is_submitter": false, "distinguished": null, "created_utc": 1628046750.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "Pleaseusesomelogic", "id": "h7mzklo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "oxinyf", "stickied": false, "body": "I obviously have no idea about countries outside the US calling systems. Please feel free to join in if you’d like.", "is_submitter": true, "distinguished": null, "created_utc": 1628049056.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "artsymarcy", "id": "h7nuwus", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oxinyf", "stickied": false, "body": "Wow, it's crazy to think how far technology has come.", "is_submitter": false, "distinguished": null, "created_utc": 1628073500.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "Parking_Pineapple440", "id": "h7ny3a0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #224", "submission": "oxinyf", "stickied": false, "body": "I’m rather young but yes I’ve used payphones and suffered those long distance call fees. I hate videochatting honestly.", "is_submitter": false, "distinguished": null, "created_utc": 1628075931.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "gabrielesilinic", "id": "h7oo6kt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #59", "submission": "oxinyf", "stickied": false, "body": "Not sure about if i'm right but as far as i know P2P combjned with WebRTC made it possible, you just pay your ISP to connect to hundreds of routers and apple has just to provide a stupidly underpowered server to handle the call status and not the chat, everything else are your devices and your network", "is_submitter": false, "distinguished": null, "created_utc": 1628089496.0, "parent_id": "t3_oxinyf", "replies": []}, {"author": "abraham1inco1n", "id": "h7pfer1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "oxinyf", "stickied": false, "body": "There's some really cool computer/ hacker history around old telephone systems: https://www.youtube.com/watch?v=4tHyZdtXULw", "is_submitter": false, "distinguished": null, "created_utc": 1628100671.0, "parent_id": "t3_oxinyf", "replies": []}]}