{"title": "I was born 50 years too early", "name": "t3_oqhtnj", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oqhtnj/i_was_born_50_years_too_early/", "selftext": "I’m so jealous of kids now. They literally have access to all of the worlds knowledge at their fingertips.  I had my grandma‘s Encyclopedia‘s from 1970.  While it was a good source of knowledge and I perused them endlessly, It’s just not like the Internet.\n\nI feel like I would have been a much more productive person with having the internet from birth. \n\nAnyhew…..", "score": 34, "upvote_ratio": 0.93, "permalink": "/r/TheFlyingTree/comments/oqhtnj/i_was_born_50_years_too_early/", "id": "oqhtnj", "author": "Pleaseusesomelogic", "link_flair_text": "Discussion", "num_comments": 48, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1627096317.0, "comments": [{"author": "gaoshan", "id": "h6bslsp", "score": 38, "subreddit": "TheFlyingTree", "author_flair": "Seeker #84", "submission": "oqhtnj", "stickied": false, "body": "I don't know. Perhaps you would be anxiety ridden, depressed and find that while you have all of the world's information at your fingertips you waste your time on pointless social media.", "is_submitter": false, "distinguished": null, "created_utc": 1627096779.0, "parent_id": "t3_oqhtnj", "replies": [{"author": "Alirezahjt", "id": "h6c8lgg", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "oqhtnj", "stickied": false, "body": "That's why I am happy to be born in the early 90s. I think I would not be able to handle the \"new world\" if I was a zoomer.", "is_submitter": false, "distinguished": null, "created_utc": 1627107636.0, "parent_id": "t1_h6bslsp", "replies": []}, {"author": "QueenOfNights", "id": "h6cfsnu", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #144", "submission": "oqhtnj", "stickied": false, "body": "This, I wish I was in an earlier generation but then think about the social preasures these kids face. Not to mention the fact that they have the anxiety of the world falling into disaster after disaster. Not only the fear that comes with that but also the preasures to post aesthetic activism on their Instagram stories and fight for causes they sometimes know little about.", "is_submitter": false, "distinguished": null, "created_utc": 1627113915.0, "parent_id": "t1_h6bslsp", "replies": []}]}, {"author": "duplexlion1", "id": "h6bul5o", "score": 17, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqhtnj", "stickied": false, "body": "You weren't born too early, the internet was invented too late.", "is_submitter": false, "distinguished": null, "created_utc": 1627097970.0, "parent_id": "t3_oqhtnj", "replies": [{"author": "clovepod", "id": "h6bv3gh", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "oqhtnj", "stickied": false, "body": "well... it had been *invented*, just wasn't commonly available and a rich source of information as it is now.", "is_submitter": false, "distinguished": null, "created_utc": 1627098278.0, "parent_id": "t1_h6bul5o", "replies": []}, {"author": "The_Holy_Fork", "id": "h6c34qz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #64 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "You can still benefit from the internet tho", "is_submitter": false, "distinguished": null, "created_utc": 1627103526.0, "parent_id": "t1_h6bul5o", "replies": []}]}, {"author": "usernames_suck_ok", "id": "h6bxdp1", "score": 15, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "oqhtnj", "stickied": false, "body": "Well, being older than most people on Reddit and being younger than you, I can tell you I don't envy most young people for a lot of reasons. I agree, the internet is awesome--in some ways. I've been using it since high school, and my career wouldn't be my career if the internet didn't exist. I'd probably still only be able to get jobs I absolutely can't stand. Every job I had before ecommerce/ordering stuff online became big business sucked.\n\nBut I think dating is significantly harder than it used to be, not really because of the internet but for other reasons--though I think trying to date online is full of such nonsense and shallow shit. Young people are meaner than they used to be and the internet gives them a powerful weapon against other people they dislike--saying this as someone who was bullied/picked on a lot growing up, I have to be so grateful for not being in that same spot today as a young person. The internet puts as much bad info in people's hands as it does good/useful info. And the quality of young people's in-school education seems to have decreased an unbelievable amount, making it more of a necessity for a young person to care and take initiative themselves to know anything other than basics and to become better at more than just using technology (talking about the US).\n\nThe times we're in right now just socioculturally and financially also suck significantly compared to the 80s and 90s, and probably the 70s, too (wasn't born in the 70s). Everything's expensive as hell, and education is not opening doors like it used to while sticking you with student debt and job opportunities that are generally some mix of underpaying you and having ridiculous standards both for hiring and for working. I remember my mother used to be able to just go to work 9-5, do work and come home, and now it's just...ugh, meetings all over the place, constant emails/Slack, 12+ hours, forced socialization/culture/\"team building\" for pay that is just not worth it.", "is_submitter": false, "distinguished": null, "created_utc": 1627099689.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "EvitableDestiny", "id": "h6bvk17", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #117", "submission": "oqhtnj", "stickied": false, "body": "You're not missing out on much. As a kid in their early 20s, who works with other kids... We don't do much with all that power. If you were born in the same gen as us, you might not have your appreciation of knowledge.", "is_submitter": false, "distinguished": null, "created_utc": 1627098557.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "DDumpTruckK", "id": "h6bxyvq", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqhtnj", "stickied": false, "body": "To be fair, kids these days also need to acquire even more of a robust skill of determining what reliable information is versus unreliable.  The number of times I've argued with someone who thinks something like psi-encyclopedia publishes facts is concerning.\n\nKids also need to learn scientific literacy, but need to be careful to hone a certain skill to not become over-confident in their ability to understand scientific abstracts.  There's too many people propagating quantum woo because they can link you to an abstract they don't understand.  When you point out that they're basing their conclusions on *interpretations,* and that the scientists themselves aren't drawing the same conclusions, they think they know more than the scientists themselves, based purely on reading the abstract.  Tragic really.", "is_submitter": false, "distinguished": null, "created_utc": 1627100067.0, "parent_id": "t3_oqhtnj", "replies": [{"author": "MisanthropicScott", "id": "h6cir0n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "> The number of times I've argued with someone who thinks something like psi-encyclopedia publishes facts is concerning.\n\nSomebody just posted that at me on DebateReligion. It was the first I'd seen of it. I asked for some peer-reviewed *scientific* links regarding the subject.", "is_submitter": false, "distinguished": null, "created_utc": 1627116687.0, "parent_id": "t1_h6bxyvq", "replies": [{"author": "DDumpTruckK", "id": "h6clkzz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqhtnj", "stickied": false, "body": "I think we might have been talking to the same guy XD.  I recognize your name and that Psi guy was all over there acting like the stories published on that site were at all reliable.  I asked him how we can know if they're telling the truth or not; how can we know those people were actually inhabited by spirits.  He was indignant that I would suggest they're lying.\n\nHe also then linked a paper showing there was *possibly* information being shared on the quantum level between two people and claimed that it was proof of supernatural mind reading.  In the abstract itself the researched concluded that *they needed to do an actual test to see if this was even information being transferred at all.* Basically he linked a study that said \"there MIGHT be information transfer, but we don't know.\" and he thought it said \"Humans can transfer information between each other through non-conventional means.\"  Dunning-Kruger effect if I ever saw it.\n\nSome people are just far too credulous.  It's quite sad.", "is_submitter": false, "distinguished": null, "created_utc": 1627119427.0, "parent_id": "t1_h6cir0n", "replies": [{"author": "MisanthropicScott", "id": "h6d0khy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "Could be the same guy. It sounds like what he was going to get to. But, I'm not bothering to go back unless he replies again.\n\nYou're actually clearer relaying his disinformation than he is in trying to explain it himself. I was wondering how he was planning to get from something about quantum entanglement in a brain to \"therefore God\". But, he was still in the early stage of his \"argument\". I couldn't even tell whether he was trying to convince me that there is a god or trying to back up my position that there isn't.\n\nHe mentioned precognition, which I pointed out would be effect (knowing of an event) before cause (the event happening) and would further serve to undermine the cause and effect needed for Aristotle's arguments. Thus it would be better support for the atheist position.", "is_submitter": false, "distinguished": null, "created_utc": 1627131637.0, "parent_id": "t1_h6clkzz", "replies": [{"author": "DDumpTruckK", "id": "h6epdmv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqhtnj", "stickied": false, "body": ">You're actually clearer relaying his disinformation than he is in trying to explain it himself.\n\nYeah.  I probably have an unfair advantage in that department though, as I have a degree in history which is for effect a degree in writing.  I also have always had a very powerful and loud inner monologue, and at a young age I discovered that the more words and phrases that I could understand and incorporate into my vocabulary the better and more clearly that inner monologue could help me think as I could more concisely communicate to myself.\n\nI know that language has some, likely significant, effect influences our thinking process.  Makes sense of course, it's hard to think about how many different kinds of snowfall there are if you only have one word for it.  Or what the difference is between a donkey and mule if they're both the same word.\n\nMeanwhile I constantly observe some people who struggle to explain *anything* complex and it's obviously a sign that they don't understand it, but I can't help but wonder if it's their shitty vocabulary that's been holding them back their whole lives.  Does everyone just get smarter if you teach them new and more complex words and phrases?  I guess it makes sense that they would.  It'd be hard to talk about antidisestablishmentarianism if you don't know what the word means or the political landscape that surrounds it.", "is_submitter": false, "distinguished": null, "created_utc": 1627162613.0, "parent_id": "t1_h6d0khy", "replies": [{"author": "MisanthropicScott", "id": "h6hc7se", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "It'd probably help at this point if I point you at the conversation. I'll use reveddit to avoid any hint of trying to start a brigade.\n\nhttps://www.reveddit.com/v/DebateReligion/comments/oqft37/the_second_way_of_aquinas_is_a_sound_cosmological/h6bh33j/\n\n>> You're actually clearer relaying his disinformation than he is in trying to explain it himself.\n\n> Yeah. I probably have an unfair advantage in that department though, as I have a degree in history which is for effect a degree in writing.\n\nThat certainly would give you a strong advantage in expressing yourself. I know that I managed to get all the way to my Technical Writing course without being able to write coherently. My college required both that and a writing elective above that mostly because at the time they were one of only 25 colleges in the country offering a 4 year degree in technical writing. So, even computer science majors had to take Technical Writing and a \"Group A elective\", for which I chose Art of Prose. That was basically more technical writing. My teacher was the same for both classes and was truly excellent, at least at getting through to me.\n\n> I know that language has some, likely significant, effect influences our thinking process. Makes sense of course, it's hard to think about how many different kinds of snowfall there are if you only have one word for it. Or what the difference is between a donkey and mule if they're both the same word.\n\nTrue. I once heard it said that the purpose of an education is to make your brain a fun place to spend the rest of your life.\n\nWe may take interests in very different things. But, having a decent command of the language probably is important for most people in being able to think clearly about whatever those interests are. I understand that some people actually think in images. I don't know how common that is. I definitely think in words.\n\n> Meanwhile I constantly observe some people who struggle to explain anything complex and it's obviously a sign that they don't understand it\n\nI strongly agree with this. I've worked with a number of people for whom English is a second language. Many of the people I've worked with apologized more than once that their English was not good.\n\nI have never had a problem understanding anyone for whom the concept they were trying to get across was clear in their own brain.\n\nPresumably, they were thinking in their native languages and then translating. As long as they were clear about what they were thinking, they always found a way to get their point across clearly, even across a language barrier.\n\nWhenever something wasn't clear, I'd see my coworkers giving people benefit of the doubt that the problem was just a language issue. In the end, it was never a language issue. If it sounded *fuzzy* coming out of their mouths, it was because it was fuzzy in their brain. They weren't clear about the issue in any language.\n\nI've also had this with native English speakers who, like a neutered dog, just didn't get it.\n\nThis is all anecdotal. It's just my personal experience. However, it's personal experience from numerous cases over 23 years as a programmer. That includes cases where someone's English was less than perfect but their brain was excellent as well as cases of varying qualities of English speaking (including native speakers) whose brains were far from excellent.\n\nRegardless of whether someone speaks English well, if they can think clearly in any language, they'll be clear. If they can't think clearly, it doesn't matter what language they use for thinking, nothing will help.\n\n> I can't help but wonder if it's their shitty vocabulary that's been holding them back their whole lives.\n\nThat is very possible. I can't be sure. In the cases of those who thought clearly but didn't speak English as well, I assume they're thinking clearly in their native language. It seems likely that they at least have a decent or better vocabulary in that language. I can't know that either way, of course.\n\n> Does everyone just get smarter if you teach them new and more complex words and phrases? I guess it makes sense that they would.\n\nI think if someone is not smart to begin with, they may fail to learn to think in complex words and phrases. They may not have the ability to understand the nuance.\n\nI think we all have our limitations. Nothing I could ever have learned could have made me the next Einstein. It was just not going to happen.\n\n>  *“Alpha children wear grey. They work much harder than we do, because they're so frightfully clever. I'm awfully glad I'm a Beta, because I don't work so hard. And then we are much better than the Gammas and Deltas. Gammas are stupid. They all wear green, and Delta children wear khaki. Oh no, I don't want to play with Delta children. And Epsilons are still worse. They're too stupid to be able to read or write. Besides they wear black, which is such a beastly color. I'm so glad I'm a Beta.”* ― Aldous Huxley, Brave New World\n\nI'm just glad to be smart enough to have an idea of what the truly brilliant people on the planet have learned. I'm not one of them. I'm a Beta.\n\nBack to the topic of this wacko though, I'm not sure just how much of their problem is language. Certainly, they don't read the conclusions of their own cited papers with a critical eye.\n\nOne such paper that tried to make things sound better for psi powers than they were able to prove had a discussion section where they stated that their own results were slight and possibly not conclusive. And, the authors of the study also correctly noted that only 34% of such studies were able to reproduce their results.\n\nSomehow, this didn't trigger the in*duh*vidual I was discussing this with to say \"wait a minute!\" They did not realize that what this means is that the results barely indicated anything at all. Further, 2/3rds of the studies on the subject actively contradicted their findings.\n\nTranslation: They did not prove psi powers exist.\n\nSomehow this person missed that. This could be a real language issue or a critical thinking issue.\n\nThat said, I don't believe that my difficulty in understanding their point came from a lack of their *ability* to explain it. I think it came from an actively disingenuous attempt to railroad the conversation and steer it away from both the point of the OP and the point in my reply such that they could find an excuse to preach their own beliefs about psi powers, quantum communication between brains, and if they reply again, presumably something about an afterlife.\n\nI think their difficulty in explaining to me in particular is that I'm not willing to let the conversation be railroaded that way. I have no objection to tangents. I just want the person to be up front about what point they're actually trying to make. I think this person was attempting to get me to admit false facts a little at a time and then go down a road to more and more outlandish claims.", "is_submitter": false, "distinguished": null, "created_utc": 1627226434.0, "parent_id": "t1_h6epdmv", "replies": [{"author": "DDumpTruckK", "id": "h6hvkob", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqhtnj", "stickied": false, "body": "Lol yep that's the same guy and some of the same studies he shoved at me.  Reading comprehension is such a difficult thing for him.", "is_submitter": false, "distinguished": null, "created_utc": 1627235841.0, "parent_id": "t1_h6hc7se", "replies": [{"author": "MisanthropicScott", "id": "h6ikr1a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "To be fair, our brains are just 2% of our body mass but use 20% of our energy. They may be just trying to conserve energy ... by turning their brain off.", "is_submitter": false, "distinguished": null, "created_utc": 1627248108.0, "parent_id": "t1_h6hvkob", "replies": [{"author": "DDumpTruckK", "id": "h6invs2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "oqhtnj", "stickied": false, "body": "Kind of like how Trump thinks he's conserving energy by never exercising.  He thinks humans are like unchargable batteries and if you exercise you're just wasting energy.  Lol.", "is_submitter": false, "distinguished": null, "created_utc": 1627249685.0, "parent_id": "t1_h6ikr1a", "replies": [{"author": "MisanthropicScott", "id": "h6ir10y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "By far not the stupidest thing tRump has said, unfortunately. But, I must've missed that one.", "is_submitter": false, "distinguished": null, "created_utc": 1627251290.0, "parent_id": "t1_h6invs2", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "mellowsout", "id": "h6bvxfh", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #205", "submission": "oqhtnj", "stickied": false, "body": "I think I would have been constantly on Spotify and YouTube instead of always making mixtapes and taping MTV.", "is_submitter": false, "distinguished": null, "created_utc": 1627098784.0, "parent_id": "t3_oqhtnj", "replies": [{"author": "ennovyelechim", "id": "h6c6hni", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "oqhtnj", "stickied": false, "body": "Aw I miss a romantic mix tape if someone made one for you they'd put a lot of thought into it. Check out my playlist just isn't the same.", "is_submitter": false, "distinguished": null, "created_utc": 1627106015.0, "parent_id": "t1_h6bvxfh", "replies": []}]}, {"author": "SoyTuTocayo69", "id": "h6bybmp", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #105", "submission": "oqhtnj", "stickied": false, "body": "I honeslty love that we have the information that we do. I learned a language and expand my knowledge everyday because of it. Any skill I want to build I can. \n\nJust have to deal with a shitty economy where I can't get out of my dad's place because I don't make 6 figures or live in a place where it's more difficult to get jobs. It's a trade off lol \n\nBut seriously though, you can advantage of it now. Learn whatever the heck you want, the world is yours sir, and it's at your fingertips as much as it is ours.", "is_submitter": false, "distinguished": null, "created_utc": 1627100298.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "retrophoebe", "id": "h6bzfsa", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #191", "submission": "oqhtnj", "stickied": false, "body": "I feel you. I’m of an age/generation that perfectly straddles the before/after the internet. It became really powerful *just* right after it would’ve been the most useful to me.", "is_submitter": false, "distinguished": null, "created_utc": 1627101029.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "MotherScar5361", "id": "h6bzyeb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqhtnj", "stickied": false, "body": "I don’t know how old you are but I think I’m the generation your talking about. I’m 17 but in my early life my family was really poor so we had limited technological advancements.\n\nI feel like the internet is both a blessing and curse. I no longer have to ask my parents to help me with homework when English is not their first language. Instead I can ask my friends or google. I can also find new hobbies and how to improve old ones.\n\nOn the other side I feel like I’m becoming more addicted to my phone. Mindlessly scrolling and barely spending time outside. It also corrupts how I see myself. Hating how my body looks and how I talk and act. Thinking I’m not doing enough because other kids my age are doing more\n\nEvery generation will have their flaws I guess", "is_submitter": false, "distinguished": null, "created_utc": 1627101354.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "Walking_the_Cascades", "id": "h6c145y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #68", "submission": "oqhtnj", "stickied": false, "body": "As an older person there are two things I didn't have when I was young that children today have access to that have made me envious.\n\nThose little transformer toys that change from a car into a robot, and shoes that light up with LEDs when you walk.", "is_submitter": false, "distinguished": null, "created_utc": 1627102120.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "clovepod", "id": "h6bv5ae", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #83 | Consortii Concordus", "submission": "oqhtnj", "stickied": false, "body": "okay, but we had libraries?", "is_submitter": false, "distinguished": null, "created_utc": 1627098308.0, "parent_id": "t3_oqhtnj", "replies": [{"author": "TesseractToo", "id": "h6c2coa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "oqhtnj", "stickied": false, "body": "Yeah but even of you went to the best downtown library in your city they didn't have a lot of information. For example I love whales but I lived in a podunk prairie city in Canada, the biggest library had maybe 5 volumes? And my dyslexic ass couldn't figure out the University library. I bought my own books, but with out the internet it was hard to know what to order and I also had my share of books that had just made up shit and published it (I had a book that said whales don't get\\* cancer and this is a 'basking whale', the author didn't know sharks from whales).  \n\n\nAnd I didn't know the tricks like mneomioncs to study, the kids who did well learned all these memorization tricks I was reading and reading the books and didn't know you memorized one bit at a time. No adults helped me with that. (My mom not only didn't tell me I was dyslexic but she instructed the schools not to help me (but was ok to punish me)). So all kinds of twisted psycho shit was done to me because of my dyslexia from humiliation in front of the class as a new kid, to getting the strap so it made it hurt to hold a pen to elaborate things to get my grades up and I ask if someone will help and no one ever did. I feel if I has access to more people would have picked up the dyslexia and so on.   \n\n\nIn r/GenX though we were speculating that the internet would have been a lot grimier because there weren't the laws in place to protect children from predators and girls, even 12 and 13 year olds, were blamed for the sexual behavior for adult men even if they weren't doing anything, existing in a room could make them culpable for \"making a man do things like that\". The Pre-Chris Hansen Years lol  \n\n\n\\*so it used to be a known myth that sharks don't get cancer, but it's wrong, so that was meta-wrong.", "is_submitter": false, "distinguished": null, "created_utc": 1627102969.0, "parent_id": "t1_h6bv5ae", "replies": []}]}, {"author": "TesseractToo", "id": "h6c18gk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "oqhtnj", "stickied": false, "body": "lol Me too but I would have been insufferable! I'd probably be the worst furry genderqueer uwu obnoxious thing the world has ever seen :D", "is_submitter": false, "distinguished": null, "created_utc": 1627102197.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "Botwmaster23", "id": "h6c348c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "oqhtnj", "stickied": false, "body": "I still read books for knowledge, on the internet anyone can say they are a scientist and write some article about how vaccines are bad, and every karen in the world will believe it.", "is_submitter": false, "distinguished": null, "created_utc": 1627103516.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "varno2", "id": "h6c3sne", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqhtnj", "stickied": false, "body": "It is because of your generation and the one before that this internet of ours exists.", "is_submitter": false, "distinguished": null, "created_utc": 1627104005.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "Mister_Way", "id": "h6c55md", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqhtnj", "stickied": false, "body": "Imagine what you can do as an old person with the internet compared to old people before. Do you? If not, then you wouldn't have done shit as a kid, either. If you do, then why complain? You got the internet!", "is_submitter": false, "distinguished": null, "created_utc": 1627105006.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "Nonensbu", "id": "h6c7mou", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #260", "submission": "oqhtnj", "stickied": false, "body": "Damn, that's a vibe I can relate to...", "is_submitter": false, "distinguished": null, "created_utc": 1627106863.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "IamTJcon", "id": "h6c8box", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #10 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "It's okay 👶 toucan catch up now :) \nNe repent for ye past,  make the best use of it now", "is_submitter": false, "distinguished": null, "created_utc": 1627107425.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "raintoonboid", "id": "h6cdrh7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #131", "submission": "oqhtnj", "stickied": false, "body": "I wish I was born further into the future, where we r living like the star wars", "is_submitter": false, "distinguished": null, "created_utc": 1627112068.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "MisanthropicScott", "id": "h6cehwk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "> I was born 50 years too early\n\n> I had my grandma‘s Encyclopedia‘s from 1970.\n\nI'm having a lot of trouble guessing what age group you are from this.\n\nRegardless, I was born in 1963. I don't envy whatever the generation is that had the internet from birth. I don't envy any young person having to deal with the world in the state that prior generations have left it.\n\nWildfires, droughts, floods, extreme weather events of all kinds, a global population of 7.8 gigapeople and the full brunt of climate change is only just beginning.\n\nOn top of that, at least in the U.S., 40 years of Reagan's voodoo ~~trickle down economics~~ gush up economics has left many young people graduating from college with very little hope of finding a job. When I graduated in 1998 with a computer science degree it took me three months to find a job within my field. Now it can easily be years.\n\nThe political situation globally is also falling apart.\n\nWe did not leave today's youth the same opportunities I had decades ago. And, for the current state of the world, I am deeply sorry. I think everyone of an older generation owes a huge apology to the next generation.\n\nFar from treating the world as if we're borrowing it from the next generation, we have treated as if it must be consumed with all due speed.\n\nThe technology we've left behind is wonderful. But, the planet is burning. I do not envy today's youth. I can only apologize for my insignificant part in where we are today.", "is_submitter": false, "distinguished": null, "created_utc": 1627112728.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "roundearthervaxxer", "id": "h6ckk80", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "oqhtnj", "stickied": false, "body": "Wait until you realize they will be immortal.", "is_submitter": false, "distinguished": null, "created_utc": 1627118441.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "Eisenthorne", "id": "h6cttv0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #18", "submission": "oqhtnj", "stickied": false, "body": "I spent time studying bugs and clouds in action, sometimes I miss the days back when there was not much else to do or distract.", "is_submitter": false, "distinguished": null, "created_utc": 1627126839.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "LoreleiOpine", "id": "h6d0cd8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "oqhtnj", "stickied": false, "body": "For example, these days you can find an online grammar resource that shows you that it is the world's knowledge, not the worlds knowledge. You'd also see that you shouldn't capitalise \"it's\" in the middle of a sentence.", "is_submitter": false, "distinguished": null, "created_utc": 1627131492.0, "parent_id": "t3_oqhtnj", "replies": [{"author": "Pleaseusesomelogic", "id": "h6dbeey", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "oqhtnj", "stickied": false, "body": "Thanks I generally just use voice to text and roll with it. Another thing we didn’t have when I was a kid. And I typed high school papers on a real typewriter\n\nAlso, no such word as “anyhew”\n\nSo, Anyhew…..", "is_submitter": true, "distinguished": null, "created_utc": 1627137808.0, "parent_id": "t1_h6d0cd8", "replies": [{"author": "LoreleiOpine", "id": "h6ddoar", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "oqhtnj", "stickied": false, "body": "*Anyhew* is a quaint colloquial term, not a typo or grammatical error.", "is_submitter": false, "distinguished": null, "created_utc": 1627138978.0, "parent_id": "t1_h6dbeey", "replies": []}]}]}, {"author": "painusmcanus", "id": "h6d5l60", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #241", "submission": "oqhtnj", "stickied": false, "body": "I was able to see both sides of it. Really, ideally we’d all have been born in 2341. That way by 2360 we’d be prime age for flugendorfin", "is_submitter": false, "distinguished": null, "created_utc": 1627134662.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "Valuable-Peace8307", "id": "h6d7csm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #8", "submission": "oqhtnj", "stickied": false, "body": "I’m so glad I’m not a kid in this day and age. Life was raise when there was no internet.", "is_submitter": false, "distinguished": null, "created_utc": 1627135645.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "MatthewofFinance", "id": "h6dqd5r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #204 | Ordo Cognitus", "submission": "oqhtnj", "stickied": false, "body": "Much more productive... perhaps. But you might have to sacrifice your attention span.", "is_submitter": false, "distinguished": null, "created_utc": 1627145106.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "boringlesbian", "id": "h6ihd9k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "oqhtnj", "stickied": false, "body": "People who want to learn new things, find ways to learn new things. As a kid in the 70s and 80s, I read encyclopedia and other reference books. I got magazine subscriptions to Psychology Today and National Geographic and read them all from cover to cover.\nI would have loved to have all this knowledge available when I was a kid.\n\nPeople like us still exist and use the internet to appease their curiosity. Other, use it for entertainment and as a distraction from the horrors of the world. Just like my generation used the tv and teen magazines, or MAD/Cracked magazines.\n\nWe are just more aware of others now.", "is_submitter": false, "distinguished": null, "created_utc": 1627246428.0, "parent_id": "t3_oqhtnj", "replies": []}, {"author": "metalhev", "id": "h747c0v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "oqhtnj", "stickied": false, "body": "Then again, you didn't get bombarded every minute with all kinds of fear-mongering information about the end of the world, insane violence, everlooming crisis, and your toe-pain actually being cancer that'll kill you, so there's that.", "is_submitter": false, "distinguished": null, "created_utc": 1627671776.0, "parent_id": "t3_oqhtnj", "replies": [{"author": "Pleaseusesomelogic", "id": "h765n00", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #231", "submission": "oqhtnj", "stickied": false, "body": "Oh I still get that. I’m on the Internet just like anybody else. I’m just smart enough to know how to ignore it.", "is_submitter": true, "distinguished": null, "created_utc": 1627707335.0, "parent_id": "t1_h747c0v", "replies": []}]}]}