{"title": "It's easy to forget that we are apes who wear clothes and the project of civilization has really just begun. Can we survive?", "name": "t3_otk44j", "url": "https://www.reddit.com/r/TheFlyingTree/comments/otk44j/its_easy_to_forget_that_we_are_apes_who_wear/", "selftext": "", "score": 3, "upvote_ratio": 0.67, "permalink": "/r/TheFlyingTree/comments/otk44j/its_easy_to_forget_that_we_are_apes_who_wear/", "id": "otk44j", "author": "Quiet_Days_in_Clichy", "link_flair_text": "Discussion", "num_comments": 61, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1627509691.0, "comments": [{"author": "Paul_Thrush", "id": "h6vy1pe", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "otk44j", "stickied": false, "body": "Nothing lasts forever. At some point humans will be extinct. But we'll all be dead before that happens, so it really won't affect us.", "is_submitter": false, "distinguished": null, "created_utc": 1627511666.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6w2ccc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Well what if we survive, invent fusion and digitize our consciousness? We would be interconnected brains in a vat for eternity.", "is_submitter": true, "distinguished": null, "created_utc": 1627513679.0, "parent_id": "t1_h6vy1pe", "replies": [{"author": "Paul_Thrush", "id": "h6w792o", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "otk44j", "stickied": false, "body": ">invent fusion\n\nTo be clear, stars run on fusion. Fusion reactors have been built, but they curently use  more power than they generate and can't run for long. I know what you meant, though.\n\n&#x200B;\n\n>digitize our consciousness\n\nI don't think it's possible. I think there's a lot of hype about it and people expect it to be true, but I know you won't see it in your lifetime.\n\n&#x200B;\n\n>for eternity\n\nI have some bad news for you, if you haven't heard. Nothing lasts forever, not even the universe.", "is_submitter": false, "distinguished": null, "created_utc": 1627516057.0, "parent_id": "t1_h6w2ccc", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x264p", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "This is the sort of response I was looking for. Thanks for the great reply", "is_submitter": true, "distinguished": null, "created_utc": 1627531750.0, "parent_id": "t1_h6w792o", "replies": [{"author": "THF-Killingpro", "id": "h6y43sq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "otk44j", "stickied": false, "body": "I have read the conversation and want to add something. If you will just upload the brain you will get not what you want. That is because the brain uses hormones that come from alltroughout the body. So my theorie is that the brain will work like a computer program that can't achive it's goal. Because humans are designed to keep the species alive that is their sole purpose. So we would most likely need to creat a new entity that has a goal that fits it. And like I said earlyer we would likely need to upload the whole body( and probably even the enviroment, for hormones and so on to be simulated properly). So what would a simulated human do? I don't know myself but their goal wouldn't be achivabel so, to function properly, wouldn't a human just get loaded into a matrix? The human might be good and could control it's enviroment, but that would get boring as soon as the imagenation and the creativity have nothing more to try out. So in the long run the human would just live longer, try everything out and then want to be deleted. So, it would rather be creating and entity fit for the purpose of existing for almost forever and upload our expiriences to that entity, and that would then be the new version of the human that would live forever. The entity suitable for something like that would be an AI that would use human concepts( like not just exterminating a species, having morals and things like that) and get an human expirience \"pack\" uploaded to it so it would gain a personality, or to say it short, a human that doesen't has needs like food,water,fun,sex or relationships( I'm sure I forgot things, but you should het the idea) or any stimuli from the outside world to function properly.", "is_submitter": false, "distinguished": null, "created_utc": 1627560812.0, "parent_id": "t1_h6x264p", "replies": []}]}, {"author": "dashingThroughSnow12", "id": "h6wrpfa", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "otk44j", "stickied": false, "body": "> I don't think it's possible. I think there's a lot of hype about it and people expect it to be true, but I know you won't see it in your lifetime.\n\nAgreed.\n\nIf you were to take all the computing power in the world, put it in a room, and link it up, you could simulate around 3000 human brains. Within our lifetime, we could see a human brain fully simulated. It would cost a lot of money, we'd need a gigantic amount of computing power and electricity and space, but it is the realm of imaginable.\n\nTaking an existing mind and digitizing it would be another feet. Doing this for more than a few dozen people, not tenable in the near future at current technology growth.", "is_submitter": false, "distinguished": null, "created_utc": 1627526040.0, "parent_id": "t1_h6w792o", "replies": [{"author": "KuriousKhemicals", "id": "h6wx4dl", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "otk44j", "stickied": false, "body": "I'm gonna guess that even doing it to one or more brains will likely take a backseat to other critical demands by the time it's technically possible. The need to reduce unnecessary energy consumption,  fix carbon, and employ stopgap solutions for many other changes will be a drain on what computing power we might theoretically have available for decades to come.", "is_submitter": false, "distinguished": null, "created_utc": 1627528883.0, "parent_id": "t1_h6wrpfa", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x53bj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Maybe the most underrated reply. Great stuff, very down to earth thinking.", "is_submitter": true, "distinguished": null, "created_utc": 1627533546.0, "parent_id": "t1_h6wx4dl", "replies": []}]}, {"author": "Quiet_Days_in_Clichy", "id": "h6x4iyp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "But say we have a billion years. You're essentially saying that digitizing consciousness on a large scale is impossible when we know that hypothetically it is not. If we can go from delivering milk by horse and carriage to landing on the moon in 50 years then isn't anything that doesn't break the laws of physics plausible over a long enough time scale?\n\nEdit: Didn't mean this to be contentious or condescending because the answer could legitimately be no.", "is_submitter": true, "distinguished": null, "created_utc": 1627533186.0, "parent_id": "t1_h6wrpfa", "replies": [{"author": "dashingThroughSnow12", "id": "h6yct98", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "otk44j", "stickied": false, "body": "> If we can go from delivering milk by horse and carriage to landing on the moon in 50 years then isn't anything that doesn't break the laws of physics plausible over a long enough time scale?\n\nThis backs up what I am saying.\n\nIf you look back in the 60s, 70s, 80s, and early 90s, it was popular to imagine that by 2000, we'd regularly be taking trips to outer space and some of us would be living there or on the moon or on Mars. We're no further now to that than we were in 1961.\n\nNot everything has economies of scale. When talking about physical things, there are limits one approaches. For space, it is that you need a massive amount of energy to get people to space. Then they require a massive amount of resources to stay alive.\n\n> But say we have a billion years. You're essentially saying that digitizing consciousness on a large scale is impossible when we know that hypothetically it is not.\n\nCan we say that large scale is 1B consciousnesses digitized and active?\n\nFrom some estimates I've read, if you took all existing electronics, you could simulate around 3000 human brains. Some of these are big mainframes, some of these are small SOCs. It gives us a ballpark though.\n\nWe'd need around 333,000x more computing power than currently exists to get large scale consciousness digitization. At this point, you should see the issue.\n\nWay before you get near that, you will run out of rare earth metals. Manufacturing will be a nightmare. Running the computers will consume somewhere around an exawatt hour of energy per year. That's around 10x what humanity currently consumes.\n\nYou have to store these machines somewhere. You have to cool them. Security. Etcetera.", "is_submitter": false, "distinguished": null, "created_utc": 1627565489.0, "parent_id": "t1_h6x4iyp", "replies": []}]}]}]}]}]}, {"author": "StopBanningMeGDIT", "id": "h6w2mf4", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "otk44j", "stickied": false, "body": "Fuck no we can't", "is_submitter": false, "distinguished": null, "created_utc": 1627513815.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x3xlt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Ugh unfortunately probably not. Does this count as an angry upvote? I guess it should.  Angry upvote because you're probably right.", "is_submitter": true, "distinguished": null, "created_utc": 1627532821.0, "parent_id": "t1_h6w2mf4", "replies": [{"author": "StopBanningMeGDIT", "id": "h6xzk5d", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #254", "submission": "otk44j", "stickied": false, "body": "Haha, I don't want to be. There's a little hope since the young kids seem to be better than the older ones but we probably killed the earth.", "is_submitter": false, "distinguished": null, "created_utc": 1627557875.0, "parent_id": "t1_h6x3xlt", "replies": []}]}, {"author": "Cregaleus", "id": "h6ynw2r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "otk44j", "stickied": false, "body": "What does it even mean to survive in this context? There is the inevitable heat-death of the universe coming, so indefinite survival is impossible. You say we can't survive but what does it mean to \"survive\" in your terms?\n\nSurvive the next 100 years? 1,000? 1,000,000?", "is_submitter": false, "distinguished": null, "created_utc": 1627570575.0, "parent_id": "t1_h6w2mf4", "replies": []}]}, {"author": "TheDeadMonument", "id": "h6vx0rb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "otk44j", "stickied": false, "body": "I think it depends on how soon (if at all) digitalization of humans happens. Even now, geneticists are working out how to clip out our more primitive aspects. And with Elon and his brain chip, it's only a matter of time until we can start removing this aspects from our minds, also. Tailored behavior. \nWith tailored behavior we could have a decently programmed society. Will we be free to think? That, I don't know. \n\nThere's also the aspect of a controlling  superintelligent AI that controls all administration and implementation of rules.", "is_submitter": false, "distinguished": null, "created_utc": 1627511191.0, "parent_id": "t3_otk44j", "replies": [{"author": "1up_for_life", "id": "h6wdqbm", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #277", "submission": "otk44j", "stickied": false, "body": "Yes we *could* have a better society with tailored behavior. But you and I both know that we wont, it will only be used to get us to consume more and complain less.", "is_submitter": false, "distinguished": null, "created_utc": 1627519225.0, "parent_id": "t1_h6vx0rb", "replies": [{"author": "TheDeadMonument", "id": "h6wdsps", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "otk44j", "stickied": false, "body": "Precisely.", "is_submitter": false, "distinguished": null, "created_utc": 1627519256.0, "parent_id": "t1_h6wdqbm", "replies": []}, {"author": "Quiet_Days_in_Clichy", "id": "h6x2f9u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Ya.... this... sigh....", "is_submitter": true, "distinguished": null, "created_utc": 1627531904.0, "parent_id": "t1_h6wdqbm", "replies": []}]}]}, {"author": "Btankersly66", "id": "h6wd4i7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "otk44j", "stickied": false, "body": "We've already crossed the threshold where the wealthiest people only need a very small number of people to support them. 5 billion people could easily expire and the uber wealthy could perpetuate their legacy hundreds maybe thousands of years into the future with who remains. \n\nBarring a comet striking the planet our species will probably exist for at least 250 million years. Though it will be a very select few and it will probably consist of an ultra wealthy class who controls millions of \"slaves\", who work off of the planet, plus a few protected achronistic indigenous tribes.", "is_submitter": false, "distinguished": null, "created_utc": 1627518930.0, "parent_id": "t3_otk44j", "replies": [{"author": "dashingThroughSnow12", "id": "h6wrvep", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "otk44j", "stickied": false, "body": "I too like listening to Alex Jones conspiracy theories.", "is_submitter": false, "distinguished": null, "created_utc": 1627526124.0, "parent_id": "t1_h6wd4i7", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x2s43", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Honestly just sounds like run of the mill capitalism to me. I'm a giant pinko lefty though so grain of salt and all.", "is_submitter": true, "distinguished": null, "created_utc": 1627532118.0, "parent_id": "t1_h6wrvep", "replies": []}]}, {"author": "Walking_the_Cascades", "id": "h6ys1g2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #68", "submission": "otk44j", "stickied": false, "body": ">We've already crossed the threshold where the wealthiest people only need a very small number of people to support them. \n\nThat sounds like the basis for an interesting thought experiment. How few people are needed to support the über wealthy?\n\nDo the wealthy want to live in a house? Does the house use electricity? If so, you need people to locate ores, mine the ore, smelt it, manufacture wire (and the plastic that surrounds the wire, which is an entire industry in itself), and trained electricians to install it. Plus all of the industries needed to transport materials from point A to point B. Vehicle manufacturing facilities, road building industry, gasoline industry to run the transportation vehicles... Seems like just getting wiring for the house requires a host of industries and more than two or three people. \n\nAnd we haven't even started talking about the other materials for the house. Textiles, lumber, roofing, paint, glass, plumbing, heating and cooling, cooking and refrigeration...\n\nNow, if the ultra wealthy want to do more than sit naked in their house all day and stare at the walls, we've got a *lot* more to discuss!", "is_submitter": false, "distinguished": null, "created_utc": 1627572341.0, "parent_id": "t1_h6wd4i7", "replies": []}]}, {"author": "ATR2400", "id": "h6whv5s", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #60", "submission": "otk44j", "stickied": false, "body": "It depends on how long term you’re thinking? The next 10 years? Sure. The next 40. Most likely. The next 300? Too far to tell? The heat death of the universe? Everything will be dead. Including us.", "is_submitter": false, "distinguished": null, "created_utc": 1627521246.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x32du", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Yes it is very general but even until the heat death of the universe there remains technological solutions to survival. They are hypothetical to be sure but we have millions or potentially billions of years to figure it out", "is_submitter": true, "distinguished": null, "created_utc": 1627532291.0, "parent_id": "t1_h6whv5s", "replies": []}]}, {"author": "Erii_Sky", "id": "h6xl3wq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #44", "submission": "otk44j", "stickied": false, "body": "If there’s one thing I’ve learned, it’s that nature always wins in the end. It might take decades, centuries, even millennia or tens/hundreds of millennia, but one day humanity will come to an end and nature will reclaim the land we used to call home.", "is_submitter": false, "distinguished": null, "created_utc": 1627545755.0, "parent_id": "t3_otk44j", "replies": []}, {"author": "bernpfenn", "id": "h6wgx1p", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "otk44j", "stickied": false, "body": "WE apes have aircondition. BUT wildlife and insects at the bottom of the foodchain for frogs birds and bats doesn't have that luxury of cooling down time.\n\nonce they are gone, all insect pollinated plants will wither away. fruits and vegetables gone. trees are last.\n\nthe whole northpole is above zero currently. latent energy... the same energy that melts an ice cube will then heat the water to 80 C. that process starts when the north pole is ice free in a couple of years.\n\nbaked in CO2...the current heatwaves will get worse for the next 80 years. That assumes we stop CO2 production immediately cold Turkey.\nwe have a  min. of 80 years of steady incrementing temperatures. which animals do you think will then be around.\n\nI practice appreciating every day as if it is the last. I \"rescue\" insects from my house. I try to live here and now. \n\nAny plant does that. regardless of tomorrow, here is a branch, a leaf, a flower, a fruit.", "is_submitter": false, "distinguished": null, "created_utc": 1627520778.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x2uo4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Facts.", "is_submitter": true, "distinguished": null, "created_utc": 1627532161.0, "parent_id": "t1_h6wgx1p", "replies": []}, {"author": "DELETED", "id": "h6xw6ba", "score": -1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "otk44j", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627555353.0, "parent_id": "t1_h6wgx1p", "replies": [{"author": "Kweldulf", "id": "h6y9khd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "otk44j", "stickied": false, "body": "It has been warmer than it is now. That's true. It has not been warmer than it will be soon. That's one. Two - the warming has been slow. Millenia even - all living had time to adapt through evolition to changing climate. Now the pace is much much faster. No time for evolution to foster the adaptation process. They will NOT be fine.", "is_submitter": false, "distinguished": null, "created_utc": 1627563841.0, "parent_id": "t1_h6xw6ba", "replies": [{"author": "DELETED", "id": "h6yar55", "score": -1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "otk44j", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627564463.0, "parent_id": "t1_h6y9khd", "replies": [{"author": "Kweldulf", "id": "h6yb3qa", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "otk44j", "stickied": false, "body": "And is there scientific evidence for this mechanism to be sufficient to preserve enough of the eco-system for it to remain functioning and for humans to survive? Or maybe the rates of extinction of species are highest in history (except for massive disasters like dinosaur death), and presumably this mechanism is not working well enough to allow for survival of species?", "is_submitter": false, "distinguished": null, "created_utc": 1627564640.0, "parent_id": "t1_h6yar55", "replies": [{"author": "DELETED", "id": "h6ybne6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "otk44j", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627564914.0, "parent_id": "t1_h6yb3qa", "replies": [{"author": "bernpfenn", "id": "h6zzo66", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "otk44j", "stickied": false, "body": "no doubt. but reset to bacteria. then maybe there are intelligent rubbertrees after half a billion years.", "is_submitter": false, "distinguished": null, "created_utc": 1627590327.0, "parent_id": "t1_h6ybne6", "replies": [{"author": "DELETED", "id": "h70027w", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "otk44j", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627590489.0, "parent_id": "t1_h6zzo66", "replies": [{"author": "bernpfenn", "id": "h71z81c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "otk44j", "stickied": false, "body": "it's still aeons before adaptation takes place. but there are very short term problems arising for all life forms. food, heat and water. no one  adapts to that", "is_submitter": false, "distinguished": null, "created_utc": 1627626739.0, "parent_id": "t1_h70027w", "replies": []}]}]}]}]}]}]}]}]}, {"author": "CheezMeister__", "id": "h6wxx6f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #25", "submission": "otk44j", "stickied": false, "body": "Depending on how we play things out now. We need to start advancing to save the planet we have or move off world fast. Other wise we could die off", "is_submitter": false, "distinguished": null, "created_utc": 1627529319.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x3lvk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Agreed. Not sure why you got downvoted without a counter argument.", "is_submitter": true, "distinguished": null, "created_utc": 1627532620.0, "parent_id": "t1_h6wxx6f", "replies": [{"author": "CheezMeister__", "id": "h6x9wde", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #25", "submission": "otk44j", "stickied": false, "body": "Its reddit. No matter what sub or post", "is_submitter": false, "distinguished": null, "created_utc": 1627536770.0, "parent_id": "t1_h6x3lvk", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6xi04j", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "May you commune harmoniously with airborne photosynthesis comrade.", "is_submitter": true, "distinguished": null, "created_utc": 1627543084.0, "parent_id": "t1_h6x9wde", "replies": []}]}]}]}, {"author": "MisanthropicScott", "id": "h6xd3ko", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "otk44j", "stickied": false, "body": "The largest mass extinction of multicellular life in the history of this planet, the Permian/Triassic extinction, was caused by a warming planet.\n\nThe ocean conveyor currents stopped. The ocean became anoxic (little or no oxygen). Sulfur producing bacteria thrived in the anoxic depths and gradually the anoxic layer rose to the surface. At that point, toxic quantities of hydrogen sulfide gas were released into the atmosphere turning the sky green by changing the refraction of the atmosphere. This brought the mass extinction onto land.\n\nIf we don't take very strong and decisive action on climate change, we will cause another such extinction event. And, we will not survive.\n\n[Stanford Earth Matters magazine: What caused Earth's biggest mass extinction?](https://earth.stanford.edu/news/what-caused-earths-biggest-mass-extinction#gs.7maype)\n\n[Full length book on the subject: Under a Green Sky by Peter Ward](https://www.goodreads.com/book/show/630144.Under_a_Green_Sky)\n\nDuring mass extinction events, large warmblooded species fare very poorly. We are large and warmblooded.\n\nSo far, I see zero evidence of us taking climate change seriously. And, we don't have much time any more. In the 1980s, we could have made incremental changes to get where we needed to go. Now, we need bold and radical change in a big fat hurry. We're already seeing horrific effects today.\n\nSo, let's solve climate change, which is our most immediate problem. Then, we can talk about whether we might survive. Right now, I don't think so.\n\nAs for civilization rather than survival of the species, that's a very different question.\n\nSource: [Deforestation and world population sustainability: a quantitative analysis](https://www.nature.com/articles/s41598-020-63657-6)\n\nExcerpt from the Conclusion section (emphasis mine):\n\n> Calculations show that, maintaining the actual rate of population growth and resource consumption, in particular forest consumption, **we have a few decades left** before an irreversible collapse of our civilisation (see Fig. 5). Making the situation even worse, we stress once again that **it is unrealistic to think that the decline of the population in a situation of strong environmental degradation would be a non-chaotic and well-ordered decline.** This consideration leads to an even shorter remaining time. Admittedly, in our analysis, we assume parameters such as population growth and deforestation rate in our model as constant. This is a rough approximation which allows us to predict future scenarios based on current conditions. Nonetheless **the resulting mean-times for a catastrophic outcome to occur, which are of the order of 2–4 decades** (see Fig. 5), make this approximation acceptable, as it is hard to imagine, in absence of very strong collective efforts, big changes of these parameters to occur in such time scale.\n\nIMHO, the future is looking rather grim. We seem incapable of taking science seriously and caring enough about our own survival to actually do anything to ensure it.", "is_submitter": false, "distinguished": null, "created_utc": 1627539123.0, "parent_id": "t3_otk44j", "replies": [{"author": "DELETED", "id": "h6xwbvi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "otk44j", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627555476.0, "parent_id": "t1_h6xd3ko", "replies": [{"author": "MisanthropicScott", "id": "h6y76e4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "otk44j", "stickied": false, "body": "95% of all multicellular species went extinct at that time.\n\nLife will pull through in the post-human era. But, it takes about 50 million years!\n\nIt takes about 50 million years from a mass extinction event before life is as varied and complex as it was before the event.\n\nAnd, you're ignoring the massive suffering caused by such an event. 250 million years ago, that cause was enormous volcanic eruptions. Now, it's us.\n\nDo we not have a moral imperative not to be a literal catastrophic event in the history of the planet?", "is_submitter": false, "distinguished": null, "created_utc": 1627562575.0, "parent_id": "t1_h6xwbvi", "replies": [{"author": "DELETED", "id": "h6y8xmx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "otk44j", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627563505.0, "parent_id": "t1_h6y76e4", "replies": [{"author": "MisanthropicScott", "id": "h6yimiv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "otk44j", "stickied": false, "body": "Agreed. But, you're still ignoring the suffering caused. And you're ignoring that it's still about 167 times as long as humans have been on this planet. So, from our perspective, it's a pretty long time.", "is_submitter": false, "distinguished": null, "created_utc": 1627568242.0, "parent_id": "t1_h6y8xmx", "replies": [{"author": "DELETED", "id": "h6yjube", "score": 1, "subreddit": "TheFlyingTree", "author_flair": null, "submission": "otk44j", "stickied": false, "body": "[deleted]", "is_submitter": false, "distinguished": null, "created_utc": 1627568792.0, "parent_id": "t1_h6yimiv", "replies": [{"author": "MisanthropicScott", "id": "h6ymbwf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "otk44j", "stickied": false, "body": "I care about the suffering caused by the actions of our species.", "is_submitter": false, "distinguished": null, "created_utc": 1627569896.0, "parent_id": "t1_h6yjube", "replies": []}]}]}]}]}]}]}, {"author": "AndrewIsOnline", "id": "h6w0riz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #244", "submission": "otk44j", "stickied": false, "body": "As long as we get it right this third time", "is_submitter": false, "distinguished": null, "created_utc": 1627512930.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x2hw2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Underrated reply.", "is_submitter": true, "distinguished": null, "created_utc": 1627531946.0, "parent_id": "t1_h6w0riz", "replies": []}]}, {"author": "NoSuchKotH", "id": "h6w6hr3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "otk44j", "stickied": false, "body": "I think you want to read \"The Collapse of Complex Societies\" by Tainter.", "is_submitter": false, "distinguished": null, "created_utc": 1627515681.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x2k13", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Never heard of it. Will have to google.", "is_submitter": true, "distinguished": null, "created_utc": 1627531982.0, "parent_id": "t1_h6w6hr3", "replies": []}]}, {"author": "TotallySpaghettironi", "id": "h6vtv7f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #235", "submission": "otk44j", "stickied": false, "body": "How far into the future are you thinking?", "is_submitter": false, "distinguished": null, "created_utc": 1627509746.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6vvvdd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Whenever.", "is_submitter": true, "distinguished": null, "created_utc": 1627510664.0, "parent_id": "t1_h6vtv7f", "replies": []}]}, {"author": "Asog9999", "id": "h6vumvh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "otk44j", "stickied": false, "body": "We are not defendant of apes.", "is_submitter": false, "distinguished": null, "created_utc": 1627510100.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6vw2mi", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Do you have to take the BAR exam or can anyone prosecute apes?", "is_submitter": true, "distinguished": null, "created_utc": 1627510757.0, "parent_id": "t1_h6vumvh", "replies": [{"author": "TheDeadMonument", "id": "h6vwbbe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "otk44j", "stickied": false, "body": "Ha ha ha", "is_submitter": false, "distinguished": null, "created_utc": 1627510866.0, "parent_id": "t1_h6vw2mi", "replies": []}, {"author": "Paul_Thrush", "id": "h6vygj4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "otk44j", "stickied": false, "body": "Yes, the monkey bar exam.", "is_submitter": false, "distinguished": null, "created_utc": 1627511858.0, "parent_id": "t1_h6vw2mi", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6w210r", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "See precedent Magilla Gorilla v. United States.", "is_submitter": true, "distinguished": null, "created_utc": 1627513529.0, "parent_id": "t1_h6vygj4", "replies": []}]}]}]}, {"author": "TheCanadianGame", "id": "h6vuq4z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "otk44j", "stickied": false, "body": "Who are you thinking about? All of civilization? A few select people?", "is_submitter": false, "distinguished": null, "created_utc": 1627510142.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6vvtv8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "All of human civilization.  I am using the term generally.", "is_submitter": true, "distinguished": null, "created_utc": 1627510644.0, "parent_id": "t1_h6vuq4z", "replies": []}]}, {"author": "xteriic", "id": "h6whkrq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #116", "submission": "otk44j", "stickied": false, "body": "We've done pretty good for the last millennia.", "is_submitter": false, "distinguished": null, "created_utc": 1627521105.0, "parent_id": "t3_otk44j", "replies": [{"author": "Quiet_Days_in_Clichy", "id": "h6x2wdf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #200", "submission": "otk44j", "stickied": false, "body": "Have we???", "is_submitter": true, "distinguished": null, "created_utc": 1627532190.0, "parent_id": "t1_h6whkrq", "replies": []}]}, {"author": "FourSparta", "id": "h6xjm7e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #47", "submission": "otk44j", "stickied": false, "body": "Maybe we will evolve to the point where we don't need clothes anymore???", "is_submitter": false, "distinguished": null, "created_utc": 1627544465.0, "parent_id": "t3_otk44j", "replies": [{"author": "xXxHelsinginHerraxXx", "id": "h6xqqha", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #197", "submission": "otk44j", "stickied": false, "body": "Return to monke", "is_submitter": false, "distinguished": null, "created_utc": 1627550756.0, "parent_id": "t1_h6xjm7e", "replies": []}]}, {"author": "Zealousideal_Mix_629", "id": "h6xvwjk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "otk44j", "stickied": false, "body": "Some will some won't, like any other animal we are also subject to survival of the fittest.", "is_submitter": false, "distinguished": null, "created_utc": 1627555136.0, "parent_id": "t3_otk44j", "replies": []}, {"author": "capncapitalism", "id": "h6xvx1g", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "otk44j", "stickied": false, "body": "Civilizations rise and fall. Despite the decadence humanity found itself in, as a species we're still surprisingly resilient and adaptable. Outside of an E.L.E, humanity will survive. \n\nCivilization? No, at least not as we know it. Major powers will fall and others will rise in their place for the cycle to continue. The cultures will shift and grow, building something new.", "is_submitter": false, "distinguished": null, "created_utc": 1627555147.0, "parent_id": "t3_otk44j", "replies": []}, {"author": "LostInTheWoods1219", "id": "h6y6cqs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "otk44j", "stickied": false, "body": "\"Can we survive?\".  \nConsidering the fact that we have been worrying about the climate for the last decades and we barely changed our course when it comes to this, probably not.  \nConsidering the fact that we have weapons that can erase humanity and every living thing on this planet and these weapons are in hands of people that are just bound to contracts and agreements, probably not.", "is_submitter": false, "distinguished": null, "created_utc": 1627562118.0, "parent_id": "t3_otk44j", "replies": []}, {"author": "DrEvyl666", "id": "h6ytttt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #153", "submission": "otk44j", "stickied": false, "body": "I like Devin Townsend's thing...  we're just talking meat.", "is_submitter": false, "distinguished": null, "created_utc": 1627573093.0, "parent_id": "t3_otk44j", "replies": []}, {"author": "Wizicist", "id": "h6zmp4q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #132 | Consortii Concordus", "submission": "otk44j", "stickied": false, "body": "Can we? Absolutely. Is it probable? Debatable. Humans have demonstrated that, even in extreme tribalism settings, they're capable of acting with humanity and even defying orders that they recognized would be globally catastrophic.\nThat said, as we grow more powerful as a species, we will likely face more similar situations, and it's not too big stretch to claim that some of these situations could mean life or death for us as a species.\nPersonally, I think that our tendency to act as a community in times of crisis will ultimately allow us to survive more than a few crises. After all, humans will pack bond with anything.", "is_submitter": false, "distinguished": null, "created_utc": 1627584940.0, "parent_id": "t3_otk44j", "replies": []}]}