{"title": "I've been trying to think about this often as of late. How do you slay the hydra and prevent other dragons from coming into existence.", "name": "t3_pgsvnh", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pgsvnh/ive_been_trying_to_think_about_this_often_as_of/", "selftext": "How do the collective of humans create a system of value that is more broad range then simple bartering but not susceptible to the short comings of the human condition(greed, resource hoarding, short sightedness, the illusion of standing above another). Seems like there would need to be an element of associating merit in a way that is wholly private to the individual, not grindable for the sake of clout, and valuable as a resource to request more than the base necessities required for a person to live with dignity all humans should have. \n\nAs a middle aged human with low resources and subpar health, i find that because i don't fit the cookie cutter paradigm of valued worker I am stuck. More than just a rut of depression. Financially and socially I have no means of adding value to the collective of humans through the established systems that have been running the bigger picture since generations no longer remembered. It seems to me that the answers to scarcity of resources lie in the stars, and that there is no collective effort to seek out the technologies required to provide for all humans on the planet isn't the pinnacle of the individual's existence. The technology necessary to seed other planets to be habitable could be prototyped here and used to change large swathes of inhospitable environments into habitable and resource rich environments capable of providing basic necessities of livelihood, comfort, and health. Raising the bar of the lowest common denominator of the species so that we might all know what it is to walk in the light of Sol together.", "score": 2, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/pgsvnh/ive_been_trying_to_think_about_this_often_as_of/", "id": "pgsvnh", "author": "r4rrisforrandom", "link_flair_text": "Discussion", "num_comments": 4, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630623979.0, "comments": [{"author": "NoSuchKotH", "id": "hbdsefx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pgsvnh", "stickied": false, "body": "From the defeated, depressing way you write, I guess you are living in the US?\n\nIf that's the case, let me assure you, the rest of the world is not as depressing and people are not seen as simple wage slaves to be used until their death. It's just that the US has this notion that, well, anyone who isn't successful, aka rich, has not been working hard enough and it's absolute his own fault. \n\nEspecially in western Europe things are much more moderate. People can relatively freely choose what they want to do. A lot of people choose to go for a \"low wage\" job in order to bring change to their lives, the lives of others, or even the world. Heck, I quit my well paying engineer job and went for a PhD because I got bored.\n\nIf you want add value to the collective, maybe your first step should be to move to some place where people are actually free and can follow their calling instead of staying in a place that suffocates you.", "is_submitter": false, "distinguished": null, "created_utc": 1630627083.0, "parent_id": "t3_pgsvnh", "replies": []}, {"author": "HM_mtl", "id": "hbe83js", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #487", "submission": "pgsvnh", "stickied": false, "body": "Kill it with fire?", "is_submitter": false, "distinguished": null, "created_utc": 1630634450.0, "parent_id": "t3_pgsvnh", "replies": []}, {"author": "neolthrowaway", "id": "hbes617", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #338", "submission": "pgsvnh", "stickied": false, "body": "Excuse me sir/ma'am/enbie, do you have a moment to talk about our lord and savior, Henry George?", "is_submitter": false, "distinguished": null, "created_utc": 1630644900.0, "parent_id": "t3_pgsvnh", "replies": []}, {"author": "glarung", "id": "hbes9os", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #300", "submission": "pgsvnh", "stickied": false, "body": "Don't think of it as a hydra that needs to be slayed, but rather resources that need to be managed. \n\nAs some mentioned, in other systems the bars necessities for life are met. \nHowever, this won't always be the case. \nThe kicker is finding a way to get beyond a hand to mouth living. \nThat is somewhat unique to one's circumstance. If there was a singular,  universal way,  the world would be a better place.", "is_submitter": false, "distinguished": null, "created_utc": 1630644963.0, "parent_id": "t3_pgsvnh", "replies": []}]}