{"title": "Relevance of political elections", "name": "t3_pie717", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pie717/relevance_of_political_elections/", "selftext": "As I am from Germany and we have elections upcoming, I was wondering how this sub thinks about the relevance of elections.\n\nNo worries, I already finished my mail-in ballot as I think that elections are important and that, if you're allowed to vote, you should get information to see what party fits you best.\n\nBut I also know people that don't give a flying flamingo about elections in any way. They don't really look for information or so, maybe they will just vote based on what they already picked up or do not vote at all.\n\nSo as I think elections are important because of many reasons, I am looking for various other opinions on that topic, maybe trying to start a small discussion about politics.", "score": 1, "upvote_ratio": 0.67, "permalink": "/r/TheFlyingTree/comments/pie717/relevance_of_political_elections/", "id": "pie717", "author": "realkuebite", "link_flair_text": "Discussion", "num_comments": 5, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630852547.0, "comments": [{"author": "CreativityTheEmotion", "id": "hbp73wp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #646", "submission": "pie717", "stickied": false, "body": "I've gotten involved in a political party, and subsequently all elections it participates in, because a political party struck my fancy.\n\nI'm afraid I don't have a very good idea on what people outside parties think, especially since a party is about *promoting* a way of thinking, not *understanding* one.", "is_submitter": false, "distinguished": null, "created_utc": 1630857616.0, "parent_id": "t3_pie717", "replies": [{"author": "realkuebite", "id": "hbp9xq0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #648", "submission": "pie717", "stickied": false, "body": "I am also a member of a party, that's why I busy myself with politics more than others tend to do. That's why I have the opinion that elections, especially General Elections, are important and that you should think about it before you vote. After all it's about having a chance to cast your opinion and maybe change how politics is done.", "is_submitter": true, "distinguished": null, "created_utc": 1630858858.0, "parent_id": "t1_hbp73wp", "replies": []}, {"author": "sabriffle", "id": "hbsa924", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "pie717", "stickied": false, "body": "I’m new here and still orienting myself, but I’m not affiliated with a political party and perhaps can provide some perspective:\n\n-In theory, the party system as it stands where I am is ridiculous. \n\n-In practice, I vote with the party I most closely align with virtually all the time—as the stakes tend to be *rather high*—unless I have a very good reason to vote another way. Voting another way is a well-educated decision, and easy for me to consider because, not being part of a party, I have no party loyalty. I will say that I don’t vote for people or policies that have a habit of disregarding human rights, but I do get some interesting mail.", "is_submitter": false, "distinguished": null, "created_utc": 1630914369.0, "parent_id": "t1_hbp73wp", "replies": [{"author": "realkuebite", "id": "hbsg3mr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #648", "submission": "pie717", "stickied": false, "body": "Although I am a party member i do not have to stick to party loyality, especially since the party I'm a member of is fairly small. I would have voted for them if the chances of even getting into parliament would have been higher and if my general support for a different party would have been higher in this particular election.", "is_submitter": true, "distinguished": null, "created_utc": 1630919565.0, "parent_id": "t1_hbsa924", "replies": []}]}]}, {"author": "Niskanen204", "id": "hbprgeg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "pie717", "stickied": false, "body": "Generally quite cynical about the process of representative democracy and those who are gung-ho about it. I'd be happy to expand on any particular point, but generally I've found going in detail on Reddit to be a pretty useless endeavor.", "is_submitter": false, "distinguished": null, "created_utc": 1630866614.0, "parent_id": "t3_pie717", "replies": []}]}