{"title": "How would you convince someone to hire someone “worse”?", "name": "t3_pae70o", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pae70o/how_would_you_convince_someone_to_hire_someone/", "selftext": "Applying for a job soon and I have some red flags in my record (academic, nothing legal) and I just have no idea how best to present it.\n\nI’m so glad that mental health and people needing to take time away for themselves is becoming more accepted in general, but I don’t think that’s extending to the job sector.  Like, why would someone want to hire me when someone else could have gone through the same things mentally or otherwise and didn’t need time away or didn’t suffer academically. Doesn’t that basically mean that applicant is stronger than I am? \n\nI’ve been trying to spin it like, I know how to cope with things when it gets tough since I’ve been there, but idk it just sounds like crap to me. The others won’t even need to cope when things get tough because they’ve never let themselves even get to that point.\n\nAny advice appreciated.", "score": 3, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/pae70o/how_would_you_convince_someone_to_hire_someone/", "id": "pae70o", "author": "retrophoebe", "link_flair_text": "Question", "num_comments": 16, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629771243.0, "comments": [{"author": "Muroid", "id": "ha4354m", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "pae70o", "stickied": false, "body": "Not to pry, but can you give a general indication of what kind of negatives you’re talking about? I find that people who are new to post-college job hunting tend to vastly overestimate how much employers care about anything academics-related beyond “Do you have a degree?” at least outside of some very specific and fairly narrow fields.", "is_submitter": false, "distinguished": null, "created_utc": 1629771646.0, "parent_id": "t3_pae70o", "replies": [{"author": "retrophoebe", "id": "ha4vea7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #191", "submission": "pae70o", "stickied": false, "body": "Not college, but post-grad professional school. Had to repeat twice and failed a national exam before passing with a low score. It is not normal for people in my field to do any of this. If it were college, I wouldn’t be worried.", "is_submitter": true, "distinguished": null, "created_utc": 1629789350.0, "parent_id": "t1_ha4354m", "replies": [{"author": "04221970", "id": "ha88fmt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #110", "submission": "pae70o", "stickied": false, "body": "So you completed post-grad professional school and passed the national exam.....I'm not seeing any negatives here.\n\nWhy would you need to indicate previous failures if you ultimately passed?\n\n\nFor example... I failed my drivers test twice but passed.  If I had to apply for a job requiring driving, I'd just say that I have the proper drivers license completed...there is no need for me to tell them it took me 3 times to pass.", "is_submitter": false, "distinguished": null, "created_utc": 1629849134.0, "parent_id": "t1_ha4vea7", "replies": [{"author": "retrophoebe", "id": "ha8m93m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #191", "submission": "pae70o", "stickied": false, "body": "It’s on my permanent record that I failed and it’s something that the job looks at. I can’t provide further details, except to say that I’m not exaggerating lol and that it matters. Anyway, thanks for replying.", "is_submitter": true, "distinguished": null, "created_utc": 1629855477.0, "parent_id": "t1_ha88fmt", "replies": [{"author": "chewbaccataco", "id": "hadi84n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #67 | Classis Veritatus", "submission": "pae70o", "stickied": false, "body": "Take ownership of your weaknesses and mistakes if they are brought up. Everyone makes mistakes. The real test is to see how you handled it, if you learned from it, and how that changed your behavior in some way for the better.", "is_submitter": false, "distinguished": null, "created_utc": 1629944448.0, "parent_id": "t1_ha8m93m", "replies": []}, {"author": "PenguinInDistress", "id": "haf97sw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #156", "submission": "pae70o", "stickied": false, "body": "You didn't give up and walk away. People fail. Learning from those failures and overcoming them is what employers are looking for.", "is_submitter": false, "distinguished": null, "created_utc": 1629985487.0, "parent_id": "t1_ha8m93m", "replies": []}]}]}]}]}, {"author": "solongfish99", "id": "ha4egqi", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "pae70o", "stickied": false, "body": "There's no guarantee you'd get hired even if you didn't have those red flags, whatever they are, so the way I see it is that it's best not to worry about them. If they come up in the interview, you should be able to explain it thoughtfully, but don't make it the defining aspect of your first impression. Instead, focus on the things you have done/are proud of/are relevant to the job.", "is_submitter": false, "distinguished": null, "created_utc": 1629777437.0, "parent_id": "t3_pae70o", "replies": []}, {"author": "MisanthropicScott", "id": "ha4n36u", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pae70o", "stickied": false, "body": "You're not worse. You're better. You need to feel that walking in the door. You need to walk that difficult and fine line between arrogance and low self-esteem that is *confidence*. It's not easy. And, I'm not all that good at interviewing.\n\nBut, keep this in mind. You have absolutely no idea who else has applied for the job. You very well might be the best candidate. Leave it to them to tell you that you're not. You have no reason to tell them that.\n\nEven if your skill set isn't exactly the best, if you are the best fit with the team you'll be working on, that can count for a lot. So, make sure to listen carefully to the questions you're being asked and fully understand them. Make sure they know you hear what they're telling you they want during the interview. Then do your best to give it to them.\n\nSome interviews may put you in a simulated position where you are doing the job during the interview. Take that seriously. Work through the problems. One of the best interviews I ever had, not only because I actually got the job but because I really thought that it tested for what was missing on most interviews, put me in the position of working with a few other people designing a hypothetical system. \n\nThe job was for a computer programming position. This part of the interview came after the basics but really showed whether a person was capable of working on a team of developers.\n\nIf you end up in a situation where they are presenting you with the opportunity to actually show how you can do the job, take it seriously and do your best.\n\nBe personable with your interviewers. Treat them as if they're your coworkers, your team. That is what they're likely interviewing you for. Be someone with whom they will actively want to work.\n\nGood luck!\n\nP.S. Remember, don't get discouraged by failing to get one job. If you interview at 12 places and get a single job, you've won. You only need one job.", "is_submitter": false, "distinguished": null, "created_utc": 1629782889.0, "parent_id": "t3_pae70o", "replies": []}, {"author": "caparisme", "id": "ha4qspo", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pae70o", "stickied": false, "body": "Just don't worry too much on the red flags and just focus on what advantage you have to offer. Employees are not as interested in hearing about your flaws as hearing how you can benefit them. There is no need mention them and shoot yourself in the foot unless asked. Prepare an answer just in case of course but most of the time you won't be needing it.\n\nWorry not about other people and focus more on highlighting the best you can offer.", "is_submitter": false, "distinguished": null, "created_utc": 1629785642.0, "parent_id": "t3_pae70o", "replies": []}, {"author": "Tenacious-Tea", "id": "ha4c1p9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pae70o", "stickied": false, "body": "If there is no way around having it be known to a potential employer, then I think your best bet is to just own it.  If you seem like you are still caught up on what happened, or possibly embarrassed by it, they will probably pick up on that.  Instead, if you are able to joke about it and be OK with whatever happened, that confidence says a lot. Being able to pick yourself up after going through something hard, and finishing whatever it is you started, even if it takes a bit longer also says a lot.\n\nPeople go through tough times, if the person interviewing you is also who would be your manager, and they can’t see past some previous failures that you have learned/grown from, then you probably wouldn’t want to work for them anyway.", "is_submitter": false, "distinguished": null, "created_utc": 1629776106.0, "parent_id": "t3_pae70o", "replies": []}, {"author": "AlternativeMint", "id": "ha5n8nw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "pae70o", "stickied": false, "body": "There are 3 approachs to this:\n\n\n1. Own it directly. Yes, that was me, I did poorly but I also learnt \"xx\" and \"yy\", and I needed to stay out to solve my mental issues.\n\n\n2. Skip it. Try to divert the attention to other strong things. Yes, I got that score, but I great at \"xx\" and my hobbies are \"xx\" and that can help me at work.\n\n\n3. It is your story. And stories are not about what really happened, sometimes is about how you interpreted what happened. Two years spent and a poor score? Good. Being out of college you went into your adult life crisis. You really needed to know what to do with your life. Even thought about doing other things, so you really needed to be sure. And of course during those years you did research, considered joining other careers, learnt skills that made you unique, or made you realize what you really, really want.\n\nThere is no need of blatant lies. You get your story ready, when you are questioned about that, you will tell how much you grew up during those two years. Two years and a poor score? \"Yes! That was a really exciting part of my life. I had been working hard and studying during years but somehow I wanted to be totally sure this is the path I wanted to follow. During that time I explored other possibilities and focused on myself trying to find my best version. Now I know what I want, feel lost no more and looking back, I did the right thing. Because once you know your path and what you want, that is a huge source of focus and energy you can put into a good use in the job you want. So here I am, this is my \"first\" interview and I hope it is my last so I don't need to search for other companies.\"\n\nAnd you need to believe in your history.", "is_submitter": false, "distinguished": null, "created_utc": 1629809981.0, "parent_id": "t3_pae70o", "replies": [{"author": "haz_mat_", "id": "ha8i693", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "pae70o", "stickied": false, "body": ">1. Own it \n\nThis is exactly what I was going to say. You have to own it.\n\nOP, you struggled and succeeded in a way that most wont - thats the definition of determination. That being said, I wouldn't necessarily pitch that aspect front-and-center, but you definitely need to be ready to stand up for yourself when an interviewer asks about that.", "is_submitter": false, "distinguished": null, "created_utc": 1629853595.0, "parent_id": "t1_ha5n8nw", "replies": []}]}, {"author": "areyouseriousdotard", "id": "ha5avqc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "pae70o", "stickied": false, "body": "I usually give advice for stuff like this in /r/illegallifeprotips...\n\nBut, you were taking care of a family member on hospice and that caused some issues with school...\n\nEdit-. You can sell the lie by getting watery eyes and say you are still dealing w the lose....", "is_submitter": false, "distinguished": null, "created_utc": 1629802551.0, "parent_id": "t3_pae70o", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "ha626r1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pae70o", "stickied": false, "body": "Academic matter less than if you can do the job. Focus on what you have done for past employers to fix problems and optimize processes. Most managers don't care if you had a 4.0 gpa, they just need someone to do the job so they don't have to do it.", "is_submitter": false, "distinguished": null, "created_utc": 1629816831.0, "parent_id": "t3_pae70o", "replies": []}, {"author": "Solenya-C137", "id": "ha737s1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #126", "submission": "pae70o", "stickied": false, "body": "You can tell a story about \"resiliency\" and \"perseverance,\" which are positive traits.", "is_submitter": false, "distinguished": null, "created_utc": 1629831733.0, "parent_id": "t3_pae70o", "replies": []}, {"author": "walterbanana", "id": "haept3u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "pae70o", "stickied": false, "body": "Well, you can't really change it. Have a good story ready and look for jobs. Once you've landed your first job, nobody will ever care again.", "is_submitter": false, "distinguished": null, "created_utc": 1629974549.0, "parent_id": "t3_pae70o", "replies": []}]}