{"title": "So, what if the Star Trek transport had buckets of atoms...", "name": "t3_pa1ya6", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pa1ya6/so_what_if_the_star_trek_transport_had_buckets_of/", "selftext": "And they beamed two of you to the planet, half your original atoms and half from the buckets.\n\n* Would you die and their would be two new people?\n* Would you end up being one of them and there would be a new person?\n* Or would you somehow be both?\n\nI know they explored this from the original series in the episode “The Enemy Within,” really creative stuff btw. I am more asking about what this means in terms of consciousness.", "score": 9, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/pa1ya6/so_what_if_the_star_trek_transport_had_buckets_of/", "id": "pa1ya6", "author": "roundearthervaxxer", "link_flair_text": "Discussion", "num_comments": 62, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629731958.0, "comments": [{"author": "shig23", "id": "ha1nzyq", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pa1ya6", "stickied": false, "body": "There are simply now two of you. From your perspective, you now have an identical twin who shares all your memories, right up until the moment you split. Where the atoms came from doesn’t matter; atoms enter and leave your body all the time.", "is_submitter": false, "distinguished": null, "created_utc": 1629734425.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "MisanthropicScott", "id": "ha2rxu9", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pa1ya6", "stickied": false, "body": "Oh. You assumed the bucket would have the right numbers of the right atoms. Interesting. I didn't make that assumption. Nor did I assume they'd be rearranged into human form. I was kind of thinking of two half human half bucket creatures.", "is_submitter": false, "distinguished": null, "created_utc": 1629750762.0, "parent_id": "t1_ha1nzyq", "replies": [{"author": "shig23", "id": "ha2thxd", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pa1ya6", "stickied": false, "body": "Oh ok, so you were seeing something more like a proper transporter accident. Something monstrous and short-lived appears on the pad, and everyone gets real quiet any time somebody accidentally calls someone a buckethead afterwards. I was assuming \"buckets of atoms\" meant containers of the right mixture of elements to build a human, but your version has more story hooks.", "is_submitter": false, "distinguished": null, "created_utc": 1629751388.0, "parent_id": "t1_ha2rxu9", "replies": [{"author": "MisanthropicScott", "id": "ha2ttmz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pa1ya6", "stickied": false, "body": "Yeah. It's interesting how differently we viewed the question. I'm glad I replied before reading the other replies.\n\nP.S. Not that I have ever called anyone a buckethead. But, I will certainly refrain from doing so now!", "is_submitter": false, "distinguished": null, "created_utc": 1629751520.0, "parent_id": "t1_ha2thxd", "replies": []}, {"author": "DoglessDyslexic", "id": "ha5geac", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pa1ya6", "stickied": false, "body": "> Oh ok, so you were seeing something more like a proper transporter accident. \n\n[Something like this I imagine](https://www.youtube.com/watch?v=nW-NiGp1gys).", "is_submitter": false, "distinguished": null, "created_utc": 1629806195.0, "parent_id": "t1_ha2thxd", "replies": []}]}, {"author": "roundearthervaxxer", "id": "ha3ikx9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "They have the pattern, they make make two versions of the same pattern. Half with your original atoms and half from the buckets.\n\nIt is a way to get at the form matter dichotomy. Are “you” the atoms that make up your body or the way that they are arranged?", "is_submitter": true, "distinguished": null, "created_utc": 1629762289.0, "parent_id": "t1_ha2rxu9", "replies": [{"author": "MisanthropicScott", "id": "ha3v7s5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pa1ya6", "stickied": false, "body": "> It is a way to get at the form matter dichotomy. Are “you” the atoms that make up your body or the way that they are arranged?\n\nAre you aware of [neuroplasticity](https://en.wikipedia.org/wiki/Neuroplasticity)? The brain physically changes with our experiences. So, at the very least, we are the way our atoms are arranged. I can't answer the other question.", "is_submitter": false, "distinguished": null, "created_utc": 1629768034.0, "parent_id": "t1_ha3ikx9", "replies": []}, {"author": "Tenacious-Tea", "id": "ha4dr68", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #222", "submission": "pa1ya6", "stickied": false, "body": "Physically speaking, we are the type of atoms and how those atoms are arranged with one another.  It would be strange to think of us as the exact atoms we currently are, in that seven years from now we will be none of those atoms but still the same person (generally speaking). If both brains were rematerialized in the same way as the original, then it would seem that both copies would still think they are the same person they were before.\n\nPersonally, I think there is a whole other element to this (pun intended), which makes us who we are.  Though it isn’t anywhere in the realm of what can be discussed scientifically, I think there is something beyond the atoms, a spirit, that makes us much of who we are.\nNot sure if spirit is transportable or not.  But assuming it is a thing, and transportable, then that would make a big difference on whether you could clone someone with this method or not.", "is_submitter": false, "distinguished": null, "created_utc": 1629777039.0, "parent_id": "t1_ha3ikx9", "replies": []}]}]}, {"author": "roundearthervaxxer", "id": "ha3i8yu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "Right.. but imagine going through it. The beam is materializing, which one are YOU?", "is_submitter": true, "distinguished": null, "created_utc": 1629762134.0, "parent_id": "t1_ha1nzyq", "replies": [{"author": "shig23", "id": "ha3vjv5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pa1ya6", "stickied": false, "body": "That would no longer be a meaningful question. I, shig23, would no longer be a single person. There would now be two beings, shig23-1 and shig23-a, who shared my memories and who both believed themselves to be the \"real\" me—and both would be correct. \n\nMaybe that’s the same as saying I had died and that two new people had taken my place, and maybe that would be the simplest way for society to approach the issue, but that doesn’t feel right to me. If it’s fair to say that I’m still me after teleporting and having only one of myself appear on the pad, then it would be equally true to say that there are now two beings, suddenly on divergent paths but both still equally me.", "is_submitter": false, "distinguished": null, "created_utc": 1629768185.0, "parent_id": "t1_ha3i8yu", "replies": []}]}]}, {"author": "Haikouden", "id": "ha1q26d", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #65 | Classis Veritatus", "submission": "pa1ya6", "stickied": false, "body": "I'd argue that you'd die and there would be two new people.\n\nThe transporter paradox (or teletransportation paradox, also goes by a whole bunch of other names) kind of deals with a similar issue. If being teleported involves being ripped apart and then put back together then are you as a person being teleported or are you dying, your atoms transported, and then a new/identical person made at the other end of it. \n\nI lean more towards the latter but also agree with what u/Kelyaan said both with the science magic and that we have a pretty limited understanding of consciousness. \n\nTransporters and replicators are for one the most amazing technologies that we could pretty much ever develop hypothetically, but also the most potentially horrendous/abusable in terms of things that would most definitely get banned. They explore quite a few ideas with transporter and other tech gone wrong across Star Trek but really only scratched the surface.", "is_submitter": false, "distinguished": null, "created_utc": 1629735283.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "Kelyaan", "id": "ha1vdyq", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pa1ya6", "stickied": false, "body": "Transporters, Replicators and Holodecks are the dangerous ones.", "is_submitter": false, "distinguished": null, "created_utc": 1629737470.0, "parent_id": "t1_ha1q26d", "replies": []}, {"author": "roundearthervaxxer", "id": "ha3jltn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "I think it exposes a central misunderstanding of consciousness. I believe we are an emergent phenomenon of all of our processes together, as opposed to the ghost in the machine view. I have suffered over this question of individual consciousness for years. It would make sense if I was a collection of processes, like a robot that does everything that I do. Bug why is their a “me?” Why is there a concept of experience?", "is_submitter": true, "distinguished": null, "created_utc": 1629762767.0, "parent_id": "t1_ha1q26d", "replies": [{"author": "entropyStable", "id": "ha408tm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "pa1ya6", "stickied": false, "body": ">But why is their a “me?” Why is there a concept of experience?\n\nNatural selection + thermodynamics. Having experiences helps a lot in not dying to other things that have experiences; it also helps in eating and fucking. Profound questions can have very pedestrian answers.", "is_submitter": false, "distinguished": null, "created_utc": 1629770304.0, "parent_id": "t1_ha3jltn", "replies": []}]}]}, {"author": "MisanthropicScott", "id": "ha2rin2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pa1ya6", "stickied": false, "body": "This is why we won't be beaming anywhere. I think I got this from Dogbert's new ruling class or Dilbert future or something from Scott Adams. But, I couldn't find it on a quick google search.\n\nThe problem with beaming is that the people beaming you are your coworkers. These are the same people who can't be bothered to fill the toner or ink cartridges in the printer, the same people who can't start another pot of coffee when they drink the last cup.\n\nIf these people are beaming us, mistakes like the one you mention might happen. Or, we might be walking around with all sorts of stuff sticking out of us saying, \"Please excuse the knick knacks. I got beamed into a curio cabinet last week.\"^(*)\n\nRegarding consciousness, that gets harder. Are you talking about enough of a mess to prevent the brain from functioning altogether? Or, are you talking about splitting the brain between you and the bucket so that each have approximately 1/2 human consciousness? The latter would be sort of like The Rocky Horror Picture Show where Frank N Furter split Eddy's brain between Eddy and Rocky.\n\nEither way, I think the possibilities of what might happen when being beamed around by people with only the average level of competence at their job makes beaming people a really bad idea. Would like fries with your beaming today?\n\n\\* I'm pretty sure it's that curio cabinet line I got from Scott Adams.", "is_submitter": false, "distinguished": null, "created_utc": 1629750591.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "roundearthervaxxer", "id": "ha3lowr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "“These are the same people that can’t be bothered to fill toner cartridges” LOL!!!\n\nThis is the right answer. There are people that need to have their brain hemispheres separated surgically for medical reasons. What the hell is that like?!", "is_submitter": true, "distinguished": null, "created_utc": 1629763745.0, "parent_id": "t1_ha2rin2", "replies": []}]}, {"author": "Kelyaan", "id": "ha1jpae", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pa1ya6", "stickied": false, "body": "It wouldn't since the transporters work through science magic, It would just be you and the bucket of atoms as it knows which atoms go where until the plot calls for it,  \n\n\nWhat it means for consciousness - Very little as it's not something we can really look into much, Hell we still don't even know what really makes it.", "is_submitter": false, "distinguished": null, "created_utc": 1629732633.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "roundearthervaxxer", "id": "ha3k4g8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "When I think of going through the process in my mind, appearing on the planet as a set of twins, materializing, and what that would be like, there is something in that perplexing. Yes. There would be two of me with same memories, but which one am I?", "is_submitter": true, "distinguished": null, "created_utc": 1629763011.0, "parent_id": "t1_ha1jpae", "replies": [{"author": "Kelyaan", "id": "ha3ofvv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pa1ya6", "stickied": false, "body": "You'd be the one who's mind thinks \"Which one am I\"", "is_submitter": false, "distinguished": null, "created_utc": 1629765005.0, "parent_id": "t1_ha3k4g8", "replies": []}, {"author": "entropyStable", "id": "ha3zhz7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "pa1ya6", "stickied": false, "body": "You are only unique in that any two people diverge in experiences as they progress forwards in time. But at any instance you can be copied and multiple of you can exist, this feels wrong but under many definition of the self this is fine. Those two people (who are both you) will diverge in experiences and be different from each other (but both still your) as they go forwards in time.", "is_submitter": false, "distinguished": null, "created_utc": 1629769964.0, "parent_id": "t1_ha3k4g8", "replies": []}]}]}, {"author": "plasma_phys", "id": "ha1mrf5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #111", "submission": "pa1ya6", "stickied": false, "body": "In the world of Star Trek, this is pretty close to what happened to make [Thomas Riker](https://memory-alpha.fandom.com/wiki/Thomas_Riker) \\- and in that case, yes, they ended up with two people; although either could justifiably claim to be the original, their diverging experiences led to their different personalities. Questions about consciousness are likely why the writers of DS9 introduced the idea of [neural patterns](https://memory-alpha.fandom.com/wiki/Thomas_Riker) in the context of transporters - transporting the mind as well as the body. Nicely circumvents the whole issue.", "is_submitter": false, "distinguished": null, "created_utc": 1629733916.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "roundearthervaxxer", "id": "ha3kaeg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "They borrowed this Olof from “The Enemy Within,”\nWhich I thought touched on some really interesting topics.", "is_submitter": true, "distinguished": null, "created_utc": 1629763090.0, "parent_id": "t1_ha1mrf5", "replies": []}]}, {"author": "Paul_Thrush", "id": "ha1tbu6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "pa1ya6", "stickied": false, "body": "Star Trek teleportation doesn't ransport your atoms. It disassembles a person, records the state, and reassembles the person out of atoms at the target site.\n\nIt's also science fiction fantasy so hypithetical questions are pointless. The answer is wwhatever the writer wants it to be.", "is_submitter": false, "distinguished": null, "created_utc": 1629736628.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "entropyStable", "id": "ha3yxp5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "pa1ya6", "stickied": false, "body": "It is actually an interesting hypothetical for trying to understand what is the self.", "is_submitter": false, "distinguished": null, "created_utc": 1629769714.0, "parent_id": "t1_ha1tbu6", "replies": []}, {"author": "roundearthervaxxer", "id": "ha3l5pf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "I find hypothetical questions informative.", "is_submitter": true, "distinguished": null, "created_utc": 1629763495.0, "parent_id": "t1_ha1tbu6", "replies": []}]}, {"author": "DoglessDyslexic", "id": "ha5fblo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pa1ya6", "stickied": false, "body": "This is actually a well known philosophical problem known as the [teletransportation paradox](https://en.wikipedia.org/wiki/Teletransportation_paradox) mixed with another philosophical problem known as the [ship of Theseus](https://en.wikipedia.org/wiki/Ship_of_Theseus).", "is_submitter": false, "distinguished": null, "created_utc": 1629805540.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "DoglessDyslexic", "id": "ha5fxk6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pa1ya6", "stickied": false, "body": "And also I'd note that questions of death/new person are somewhat subject to context.  Technically the original body you existed in would be no more which is a kind of death, however it would clearly not result in a dead body and arguably if we view our brains as state machines, that state machine would continue on in two separate bodies.  Both of which would be \"you\" although different instances of you which would constitute individual beings.  \n\nI'd note that even if you merely constructed a new body from a bucket based on an original template that would also be an instance of you, just not one based on your originating atoms, which seems a particularly pointless distinction.  We (our consciousnesses) are not the specific atoms that comprise us, but rather the configuration of those atoms.  Substituting different atoms doesn't alter the consciousness those atoms represent.  And in fact we are constantly changing which atoms we are comprised of.", "is_submitter": false, "distinguished": null, "created_utc": 1629805915.0, "parent_id": "t1_ha5fblo", "replies": []}, {"author": "roundearthervaxxer", "id": "ha67u8r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": ">I would be glad to know your Lordship's opinion whether when my brain has lost its original structure, and when some hundred years after the same materials are fabricated so curiously as to become an intelligent being, whether, I say that being will be me; or, if, two or three such beings should be formed out of my brain; whether they will all be me, and consequently one and the same intelligent being.\n\nAwesome! I had never heard of either. This really gets at the heart of it for me. If I die, and they can somehow make an exact duplicate of my brain 100 years from now with new atoms, would I be not dead? What about the exact same form with new atoms?\n\nHow much of my brain would they need to alter before I would lose a sense of self?\n\nDo you know of any links that go into this?", "is_submitter": true, "distinguished": null, "created_utc": 1629819233.0, "parent_id": "t1_ha5fblo", "replies": [{"author": "DoglessDyslexic", "id": "ha6mu3e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "pa1ya6", "stickied": false, "body": "> If I die, and they can somehow make an exact duplicate of my brain 100 years from now with new atoms, would I be not dead? What about the exact same form with new atoms?\n\nYou yourself will presumably be dead because you'll die.  However the new copy of you will be an instance of you from the moment of copying and will exist as a separate entity.  Bottom line, unless we can do a ship of Theseus gradual replacement of our brains a piece at a time into a more permanent medium then we die when our body dies.  Copies of us may live on (and there's multiple science fiction explorations of this, my favorite being Walter Jon Williams \"Implied Spaces\", but also Cory Doctorow's \"Down and Out in the Magic Kingdom\") but they are separate instances of you.  Just like identical twins are separate individuals even though based on the same DNA, copies of you are distinct individuals.", "is_submitter": false, "distinguished": null, "created_utc": 1629825322.0, "parent_id": "t1_ha67u8r", "replies": [{"author": "roundearthervaxxer", "id": "ha7huvm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": ">However the new copy of you will be an instance of you from the moment of copying and will exist as a separate entity.\n\nWhy? What evidence do we have for this. People die in surgery and presumably come back the same people. What makes us somehow different than a computer that gets turned off and back on? \n\nIs there some \"center\" that once turned off it breaks the continuity of existence? I don't see a lot of evidence to support this and it may be unknowable.", "is_submitter": true, "distinguished": null, "created_utc": 1629837591.0, "parent_id": "t1_ha6mu3e", "replies": []}]}]}]}, {"author": "CarcassFiend", "id": "ha1o2ia", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #143", "submission": "pa1ya6", "stickied": false, "body": "I think the teleporter theory that you die each time goes along with this well. You die, but a copy of you is created and doesn't realize the original consciousness has ceased to be. In this all new copies are real and you but not the original consciousness.", "is_submitter": false, "distinguished": null, "created_utc": 1629734454.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "Cheomesh", "id": "ha1wjoy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "pa1ya6", "stickied": false, "body": "Yeah, that's how it was established to work by Roddenberry.  The person going in is deceased and a new one is created on the other end.\n\nI always figured the implication was that a specific person does not matter in their society so much as their skillset.\n\nRaises a lot of questions too, like why they don't use that technology to just batch-produce copies of the best and brightest, or at least keep a version in a buffer as backup (similar to what happened to Scotty in one movie).", "is_submitter": false, "distinguished": null, "created_utc": 1629737941.0, "parent_id": "t1_ha1o2ia", "replies": []}, {"author": "shig23", "id": "ha1qxkr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pa1ya6", "stickied": false, "body": "It’s an apt metaphor for physical and psychological reality. The only thing connecting me to the \"me\" of 20 years ago is my memories; everything else is completely different.", "is_submitter": false, "distinguished": null, "created_utc": 1629735643.0, "parent_id": "t1_ha1o2ia", "replies": [{"author": "roundearthervaxxer", "id": "ha3knhi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "There is more too it though. If you got amnesia, you would still be you.", "is_submitter": true, "distinguished": null, "created_utc": 1629763259.0, "parent_id": "t1_ha1qxkr", "replies": [{"author": "shig23", "id": "ha3tn5k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pa1ya6", "stickied": false, "body": "Meaning if I lost all of my memories? Sure. There would still be people around me who knew my story and could tell it to me. If my house and all my things were still there, I could piece my life back together from the clues of my environment. And if I had access to my online presence, all those decades of messages and blog entries, it’d be a piece of cake. \n\nBut if I were taken away from all of that, set down far from my home and everyone who ever knew me, and my memories taken from me… no, I would no longer be me. \"I\" am not flesh and blood and the ability to think. I am a narrative, a continuity of memory, no more nor less. If the narrative is cut off, then I start over afresh as a completely empty vessel.", "is_submitter": false, "distinguished": null, "created_utc": 1629767325.0, "parent_id": "t1_ha3knhi", "replies": []}]}]}, {"author": "roundearthervaxxer", "id": "ha3kk6p", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "That is a convenient solution. Do you think that “you” are the atoms that make you up or the form that they are in?", "is_submitter": true, "distinguished": null, "created_utc": 1629763217.0, "parent_id": "t1_ha1o2ia", "replies": []}, {"author": "entropyStable", "id": "ha3yn6l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "pa1ya6", "stickied": false, "body": "By this definition someone who goes into surgery dies and a different person comes back as consciousness is suspended and different one is rebooted?  I'm taking a definition of consciousness that at least requires communication between regions of the brain and thus some anesthesia meet the bar of turning off your consciousness.", "is_submitter": false, "distinguished": null, "created_utc": 1629769583.0, "parent_id": "t1_ha1o2ia", "replies": [{"author": "CarcassFiend", "id": "ha57w5c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #143", "submission": "pa1ya6", "stickied": false, "body": "There is a theory that parallels the transporter one where consciousness is on a per instance basis. Any time a person loses consciousness, that person technically ceases to be, and upon waking is a completely new instance. Imperceptibly different because that instance has all the same memories etc.", "is_submitter": false, "distinguished": null, "created_utc": 1629800249.0, "parent_id": "t1_ha3yn6l", "replies": [{"author": "entropyStable", "id": "ha5sbn5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "pa1ya6", "stickied": false, "body": "Sure can define consciousness like that but you create a bunch of moral problems when you do. \n\nThe simplest is if you go into surgery and some terminates the empty meat sack have they done something wrong. Can you still count wrongs done against the prior person who went it surgery after you come out of surgery. \n\nSo either this instance based consciousness isn't correct or ou4 moral system is deeply flawed (or the moral system isn't related to consciousness but this is hard to argue). Given that both our moral system and consciousness can't be proven it could be that the instance theory is correct but believing that implies a lot about your moral system.", "is_submitter": false, "distinguished": null, "created_utc": 1629812472.0, "parent_id": "t1_ha57w5c", "replies": []}]}]}]}, {"author": "Zealousideal_Mix_629", "id": "ha1ot6d", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "pa1ya6", "stickied": false, "body": "Just an exact copy.", "is_submitter": false, "distinguished": null, "created_utc": 1629734762.0, "parent_id": "t3_pa1ya6", "replies": []}, {"author": "BuccaneerRex", "id": "ha1t7zd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pa1ya6", "stickied": false, "body": "It depends on your perspective. Are you the components? Or are you the arrangement of the components? \n\nThis falls victim to the illusion of continuity. \n\nThink of the Ship of Theseus (my grandfather's axe, etc.). If you have a sailboat, and you replace it piece by piece, until nothing of the original boat remains, is it the same boat?\n\nBut in this scenario, what if you replaced each piece of the boat one by one, but then used the replaced pieces to build another boat? Which boat is the 'original'. \n\nIf you build a house out of Lego, and then take it apart and put it in the bucket, where did the house go? It's clearly not in the bucket. \n\nEach of your teleporter copies would believe themselves to be 'you', and they'd both be 'right'. The problem is not with their perspectives or yours, its with the definition of what 'you' are.", "is_submitter": false, "distinguished": null, "created_utc": 1629736584.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "roundearthervaxxer", "id": "ha3l2co", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "Exactly! Great explanation :) this is the form matter dichotomy, are you the atoms that comprise your body or the form that they are arranged in?\n\nAs Neuralink tech advances, and we can offload brain processes to computers, maybe this will shine some light on topics like this.", "is_submitter": true, "distinguished": null, "created_utc": 1629763452.0, "parent_id": "t1_ha1t7zd", "replies": [{"author": "BuccaneerRex", "id": "ha5kz8t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pa1ya6", "stickied": false, "body": "> are you the atoms that comprise your body or the form that they are arranged in?\n\nYes. It's not an either-or question.", "is_submitter": false, "distinguished": null, "created_utc": 1629808805.0, "parent_id": "t1_ha3l2co", "replies": [{"author": "roundearthervaxxer", "id": "ha6712l", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "I don't think we know. More, it may be unknowable.", "is_submitter": true, "distinguished": null, "created_utc": 1629818898.0, "parent_id": "t1_ha5kz8t", "replies": []}]}]}]}, {"author": "Cheomesh", "id": "ha1vzt0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "pa1ya6", "stickied": false, "body": "FWIW, the transporter always kills you.  When you step in and the sequence starts, you don't just suddenly find yourself somewhere else - the lights go out and you are deceased.  Somewhere else, a copy of you is created with all your memories and that copy continues on.", "is_submitter": false, "distinguished": null, "created_utc": 1629737716.0, "parent_id": "t3_pa1ya6", "replies": []}, {"author": "Stand_kicker", "id": "ha20cnv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #65", "submission": "pa1ya6", "stickied": false, "body": "They have transported multiple people simultaneously without their atoms getting mixed up (mostly).\n\nThe same would apply here. It's a boring answer, I know.", "is_submitter": false, "distinguished": null, "created_utc": 1629739482.0, "parent_id": "t3_pa1ya6", "replies": []}, {"author": "prajnadhyana", "id": "ha3lcle", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pa1ya6", "stickied": false, "body": "Atoms are fungible, so you would be no different. There would be two identical people.", "is_submitter": false, "distinguished": null, "created_utc": 1629763585.0, "parent_id": "t3_pa1ya6", "replies": [{"author": "roundearthervaxxer", "id": "ha3lu17", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "Right but which one are you?", "is_submitter": true, "distinguished": null, "created_utc": 1629763812.0, "parent_id": "t1_ha3lcle", "replies": [{"author": "prajnadhyana", "id": "ha3mpj9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pa1ya6", "stickied": false, "body": "Both. They are absolutely identical.", "is_submitter": false, "distinguished": null, "created_utc": 1629764218.0, "parent_id": "t1_ha3lu17", "replies": [{"author": "entropyStable", "id": "ha3xbgu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "pa1ya6", "stickied": false, "body": ">Both. They are absolutely identical.\n\nUntil they have different experiences and there are two of you that are different people but both you.", "is_submitter": false, "distinguished": null, "created_utc": 1629768984.0, "parent_id": "t1_ha3mpj9", "replies": [{"author": "prajnadhyana", "id": "ha5woye", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pa1ya6", "stickied": false, "body": "Taking that thought even further: I'm a different person than I was 10 years ago, but I'm still me.", "is_submitter": false, "distinguished": null, "created_utc": 1629814456.0, "parent_id": "t1_ha3xbgu", "replies": []}]}, {"author": "roundearthervaxxer", "id": "ha4mqy4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "Let’s say on the planet, one twin is looking at a cliff and one the shuttle craft. You step into the transporter, when you materialize which so you see? You can’t see both. If you see the shuttlecraft, why? Why weren’t you the cliff guy?", "is_submitter": true, "distinguished": null, "created_utc": 1629782648.0, "parent_id": "t1_ha3mpj9", "replies": [{"author": "prajnadhyana", "id": "ha5wlgh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pa1ya6", "stickied": false, "body": "That question is nonsensical. \"I\" was both. \"I\" am seeing both the shuttlecraft and the cliff. They are both \"me.\"", "is_submitter": false, "distinguished": null, "created_utc": 1629814413.0, "parent_id": "t1_ha4mqy4", "replies": [{"author": "roundearthervaxxer", "id": "ha65zu8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "Perhaps. What if they pulled all new atoms. Would it still be \"you\" - that is, are you the form that your atoms are in or the actual atoms themselves?", "is_submitter": true, "distinguished": null, "created_utc": 1629818467.0, "parent_id": "t1_ha5wlgh", "replies": [{"author": "prajnadhyana", "id": "ha8fq9d", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pa1ya6", "stickied": false, "body": "Atoms are fungible. There is literally no way to tell one atom from another. They are identical in every way. \n\nWell, atoms of the same element of course.", "is_submitter": false, "distinguished": null, "created_utc": 1629852480.0, "parent_id": "t1_ha65zu8", "replies": [{"author": "roundearthervaxxer", "id": "ha8ilnm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "Interesting. New question, if they could stop every process in your brain instantly and restart it 100 years from now, do you think there would be a continuity of self, or more that there would be an identical you, but not you.", "is_submitter": true, "distinguished": null, "created_utc": 1629853794.0, "parent_id": "t1_ha8fq9d", "replies": [{"author": "prajnadhyana", "id": "ha8me2p", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "pa1ya6", "stickied": false, "body": "I suppose if it was the same brain then it would a continuity of self, as in the same \"me\" that is typing these words right now. I've had surgery where I was under general anesthesia and that was literally like my \"self\" was turned off and then back on. \n\nIf they recreated my brain, atom for atom, I would think of it as an identical \"me\", but not the same \"me\" that is typing these words.", "is_submitter": false, "distinguished": null, "created_utc": 1629855542.0, "parent_id": "t1_ha8ilnm", "replies": [{"author": "roundearthervaxxer", "id": "hbi74yp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pa1ya6", "stickied": false, "body": "So, if you get transported into 2 people, there are two new yous, they both feel continuity of self. What if they transport you into a planet full of people, they all have a continuity of self. What if they go the other way and transport a planet full of yous into one, does the same apply?\n\nDoes this argue for the idea that there is somehow one universal consciousness that we are all taking part in?", "is_submitter": true, "distinguished": null, "created_utc": 1630710262.0, "parent_id": "t1_ha8me2p", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "entropyStable", "id": "ha3x3by", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "pa1ya6", "stickied": false, "body": "Nobody knows what defines the \"self\" and so your definition of the \"self\" will determine if it is you or someone new.\n\nMy personal take is that the \"self\" is devoid from the specific atoms (on the micro scale) that make us up, as we don't feel like we are loosing ourself as we exchange atoms, among other reasons.  \n\nIgnoring the QM issues I would say there are two of you created  (no matter where the atoms came from). BUT it gets crazier the moment each of these new you experience something different they are now different individuals! So two of you are created and then the two of you become different people from each other.", "is_submitter": false, "distinguished": null, "created_utc": 1629768882.0, "parent_id": "t3_pa1ya6", "replies": []}, {"author": "haz_mat_", "id": "ha8ie64", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "pa1ya6", "stickied": false, "body": "I think the dirty little secret of the Star Trek teleporter is that it was actually just a remote replicator. They copy you then 'delete' the original.", "is_submitter": false, "distinguished": null, "created_utc": 1629853698.0, "parent_id": "t3_pa1ya6", "replies": []}, {"author": "FalconRelevant", "id": "ha9e8zq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Archon", "submission": "pa1ya6", "stickied": false, "body": "Star Trek isn't really scientifically or logically accurate you know, there was a transporter accident in which a person was split int a \"good\" and \"evil\" part, like wtf?", "is_submitter": false, "distinguished": null, "created_utc": 1629870938.0, "parent_id": "t3_pa1ya6", "replies": []}]}