{"title": "Everybody’s struggle is real. What is yours?", "name": "t3_p04ogi", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p04ogi/everybodys_struggle_is_real_what_is_yours/", "selftext": "Mine, today... contract got extended so making O.K. money. Covid passion game project is flagging. Trying to be ok with it not making it. It is hard after a so many hours. What doesn’t kill ya’ I guess.", "score": 9, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/p04ogi/everybodys_struggle_is_real_what_is_yours/", "id": "p04ogi", "author": "roundearthervaxxer", "link_flair_text": "Question", "num_comments": 27, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628382331.0, "comments": [{"author": "Financial-Process-86", "id": "h84o30x", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #268", "submission": "p04ogi", "stickied": false, "body": "Yeah I quit my job. Couldn't handle the bullshit anymore", "is_submitter": false, "distinguished": null, "created_utc": 1628392277.0, "parent_id": "t3_p04ogi", "replies": []}, {"author": "John__Nash", "id": "h84d3pv", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #17", "submission": "p04ogi", "stickied": false, "body": "Yep. If this one isn't it, take the things you learned and apply it to the next project. I hope you make a game that makes you happy.", "is_submitter": false, "distinguished": null, "created_utc": 1628386158.0, "parent_id": "t3_p04ogi", "replies": []}, {"author": "TemporaryMayGoAway", "id": "h855wrs", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #9", "submission": "p04ogi", "stickied": false, "body": "For this year and onward. Multiple struggles but I'll keep it to my top 3. \n\n1. Finding internships/job that are flexible to me being caretaker to parents. \n2. Getting my parents retail property sold/rented so they can use that income toward their expenses. This hurts the most because they save up about 20 years before buying and preparing for retail business but then found out about cancer, kidney disease so everything was put to a halt. I really do want to open it for them because I see the sadness of the dream so close but now so far.\n3. Nearing my career change with 2nd bachelor in mechanical engineering and entering final semester. Main concern is getting our senior design team project printed on 3d metal printer. Finding a company has not been easy given part size.", "is_submitter": false, "distinguished": null, "created_utc": 1628404125.0, "parent_id": "t3_p04ogi", "replies": [{"author": "roundearthervaxxer", "id": "h8674iq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "1) for what it is worth, it is a buyers market for job hunters right now. Good time to hit the accelerator (you probably already are)\n\n2) our health care system is horrible. I am very sorry. The housing market favors sellers now too. I hope you get that sorted.\n\n3) 3D printing is awesome. Have you looked into international services?", "is_submitter": true, "distinguished": null, "created_utc": 1628432561.0, "parent_id": "t1_h855wrs", "replies": [{"author": "TemporaryMayGoAway", "id": "h89eboy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #9", "submission": "p04ogi", "stickied": false, "body": "Thanks. I'm limited to the US due to the nature of the project and sponsor.", "is_submitter": false, "distinguished": null, "created_utc": 1628493059.0, "parent_id": "t1_h8674iq", "replies": []}]}]}, {"author": "H0bg0blin0verl0rd", "id": "h8784ey", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p04ogi", "stickied": false, "body": "I burned out bad after five years working in a factory. The money was good, the work was steady, but everything about that place was toxic. It was like walking around in Chernobyl:  I couldn't see any physical damage but I was always aware that the 'radiation' was killing me. Towards the end I was having anxiety and panic attacks just trying to get to work. I'd have them in the middle of the shift and it was so fucking humiliating.\n\nMy condition just got worse and worse until finally I couldn't take it anymore. I stopped coming into work, then eventually called to tell them I wasn't able to do it anymore.\n\nIn trying to understand what was wrong with me, I found out I  was autistic and had ADHD. Once I knew that pretty much EVERYTHING started making a lot more sense.\n\nJust because it makes sense though doesn't mean the struggle's over. See I was wearing a mask for pretty much my whole life, but that mask didn't fit me, and I'd never wanted it in the first place. It was forced upon me by my parents, by my peers and teachers and the other adults in my life. They shaped it, they forced me to wear the mask 24/7.\n\nNow it's gone and I don't know how to make a new one. I can't even pretend like I want to go back into the workforce anymore. Even staring down the barrel of homelessness and starvation I still just can't do it. I don't want to be a productive member of a society that has never wanted the real, authentic me, and never will. I'd rather wander off into the wilds and try to die peacefully on my own terms than keep living by everyone else's. \n\nThere's no logic to that feeling, and I'm still trying to find some way to make a living that won't leave me feeling crushed, broken, and hopeless, but it's a half-hearted, insincere effort. I don't want to wear the mask anymore. I don't want to lie and be dishonest just to get by. I don't want to sell my time just for the privilege of existing.\n\nThat's all there is in this life, though. My struggle is trying to figure out how to exist in a world that doesn't want me and that I want no part of.", "is_submitter": false, "distinguished": null, "created_utc": 1628449950.0, "parent_id": "t3_p04ogi", "replies": [{"author": "roundearthervaxxer", "id": "h87fqv8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "Work-life can be a soul sucker to be sure. Hypothetical: If you could live off the land, hunting your own food, finding water, etc. Would that appeal to you? It would be hard work.", "is_submitter": true, "distinguished": null, "created_utc": 1628453526.0, "parent_id": "t1_h8784ey", "replies": [{"author": "H0bg0blin0verl0rd", "id": "h87g4ub", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p04ogi", "stickied": false, "body": "I suppose, yes. The problem with that lifestyle is that I very much enjoy the internet. I love my tablet specifically because it's such an efficient storage medium for my greatest love in life: literature. I also don't know the first thing about hunting, but I do have some idea of how to garden.\n\nI could probably be happy living like a primitive, but it would be a pathetically limited existence in a world that provides endless opportunities to those with the wealth to pay for them.", "is_submitter": false, "distinguished": null, "created_utc": 1628453708.0, "parent_id": "t1_h87fqv8", "replies": []}]}]}, {"author": "NoSuchKotH", "id": "h85e4km", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p04ogi", "stickied": false, "body": "I'm trying to science the shit out of this planet, but it isn't working much... Math is hard, especially if you are an engineer.", "is_submitter": false, "distinguished": null, "created_utc": 1628411078.0, "parent_id": "t3_p04ogi", "replies": [{"author": "roundearthervaxxer", "id": "h866iw9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "It doesn’t help that we are in a new dark ages with flat earthers and anti vaxxers", "is_submitter": true, "distinguished": null, "created_utc": 1628432253.0, "parent_id": "t1_h85e4km", "replies": [{"author": "NoSuchKotH", "id": "h8688ny", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p04ogi", "stickied": false, "body": "I don't really care about most of them. Beside the covidiots, they are just a minority that don't affect my daily life. And as for the covidiots, I can't do anything about them. They don't listen to reason. They have so completely bought into this BS that anyone who says something that contradicts their religion is shunned or worse, stoned.", "is_submitter": false, "distinguished": null, "created_utc": 1628433129.0, "parent_id": "t1_h866iw9", "replies": [{"author": "roundearthervaxxer", "id": "h8690j1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "They are why we can’t have nice things. Social media needs to be regulated", "is_submitter": true, "distinguished": null, "created_utc": 1628433513.0, "parent_id": "t1_h8688ny", "replies": [{"author": "NoSuchKotH", "id": "h86asyg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p04ogi", "stickied": false, "body": "That's a very simplistic view of the world.\n\nDisagreement is part of being human. Finding ways how to reach an accord is what makes us better. Without people disagreeing, we will only ever be at the same spot, doing the same things over and over again. Where we lost is, that we made it a virtue to accept other opinions without ever understanding them. Instead of talking, we shunned those who did not follow the same faith as we do. We drove a wedge into our society ourselves.\n\nSocial media is not to blame what happened. Neither will regulating it fix the underlying problems. Problems that run much deeper.", "is_submitter": false, "distinguished": null, "created_utc": 1628434392.0, "parent_id": "t1_h8690j1", "replies": [{"author": "roundearthervaxxer", "id": "h86hrte", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "\\> Where we lost is, that we made it a virtue to accept other opinions without ever understanding them.\n\nThis is right. Social media has a lot to do with this. Everybody started trusting their intuitions over trusting experts that have spent their entire lives learning about their field. It wasn't like this before. If it were, we would still be fighting polio.\n\nThe same science that puts people on the moon makes vaccines. Are there corporate interests that manipulate markets and policy? Sure. We need to be wary of that. We also need to trust career professionals that work every day to improve the lives of people.\n\nPut simply, 'question authority' became 'abandon authority' and that is not very well thought out.", "is_submitter": true, "distinguished": null, "created_utc": 1628437772.0, "parent_id": "t1_h86asyg", "replies": [{"author": "NoSuchKotH", "id": "h86k72q", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p04ogi", "stickied": false, "body": "Sorry, it's sunday. I don't feel like explaining to you that people like these existed 50 years ago already. Call your grandfather/grandmother and ask them about the conspiracy and anti-authoritarian people back in their days. And if you want to have fun, ask them about the flower-power movement.", "is_submitter": false, "distinguished": null, "created_utc": 1628438901.0, "parent_id": "t1_h86hrte", "replies": [{"author": "roundearthervaxxer", "id": "h86qgj4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "This idea that you need to \"explain things to me\" tells me everything I need to know about this discussion. I was trying to have a conversation where we respected each other.\n\nFauci himself said that if the same attitudes existed when we were vaccinating against Polio, it would likely still be with us.\n\n\"The term 'flower power' became synonymous with the 1960's. This slogan is used to describe the passive, peaceful resistance movement of the time, which was rooted in the opposition against the Vietnam War.\"\n\nSounds like some pretty cool people. That was the \"Question Authority\" people I was talking about. They got it right.\n\nHave a good Sunday.", "is_submitter": true, "distinguished": null, "created_utc": 1628441792.0, "parent_id": "t1_h86k72q", "replies": []}]}]}]}]}]}]}]}, {"author": "PalatableNourishment", "id": "h85mad3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "p04ogi", "stickied": false, "body": "I have a job but it doesn’t pay that well and my boss is getting lazy in a way that’s setting off warning bells in my head. My position is contract based so I have no job security. I’m looking for a new one and it’s stressful. The only interview I’ve gotten so far went well but it turned out they paid 30% less than what I make now and wouldn’t negotiate.", "is_submitter": false, "distinguished": null, "created_utc": 1628418562.0, "parent_id": "t3_p04ogi", "replies": [{"author": "roundearthervaxxer", "id": "h866eiy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "Lazy bosses are the worst. I am a contractor and I survive by casting a huge net. I also turn down bad offers and always apply up.", "is_submitter": true, "distinguished": null, "created_utc": 1628432190.0, "parent_id": "t1_h85mad3", "replies": [{"author": "PalatableNourishment", "id": "h86a5pr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "p04ogi", "stickied": false, "body": "I am just now getting the confidence to apply up and cast the net wide. I know I will be valuable anywhere I work because I have a good work ethic and I’m an extremely quick learner. I just don’t want to end up somewhere that doesn’t value their employees. I don’t need a massive salary but I want to build a life and have some job security. Has work been good for you in the pandemic? Here (Maritime Canada), contractors had tons of work but then it got a bit difficult because there was a shortage of building materials.", "is_submitter": false, "distinguished": null, "created_utc": 1628434079.0, "parent_id": "t1_h866eiy", "replies": [{"author": "roundearthervaxxer", "id": "h86bdqj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "You are definitely valuable! I would spend an hour per day applying to jobs that look like a good fit. Really tighten up your resume and cover, if you haven't.\n\nI have always been a contractor. I have grown to like it.\n\nDon't get phased by rejection letters. They are looking at a lot of candidates and sometimes need to make hard decisions.", "is_submitter": true, "distinguished": null, "created_utc": 1628434673.0, "parent_id": "t1_h86a5pr", "replies": []}]}]}]}, {"author": "human_shadow", "id": "h85pafw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #3", "submission": "p04ogi", "stickied": false, "body": "For months, I have weighed pros and cons of some decisions that I will either make, or they will be made for me. \n\nThe result? \n\nThere isn't one aside from endless internal debate that is both maddening and distracting. Do I want to try again? How much of myself am I willing to devote? Will it be different and what if it's not? What else could I be doing or is there anything else I should be doing?\n\nMeh.  Overthinking is overrated. \n\nI'm sorry, what was the question? I was just distracted thinking about what to do with life... again...for the hundredth time...this month...", "is_submitter": false, "distinguished": null, "created_utc": 1628421161.0, "parent_id": "t3_p04ogi", "replies": [{"author": "roundearthervaxxer", "id": "h8666xw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "One lesson my pops shared while he was still around was don’t get paralyzed by a decision. Often either choice is better than stressing over them.", "is_submitter": true, "distinguished": null, "created_utc": 1628432079.0, "parent_id": "t1_h85pafw", "replies": [{"author": "human_shadow", "id": "h8669pd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #3", "submission": "p04ogi", "stickied": false, "body": "Sound logic.", "is_submitter": false, "distinguished": null, "created_utc": 1628432119.0, "parent_id": "t1_h8666xw", "replies": []}]}]}, {"author": "noodlefrits", "id": "h85uue1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #1", "submission": "p04ogi", "stickied": false, "body": "I just woke up and have to pee pretty bad, but my roommate is in the bathroom taking a shower.", "is_submitter": false, "distinguished": null, "created_utc": 1628425378.0, "parent_id": "t3_p04ogi", "replies": [{"author": "roundearthervaxxer", "id": "h865ycp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p04ogi", "stickied": false, "body": "If that is your biggest problem, you are in pretty good shape!", "is_submitter": true, "distinguished": null, "created_utc": 1628431953.0, "parent_id": "t1_h85uue1", "replies": [{"author": "noodlefrits", "id": "h866d4t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #1", "submission": "p04ogi", "stickied": false, "body": "It was the most pressing one at the time", "is_submitter": false, "distinguished": null, "created_utc": 1628432170.0, "parent_id": "t1_h865ycp", "replies": []}]}]}, {"author": "An_Dr01d", "id": "h88bjzl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #66", "submission": "p04ogi", "stickied": false, "body": "Dealing with my mental health.", "is_submitter": false, "distinguished": null, "created_utc": 1628468899.0, "parent_id": "t3_p04ogi", "replies": []}]}