{"title": "We need to be seeing more memorials for the people we lost to Covid on Television.", "name": "t3_p4vpzd", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p4vpzd/we_need_to_be_seeing_more_memorials_for_the/", "selftext": "We are talking over a half a million people. \n\nA third, if not a half of the people in this country don't believe in facts. It is the media's responsibility to show real stories of grief and loss. It is the best way to get vaccination levels to the point where they need to be.\n\nI remember soldier casualty counts on the news every night during the Vietnam war. We lost 10 times as many people to Covid.", "score": 15, "upvote_ratio": 0.89, "permalink": "/r/TheFlyingTree/comments/p4vpzd/we_need_to_be_seeing_more_memorials_for_the/", "id": "p4vpzd", "author": "roundearthervaxxer", "link_flair_text": "Discussion", "num_comments": 36, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629041844.0, "comments": [{"author": "usernames_suck_ok", "id": "h9248yt", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "p4vpzd", "stickied": false, "body": "At one point, every day CNN and MSNBC were doing mini-memorials, and you probably know how many people feel about CNN and MSNBC. People turn off/refuse to watch what they don't want to see and hear. And even CNN and MSNBC have moved on.\n\nI work in marketing, and I have to disagree that this would make a significant impact in getting people vaccinated. This is not like trying to get people to buy a product. This has become very politicized, and some people seriously think this is about their ***personal freedom*** and as if it has nothing to do with anyone else, because it's deeper--**half of our country cares absolutely nothing about other people**, and many of that half are unfazed when you tell them how COVID-19 could affect even just themselves. \n\nThose people also are highly focused on believing what they want to believe, which is why I blame the CDC in large part for these stagnant vaccination rates and the US moving on from paying attention to COVID-19 or from treating it like it's still a threat. They just simply fucked up when they came out and said vaccinated people don't need to wear masks, knowing the Delta variant was out there and knowing there would likely be many other variants coming, and knowing how low the vaccination rates were at that point and that no proof would be required that you're actually vaccinated. All hell broke loose after they did that, i.e. sports stadiums/arenas started fully opening, travel went up, schools decided they were going to open up, stores went back to normal hours, all kinds of people quit wearing masks regardless of their vaccination status, etc...and now we have cities, states, doctors, nurses and hospitals crying and whining about being overloaded and running out of space like they were doing last spring and last summer. \n\nIf the CDC--whom we really should be able to rely on for info about the virus and vaccines--weren't so full of shit with the flip-floppy info they give out, stuff that they could foresee that maybe they shouldn't say or advise...you might not be sitting here going back and forth with people about whether or not the ***media*** should have the burden of trying to convince people to get vaccinated. Really, the CDC just needs to get its shit together and/or get competent people within their organization.", "is_submitter": false, "distinguished": null, "created_utc": 1629051200.0, "parent_id": "t3_p4vpzd", "replies": [{"author": "dashingThroughSnow12", "id": "h935pqb", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p4vpzd", "stickied": false, "body": "I like some of what your saying, dislike other parts. I'd probably say the same about my own ideas.", "is_submitter": false, "distinguished": null, "created_utc": 1629067575.0, "parent_id": "t1_h9248yt", "replies": []}, {"author": "roundearthervaxxer", "id": "h94a2s3", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "People really respond to human interest stories. It would have an effect. They should test it in certain markets.", "is_submitter": true, "distinguished": null, "created_utc": 1629088013.0, "parent_id": "t1_h9248yt", "replies": []}]}, {"author": "DrinkingAtQuarks", "id": "h91jzvb", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #142", "submission": "p4vpzd", "stickied": false, "body": "At least in the US, I suspect this would be dismissed as propaganda by many people.", "is_submitter": false, "distinguished": null, "created_utc": 1629042744.0, "parent_id": "t3_p4vpzd", "replies": [{"author": "NotAnotherHipsterBae", "id": "h91o0lt", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #85", "submission": "p4vpzd", "stickied": false, "body": "Yeah, it’d be looked at as propaganda. Plus the politicized media wouldn’t show it cause they’ll loose viewers. Why truth is placed under opinions is atrocious.", "is_submitter": false, "distinguished": null, "created_utc": 1629044421.0, "parent_id": "t1_h91jzvb", "replies": [{"author": "roundearthervaxxer", "id": "h91qvo2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "Yes, it would be bad for ratings, but as a matter of public health, it is a national priority. I work in advertising. It is not a question if it would lead to more vaccinations, how many is the question.\n\nThey should at least pilot a program in certain areas. I won't at all be surprised if we start this. We are running out of options.", "is_submitter": true, "distinguished": null, "created_utc": 1629045632.0, "parent_id": "t1_h91o0lt", "replies": []}]}, {"author": "roundearthervaxxer", "id": "h91qiwp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "Maybe to a degree, but real stories of grieving families could well have an effect.", "is_submitter": true, "distinguished": null, "created_utc": 1629045481.0, "parent_id": "t1_h91jzvb", "replies": [{"author": "Zealousideal_Mix_629", "id": "h91r7xk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p4vpzd", "stickied": false, "body": "That would get me to change the channel immediately.", "is_submitter": false, "distinguished": null, "created_utc": 1629045770.0, "parent_id": "t1_h91qiwp", "replies": [{"author": "vook485", "id": "h9y430v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p4vpzd", "stickied": false, "body": "Good point. I'm vaccinated and would probably change the channel too if I watched TV. You can't forcibly educate American idiots, but states *can* invoke [this 1905 SCOTUS decision](https://en.wikipedia.org/wiki/Jacobson_v._Massachusetts) and compel vaccination of anyone who doesn't have a medical contraindication. (Note that in 1905 vaccines *in general* were more experimental than mRNA vaccines in particular are today, and even with our drastically higher standards the SARS-CoV-2 vaccines are rapidly approaching general approval.)\n\nI expect that there are few enough people who'd put in the effort to doctor shop for a fake contraindication that we'd reach 90+% vaccination pretty quickly. If not, then they can start examining the particular claimed contraindications and the doctors giving them.  Medical licenses can be revoked from doctors practicing fake medicine. States can severely penalize people who lie to neglect their responsibility to prevent spreading a deadly communicable disease.", "is_submitter": false, "distinguished": null, "created_utc": 1629662074.0, "parent_id": "t1_h91r7xk", "replies": [{"author": "Zealousideal_Mix_629", "id": "h9y9qlk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p4vpzd", "stickied": false, "body": "They could,  but they would have Civil unrest.", "is_submitter": false, "distinguished": null, "created_utc": 1629664584.0, "parent_id": "t1_h9y430v", "replies": [{"author": "vook485", "id": "h9yuu1j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p4vpzd", "stickied": false, "body": "Just send in the National Guard because no one good cares if they shoot the rioters (/s)\n\nSeriously, the \"law and order\" position is nearly everyone gets vaccinated, making it mandatory as soon as vaccines get full regular approval instead of just emergency use authorization (I need to read up on that, but I think it's just a matter of time), and clamp down hard against anyone who violates the rules. We've already seen that the USA's society can survive throwing millions of people into prison for nonviolent crimes, so why not combine that \"tough on crime\" drug war era rhetoric with \"tough on virus\"?\n\nI mean, I know the answer is that there's too much overlap between the people who enforce the laws and the people who break the laws in this case, due to how mitigating and ending this pandemic has been politicized. Also, even with a former prosecuting criminal attorney as Vice President, I don't think there's enough political will to implement that unless things get *drastically* worse.\n\n… But that won't stop me from sometimes wishing for mandatory vaccination to stop half-assing this pandemic as a society.", "is_submitter": false, "distinguished": null, "created_utc": 1629674277.0, "parent_id": "t1_h9y9qlk", "replies": [{"author": "Zealousideal_Mix_629", "id": "h9yvqf7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p4vpzd", "stickied": false, "body": ">Just send in the National Guard because no one good cares if they shoot the rioters (/s)\n\nIt takes far less people than you would expect to threaten the stability of government.\n\nhttps://www.theguardian.com/commentisfree/2017/feb/01/worried-american-democracy-study-activist-techniques", "is_submitter": false, "distinguished": null, "created_utc": 1629674705.0, "parent_id": "t1_h9yuu1j", "replies": [{"author": "vook485", "id": "ha03uwg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p4vpzd", "stickied": false, "body": "I appreciate the link, but it seems to suggest that it takes 3.5% sustained nonviolent obstructionists to destabilize *a policy*, not the entire government. Regardless, until vaccine mandates actually happen (*if* they actually happen), we won't know how many will actually refuse.\n\nFor reference, several childhood vaccinations were at >90% administration by age 24 months in the USA, according to [the first page I could find with concrete statistics](https://www.cdc.gov/mmwr/volumes/69/wr/mm6942a1.htm). Looking at the results broken down by insurance status, the highest rate was for Polio vaccination in particular for infants covered by private insurance, at 95%, and that's with neither a mandate nor a pandemic.\n\nGiven that people tend to take the path of least resistance, how many would continuously demonstrate against the vaccine instead of getting it?", "is_submitter": false, "distinguished": null, "created_utc": 1629699131.0, "parent_id": "t1_h9yvqf7", "replies": [{"author": "Zealousideal_Mix_629", "id": "ha0kstx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p4vpzd", "stickied": false, "body": "I'm just highlighting why the by force plan hasn't been enacted because the current administration understands what will happen.  We recently had our generations *fall of Saigon* they don't also want to cause our generations *Kent state*", "is_submitter": false, "distinguished": null, "created_utc": 1629713701.0, "parent_id": "t1_ha03uwg", "replies": [{"author": "vook485", "id": "ha0le6h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #113", "submission": "p4vpzd", "stickied": false, "body": "It's really frustrating when the minority party is catered to while actively furthering a pandemic, to the point the majority party has radically diluted its mitigating policies. But I do see the balance of power justification, even if it never stopped the other side from doing everything possible", "is_submitter": false, "distinguished": null, "created_utc": 1629714188.0, "parent_id": "t1_ha0kstx", "replies": []}]}]}]}]}]}]}]}]}]}, {"author": "adadagabaCZ", "id": "h95opni", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #12", "submission": "p4vpzd", "stickied": false, "body": "Can I just ask which country are you speaking from? \"This country\" is a rather subjective term, and I don't think a single Czech solider engaged in the Vietnam war, so 10x0 is still 0, which makes the fact false.", "is_submitter": false, "distinguished": null, "created_utc": 1629122466.0, "parent_id": "t3_p4vpzd", "replies": [{"author": "roundearthervaxxer", "id": "h97s67e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "USA, sorry - should have specified", "is_submitter": true, "distinguished": null, "created_utc": 1629152653.0, "parent_id": "t1_h95opni", "replies": []}]}, {"author": "PenguinInDistress", "id": "h91xfgj", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #156", "submission": "p4vpzd", "stickied": false, "body": "I'm honestly curious how many lives were lost because Americans couldn't pay to receive medical treatment. \n\nAt a baseline, we are unhealthy. Medical expenses are for those who have financial security.  Medical upkeep and yearly check ups are being lost because no one can afford it. \n\nPeople can't even afford their medicines. \n\nAt what cost is this because our medical infrastructure is weak? \n\nHospital beds are full. No one else can recover or receive help. They are turned down to die at home. \n\nWe have failed in many ways. Our country's disorganization is a main fault.", "is_submitter": false, "distinguished": null, "created_utc": 1629048314.0, "parent_id": "t3_p4vpzd", "replies": [{"author": "roundearthervaxxer", "id": "h94afi8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "Biden or Obama would have done so much better", "is_submitter": true, "distinguished": null, "created_utc": 1629088227.0, "parent_id": "t1_h91xfgj", "replies": []}]}, {"author": "Zealousideal_Mix_629", "id": "h91qz45", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p4vpzd", "stickied": false, "body": "The list is not finished, don't worry it will come.", "is_submitter": false, "distinguished": null, "created_utc": 1629045673.0, "parent_id": "t3_p4vpzd", "replies": []}, {"author": "Summonest", "id": "h91t6e8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #44 | Classis Veritatus", "submission": "p4vpzd", "stickied": false, "body": "Or just a loud, daily reminder of current numbers", "is_submitter": false, "distinguished": null, "created_utc": 1629046568.0, "parent_id": "t3_p4vpzd", "replies": []}, {"author": "Karyo_Ten", "id": "h921pkd", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4vpzd", "stickied": false, "body": ">It is the media's responsibility to show real stories of grief and loss.\n\nResponsibility doesn't bring viewers. No viewers = less valuable ads. Less valuable ads = less money. Less money = Directors not happy.\n\nResponsibility is the carrot. But we need a financial stick.", "is_submitter": false, "distinguished": null, "created_utc": 1629050112.0, "parent_id": "t3_p4vpzd", "replies": [{"author": "roundearthervaxxer", "id": "h94abds", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "Mandate it nationally if you have to. It would be terrible for ratings. TV used to serve a public service role, emergency broadcast etc. whatever it takes. It is like a ghost tragedy that nobody can see. That is a problem.", "is_submitter": true, "distinguished": null, "created_utc": 1629088159.0, "parent_id": "t1_h921pkd", "replies": []}]}, {"author": "dashingThroughSnow12", "id": "h93530d", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p4vpzd", "stickied": false, "body": "I don't think that will help. Around 480K of the 600K who died were age 65+. Seeing memorials which are 80% senior citizens reinforces to skeptics that this was an old person's disease and instead of locking down everyone, we should have especially taken caution for the old and have them actually lock down.", "is_submitter": false, "distinguished": null, "created_utc": 1629067280.0, "parent_id": "t3_p4vpzd", "replies": [{"author": "roundearthervaxxer", "id": "h9495tw", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "Focus on grieving families talking about dad or grandma went to soon. That stuff works.\n\nOur icu beds are filled with children, no mention of it at all on the news.", "is_submitter": true, "distinguished": null, "created_utc": 1629087468.0, "parent_id": "t1_h93530d", "replies": []}]}, {"author": "NoSuchKotH", "id": "h91mno3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p4vpzd", "stickied": false, "body": "In this country, it's only a mere 1-5% who do not believe in fact :-P.\n\nIn the US, it is more, but I doubt it would change anything. Just read NNN a bit. Those people have made a religion out of their believe. Nothing you tell them will change their mind. Only if it happens to themselves might they see the errors in their ways.", "is_submitter": false, "distinguished": null, "created_utc": 1629043853.0, "parent_id": "t3_p4vpzd", "replies": [{"author": "roundearthervaxxer", "id": "h91qeth", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "These are the very people that advertising works on. Right now it all seems like a bad dream.", "is_submitter": true, "distinguished": null, "created_utc": 1629045432.0, "parent_id": "t1_h91mno3", "replies": [{"author": "NoSuchKotH", "id": "h91ue9e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p4vpzd", "stickied": false, "body": "Really? How so?\n\nAll of the NNN idiots repeat their mantra, that they have seen the truth, that they have connected the dots, that they know what is going on. And anyone who contradicts them is either a sheep or being paid of by big pharma.\n\nOh.. and masks cause bacterial infections. Vaccines both contain and don't contain microchips. They are coming for patriots, true americans and anti-vaxxers soon. The pro-vaxers (sic!) are nothing to be afraid of.... etc pp", "is_submitter": false, "distinguished": null, "created_utc": 1629047077.0, "parent_id": "t1_h91qeth", "replies": []}]}]}, {"author": "retrophoebe", "id": "h91vnae", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #191", "submission": "p4vpzd", "stickied": false, "body": "What you’re proposing is literally “making a person a statistic”; doesn’t matter if there’s a story on the person, it’s still going to be one of many that’ll get jumbled into a hodge podge. \n\nIt’s slightly different for Vietnam/wars, since the soldiers knowingly took a risk and sacrificed themselves in order for the greater good (in some people’s opinion at least). Being an impersonal statistic kind of worked since in terms of impact, it didn’t matter what the soldiers life was; Americans saw that an entire group fought for an ideology at the expense of their everything.\n\nFor COVID, the people you’re wanting to impact, seeing other’s grief and loss won’t change their minds because that’s not what they’re driven by. Some people think it’s all fake, so those stories must be fake too. Other people think their immune system can take it, so that also wouldn’t help. What does seem to be helping are famous/outspoken COVID deniers who got COVID and passed away. Select stories like this of people who held great standing in the COVID denier community instead of a firehose of stories of people the deniers don’t know work better imo.", "is_submitter": false, "distinguished": null, "created_utc": 1629047593.0, "parent_id": "t3_p4vpzd", "replies": [{"author": "roundearthervaxxer", "id": "h94asgj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p4vpzd", "stickied": false, "body": "People absolutely respond to human interest segments. We need to cover this more. It is like this giant tragedy that doesn’t even feel real. 500000 Americans dead. This is the biggest tragedy this country has ever seen, since the civil war and people whine about wearing a mask or flat out don’t believe the reality.", "is_submitter": true, "distinguished": null, "created_utc": 1629088444.0, "parent_id": "t1_h91vnae", "replies": []}]}, {"author": "SavnetSinn", "id": "h960ld6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #73 | Ordo Cognitus", "submission": "p4vpzd", "stickied": false, "body": "People still watch television?", "is_submitter": false, "distinguished": null, "created_utc": 1629127415.0, "parent_id": "t3_p4vpzd", "replies": []}, {"author": "SybariteAussie", "id": "h99y2z9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p4vpzd", "stickied": false, "body": "“Memento Mori!”", "is_submitter": false, "distinguished": null, "created_utc": 1629198747.0, "parent_id": "t3_p4vpzd", "replies": []}, {"author": "metalhev", "id": "h9atnqr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4vpzd", "stickied": false, "body": "If those statistics are anything like brazil's, 95% are false.", "is_submitter": false, "distinguished": null, "created_utc": 1629214013.0, "parent_id": "t3_p4vpzd", "replies": []}]}