{"title": "The spookiest thing that's ever happened to me", "name": "t3_p7dfkz", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p7dfkz/the_spookiest_thing_thats_ever_happened_to_me/", "selftext": "While sleeping one night I recall being in a dream or something and I'm seeing the room, like my eyes are open in bed, it's not clear and feels like a dream. I see some kind of shadow figure that's unrecognizable enter the room and stand at the foot of the bed, looking over us sleeping. It didn't feel good. The next thing I'm suddenly wide awake laying in bed, with my torso suddenly and completely upright, and I'm screaming bloody death. The screaming was so hard it felt as if my body was putting everything it had into that one thing. I screamed so hard my throat was sore for days. I screamed so loud that we were worried what our neighbors would think. I screamed so loud, I could feel it in my core the next day. It was a weird experience.\n\nThe screaming of course wakes up my sleeping partner, but we're both reasonable about it, decide it was just a bad dream and go back to sleep pretty quickly. Nothing like this has ever happened to me before, or ever since.\n\nThe next morning I'm trying to describe how I felt when this was happening, and I started by describing being alerted to seeing some figure in the room. There was a sound, something that made a knock, or a light bang, and that awakened me to seeing this figure. My partner asked what it sounded like, and I said \"well it's kind of like a knocking sound or a ...\"\n\nJust as I'm saying this, there's a bang against the window behind the head of the bed, and we're both startled for a moment when I look over and say \n\"That. \nThat's what it sounded like, just before I see the dark figure.\"\n\nSo we go outside to see what happened, and we find a small bird, whats probably a grey Sparrow, must have flown into the window. Now it lays there on the ground dead. Never had a bird fly into the window before, or ever since, it's only the third floor of a house surrounded by other houses the same height.", "score": 5, "upvote_ratio": 0.86, "permalink": "/r/TheFlyingTree/comments/p7dfkz/the_spookiest_thing_thats_ever_happened_to_me/", "id": "p7dfkz", "author": "ryguyt", "link_flair_text": "Fascinating", "num_comments": 8, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629374454.0, "comments": [{"author": "FnchWzrd314", "id": "h9j0fk0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #53 | Ordo Cognitus", "submission": "p7dfkz", "stickied": false, "body": "I'm no expert, but that reminds me of descriptions of sleep paralysis, super creepy though, especially the bird thing.", "is_submitter": false, "distinguished": null, "created_utc": 1629378044.0, "parent_id": "t3_p7dfkz", "replies": [{"author": "ryguyt", "id": "h9j1zj9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #99", "submission": "p7dfkz", "stickied": false, "body": "Yeah totally sleep paralysis and definitely a dream, not spooky action. But that bird though, phewwww, that was weird timing.", "is_submitter": true, "distinguished": null, "created_utc": 1629378819.0, "parent_id": "t1_h9j0fk0", "replies": []}, {"author": "DoglessDyslexic", "id": "h9j18yn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p7dfkz", "stickied": false, "body": "Was going to say the same thing.  Sounds like classic sleep paralysis.", "is_submitter": false, "distinguished": null, "created_utc": 1629378453.0, "parent_id": "t1_h9j0fk0", "replies": []}]}, {"author": "CemeteryWind213", "id": "h9ksgpm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #175 | Classis Veritatus", "submission": "p7dfkz", "stickied": false, "body": "I saw a hooded figure standing at the foot of my bed during a round of sleep paralysis. I though it was my roomate pranking me and tried to tackle it in the twilight of consciousness, but fell flat on my face. It was just my winter coat. I had installed a hook the previous day and was still an unfamiliar sight in my surroundings.", "is_submitter": false, "distinguished": null, "created_utc": 1629404972.0, "parent_id": "t3_p7dfkz", "replies": []}, {"author": "SavnetSinn", "id": "h9jzacm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #73 | Ordo Cognitus", "submission": "p7dfkz", "stickied": false, "body": "If it's really still bugging you, I'd throw on a movie like Paranormal Activity or Insidious late tonight before going to bed. If you have an impressionable or imaginative mind, it'll really fuck with you.", "is_submitter": false, "distinguished": null, "created_utc": 1629392934.0, "parent_id": "t3_p7dfkz", "replies": []}, {"author": "Munnin41", "id": "h9lddfx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #298", "submission": "p7dfkz", "stickied": false, "body": "When I was little, I think 6yo, my brother and I shared a room, with a bunk bed. I slept on the top bunk and could see on top of a cabinet. One night, I saw a shadow dancing on top of the cabinet. It kinda looked like a mix between Winnie the Pooh and that demon from that animated series disenchantment. It was freaking me out, so I screamed, waking everyone up. My mom came in and told me there was nothing there. I didn't see it any more either.\n\nNever had anything like that happen ever again. It is one of the very few things I can still remember from before I was 14.", "is_submitter": false, "distinguished": null, "created_utc": 1629413830.0, "parent_id": "t3_p7dfkz", "replies": []}, {"author": "PalatableNourishment", "id": "h9lu86z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #53", "submission": "p7dfkz", "stickied": false, "body": "The last time I had sleep paralysis, I was sleeping in my childhood bedroom at my parents’ house. On the wall across the room is a cork board with various little trinkets pinned to it. I was laying there staring at the board and suddenly things were flying off the cork board at me, barely missing me. I couldn’t move. Then the whole board flew off the wall right at me. At that moment, I felt like I left my body and my consciousness seemed to float down to the foot of my bed. It was as if something was tugging me. Then I floated out of my room and into the stairway that goes up to my parents’ room. There is a window in the stairway that looks out to the street. I floated there, staring out the window for a bit. Then I woke up in my bed with my heart pounding, breathing heavy.", "is_submitter": false, "distinguished": null, "created_utc": 1629421697.0, "parent_id": "t3_p7dfkz", "replies": [{"author": "ryguyt", "id": "h9ng5pc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #99", "submission": "p7dfkz", "stickied": false, "body": "Wow, that's quite a trip!", "is_submitter": true, "distinguished": null, "created_utc": 1629460353.0, "parent_id": "t1_h9lu86z", "replies": []}]}]}