{"title": "Can anyone recommend me some hard physics concepts?", "name": "t3_p9vwhq", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p9vwhq/can_anyone_recommend_me_some_hard_physics_concepts/", "selftext": "Just theory and concepts, since I am bad at problem solving.\n\nThank You", "score": 7, "upvote_ratio": 0.74, "permalink": "/r/TheFlyingTree/comments/p9vwhq/can_anyone_recommend_me_some_hard_physics_concepts/", "id": "p9vwhq", "author": "saymonguedin", "link_flair_text": "Question", "num_comments": 34, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629709249.0, "comments": [{"author": "MisanthropicScott", "id": "ha0gmcm", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p9vwhq", "stickied": false, "body": "The speed of light in a vacuum is constant for all observers. This seemingly simple sounding observation led Einstein to come up with special and general relativity.\n\nA====> <==B <====C\n\nImagine you're at point B driving 20 km/hr towards A. A is driving toward you at 40 km/hr and C is driving toward you at 40 km/hr.\n\nFrom your perspective, the relative speed of A coming toward you is 60 km/hr. And, the relative speed with which C is overtaking you is 20 km/hr.\n\nNow, imagine the same scenario at much higher speeds. You're still B. But, now you're in your VeryFast^(tm) space ship going toward light source A at 50% of the speed of light. Light from A is coming toward you at the speed of light. Light source C is emitting light that is overtaking you going the speed of light.\n\nFrom your perspective, it would make sense if light from A were coming towards you at a relative speed of 1.5 times the speed of light. And, it would make sense that light coming from C would be overtaking you at a relative speed of 0.5 times the speed of light.\n\nIn reality, you see the light coming towards you from both A and C moving at a relative speed of the speed of light.\n\nThis simple observation, that light coming toward the earth from all directions, regardless of the earth's motion, appears to be the same speed was enough to lead Einstein to deduce much of relativity. \n\nIt led to the hypothesis, later confirmed and used in your GPS system, that time is not constant for all observers. Time physically ticks at different rates on satellites in geosynchronous orbit than on the surface of the earth. And, it matters when calculating our positions with such systems.\n\nHere's an explanation of how this can be intuited from the consistency of the speed of light in a vacuum.\n\nhttps://en.wikipedia.org/wiki/Time_dilation#Simple_inference", "is_submitter": false, "distinguished": null, "created_utc": 1629710101.0, "parent_id": "t3_p9vwhq", "replies": [{"author": "Muroid", "id": "ha12kyw", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p9vwhq", "stickied": false, "body": "The constant speed of light is largely derived from Maxwell’s equations describing electromagnetism, rather than observations about the speed light travels in different directions, though the Michelson-Morley experiment did knock a major hole in the Luminiferous Aether theory that, up to that point, was the major solution for what light was traveling at a constant speed relative to.\n\nRelativity’s major breakthrough was resolving this existing conundrum by answering the question with “relative to everyone” and then mathematically working out what the consequences of that would be.", "is_submitter": false, "distinguished": null, "created_utc": 1629724961.0, "parent_id": "t1_ha0gmcm", "replies": [{"author": "MisanthropicScott", "id": "ha1bwaj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p9vwhq", "stickied": false, "body": ">> The speed of light in a vacuum is constant for all observers.\n\n> The constant speed of light is largely derived from Maxwell’s equations describing electromagnetism\n\nDid Maxwell know that it would be constant *for all observers*? That is kind of a big deal. I thought it was that discovery that was the underlying raw data that caused Einstein to come up with relativity.\n\nIt wasn't that relativity dictated that the speed of light must be constant relative to all observers. I think that was the observation prior to relativity that led to relativity. That was the brute fact, the raw observation, that relativity explains.\n\nAs you note, this fact was discovered by the [Michelson-Morley experiment](https://en.wikipedia.org/wiki/Michelson%E2%80%93Morley_experiment), which took place in 1887, well before Einstein developed either special or general relativity.", "is_submitter": false, "distinguished": null, "created_utc": 1629729300.0, "parent_id": "t1_ha12kyw", "replies": [{"author": "Muroid", "id": "ha1gvz3", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p9vwhq", "stickied": false, "body": "The constant *c* falls out of Maxwell’s equations. It was a problem that a lot of people were working on for a long time. Far from being a mathematical explanation of an observed phenomenon, Special Relativity was heavily based on the math, and used the constancy of the speed of light as an axiomatic starting point for building the rest of the math. \n\nThe idea that the speed of light was constant for all observers was a controversial point when he published his paper, rather than being an established fact that he was trying to explain. The fact that he was able to make the conceptual leap of accepting that as a starting point is what allowed him to work out the rest of the math for special relativity which isn’t really all *that* complicated.", "is_submitter": false, "distinguished": null, "created_utc": 1629731446.0, "parent_id": "t1_ha1bwaj", "replies": []}]}]}]}, {"author": "NoSuchKotH", "id": "ha0gu4d", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p9vwhq", "stickied": false, "body": "What is your goal? What kind of concepts are you looking for? And last, but not least, what is your background? Are you a highschool student? College? University? Which country?", "is_submitter": false, "distinguished": null, "created_utc": 1629710293.0, "parent_id": "t3_p9vwhq", "replies": [{"author": "saymonguedin", "id": "ha0gw5c", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #230", "submission": "p9vwhq", "stickied": false, "body": "Just the understanding part, any physics stuff", "is_submitter": true, "distinguished": null, "created_utc": 1629710343.0, "parent_id": "t1_ha0gu4d", "replies": [{"author": "NoSuchKotH", "id": "ha0hgsq", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p9vwhq", "stickied": false, "body": "Yes, but what do you understand already? Are levers a new concept for you? Or have you studied Heisenberg's matrix mechanics? Do you feel at ease with Dirac's bracket notation? Or do you struggle already with trigonometry? \n\nThere is a lot in physics, more than you probably imagine. And most of it depends on understanding a damn lot of advanced math. So without knowing where you are coming from and where you are intending to go to, it is extremely hard to answer your question.", "is_submitter": false, "distinguished": null, "created_utc": 1629710852.0, "parent_id": "t1_ha0gw5c", "replies": []}]}]}, {"author": "jumpinjahosafa", "id": "ha0qoya", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #218", "submission": "p9vwhq", "stickied": false, "body": "Langrangians, Hamiltonians, entropy, quantum tunnelling\n\nI'd even argue fluid dynamics is challenging. This question is too broad tbh", "is_submitter": false, "distinguished": null, "created_utc": 1629718141.0, "parent_id": "t3_p9vwhq", "replies": [{"author": "ResidentIdaKozuke", "id": "ha0tmei", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #198", "submission": "p9vwhq", "stickied": false, "body": "Ooh, I love Hamilton!", "is_submitter": false, "distinguished": null, "created_utc": 1629720037.0, "parent_id": "t1_ha0qoya", "replies": [{"author": "zebediah49", "id": "ha2oqxo", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #131", "submission": "p9vwhq", "stickied": false, "body": "[Luckily there's lots of stuff named after him](https://en.wikipedia.org/wiki/List_of_things_named_after_William_Rowan_Hamilton).", "is_submitter": false, "distinguished": null, "created_utc": 1629749468.0, "parent_id": "t1_ha0tmei", "replies": []}]}]}, {"author": "sarini11", "id": "ha0gyqp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #56 | Ordo Cognitus", "submission": "p9vwhq", "stickied": false, "body": "Magnetic resonance, whether NMR or ESR. It's concerned with manipulating spins using magnetic pulses. It gets challenging when you start considering Gaussian noise and even more challenging when considering Lorentzian noise. I recommend reading Slichter.", "is_submitter": false, "distinguished": null, "created_utc": 1629710404.0, "parent_id": "t3_p9vwhq", "replies": [{"author": "NoSuchKotH", "id": "ha0hqw0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p9vwhq", "stickied": false, "body": "Ah! A fellow friend of flicker noise!\n\nWhat are you working on?", "is_submitter": false, "distinguished": null, "created_utc": 1629711098.0, "parent_id": "t1_ha0gyqp", "replies": [{"author": "sarini11", "id": "ha0jebc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #56 | Ordo Cognitus", "submission": "p9vwhq", "stickied": false, "body": "Still a grad student. I took a course on that as a part of the quantum computing profile. The purpose was to understand some basics of spin dynamics under noise and apply dynamical decoupling techniques to cancel it. My assignment was focused on proving how a spin state decays to the pointer state under Lorentzian noise. It was by far the most interesting course I had. I'm hoping to do my thesis on that topic.", "is_submitter": false, "distinguished": null, "created_utc": 1629712518.0, "parent_id": "t1_ha0hqw0", "replies": [{"author": "NoSuchKotH", "id": "ha0jl2e", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p9vwhq", "stickied": false, "body": "Ok, you have full attention now. Is there an online lecture I could watch on this? I am kind of supposed to finish my thesis and don't really have time to work through a textbook :-(", "is_submitter": false, "distinguished": null, "created_utc": 1629712680.0, "parent_id": "t1_ha0jebc", "replies": [{"author": "sarini11", "id": "ha0k3g0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #56 | Ordo Cognitus", "submission": "p9vwhq", "stickied": false, "body": "I understand the struggle, online material on this topic is quite rare. I had to rely on Slichter. On the bright side, it's very nicely written and it covers the main points you need. What exactly is your topic? Maybe I can recommend a paper.", "is_submitter": false, "distinguished": null, "created_utc": 1629713112.0, "parent_id": "t1_ha0jl2e", "replies": [{"author": "NoSuchKotH", "id": "ha0ltmh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p9vwhq", "stickied": false, "body": "My main topic is time measurement and time synchronization. Flicker noise is a big topic there (or really in anything where measurements take more than a few milli-seconds). With this I stared to try to compile what we know about flicker noise and what common strategies to deal with it are. Hence I'm always interested in how other fields describe flicker noise and how they deal with it.", "is_submitter": false, "distinguished": null, "created_utc": 1629714533.0, "parent_id": "t1_ha0k3g0", "replies": [{"author": "sarini11", "id": "ha0p8sl", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #56 | Ordo Cognitus", "submission": "p9vwhq", "stickied": false, "body": "Slichter might not be suitable in this case. My approach was quite mathematical, the proof was basically asymptotic analysis. Even the decoupling techniques were mostly suitable for Gaussian noise. Be it engineering or physics, flicker noise is a pain, everyone avoids it like the plague lol. I can't be much of a help, but this [paper](https://arxiv.org/abs/1708.05535) might be relevant.", "is_submitter": false, "distinguished": null, "created_utc": 1629717131.0, "parent_id": "t1_ha0ltmh", "replies": [{"author": "NoSuchKotH", "id": "ha1azvn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p9vwhq", "stickied": false, "body": "Yeah, flicker noise is a bitch. A bitch that has not been solved for over a hundred years. (aka it's one of those career killing research topics)\n\nThanks for the paper, I'll have a look.", "is_submitter": false, "distinguished": null, "created_utc": 1629728903.0, "parent_id": "t1_ha0p8sl", "replies": []}]}]}]}]}]}]}]}, {"author": "a_planet_", "id": "ha0y0fh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #98", "submission": "p9vwhq", "stickied": false, "body": "Hard physics concepts that don't require problem-solving are hard to come by. It also depends on what you consider hard. You can just go through a physics textbook and read all the interesting bits. That said, people here are giving some nice suggestions. \n\nI would recommend going on youtube and finding out about cool concepts like that if you're only interested in theory. There are a lot of great channels on both the practical and theoretical sides of physics. Check out pbs space time, smarter every day, sixty symbols, 3blue1brown, veritasium, steve mould, tibees, up and atom, zach star. Or check out podcasts from science communicators like Brian Greene, Carrol, Krauss, Tyson and you will hear wonderful things.", "is_submitter": false, "distinguished": null, "created_utc": 1629722594.0, "parent_id": "t3_p9vwhq", "replies": [{"author": "saymonguedin", "id": "ha1xaum", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #230", "submission": "p9vwhq", "stickied": false, "body": "Would you recommend Einstein Field Equations?", "is_submitter": true, "distinguished": null, "created_utc": 1629738246.0, "parent_id": "t1_ha0y0fh", "replies": [{"author": "a_planet_", "id": "ha5jdzy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #98", "submission": "p9vwhq", "stickied": false, "body": "I would rather recommend General Relativity and Special Relativity. Einstein's Field Equations by themselves are just a bunch of differential geometry that you need to know.", "is_submitter": false, "distinguished": null, "created_utc": 1629807932.0, "parent_id": "t1_ha1xaum", "replies": []}]}]}, {"author": "jmcsquared", "id": "ha10jv5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "p9vwhq", "stickied": false, "body": "Gravity is caused by the curvature of space and time according to general relativity. Just as the straight lines of longitude, that begin parallel at the equator, converge at the north pole due to the Earth's shape, the orbit of a planet around the Sun is actually a straight path, the straightest possible path that it could follow in spacetime with that initial velocity.\n\nWe're all traveling at the speed of light. The catch is, we travel almost exclusively through time. Motion through space is just a way to divert some of that motion to movement through space. The fastest speeds we can travel are just a couple thousand miles per hour, which is nothing compared to light speed, so we almost never travel much through space. \n\nSo, most of the gravity we experience is due to the curvature of time specifically.\n\nIn math, curvature causes distances and durations to change from place to place. So, another fun way to say this is, we feel as though we're being pulled towards the Earth because time is ticking faster for our heads than for our feet. It's fairly easy to show that such a thing happening to time produces a force that looks just like Newtonian gravitational pull.", "is_submitter": false, "distinguished": null, "created_utc": 1629723934.0, "parent_id": "t3_p9vwhq", "replies": []}, {"author": "BuccaneerRex", "id": "ha1ehfu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p9vwhq", "stickied": false, "body": "There are a lot of cutting-edge hypotheses that seek to provide explanation for the phenomena we observe in the universe. Most of these stem from a reductionist philosophy, i.e. breaking everything down into its simplest/most fundamental parts/interactions/rules and then seeing if our descriptions of systems using these kinds of parts/rules actually describe real things.\n\nThe most fundamental hypotheses I've seen recently are from Stephen Wolfram (wolframphysics.org). Starting from a perspective of cellular automata & graph theory, they are working on a descriptive theory of everything that starts with dimensionless nodes connected by edges, and the rules for updating those connections... and that is it. So far they've seen that the mathematical objects that are the evolving graphs created out of these nodes and the edges between them act as physical objects in a physical system, interacting and changing according to emergent rules which correspond to physical laws.\n\nSo if you you can think in n-dimensions and want to wrestle with the concept of everything, including existence itself being emergent from patterns of shifting connections in a timeless/dimensionless manifold and the 'present' is an evolving 3-dimensional slice of the causally connected hypergraphs, then you should check it out.", "is_submitter": false, "distinguished": null, "created_utc": 1629730417.0, "parent_id": "t3_p9vwhq", "replies": [{"author": "giantsnails", "id": "ha33912", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p9vwhq", "stickied": false, "body": "No one with a physics degree takes Wolfram’s new theory seriously. Guy is old, losing his edge.", "is_submitter": false, "distinguished": null, "created_utc": 1629755424.0, "parent_id": "t1_ha1ehfu", "replies": [{"author": "BuccaneerRex", "id": "ha353zz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p9vwhq", "stickied": false, "body": "I've been reading about it for a few years, and it was recently brought back to my attention through Sean Carroll's podcast.\n\nSeems like a few people are taking it seriously, anyway.", "is_submitter": false, "distinguished": null, "created_utc": 1629756223.0, "parent_id": "t1_ha33912", "replies": []}]}]}, {"author": "SybariteAussie", "id": "ha0te7u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p9vwhq", "stickied": false, "body": "Nice thread folks! I salute & relish! My interest in science is new. The scientific method helped remove religion, be fact focused & open to discussion", "is_submitter": false, "distinguished": null, "created_utc": 1629719895.0, "parent_id": "t3_p9vwhq", "replies": [{"author": "NoSuchKotH", "id": "ha1bd9a", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p9vwhq", "stickied": false, "body": "I know more deeply religious scientists than religious non-scientists. And I am in academia. 😅", "is_submitter": false, "distinguished": null, "created_utc": 1629729068.0, "parent_id": "t1_ha0te7u", "replies": [{"author": "SybariteAussie", "id": "ha1fbmx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p9vwhq", "stickied": false, "body": "Galileo was nearly torched. He retracted the statement that Earth orbits the sun. When the Vatican ruled, things were different. I am not anti religion. Was it Newton that developed the scientific method? If umbrage was felt, it was not my intention. 🖖", "is_submitter": false, "distinguished": null, "created_utc": 1629730774.0, "parent_id": "t1_ha1bd9a", "replies": [{"author": "NoSuchKotH", "id": "ha1h25q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p9vwhq", "stickied": false, "body": "There was not one guy who developed the scientific method. Galileo was a proponent of the key points of it already, and not the first one either. But it took well into the 20th century to get the details hammered down. And we are still refining it.", "is_submitter": false, "distinguished": null, "created_utc": 1629731520.0, "parent_id": "t1_ha1fbmx", "replies": [{"author": "SybariteAussie", "id": "ha1ktbc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p9vwhq", "stickied": false, "body": "I concur, the door is always open. Some exceptions. Velikovsky drew a interesting response from his first book! Bill Bryson discussed some humorous academic feuds in short history of nearly everything", "is_submitter": false, "distinguished": null, "created_utc": 1629733101.0, "parent_id": "t1_ha1h25q", "replies": []}]}]}]}]}, {"author": "ARtEmiS_Oo", "id": "ha0unes", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #193", "submission": "p9vwhq", "stickied": false, "body": "Fermi paradox", "is_submitter": false, "distinguished": null, "created_utc": 1629720667.0, "parent_id": "t3_p9vwhq", "replies": []}, {"author": "roguezebra", "id": "ha16r2b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #15", "submission": "p9vwhq", "stickied": false, "body": "Try Special relativity paradoxes: Ladder paradox, light clock, light cones, grandfather paradox, twin paradox.", "is_submitter": false, "distinguished": null, "created_utc": 1629726973.0, "parent_id": "t3_p9vwhq", "replies": []}, {"author": "giantsnails", "id": "ha33rgi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p9vwhq", "stickied": false, "body": "Most people who ask this question are much more interested in philosophy than physics. If you’re looking for pop science, intro videos on quantum mechanics and quantum field theory are probably going to feel cool. The Dirac equation, Feynman’s one electron universe, and the many worlds interpretation are pretty fun for amateurs.", "is_submitter": false, "distinguished": null, "created_utc": 1629755642.0, "parent_id": "t3_p9vwhq", "replies": [{"author": "saymonguedin", "id": "ha48rcb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #230", "submission": "p9vwhq", "stickied": false, "body": "Thank you for those.", "is_submitter": true, "distinguished": null, "created_utc": 1629774387.0, "parent_id": "t1_ha33rgi", "replies": []}]}]}