{"title": "Forgetting Past Feelings", "name": "t3_peby9j", "url": "https://www.reddit.com/r/TheFlyingTree/comments/peby9j/forgetting_past_feelings/", "selftext": "I was wondering, has anyone ever had any experiences that you knew felt very intense when you felt it (eg: a loss of a loved one, being abused, etc), but when looking back not feeling or relating to it at all? Or perhaps anyone has any theories on why this is??", "score": 8, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/peby9j/forgetting_past_feelings/", "id": "peby9j", "author": "scarstreet", "link_flair_text": "Question", "num_comments": 15, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630302197.0, "comments": [{"author": "IsNowReallyTheTime", "id": "hawcpp2", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #220", "submission": "peby9j", "stickied": false, "body": "PTSD, disassociate to guard against whatever (guilt, shame etc).", "is_submitter": false, "distinguished": null, "created_utc": 1630303579.0, "parent_id": "t3_peby9j", "replies": [{"author": "helloreddit321567", "id": "haz1xe4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #247", "submission": "peby9j", "stickied": false, "body": "This. It's a protective measure your brain is taking because of the threat the trauma represents. It's something you will need to deal with eventually though. Don't be afraid to reach out to someone OP.\n\nEdit : You're welcome to DM me if you need to talk", "is_submitter": false, "distinguished": null, "created_utc": 1630355774.0, "parent_id": "t1_hawcpp2", "replies": []}]}, {"author": "usernames_suck_ok", "id": "hawbmfy", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "peby9j", "stickied": false, "body": "All of my break-ups were like this, even when I was in love. I'm thinking time really does heal all wounds. Or most, anyway. I would think getting abused or losing a loved one to death would be very different.", "is_submitter": false, "distinguished": null, "created_utc": 1630302765.0, "parent_id": "t3_peby9j", "replies": [{"author": "zephyrsong888", "id": "haxd2wi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #140", "submission": "peby9j", "stickied": false, "body": "I think the worst relationship breakups are this way: you break up and almost immediately wonder why you were in it in the first place!\n\nOn the other hand, the *bad* breakups keep that feeling of wishing it was still around all the time. So it seems that for negative experiences, it's protective.", "is_submitter": false, "distinguished": null, "created_utc": 1630330109.0, "parent_id": "t1_hawbmfy", "replies": []}]}, {"author": "SybariteAussie", "id": "hawemp8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "peby9j", "stickied": false, "body": "Closure only comes when I understand what happened, where I went wrong & the correct things I should have done. When I can understand why the person who hurt me, or my perception that they did. Behaved in such a way & their motives. My responses on Reddit are handicapped by self censorship and censorship.", "is_submitter": false, "distinguished": null, "created_utc": 1630305062.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "SilverWolf5476", "id": "hawfa3r", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #337", "submission": "peby9j", "stickied": false, "body": "It’s a common human experience. As we gain more experience throughout our days our older memories get overwritten and you develop distance from those memories because you’re not interacting with them. Your crystallized intelligence regarding that emotion or person starts to fade and you eventually lose the feeling you once had. \n\nIt’s the same exact experience you might have had if you ever stopped doing something for a long time, you had to relearn it for a period of time to pick it back up again. \n\nYou can get those old feelings back if you want to by looking at old photos, hearing stories, talking about the person, etc. (I don’t know why you would want to though) It’s the same as the above paragraph, you’ll “pick up” the old feelings again just like you “pick up” an old skill you’ve already learned.", "is_submitter": false, "distinguished": null, "created_utc": 1630305571.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "SybariteAussie", "id": "hawfgct", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "peby9j", "stickied": false, "body": "I heard a song that inspired me to analyse all my decisions and look for the times where I was engaging in self deception or sophistry. Was amazed at how many times I had been dishonest with myself! Creating a alternative reality where everything is just dandy. I don’t know what that means? Song was by Janis Ian, at 17. I tend to be more honest with others than myself. Maybe because I smoke weed, causing memory issues? I won’t remember the lie I told, so am obliged to tell the truth? 🤔", "is_submitter": false, "distinguished": null, "created_utc": 1630305710.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "Corvidtv", "id": "hawfwkz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #330", "submission": "peby9j", "stickied": false, "body": "I like to think of it like a physical wound. When it happens, the pain is right there in front of everything you do, lighting up all your synapses, drawing your complete attention. But, time goes on and it slowly heals. You scab over, and if you pick at it you will still bleed, albeit not as much as before. Eventually a scar forms, and it doesn't hurt any more. You still see it, and can probably vaguely remember the feeling, but its mostly just a reminder that you survived.", "is_submitter": false, "distinguished": null, "created_utc": 1630306071.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "retrophoebe", "id": "hawj9o5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #191", "submission": "peby9j", "stickied": false, "body": "Forgetting is sometimes the greatest gift.", "is_submitter": false, "distinguished": null, "created_utc": 1630308860.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "Chocolate_effort", "id": "hawkgq4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #179", "submission": "peby9j", "stickied": false, "body": "I think it's one way our body tries to protect us.", "is_submitter": false, "distinguished": null, "created_utc": 1630309876.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "Financial-Process-86", "id": "hawkoj9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #268", "submission": "peby9j", "stickied": false, "body": "I don't have time for that. I must push forward. Road to faang baby.", "is_submitter": false, "distinguished": null, "created_utc": 1630310059.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "bolrnly", "id": "hawmftx", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #155 | Ordo Cognitus", "submission": "peby9j", "stickied": false, "body": "https://youtu.be/VAhh5pQyFxU", "is_submitter": false, "distinguished": null, "created_utc": 1630311595.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "throw-away451", "id": "haxghyy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "peby9j", "stickied": false, "body": "Yes, I have schizoid personality disorder (SPD) and it only started manifesting itself during my early 20s. One of the symptoms is anhedonia, or an inability to experience positive feelings or emotions. I remember having fun and enjoying life, but now I can only remember that I was capable of feeling those things, not how it actually felt. It’s like a prisoner who has been in solitary confinement for so long that they can’t remember what fresh air and sunlight are like. I’m going to therapy in hopes of being able to feel again.", "is_submitter": false, "distinguished": null, "created_utc": 1630331735.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "xteriic", "id": "hay61er", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #116", "submission": "peby9j", "stickied": false, "body": "This is purely anecdotal but I thought I'd write it in case anybody can relate: \n\nMy past (albeit what I like to consider limited in comparison to others) experience with going through traumatic events is that I ended up supressing all emotions related to said experience, and I was for a long time able to internally reflect upon what happened as \"that happened, it was pretty bad\" fairly calmly. Something I did on a daily basis for a year, and then dropping off to a bi-daily basis \n\nDue to being used to be able to reflect so calmly, I did NOT expect myself to have the most violent, tear filled emotional breakdown three years later in the arms of a loved one when I confided in them what happened to me to explain why I'm a bit messed up in a way. It seems as if externally expressing my recollection was what brought back all the feelings, or perhaps rather said unleashed the repressed emotional buildup that had accumulated since then. \n\nUpon seeing my reaction, my friend urged me to see a therapist, something that I was pretty skeptical of at first. I couldn't possibly be messed up enough to require professional help, right...? \n\nTurned out that helped a ton, and I grew so much from that help. I ended up developing healthy coping abilities that I use on a daily basis that I'm forever grateful for having learned. And I'm in the end really happy I was pushed to seek help. \n\nTL;DR: See a therapist, yo.", "is_submitter": false, "distinguished": null, "created_utc": 1630342575.0, "parent_id": "t3_peby9j", "replies": []}, {"author": "CactiIlluminati", "id": "hb06jia", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #175", "submission": "peby9j", "stickied": false, "body": "I was betrayed 25 years ago and I still get mentally ill from it now.", "is_submitter": false, "distinguished": null, "created_utc": 1630374123.0, "parent_id": "t3_peby9j", "replies": []}]}