{"title": "Religious backgrounds?", "name": "t3_pg9rej", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pg9rej/religious_backgrounds/", "selftext": "What does everyone here believe?\n\nEdit: I was raised Unitarian Universalist and had a few years of hardcore atheism before being brought to Christ through a series of dreams and symbols. I was baptized into Pentacostalism, but quickly escaped after a demonic night terror that occurred after a revival service. I am now a Gnostic Christian, after a year of trying to figure things out", "score": 8, "upvote_ratio": 0.75, "permalink": "/r/TheFlyingTree/comments/pg9rej/religious_backgrounds/", "id": "pg9rej", "author": "sister-goose", "link_flair_text": "Discussion", "num_comments": 90, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630553417.0, "comments": [{"author": "SchoggiToeff", "id": "hbao1zp", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #114", "submission": "pg9rej", "stickied": false, "body": "Thursday, two weeks ago, a being opened a yogurt and left it standing outside the fridge. It became what we know as the universe.", "is_submitter": false, "distinguished": null, "created_utc": 1630575215.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "superepic31", "id": "hbatciu", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #443", "submission": "pg9rej", "stickied": false, "body": "Agnostic Atheist.", "is_submitter": false, "distinguished": null, "created_utc": 1630579535.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "BuccaneerRex", "id": "hbb8vbm", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pg9rej", "stickied": false, "body": "None. My family has been atheist for at least three generations. Although that doesn't mean we sat around talking about all the deities we didn't believe in. \n\nDeities and religion simply weren't mentioned. Gods are not explanations for anything and religions are human rules. \n\nPersonally, I'm a physicalist. The physical universe is all there is. There is no supernatural or paranormal. There's just the natural and the normal. \n\nIt is far more likely that everyone in history who believes in magic was wrong than it is that magic is real.", "is_submitter": false, "distinguished": null, "created_utc": 1630588467.0, "parent_id": "t3_pg9rej", "replies": [{"author": "Corvidtv", "id": "hbegljs", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #330", "submission": "pg9rej", "stickied": false, "body": "Conversely, \"magic\" is just science we didn't understand. If you hop in a time machine and go to the middle ages with some flashpaper and a tazer you'd either be hailed as a wizard or burned at the stake. Even physics has things that happen where the scientific community just goes \"fuck man, I dunno. It just does that. \"", "is_submitter": false, "distinguished": null, "created_utc": 1630638550.0, "parent_id": "t1_hbb8vbm", "replies": [{"author": "BuccaneerRex", "id": "hbh1t7r", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "pg9rej", "stickied": false, "body": "That's my point exactly. Deities are not explanations. They're the place where you're not allowed to ask anymore questions. \n\n> If you hop in a time machine and go to the middle ages with some flashpaper and a tazer you'd either be hailed as a wizard or burned at the stake\n\n[It's all about the showmanship.](https://thumbs.gfycat.com/FrighteningScornfulKingsnake-size_restricted.gif)", "is_submitter": false, "distinguished": null, "created_utc": 1630691579.0, "parent_id": "t1_hbegljs", "replies": []}]}]}, {"author": "JivePrintingDotCom", "id": "hbbxvmj", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #517", "submission": "pg9rej", "stickied": false, "body": "Jesus Christ is my only ambition, my only loyalty, and my only plan. This owes exclusively to his goodness and grace, no one who had the life I did could feel otherwise.", "is_submitter": false, "distinguished": null, "created_utc": 1630599084.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "throw-away451", "id": "hbb8esh", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "pg9rej", "stickied": false, "body": "I was raised Presbyterian and still am. However, I don’t attend church because being around people drains me too much, and I have many issues with the current status of the church (across all denominations) as an organization. I probably have more in common with a medieval theologian than I do the modern image of a Christian, as I would consider myself religious but not spiritual (yes, it’s a deliberate reversal of the more common phrase). I also don’t have any issues with science, except where it infringes on certain moral or ethical lines that even non religious people would have problems with.", "is_submitter": false, "distinguished": null, "created_utc": 1630588252.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Summonest", "id": "hbbbh6p", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #44 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": "I believe that I'm god and I just have yet to master my omnipotence.", "is_submitter": false, "distinguished": null, "created_utc": 1630589664.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Star_Cultist", "id": "hbawh4q", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #279", "submission": "pg9rej", "stickied": false, "body": "Militant Atheist", "is_submitter": false, "distinguished": null, "created_utc": 1630581709.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "ResidentIdaKozuke", "id": "hbaxud2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #198", "submission": "pg9rej", "stickied": false, "body": "Born a Muslim, never believed in it, became an atheist. I believe god is simply as close a external reflection of someone’s self if they believe in it.", "is_submitter": false, "distinguished": null, "created_utc": 1630582571.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "ianovic69", "id": "hbazio4", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #216", "submission": "pg9rej", "stickied": false, "body": "It turns out I'm a gnostic atheist.\n\nSomeone has been through these comments and down voted everything. I've not seen that here before.", "is_submitter": false, "distinguished": null, "created_utc": 1630583566.0, "parent_id": "t3_pg9rej", "replies": [{"author": "horse_loose_hospital", "id": "hbbyj62", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #128", "submission": "pg9rej", "stickied": false, "body": "I just reverse UNO'd them 👍🏼", "is_submitter": false, "distinguished": null, "created_utc": 1630599345.0, "parent_id": "t1_hbazio4", "replies": []}]}, {"author": "Akeldama22", "id": "hbb5g0n", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #423", "submission": "pg9rej", "stickied": false, "body": "I grew up exoteric Christian, turned atheist after thinking for myself, now I would say I believe in god but I don't necessarily subscribe to anything. I think all spiritual paths lead to generally the same place when looked at from an esoteric perspective. I would say I believe in the Hermetic Principles and the alchemy of the soul(transmuting your soul from lead to gold). The bland, controlled message of exoteric religion is what turned me atheist in the first place, but there's just so much more to it when you look past the veil.", "is_submitter": false, "distinguished": null, "created_utc": 1630586785.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "boringlesbian", "id": "hbbgy88", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #261 | Consortii Concordus", "submission": "pg9rej", "stickied": false, "body": "I was raised Catholic. I was supposed to be a nun. I went to a Baptist Academy school in 1st and 3rd grade. My mother would send me to back to back VBSs at any random church throughout the summer so she wouldn't have to hire a babysitter or watch me herself. At a young age I saw how different churches/sects interpreted things in the Bible and how wildly different those interpretations could be. I started questioning and was shut down every time. By the the time I was about 13, I started exploring other belief systems that I hadn't been raised with...Buddhism, Baha'i, Wiccan, etc. I decided at 19 that I couldn't believe any of them. I've been an Atheist ever since. In the last 20 years or so, I've become increasingly Anti-Theist. I think religion and magical thinking has done much more harm than good in the world.", "is_submitter": false, "distinguished": null, "created_utc": 1630592060.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Immelmaneuver", "id": "hbbwzpf", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #20", "submission": "pg9rej", "stickied": false, "body": "Raised Catholic, Philosophically Satanic Anti-Theist.", "is_submitter": false, "distinguished": null, "created_utc": 1630598730.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "BelowAvgPhysicist_02", "id": "hb9y8pj", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #267", "submission": "pg9rej", "stickied": false, "body": "I believe in science", "is_submitter": false, "distinguished": null, "created_utc": 1630555668.0, "parent_id": "t3_pg9rej", "replies": [{"author": "helloreddit321567", "id": "hbau7ad", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #247", "submission": "pg9rej", "stickied": false, "body": "Science isn't about beliefs though, so you shouldn't *believe* in it", "is_submitter": false, "distinguished": null, "created_utc": 1630580155.0, "parent_id": "t1_hb9y8pj", "replies": [{"author": "SeizureHamster", "id": "hbbs24h", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #206", "submission": "pg9rej", "stickied": false, "body": "Eh....idk. The more science I do the more I realize how much of it is taken on faith. Faith that skepticism will generate a self correcting system. Faith that published papers are accurate and presented appropriately. Faith that the lack of publishing negative results isn’t leading to knowledge of rare positives out of something that fails 999 of the 1000 times it was tried. Faith that the pipette guys calibrated our pipettes correctly. That antibodies actually work as intended. Like yes many of these things are frequently false, but like there comes a point where if you question everything you never get anywhere so you just kinda try to only take the less important things on faith. But it’s a lot of faith.", "is_submitter": false, "distinguished": null, "created_utc": 1630596709.0, "parent_id": "t1_hbau7ad", "replies": [{"author": "helloreddit321567", "id": "hbc0k9u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #247", "submission": "pg9rej", "stickied": false, "body": "Realising that some doubt still persist doesn't equal to taking it on faith. Repeatability is there to try to avoid having to take it up on faith, at least in theory. And you remain aware that some better fitted theory may exist whether we figure it out later or not. Science is about dealing with a healthy dosage of doubt, even if you do need to not let it invade all your work and keep you from trying to go on. But at the end of the day, it's about being aware that there is little that we know for sure, which is the opposite of faith.", "is_submitter": false, "distinguished": null, "created_utc": 1630600144.0, "parent_id": "t1_hbbs24h", "replies": [{"author": "SeizureHamster", "id": "hbcbwyb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #206", "submission": "pg9rej", "stickied": false, "body": "Difference of adjective choices here mainly I think. Reproducibility is much lower than we like to admit, months possibly years of my life have gone to doing exactly what someone else has claimed to have done and having it not work and then months on top of that trying slight variants that might make it work and sometimes having success with derivatives inspired by what other people claimed work and in my experience didn’t. Faith to me describes belief in something even knowing that it’s limited. Scholarly publishing is broken but I support it participate in it and believe in it anyways. Certainty doesn’t have to be a component of faith. I think that faith enters the equation when something can’t be checked. Therefore by accepting the depth of unknowns intrinsic to science it is a placement of faith.", "is_submitter": false, "distinguished": null, "created_utc": 1630604626.0, "parent_id": "t1_hbc0k9u", "replies": [{"author": "helloreddit321567", "id": "hbcih26", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #247", "submission": "pg9rej", "stickied": false, "body": "Imo faith is denying that there is doubt. So I don't think we are saying the same thing. A religious person will become angry and agitated at best if you try to make them see the holes in their belief, while being a scientist is admitting that there must be doubt. Also, I do make a difference between science and scientists. Science is the unreachable concept, designing the perfect protocols and being objective regarding the bias. Scientists are humans trying to do their best at figuring out things while knowing they have a wide range of limitations. I don't believe in scientists but I encourage the effort and partake in it.", "is_submitter": false, "distinguished": null, "created_utc": 1630607271.0, "parent_id": "t1_hbcbwyb", "replies": [{"author": "SeizureHamster", "id": "hbd0umy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #206", "submission": "pg9rej", "stickied": false, "body": "I separate faith from religion and fanaticism. I know a lot of very excellent religious/faith in god type people who very much take a “yeah idk if I’m right but this is the premise/belief system I have faith in” and we have had lots of lovely discussions where we share our belief systems with one another and it’s not a problem. Neither of us is trying to fix the other ones belief system because that’s not what faith is. Faith is something that enriches their lives, makes them feel better, and helps them be kinder people. It doesn’t have to perfectly explain the universe or make perfect sense all the time. It brings them comfort, a community, and makes them happier people. They are more comfortable with the concept of an unknowable ineffable sky daddy. I like the idea that god if extant is just a poor overworked programmer trying desperately to patch all the bugs in the universe and lowkey making it worse at least half the time. But that’s an amusing explanation/concept for me not a defining factor in my life. The ones that get angry and go no this true no doubt what’s wrong with you for questioning me come to jesus or go to hell I classify as fanatics and consider them problematic at best. For me, I am a better friend because I concentrate my objections around problematic and frequently harmful aspects of organized religion (of which imo there are many) instead of demonizing faith in explanations for the unknowable (given current science limitations) I just kinda go, well we don’t know either way, I have faith that yours doesn’t make any sense and sky daddy’s not real, but you have faith in sky dad. Neither of us knows so it’s at most conclusive an interesting philosophical exercise. Faith doesn’t auto jump everyone onto the kill shun and fix or torch the nonbelievers train. I don’t know and nobody knows but I like this explanation so that’s what I go with is faith.\n\nWe’re defining faith differently based on our interactions with religious individuals.", "is_submitter": false, "distinguished": null, "created_utc": 1630614541.0, "parent_id": "t1_hbcih26", "replies": []}]}]}]}]}, {"author": "Artizela", "id": "hbbzruo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #1", "submission": "pg9rej", "stickied": false, "body": "The scientific method can actually produce a lot of obviously idiotic falsehoods if followed coldly. A lot of intuition is required by researchers to decide what makes sense and what doesn't, so there is space for belief.\n\nFor example:\n\n1. Hempel's paradox demonstrates that you can prove all ravens are black by observing the color of apples and bananas.\n2. Goodman's New Riddle of Induction demonstrates that, using the fact that all bluebirds observed so far have been blue, we can scientifically prove that all bluebirds observed after 2030 will be green.\n\nThese are just two examples demonstrating holes in the current widely-accepted positivist scientific method. Various solutions have been presented for them and others, but each brings its own share of problems.\n\nThose 'holes' in the method are patched with intuition. And the fact that intuition is involved means people have to **believe** in the work scientists are doing, because science by itself can produce nonsense.", "is_submitter": false, "distinguished": null, "created_utc": 1630599836.0, "parent_id": "t1_hbau7ad", "replies": []}]}, {"author": "S_thyrsoidea", "id": "hbaanai", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "pg9rej", "stickied": false, "body": "I used to believe in science, but now I'm an atheist. :/", "is_submitter": false, "distinguished": null, "created_utc": 1630563745.0, "parent_id": "t1_hb9y8pj", "replies": []}]}, {"author": "paralea01", "id": "hba5buz", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #299", "submission": "pg9rej", "stickied": false, "body": "Agnostic atheist but raised Christian.", "is_submitter": false, "distinguished": null, "created_utc": 1630559954.0, "parent_id": "t3_pg9rej", "replies": [{"author": "LemonFlower21", "id": "hba8dsb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #399", "submission": "pg9rej", "stickied": false, "body": "Me too thanks", "is_submitter": false, "distinguished": null, "created_utc": 1630562064.0, "parent_id": "t1_hba5buz", "replies": []}]}, {"author": "HM_mtl", "id": "hbb9qot", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #487", "submission": "pg9rej", "stickied": false, "body": "\\- Was born as catholic  \n\\- Got a doubt about God existence and got interest with occultism at 8yo  \n\\- Got very hard time at primary and high school, + at home it wasn't that easy too  \n\\- In my 20s, I got every strange experiences that it couldn't really explain by science  \n\\- At 26yo, I got one of the ultimate strange experiences by meeting a \"spiritual being\" and it didn't go as planned for \"them\". Since that day, I saw an improvement in my life.", "is_submitter": false, "distinguished": null, "created_utc": 1630588879.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "enhtie", "id": "hbapiy5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #67", "submission": "pg9rej", "stickied": false, "body": "myself", "is_submitter": false, "distinguished": null, "created_utc": 1630576492.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "helloreddit321567", "id": "hbauofv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #247", "submission": "pg9rej", "stickied": false, "body": "I'm agnostic and I strongly dislike all religious structures. I'm not pretending to know what is or isn't, but I think that our religions are clearly man-made. They are just patriarchal structures that are there to either maintain the status quo or make mob fight for their leaders.", "is_submitter": false, "distinguished": null, "created_utc": 1630580499.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "woolgathering_futz", "id": "hbautk6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #509", "submission": "pg9rej", "stickied": false, "body": "I don't really like labels and boxes, I generally avoid them as I think individuals are interesting and complex and shit and great and stuff ...\n\nSo, beliefs? I believe there's an incomprehensible amount of mystery in this world/space/life and I love it. I love science and because I'm not very bright I love that people much smarter than me are able to immerse themselves in it, try to work things out and explain it to me.\n\nI think it most likely that none of this actually exists the way we think it does and we're part of a complex simulation or at least our journey has been or is being manipulated in some way.\n\nI also believe that when I die, it's over, done, nothing so I'm rather keen to make the most of this life and do what makes me and those around me happy, curious and kind.", "is_submitter": false, "distinguished": null, "created_utc": 1630580599.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "little_jonnie", "id": "hbb0py3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #248", "submission": "pg9rej", "stickied": false, "body": "I'm an atheist but my father and his family and my mother's family are religious. I never go around telling people that I don't belive in religion and I still celebrate Christmas with my family, so I can spend more time with them. I respect their beliefs even if I don't believe them myself.", "is_submitter": false, "distinguished": null, "created_utc": 1630584259.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "kindasortasalty", "id": "hbb9a36", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #33", "submission": "pg9rej", "stickied": false, "body": "I went to a Quaker school but that’s about as close to religion as I ever got", "is_submitter": false, "distinguished": null, "created_utc": 1630588663.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "rogue_skywalker", "id": "hbb9l2h", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #157 | Consortii Concordus", "submission": "pg9rej", "stickied": false, "body": "Ascendant Arborist ofc", "is_submitter": false, "distinguished": null, "created_utc": 1630588809.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "RSdabeast", "id": "hbbd34u", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #289", "submission": "pg9rej", "stickied": false, "body": "Atheist, ex-Catholic.", "is_submitter": false, "distinguished": null, "created_utc": 1630590374.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "germz80", "id": "hbbghcx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #119", "submission": "pg9rej", "stickied": false, "body": "I used to be Mormon, but am now an atheist. I don't believe in the flying tree either, but people here seem to be ok with that.", "is_submitter": false, "distinguished": null, "created_utc": 1630591858.0, "parent_id": "t3_pg9rej", "replies": [{"author": "Suulace", "id": "hbbpts9", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #289", "submission": "pg9rej", "stickied": false, "body": "> Mormon\n\nNice, a couple of us ex-mormons here looks like!", "is_submitter": false, "distinguished": null, "created_utc": 1630595793.0, "parent_id": "t1_hbbghcx", "replies": []}]}, {"author": "pm-me-ur-cattos", "id": "hbbis5q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #287", "submission": "pg9rej", "stickied": false, "body": "I'm Muslim :)", "is_submitter": false, "distinguished": null, "created_utc": 1630592832.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "OccamsRazorstrop", "id": "hbbj63o", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #180", "submission": "pg9rej", "stickied": false, "body": "Ex-Bible Belt Roman Catholic now long an agnostic-verging-on-gnostic asupernaturalist (my coined term to indicate that I have no belief in anything supernatural, which includes gods; yes, I know that there are terms such as realist, naturalist, and physicalist that mean that, but they come loaded with formal-philosophy baggage that I think is nonsense and don’t care to deal with).", "is_submitter": false, "distinguished": null, "created_utc": 1630592992.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "areyouseriousdotard", "id": "hbbkksn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "pg9rej", "stickied": false, "body": "Secular humanist", "is_submitter": false, "distinguished": null, "created_utc": 1630593584.0, "parent_id": "t3_pg9rej", "replies": [{"author": "PORTMANTEAU-BOT", "id": "hbbklh3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #483", "submission": "pg9rej", "stickied": false, "body": "Secumanist.\n\n***\n\n^(Bleep-bloop, I'm a bot. This )^[portmanteau](https://en.wikipedia.org/wiki/Portmanteau) ^( was created from the phrase 'Secular humanist' | )^[FAQs](https://www.reddit.com/axl72o) ^(|) ^[Feedback](https://www.reddit.com/message/compose?to=jamcowl&subject=PORTMANTEAU-BOT+feedback) ^(|) ^[Opt-out](https://www.reddit.com/message/compose?to=PORTMANTEAU-BOT&subject=OPTOUTREQUEST)", "is_submitter": false, "distinguished": null, "created_utc": 1630593591.0, "parent_id": "t1_hbbkksn", "replies": [{"author": "areyouseriousdotard", "id": "hbbl6zr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "pg9rej", "stickied": false, "body": "Bad bot", "is_submitter": false, "distinguished": null, "created_utc": 1630593845.0, "parent_id": "t1_hbbklh3", "replies": []}]}]}, {"author": "Suulace", "id": "hbbpin8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #289", "submission": "pg9rej", "stickied": false, "body": "I was raised Mormon and conservative, now I'm an atheist and liberal-ish", "is_submitter": false, "distinguished": null, "created_utc": 1630595668.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Rude_Ladder_9474", "id": "hbbsjwb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #266", "submission": "pg9rej", "stickied": false, "body": "Background is half and half Christian and atheist", "is_submitter": false, "distinguished": null, "created_utc": 1630596914.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "iIoveoof", "id": "hbbtrd3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #513", "submission": "pg9rej", "stickied": false, "body": "Episcopalian Christian", "is_submitter": false, "distinguished": null, "created_utc": 1630597429.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Gullible-Chemical471", "id": "hbcpzd2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #321", "submission": "pg9rej", "stickied": false, "body": "I'm a follower of the Lord Jesus Christ.", "is_submitter": false, "distinguished": null, "created_utc": 1630610250.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Corvidtv", "id": "hbdrahp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #330", "submission": "pg9rej", "stickied": false, "body": "Steadfast agnostic. Any person who says with 100% confidence that they know their sky daddy is the right one, or even that there's no chance a higher power exists, are terminally narcissistic. Uncertainty is the only real certainty in religious matters. Basically, believe in whatever makes sense to you, because everything is relative to your life. Most important thing is, don't be a cunt to others because they think differently than you.", "is_submitter": false, "distinguished": null, "created_utc": 1630626552.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "SuperfluousApathy", "id": "hbemekx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #492", "submission": "pg9rej", "stickied": false, "body": "Christ is lord.", "is_submitter": false, "distinguished": null, "created_utc": 1630641534.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "TopHatGuy413", "id": "hb9zqqm", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Druid #18", "submission": "pg9rej", "stickied": false, "body": "I believe in God, but only for the bad things.", "is_submitter": false, "distinguished": null, "created_utc": 1630556515.0, "parent_id": "t3_pg9rej", "replies": [{"author": "DugsBeCoolBro", "id": "hbayfwh", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #501", "submission": "pg9rej", "stickied": false, "body": "Why? (Note, the note here is not meant to be accusing, I’m genuinely curious. Tone doesn’t carry across just words, so just wanted to tell you so that we’re understanding each other well.)", "is_submitter": false, "distinguished": null, "created_utc": 1630582928.0, "parent_id": "t1_hb9zqqm", "replies": [{"author": "TopHatGuy413", "id": "hbcl7b4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #18", "submission": "pg9rej", "stickied": false, "body": "It’s a Seinfeld reference, but it seems no one caught it.", "is_submitter": false, "distinguished": null, "created_utc": 1630608357.0, "parent_id": "t1_hbayfwh", "replies": []}]}]}, {"author": "NoSuchKotH", "id": "hbaia7y", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pg9rej", "stickied": false, "body": "I believe in The Great Flying Tree.", "is_submitter": false, "distinguished": null, "created_utc": 1630569994.0, "parent_id": "t3_pg9rej", "replies": [{"author": "therapythrowaway1205", "id": "hbbcx04", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "pg9rej", "stickied": false, "body": "Hail almighty green floating oxygen provider!", "is_submitter": false, "distinguished": null, "created_utc": 1630590297.0, "parent_id": "t1_hbaia7y", "replies": []}]}, {"author": "SybariteAussie", "id": "hba57g7", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pg9rej", "stickied": false, "body": "Mother was hardcore Christian from when I was 7-8. Extreme measures utilised to indoctrinate. Treaty was made with mother that I could read the bible or listen to the sermon. I chose the bible. Read from cover to cover several times. Church 3 times a week, minimum. Have not been to church or read bible in over 30 years. Can still quote lots of verses! Was told that if I said a prayer, something magical would happen. God would speak to me & say that I was forgiven. Nothing happened. I would have liked the bible much more if they had left the 4 books of Enoch in there!", "is_submitter": false, "distinguished": null, "created_utc": 1630559870.0, "parent_id": "t3_pg9rej", "replies": [{"author": "DugsBeCoolBro", "id": "hbayrdh", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #501", "submission": "pg9rej", "stickied": false, "body": "Oof, that sounds awful. As a Christian, sorry u ur mom did that. That sound rly annoying and definitely not like it would make you want to genuinely be a Christian. Note to self : don’t be that forceful when I want my kids to be Christian.", "is_submitter": false, "distinguished": null, "created_utc": 1630583117.0, "parent_id": "t1_hba57g7", "replies": [{"author": "SybariteAussie", "id": "hbb4jtb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pg9rej", "stickied": false, "body": "I think I can quote one with book chapter & verse included , John 3-16. I used to be very sceptical about the flood. Velikovsky changed my mind. Am not anti religious, unless they are advocating violence or doing dodgy stuff with the women and children. Some religions are extremely wealthy! Own large corporations, vast real estate portfolios etc. Have heard that Amish church meetings, everyone is quiet. Every now and then, someone will make a taciturn statement. Everyone mostly lost in thought. That kind of church service sounds nice.", "is_submitter": false, "distinguished": null, "created_utc": 1630586323.0, "parent_id": "t1_hbayrdh", "replies": []}]}]}, {"author": "Cascadiana88", "id": "hbabud2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #270", "submission": "pg9rej", "stickied": false, "body": "I'm an agnostic atheist.", "is_submitter": false, "distinguished": null, "created_utc": 1630564654.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "GreyShuck", "id": "hbacikr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #201", "submission": "pg9rej", "stickied": false, "body": "Raised in the Church of England, but the whole christianity thing never had any resonance for me at all and I ceased any involvement with that as soon as my parents allowed me to stop going to Sunday school.\n\nThese days I am probably best described theologically as a naturalistic pantheist. I experience spirituality, express it in the form of paganism, and identify as a pagan. I have acted as a prison chaplain for the Pagan Federation in the past.", "is_submitter": false, "distinguished": null, "created_utc": 1630565187.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Ok-Researcher3350", "id": "hbbb2no", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #415", "submission": "pg9rej", "stickied": false, "body": "agnostic theist. i don’t believe in the bible, it was made so it would be ok to stone people to death because “god said so”", "is_submitter": false, "distinguished": null, "created_utc": 1630589481.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "rambling_RN", "id": "hb9w8xm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #258", "submission": "pg9rej", "stickied": false, "body": "That one day, I will no longer be.  I may or may not have changed something or someone, it's all about perspective. But what a wild and wonderful trip out has been.", "is_submitter": false, "distinguished": null, "created_utc": 1630554565.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "TesseractToo", "id": "hba4n0t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "pg9rej", "stickied": false, "body": "When I was a kid we were Friends Quaker. I'm atheist but still hold the values of that I guess. I'm a member but I don't go to meeting or anything and I don't think any god will be talking to me ever.", "is_submitter": false, "distinguished": null, "created_utc": 1630559508.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "pockets-of-soup", "id": "hba7nos", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #494", "submission": "pg9rej", "stickied": false, "body": "I am a bit more calvinist then baptist but like some of the eastern idea when it comes to meditation and experiences", "is_submitter": false, "distinguished": null, "created_utc": 1630561548.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Xechorizo", "id": "hba8p7g", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #216", "submission": "pg9rej", "stickied": false, "body": "Started out as a Mormon. Nowadays I'm fairly certain \"god\" is meaningless, or maybe even unthinkable.", "is_submitter": false, "distinguished": null, "created_utc": 1630562295.0, "parent_id": "t3_pg9rej", "replies": [{"author": "Suulace", "id": "hbbpoe2", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #289", "submission": "pg9rej", "stickied": false, "body": "Eyy fellow ex-mormon!", "is_submitter": false, "distinguished": null, "created_utc": 1630595732.0, "parent_id": "t1_hba8p7g", "replies": []}]}, {"author": "chocol8cek", "id": "hba9jkn", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #107 | Legio Virtus", "submission": "pg9rej", "stickied": false, "body": "I'm an atheist. My family is Hindu tho.", "is_submitter": false, "distinguished": null, "created_utc": 1630562923.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "jmcsquared", "id": "hbacqwq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": "Ignostic atheist. Raised in a pentecostal home where speaking in tongues was the norm.", "is_submitter": false, "distinguished": null, "created_utc": 1630565368.0, "parent_id": "t3_pg9rej", "replies": [{"author": "TheLittlestHibou", "id": "hbaet0m", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": "Speaking in tongues was creepy as hell the first time I saw girls doing this at a Youth For Christ conference.\n\nPoor kids. \n\nDidn't it feel fake and surreal to you growing up around this sort of thing?", "is_submitter": false, "distinguished": null, "created_utc": 1630567031.0, "parent_id": "t1_hbacqwq", "replies": [{"author": "jmcsquared", "id": "hbaforl", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": ">Didn't it feel fake and surreal to you growing up around this sort of thing?\n\nNope. I assumed it was god's spirit speaking through human beings. It was so normal to me, it happened so often in my house, it almost comforted me to hear it.\n\nHowever, I was never able to do it. Something in me couldn't just \"let go\" and start blabbering like an idiot. Maybe I subconsciously thought it was fake? I assumed it was because god gives people different gifts. Now I chalk it up to my natural stubbornness, the same stubbornness that made me eventually question all that garbage.", "is_submitter": false, "distinguished": null, "created_utc": 1630567768.0, "parent_id": "t1_hbaet0m", "replies": [{"author": "TheLittlestHibou", "id": "hbd5712", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": "It's so interesting how certain quirks and behaviours can be normalized when we're exposed to it repeatedly. Even the weirdest quirks can seem normal until someone breaks the status quo.\n\nBreaking from the status quo, that's what you did by questioning all that garbage.\n\nWhy do some people break from the status quo while most others follow?\n\nStubbornness, yeah, maybe.", "is_submitter": false, "distinguished": null, "created_utc": 1630616268.0, "parent_id": "t1_hbaforl", "replies": [{"author": "jmcsquared", "id": "hbdbxr6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #256 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": ">Why do some people break from the status quo while most others follow?\n\nMy wife and I have asked that same question about ourselves.\n\nYou might say it's due to one trait or another, but then you have to ask, why did we get those traits, and not others? Do others have those traits as well, and was it just our environment that helped us express them?\n\nI've concluded that we were just lucky.", "is_submitter": false, "distinguished": null, "created_utc": 1630619412.0, "parent_id": "t1_hbd5712", "replies": []}]}]}]}]}, {"author": "TheLittlestHibou", "id": "hbadtvq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": "After a childhood of violent religious abuse and clergy abuse in a Catholic children's home, as well as being told by both Catholics and Evangelicals (when I converted to Protestanism when I was ~12 y.o.) that victims of rape and sexual abuse have technically had sex before marriage - or outside of marriage - even if it wasn't consentual and was straight up RAPE, God still considers the victim of rape or child sexual abuse to have sinned because being raped is sex before/outside of marriage, and victims need to ask forgiveness from God for the sin of being raped... revolting, disgusting things to fill a child's head with.\n\nI believe religious people are so deeply brainwashed that they cannot tell the difference between right and wrong, and that religious people are mentally ill and this is exactly how I treat them. Like they're mentally ill (because they are).\n\nReligious people are delusional and cannot be trusted, especially when it comes to covering up child sex abuse and violence against women.\n\nAll major Abrahamic sects are guilty of this. I cannot respect, support or condone religions that sexually abuse women and children. I refuse to respect other people who stan for the Catholic Church or any other religion that abuses children (which is all of them, ALL religions abuse children imvho).\n\nNeedless to say, I'm a staunch atheist and don't believe in anything supernatural. Gods, ghosts, demons, angels, vampires, none of it.", "is_submitter": false, "distinguished": null, "created_utc": 1630566236.0, "parent_id": "t3_pg9rej", "replies": [{"author": "DugsBeCoolBro", "id": "hbaz5gr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #501", "submission": "pg9rej", "stickied": false, "body": "Oh my word, that’s awful! I know this probably won’t change your mind, and I totally get it, it probably wouldn’t change mine either, but that is not even close to anything that is anywhere in the Bible. The Christian God is not some hardcore, “Even if someone else messed you up it’s still ur fault,” kinda God. He’s expressed as being love. Not even loving, it says He *is* love. I’m so sorry these people got it so wrong.", "is_submitter": false, "distinguished": null, "created_utc": 1630583353.0, "parent_id": "t1_hbadtvq", "replies": [{"author": "TheLittlestHibou", "id": "hbbgmo1", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": "Excuse me, but no, the Bible repeatedly commands Christians to murder non-believers, to murder gay people, to murder women, and to abuse children.\n\nYou have been brainwashed.\n\nReligion is a mental illness.\n\n[https://www.evilbible.com/](https://www.evilbible.com/)", "is_submitter": false, "distinguished": null, "created_utc": 1630591921.0, "parent_id": "t1_hbaz5gr", "replies": [{"author": "Gullible-Chemical471", "id": "hbcpqqh", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #321", "submission": "pg9rej", "stickied": false, "body": "You have been misinformed.\n\nCan you show where the Bible commands Christians (not the Jews/Israelites) to do any of those things?\n\nThe Old Testament (first part) are largely Jewish laws, history and Prophet books. Those counted for the Israelite people, but never to Christians.", "is_submitter": false, "distinguished": null, "created_utc": 1630610155.0, "parent_id": "t1_hbbgmo1", "replies": [{"author": "paralea01", "id": "hbr2y4s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #299", "submission": "pg9rej", "stickied": false, "body": "Matthew 5-18\n\nFor verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled.\n\nThe law here being referred to by Jesus is Mosaic law.  Which commands a lot of murder and other atrocities.", "is_submitter": false, "distinguished": null, "created_utc": 1630888848.0, "parent_id": "t1_hbcpqqh", "replies": []}, {"author": "TheLittlestHibou", "id": "hbctzu4", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": "Are you trying to blame Jewish people for the terrible things Christians have done in the name of their God and according to the Christian Bible?\n\nThe Old Testament is a Christian fabrication, not a Jewish one. Christians wrote both the Old and New Testaments, not Jews.\n\nDo you blame Jewish people for the terrible things Muslims do to women and children too?\n\nLike, everything is the fault of the Jews?\n\nSigh.\n\nLike I said, religion is a mental illness.\n\nSorry, I don't mean to be offensive, I have zero patience for religious absurdity today. I've reached my limit.", "is_submitter": false, "distinguished": null, "created_utc": 1630611847.0, "parent_id": "t1_hbcpqqh", "replies": [{"author": "Gullible-Chemical471", "id": "hbcxovn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #321", "submission": "pg9rej", "stickied": false, "body": "I'm not blaming anyone. I explained to you how a Christian views and interprets the different parts of the Bible. I'm sorry if I had made that unclear to you.\n\nHumans can do terrible things in the name of whatever they want. That can be religion, their mom or their president, or just because. The fact someone  kills in name of a religion (or anything) does not make that religion (or anything) bad. Only if this religion (or anything) calls for that violence for the sake of it, then it is bad.\n\nNazi doctors did horrible experiments on humans in the name of science. Can we therefore conclude that science is disgusting and a mental illness? No, because science does not call for horrible experiments.\n\nThe Bible does not command Christians to do terrible things, therefore terrible acts can not be Christian acts.\n\nAlso, found any Bible verses so far that support your earlier mentioned claims?\n\nEDIT: your claim that the Old Testament was written by Christians is based on the lack of knowledge. Please look things up before making claims.", "is_submitter": false, "distinguished": null, "created_utc": 1630613298.0, "parent_id": "t1_hbctzu4", "replies": [{"author": "TheLittlestHibou", "id": "hbda2br", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "pg9rej", "stickied": false, "body": "Who wrote the Old Testament, hun?\n\nDo you even know?", "is_submitter": false, "distinguished": null, "created_utc": 1630618479.0, "parent_id": "t1_hbcxovn", "replies": [{"author": "Gullible-Chemical471", "id": "hbdcffr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #321", "submission": "pg9rej", "stickied": false, "body": "The Old Testament starts with the Torah (attributed to be compiled/partially written by Moses). The books following are historical books, authors unknown. Likely have been court scribes or so. Then there are the poetic books. Many of the psalms are attributed to king David, while the next few books are attributed to king Solomon. The Prophet books have been written by the prophet themselves, possible, or by a scribe, which is mentioned in some books.\n\nParts of these books have been found as part of the Dead Sea scrolls, dating back as far as 4th century BCE.\n\nIn the 10th century Jewish scholars wrote the Masoretic text, compiling the Hebrew Old Testament. This Masoretic text is used as basis for the OT of many modern Bible translations.\n\nFound any Bible verses yet that support your earlier mentioned claims?", "is_submitter": false, "distinguished": null, "created_utc": 1630619635.0, "parent_id": "t1_hbda2br", "replies": []}, {"author": "sister-goose", "id": "hbeo1xb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #458", "submission": "pg9rej", "stickied": false, "body": "Not Christians because they didn't even exist yet 🤦 Christian = follower of Christ. Christ wasn't even on earth yet in the OT", "is_submitter": true, "distinguished": null, "created_utc": 1630642443.0, "parent_id": "t1_hbda2br", "replies": []}]}]}]}]}]}]}]}, {"author": "ThickEffective1265", "id": "hbaev3w", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #293", "submission": "pg9rej", "stickied": false, "body": "I am a born Buddhist but I don't practice religion anymore", "is_submitter": false, "distinguished": null, "created_utc": 1630567080.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Mr--Elephant", "id": "hbah7zv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #72 | Ordo Cognitus", "submission": "pg9rej", "stickied": false, "body": "Agnostic, although I'm not inheriently against the concept of me being Religious. I do find some comfort in the idea and I have personal anacdotes that fit neatly in there. But too many religious communities/people around me are bigoted or use their faith as an excuse for conspiracy for me to be comfortable believing/identifying in such a thing", "is_submitter": false, "distinguished": null, "created_utc": 1630569076.0, "parent_id": "t3_pg9rej", "replies": [{"author": "DugsBeCoolBro", "id": "hbazich", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #501", "submission": "pg9rej", "stickied": false, "body": "Oh dude those people sound awful. Please try to explore these religions yourself, as often people will misrepresent their religion. As a Christian, there’s lots of people who say they’re a Christian but don’t at all act like it. And I’m sure this is true for other religions as well, so please explore them for yourself rather than trusting a possibly flawed interpretation of it.", "is_submitter": false, "distinguished": null, "created_utc": 1630583561.0, "parent_id": "t1_hbah7zv", "replies": []}]}, {"author": "TheDeadMonument", "id": "hbbcaqc", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "pg9rej", "stickied": false, "body": "Previously Baptist Christian.", "is_submitter": false, "distinguished": null, "created_utc": 1630590024.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "robbdire", "id": "hbad4d0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #112", "submission": "pg9rej", "stickied": false, "body": "Raised Catholic in Ireland. Dropped it at age 8 due to reading the bible in full and realising it directly contradicts not only itself, but reality.\n\nGot a degree in physics, so I do not believe in science, I understand science. \n\nI would be, for deities put forward by humanity a gnostic atheist, but for the possibility of one out in the universe agnostic.", "is_submitter": false, "distinguished": null, "created_utc": 1630565663.0, "parent_id": "t3_pg9rej", "replies": [{"author": "whymepphard", "id": "hbaopf8", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #26", "submission": "pg9rej", "stickied": false, "body": "sure lmao", "is_submitter": false, "distinguished": null, "created_utc": 1630575788.0, "parent_id": "t1_hbad4d0", "replies": []}]}, {"author": "Rue_Bixcube", "id": "hbb8jfq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #103", "submission": "pg9rej", "stickied": false, "body": "God is a fake idea. Someone made it up so they could beat up women, murder gay people, and steal money from brain dead idiots.", "is_submitter": false, "distinguished": null, "created_utc": 1630588313.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "horse_loose_hospital", "id": "hbby0kq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #128", "submission": "pg9rej", "stickied": false, "body": "Culturally Jewish/fully atheist.", "is_submitter": false, "distinguished": null, "created_utc": 1630599139.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Cregaleus", "id": "hbcbn8b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "pg9rej", "stickied": false, "body": "Atheist. Supposedly I was raised Christian, but my parents didn't tell me that until I was 22. We never once went to church except for weddings and funerals. I had assumed my parents were atheist too, but they're just really bad at being religious.", "is_submitter": false, "distinguished": null, "created_utc": 1630604517.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "Grievous1138", "id": "hbed5sg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #133", "submission": "pg9rej", "stickied": false, "body": "Raised Catholic. Questioned for a while. Studied my own faith in more detail and a bunch of others. Came back around to Catholicism, but I like to think I'm more well-rounded by the experience.", "is_submitter": false, "distinguished": null, "created_utc": 1630636847.0, "parent_id": "t3_pg9rej", "replies": []}, {"author": "JokerReach", "id": "hbqe5cd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #440", "submission": "pg9rej", "stickied": false, "body": "Like many folks here I am exmormon.\n\nAfter years as more of apatheist than anything I ended up stumbling across the Nag Hamaddi library and a lot of the concepts made a lot of sense to me.\n\nThe tripartite metaphysical framework outlined in the Apocryphon of John provides more adequate explanations for concepts such as the problem of suffering/evil and the unwelcoming/harsh nature of the world than I have found elsewhere (very often \"God works in mysterious ways\" or \"it's just random bruh,\" neither of which have ever been satisfactory answers to me).\n\nI don't necessarily subscribe to a literalist interpretation of Gnostic Christianity. I don't have faith that there is a lion-headed snake named Yaldabaoth that masquerades as Yahweh who was rejected from Pleroma as a result of Sophia's solo-emanation. I don't have faith that the Monad sent Christ to provide a path back for our divine sparks to join back up with syzygies.\n\nHowever, the *concept* of Pleroma, the *concept* of fragments of it providing the basis for spirituality and that which makes us uniquely human, that makes us resist and make the best of the cruel nature of physical existence... I'd be lying if I said I didn't find answers and solace therein.", "is_submitter": false, "distinguished": null, "created_utc": 1630876808.0, "parent_id": "t3_pg9rej", "replies": []}]}