{"title": "Is this it?", "name": "t3_ped1ph", "url": "https://www.reddit.com/r/TheFlyingTree/comments/ped1ph/is_this_it/", "selftext": "Well, I'm finishing my university degree soon. I do stats and data science. It was okay. The university was rather inefficient. I feel hopeless. Is this it? Am I just going to to work for the next 50 years of my life for some corporate pigs gain? I don't enjoy living. I don't enjoy consuming products. Money is so meh for me. I feel like I don't fit into this place. I want out of here. It terrifies me that I'll be stuck in some meaningless job to earn meaningless money. I just don't care. I'm already mentally ill, and I think I'll diminish as I go on. I don't enjoy living and I don't see anything in the future that I would enjoy.\n\nI always have this fantasy that I could run away to Ukraine or Congo or somewhere, be an irregular, experience combat. See life on the line. The camaraderie. There nothing is superficial. It's 'go kill these guys' or 'do this objective'. It risky sure, but It looks meaningful and exciting. I yearn for something significant.  I don't think I can keep living this same way. Might as well die in combat, a much more honourable way to go. Dying for ideals, rather than the lack of them. \n\nI don't want to be a corporate drone. I am already miserable enough.  Any input is welcome. I am largely done with humanity, so be as cruel as you like. I'm just some user on some stupid website.", "score": 13, "upvote_ratio": 0.79, "permalink": "/r/TheFlyingTree/comments/ped1ph/is_this_it/", "id": "ped1ph", "author": "Star_Cultist", "link_flair_text": "Discussion", "num_comments": 24, "over_18": true, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630307522.0, "comments": [{"author": "Concrete_Grapes", "id": "hawiqf6", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "ped1ph", "stickied": false, "body": "Go to a marina, with your fancy degree, and offer to do their book keeping job. Say, you'll do that, and trade if for experience learning to fix boats, or gain a captains license, or learning to sail. Some hands on adventure shit traded for some number crunching. LEt everyone in the marina know you're willing to do some acocunting for their taxes, and see if they can get their boat repairs written off or some shit.  \n\n\nLearn how to swear like a sailor.   \n\n\nLearn all the datasheets for all the resins and carbon'glass and sheet goods for all the fucking things they're building in the yard, become the GO to guy for data and data science on which materials are best to fix these briney bastards boats. Shit, if you have to get a job at West Marine (it's a real place), to get this, DO IT.   \n\n\nLearn boat drafting. Go read some books. Talk to anyone coming in that's building a boat. Talk about the data, and data science of hull lenght vs hull speed, find some fancy bullshit and blow their minds.   \n\n\nOnce you know your ass from a hole in the ground on a boat, apply to sail on Tall Ships, or racing crews. They'll feed you, become your bothers, you'll all nearly fucking die every time you head out, they'll BEG you to do math to save weight with material data's and resine compatibility, or you could manage the finances when they find out you've got that degree... you'll be budgeting/material data'ing some billionaires 35 million dollar racing boat's  (that he's never on) attempt to break the trans atlantic record by the time you're 30--haulin ass across the ocean at 70mph in gale force winds threatening to rip your fucking head off--with only your crew mates to keep your ass alive and prevent you from freezing to death...   \n\n\nI mean..   \n\n\nyou'll see dolphins too.   \n\n\nIt's better than getting shot 2 days into playing commando because you didnt keep your head down. innit sparky?", "is_submitter": false, "distinguished": null, "created_utc": 1630308399.0, "parent_id": "t3_ped1ph", "replies": [{"author": "Star_Cultist", "id": "hax40kx", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #279", "submission": "ped1ph", "stickied": false, "body": "Wow, that does sound intense. I never thought I could just use my degree as a foot in the door type way. This is an interesting option, as I do like the water, I was a national swimmer once. Maybe I should think about it", "is_submitter": true, "distinguished": null, "created_utc": 1630325197.0, "parent_id": "t1_hawiqf6", "replies": []}]}, {"author": "grandpassacaglia", "id": "haxqh0q", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #215", "submission": "ped1ph", "stickied": false, "body": "You have a five year old’s dramatized view of warfare", "is_submitter": false, "distinguished": null, "created_utc": 1630336098.0, "parent_id": "t3_ped1ph", "replies": [{"author": "Study_Tryhard", "id": "hayad6f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #252", "submission": "ped1ph", "stickied": false, "body": "fr", "is_submitter": false, "distinguished": null, "created_utc": 1630344364.0, "parent_id": "t1_haxqh0q", "replies": []}]}, {"author": "agaminon22", "id": "haxx1ci", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #174", "submission": "ped1ph", "stickied": false, "body": "Your view on what it is like to be a mercenary in a third world country is idiotic.", "is_submitter": false, "distinguished": null, "created_utc": 1630338866.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "Study_Tryhard", "id": "haxnz58", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #252", "submission": "ped1ph", "stickied": false, "body": "jesus christ, go touch grass and get a friend and talk to someone, fucking hell", "is_submitter": false, "distinguished": null, "created_utc": 1630335020.0, "parent_id": "t3_ped1ph", "replies": [{"author": "grandpassacaglia", "id": "haxqk3x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #215", "submission": "ped1ph", "stickied": false, "body": "First sane response", "is_submitter": false, "distinguished": null, "created_utc": 1630336134.0, "parent_id": "t1_haxnz58", "replies": [{"author": "Study_Tryhard", "id": "hayaaph", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #252", "submission": "ped1ph", "stickied": false, "body": "lmao was expecting a ton of downvotes for saying this", "is_submitter": false, "distinguished": null, "created_utc": 1630344335.0, "parent_id": "t1_haxqk3x", "replies": []}]}]}, {"author": "gaoshan", "id": "haxliah", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #84", "submission": "ped1ph", "stickied": false, "body": "Why do you feel that killing people (or being killed by people) in combat would be meaningful? Shouldn't there be a reason to take life? Is the reason just \"bad guys\"? Who determines this? What ideals, exactly? I realize it's a fantasy to you but if that's what you turn to in a search for meaning I think you should stop and consider why this is. If you can identity what sorts of ideals you would be willing to die for I bet you can find better options for meaning than lethal combat.", "is_submitter": false, "distinguished": null, "created_utc": 1630333961.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "Netzapper", "id": "haxsu97", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #213 | Classis Veritatus", "submission": "ped1ph", "stickied": false, "body": "> I always have this fantasy that I could run away to Ukraine or Congo or somewhere...\n\nSo instead of corporate drone doing stats, you'd prefer to be a drone murdering people?\n\nThe conflicts you're talking about are, fundamentally, about some fucker wanting to make some money or amass more nationalistic power. Yeah, there's some fighters on the defensive, who didn't start the war, but they're shitty people too. The Ukraine conflict is basically Ukrainian nazis versus Russian nazis. Congo is even fucking messier, organized along economic and tribal lines most westerners can't even _see_, let alone understand.\n\n> Dying for ideals, rather than the lack of them. \n\nWhat fucking ideals? You think the conflicts fought by mercenaries are driven by _ideals_? You think the wars fought by nationstates are driven by _ideals_? You'd be dying to make somebody else some money.", "is_submitter": false, "distinguished": null, "created_utc": 1630337112.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "pine_ary", "id": "hayty4d", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "ped1ph", "stickied": false, "body": "Leaving the idiotic romanticism for warfare aside, I‘m inclined to agree. \n\nWage labour is not fulfilling or just. Too many people convince themselves that serving a corporation is honorable or even desirable. But I reject the submission, and pointlessness. If you have no connection to the fruits of your labour, it is useless. It’s perfectly normal not to want that. I side with Nietzsche: Who doesn‘t own 2/3rds of their waking day is a slave. \n\nAs for solutions… try to find a passion. Something or someone you care about. Make friends, learn to cook, read books, help your neighbors, design a board game, join a worker‘s liberation group, have a kid, go visit places, build chairs, contribute to free software, play music, whatever you find fulfilling and worth your time. \n\nWork is compulsory. We have to do it to live. And we have to do it, to enable us to do what we want in our free time. Until we can manage to abolish wage slavery, just get the least bad job, do your work and try to balance money and time to enable your true interests. It‘s no use being miserable for idealistic reasons. But neither should we be complacent.\n\nAs for mental illness, it‘s complicated. We should absolutely strive to be the best version of ourselves. Now, that doesn‘t mean we should view mental health purely individualistically. After all, in a sick society, being sick is just a rational response. Being mentally well doesn‘t mean submission, or changing yourself to fit in. But that‘s no excuse not to improve your own health. It means being good to yourself and to take care. By the sound of it you should probably work on your mental health first.\n\nI wish you all the best :)", "is_submitter": false, "distinguished": null, "created_utc": 1630352485.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "armyprof", "id": "hawr6ma", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #372", "submission": "ped1ph", "stickied": false, "body": "So let me offer some perspective.  50M here, masters in research methods and stats/measurement.\n\nOne day the things you’re dreading will be what you want.  Stability, routine, a steady check.  When you’ve got family to care for and a mortgage, those things become very important.  \n\nBut…\n\nAt your age it’s perfectly normal to want to put a few miles on your soul first.  I did…I joined the Army and was a tank crewman for 12 years.  It was a combination of wonderful, frustrating, character building, annoying and routine all at once.  I met the finest people I know there and still keep in touch with some who I consider my brothers.  All the best stories I have come from those days.  I would not trade it for anything.\n\nSo.  Consider this.  With a degree you could join any service as an officer.  And every service has an intelligence branch that would love to have you.  Consider it!  You’ll make a bit of money, get some very valuable experience and have something you can look on with pride one day.  \n\nJust a thought!  Good luck!", "is_submitter": false, "distinguished": null, "created_utc": 1630315762.0, "parent_id": "t3_ped1ph", "replies": [{"author": "Star_Cultist", "id": "hax3pc6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #279", "submission": "ped1ph", "stickied": false, "body": "You make a good point. I guess army logistics would always need more guys. Thank you", "is_submitter": true, "distinguished": null, "created_utc": 1630325007.0, "parent_id": "t1_hawr6ma", "replies": []}]}, {"author": "usernames_suck_ok", "id": "haxoe83", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #233", "submission": "ped1ph", "stickied": false, "body": "Unlike some other users, I don't particularly think this is an age thing. I'm 40, don't want to work for the rest of my life (and definitely don't want \"routine\") and am focusing on making as much money as I can in a job I can actually tolerate so that I can retire asap.\n\nYou'll find other people--of all ages and experiences--who get what you mean at r/antiwork.", "is_submitter": false, "distinguished": null, "created_utc": 1630335199.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "145676337", "id": "haxoghz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #116", "submission": "ped1ph", "stickied": false, "body": "First, if you want to try \"normal\" you can prioritize a job where you can work as little as possible to allow you to spend as much time with friends as possible.\n\nSecond, I knew someone that had just finished all their training to become a doctor. They went on a SCUBA trip to Indonesia and just never came back. Like, it had been 2+ years. They worked at a dive resort while getting all their certifications to lead diving trips and then did that. Every day was wake up, go out on a boat, lead a few dives, head back, drink a beer while chatting with friends and the new visitors and call it a day (food and such thrown in there).\n\nAnother friend decided they'd had enough and joined a Norwegian (the friend isn't from the Europe) sailing crew for 6 months. Now they bounce around doing whatever suits their fancy. They don't have stuff but they and their partner love their lifestyle.\n\nThere's a lot of options between those two ideas and a lot of options outside of them. The thing I've found most true over the years is that it's about who you're with and not what you're doing. Sitting around on a couch, SCUBA diving, heck going to work... If you like the people you're with it's likely to be a good time.", "is_submitter": false, "distinguished": null, "created_utc": 1630335227.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "abraham1inco1n", "id": "hawqygf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "ped1ph", "stickied": false, "body": "ooof you gotta get some mental health help first of all- have you tried talking to a therapist or tried any medication? They can really really help. \n\nThe other thing is checkout the Financial Independence/ Retire Early community: https://www.reddit.com/r/Fire/ . I definitely agree that 50 years of 9 to 5 work sounds like the absolute worst- FIRE is part of what keeps me going and I'm looking to only work for ~10 more years in order to be FI.\n\nAlso hobbies really help (especially ones around exercise like climbing/hiking/cycling for me).", "is_submitter": false, "distinguished": null, "created_utc": 1630315562.0, "parent_id": "t3_ped1ph", "replies": [{"author": "Star_Cultist", "id": "hax3ill", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #279", "submission": "ped1ph", "stickied": false, "body": "Hello, yes i'm currently medicated with antidepressants and anti-psychotics. They did help a ton just to raise my energy level. I go to therapy every 2 weeks. \n\nThank you for the link.\n\nI just bought a bike, so I hope it can help me", "is_submitter": true, "distinguished": null, "created_utc": 1630324892.0, "parent_id": "t1_hawqygf", "replies": [{"author": "abraham1inco1n", "id": "hax3qvj", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #100", "submission": "ped1ph", "stickied": false, "body": "ooohh also motorcycles definitely help as well :D", "is_submitter": false, "distinguished": null, "created_utc": 1630325033.0, "parent_id": "t1_hax3ill", "replies": []}]}]}, {"author": "04221970", "id": "hax5wi8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #110", "submission": "ped1ph", "stickied": false, "body": "I was in your shoes a long time ago.  aimless after a unexciting degree.\n\nHere's my advice.  Before you get a job; before you get married and get locked down.....do something for the experience for yourself.  Take a trip, hike the Appalachian trail, sign on to a freighter...whatever.....just for the experience.\n\nYou will remember it and talk about it for the rest ofyour life.", "is_submitter": false, "distinguished": null, "created_utc": 1630326324.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "RiderHood", "id": "haywzsf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "ped1ph", "stickied": false, "body": "I dream about this all the time. But I made the choice to have kids when I was in my early 20’s. Honestly, if I knew then what I know now I just would have worked hard, saved my money, and then chase my dreams.", "is_submitter": false, "distinguished": null, "created_utc": 1630353731.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "Ayoromantic", "id": "hazhx34", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #245", "submission": "ped1ph", "stickied": false, "body": "If you die in combat you’re still a pawn for a government and their war and you’re meaningless to them lmfao", "is_submitter": false, "distinguished": null, "created_utc": 1630362680.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "pm-me-ur-cattos", "id": "hb2q2vz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #287", "submission": "ped1ph", "stickied": false, "body": "/r/antiwork\n\nJoin us! :)", "is_submitter": false, "distinguished": null, "created_utc": 1630427640.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "TiPirate", "id": "hb2wr6m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #400", "submission": "ped1ph", "stickied": false, "body": "So, run away.", "is_submitter": false, "distinguished": null, "created_utc": 1630430328.0, "parent_id": "t3_ped1ph", "replies": []}, {"author": "G235s", "id": "hb5khqs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #225", "submission": "ped1ph", "stickied": false, "body": "While I do not recommend relying on children to make you happy/bringing them into the world with a job to do for you, having one or more will take care of this kind of affluenza pretty damn quick. \n\nI know it's cool to be childfree right now, but I doubt anyone who can't handle making a connection with another person, working an OK job to support some mundane goals, and helping another person raise another person, is going to do very well on some kind of self destructive adventure.\n\nMaybe date for a while and stop worrying for a bit, have some fun. All this stuff you think is hell is really what most of us do and it's not bad.", "is_submitter": false, "distinguished": null, "created_utc": 1630474559.0, "parent_id": "t3_ped1ph", "replies": []}]}