{"title": "Any method you have for learning something effectively?", "name": "t3_phc1r8", "url": "https://www.reddit.com/r/TheFlyingTree/comments/phc1r8/any_method_you_have_for_learning_something/", "selftext": "Starting new subjects this year, any tips would be nice", "score": 3, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/phc1r8/any_method_you_have_for_learning_something/", "id": "phc1r8", "author": "Study_Tryhard", "link_flair_text": "Question", "num_comments": 12, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630697251.0, "comments": [{"author": "seloupoivre", "id": "hbhic0v", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #562", "submission": "phc1r8", "stickied": false, "body": "Check out the book “make it stick: the science of successful learning” by Peter C Brown, Henry L Roediger III, and Mark A. McDaniel. \n\nI could drop a tip or two from that book but you’d be much better served by purchasing it and keeping it in your library. \n\nThings that stood out: varied practice is better than the unvaried. ( kids who practice throwing bean bags into hoops at 5, 8 and 10 foot distances outperform kids who only practiced throwing beanbags into the hoop that was 10’ away when both groups were later tested on how many times they could get the bean bags into the hoop that was 10’ away.) \n\nThis applies to more than just kinaesthetic lessons, but it’s only one of a hundred tips and lessons to glean from it and I’d be doing you a disservice trying to paraphrase the whole thing for you. The book is phenomenal, I strongly suggest buying it.", "is_submitter": false, "distinguished": null, "created_utc": 1630698805.0, "parent_id": "t3_phc1r8", "replies": [{"author": "Study_Tryhard", "id": "hbhmhyi", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #252", "submission": "phc1r8", "stickied": false, "body": "Thanks, will check out the book, have an award.", "is_submitter": true, "distinguished": null, "created_utc": 1630700651.0, "parent_id": "t1_hbhic0v", "replies": [{"author": "QuietFew5805", "id": "hbjeqrw", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #592", "submission": "phc1r8", "stickied": false, "body": "Purchased on audible; cheers.", "is_submitter": false, "distinguished": null, "created_utc": 1630734475.0, "parent_id": "t1_hbhmhyi", "replies": []}, {"author": "seloupoivre", "id": "hbjwp33", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #562", "submission": "phc1r8", "stickied": false, "body": "D’aw shucks, thanks.", "is_submitter": false, "distinguished": null, "created_utc": 1630749734.0, "parent_id": "t1_hbhmhyi", "replies": []}]}, {"author": "TemporaryMayGoAway", "id": "hbluh48", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #9", "submission": "phc1r8", "stickied": false, "body": "After seeing your comment. I ended up reading the book. Thanks for recommending it.", "is_submitter": false, "distinguished": null, "created_utc": 1630785891.0, "parent_id": "t1_hbhic0v", "replies": []}]}, {"author": "catssej", "id": "hbidc8u", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #88", "submission": "phc1r8", "stickied": false, "body": "Active recall and spaced repetition are the most effective ways to remember information. My favourite way to study is to make “cheat sheets”, one page per each lecture of a class with the KEY information. Then I use a whiteboard and ask myself questions about the info and try to answer them without looking, pretending to teach someone else helps me a bunch.", "is_submitter": false, "distinguished": null, "created_utc": 1630713371.0, "parent_id": "t3_phc1r8", "replies": []}, {"author": "Paul_Thrush", "id": "hbixjkz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "phc1r8", "stickied": false, "body": "Read ahead of the syllabus. Read through the material the teacher will cover in class the day before or that morning. Don't worry about understanding it. Just read it. When the teacher goes over it in class you will be able to follow it much easier since you know the point and where the teacher is going with the lesson. You'll be better able to ask relevant questions to understand what you're missing.", "is_submitter": false, "distinguished": null, "created_utc": 1630723833.0, "parent_id": "t3_phc1r8", "replies": []}, {"author": "throw-away451", "id": "hbjc1w4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #164", "submission": "phc1r8", "stickied": false, "body": "I am just speaking from personal experience so your mileage may vary, but I would say the best way to learn and retain information is to understand the principles behind or themes of your subject rather than rote memorization. Rote memorization is fine for regurgitating information, and sometimes you just have to do it when there’s no easy way to dissect information into meaningful chunks that help you understand something. But in the long term, most of it will be forgotten as soon as it’s no longer being actively used, and without a proper grounding in the big picture, it will have less meaning and be less useful. \n\nDon’t only ask yourself how to do something, ask why you’re doing it and why it works. I think this applies both to the humanities and STEM. A formula in math isn’t just a machine for getting the right answer; it works based on practical principles and was reached through mathematical proofs, so if you understand those and the ultimate meaning or purpose of the equation, you won’t get stuck as easily and may be able to apply common sense to help you get the right answer. When writing essays, some just assume you can plug in information to satisfy a checklist. Instead, think about how your ideas can flow smoothly and logically from argument to evidence, and onwards to further arguments that develop from or respond to the previous ones. What are you trying to explain in general, and how are you going to develop your current point so it can stand on its own and link your previous and next points? Students forget that homework and projects are intended to test your understanding and help you master the material. It isn’t busy work (most of the time, hopefully), it’s a vehicle for gaining insight that can’t be taught, only experienced directly. \n\nWhen you read new material, don’t just absorb the information as information unto itself. Think critically about it and explore how it ties into what you already know. Taking the time to process it fully now will save you a lot of headaches later. It’s a kind of mental shortcut that cuts down on the need for brute force thinking. At the same time, cultivate what Zen practitioners call the “beginner’s mind”: be enthusiastic about learning, but don’t let your preconceptions get in the way of the new knowledge you’re studying. \n\nWhen I was in college, I saw too many people just try to get by at the last minute. If you take a genuine interest in most of what you’re learning (barring some stuff that inevitably will bore you), and engage with ideas and not merely facts, it’ll stick with you much better and broaden your horizons. Knowing how to think, both in academics and the working world, is far more valuable in most cases than vast knowledge with only shallow understanding.", "is_submitter": false, "distinguished": null, "created_utc": 1630732566.0, "parent_id": "t3_phc1r8", "replies": []}, {"author": "GlueGuy00", "id": "hbkm80p", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #543", "submission": "phc1r8", "stickied": false, "body": "break it down to learnable chunks", "is_submitter": false, "distinguished": null, "created_utc": 1630765995.0, "parent_id": "t3_phc1r8", "replies": []}, {"author": "CorvusChaos", "id": "hbhxhl9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #564", "submission": "phc1r8", "stickied": false, "body": "I've never used them but I've heard good things about making Anki decks of flashcards and using them for spaced repetition.", "is_submitter": false, "distinguished": null, "created_utc": 1630705635.0, "parent_id": "t3_phc1r8", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "hbiejkh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "phc1r8", "stickied": false, "body": "As Nike says it *just do it*", "is_submitter": false, "distinguished": null, "created_utc": 1630713987.0, "parent_id": "t3_phc1r8", "replies": []}, {"author": "blazikenxoxo", "id": "hbj5416", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #522", "submission": "phc1r8", "stickied": false, "body": "I kinda think of it in levels of complexity. Try to understand something on the lowest level of complexity, build a framework, and work up the levels of complexity and vwalah! You’re and expert. \n\nBut it kinda depends on what you hope to achieve in your endeavors. I like project based learning, so I actually try to do the thing. You will be better able to filter out what you do and don’t really know.", "is_submitter": false, "distinguished": null, "created_utc": 1630728130.0, "parent_id": "t3_phc1r8", "replies": []}]}