{"title": "Do you think it's possible to go back to faith after atheism?", "name": "t3_p0dcsv", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p0dcsv/do_you_think_its_possible_to_go_back_to_faith/", "selftext": "I've been pondering this a lot lately, it might be my little brain can't imagine this, but do you think you can make the philosophical or metaphysical walk back to faith after understanding atheism?  \n\n\nI've always wanted to talk to someone who has done this and I've talked to about 5 who say they have but in all cases it was something they did in their early 20's and it was more to indulge in hedonistic things (ie party) without thinking about judgement, and then they returned to their faith later on. In  these instances these people (especially one who was a Professor at a Uni teaching Theology), they all claimed to be ex-atheists and in their opinion found their faith to be true.   \n\n\nWhat I surmised from this (and I can't know for sure as I don't live in their head so I don't know how honest they were) was that they never did what I'd call \"the walk\" which is to really think about the existence or non existence of god/gods and what the unobjective proof is. It seemed to me as insincere and like I said, more about doing think god they knew were wrong in the eyes of their faith like a Rumspringa as it were.  \n\n\nThis is not what I am referring to.  \n\n\nYou hear from time to time about ex-pastors who are outspoken atheists- Matt Dillahunty and Dan Barker are two well known examples but for the other way around... there aren't many.   \n\n\nAfter you unpack that morality and religion are not the same thing (I think many religious people conflate the two) and realize that people who are religious can be just as cruel and criminal as atheists (and possible more so due to Moral Liscenceing) you realize that it's not religion that holds you to morals and values but more of a Humanism approach.  \n\n\nDo you think it's possible? After casting a skeptics eye to the idea of God and seeing that there aren't truly evidences do you think you can go back to faith? Doesn't faith sort of require a type of cognitive dissonance that you don't really investigate?  \n\n\nI don't know my thoughts are pretty scattered on this. What do you think?", "score": 9, "upvote_ratio": 0.77, "permalink": "/r/TheFlyingTree/comments/p0dcsv/do_you_think_its_possible_to_go_back_to_faith/", "id": "p0dcsv", "author": "TesseractToo", "link_flair_text": "Discussion", "num_comments": 98, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628423828.0, "comments": [{"author": "Cognizant_Psyche", "id": "h85vyq0", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "For clarification on terms, when I say atheist I mean lack of a belief in a deity, that’s It.  This is also coming from the perspective of someone who left after decades of indoctrination and heavy fanatical beliefs in a radicalized fundamental non denominational sect of Christianity, resulting in landing as an Existential Nihilist after over a decade of self reflection, research, learning, contemplation, and exploring a wide variety of topics such as science, history, philosophy, religions, and psychology.\n\nI find that many atheists who left religion and then returned never really stopped believing in the first place.  They became disenfranchised with the sect, group, traditions, church, peers, or family upbringing they were subjected to, or had a bout of misotheism (what the religious claim us atheists are), but either never understood the core beliefs, read the holy text  (only listened what other people told them it said),and/or still held on to the core tenants of the faith as true but threw the baby out with the bath water.  Then after life happens they fall back into old habits or comforts and become the prodigal son, usually into a different sect or religion that aligns more with how they feel or can accept it as truth.  I hate to say it was just a phase, and there are exceptions I’m sure, but I find it hard for someone who did the due diligence as you said and really took stock of themselves and their beliefs resulting in full abandonment of deistic beliefs to return to what amounts to fantasy ( from the perspective of us heathens when it comes to the existence of a deity).  It would be like an adult returning to the belief in Santa, once you open that box you can’t really go back.  Life is hard and people will do strange thing to survive and cope with reality… but again, I find it difficult to imagine such a regression.", "is_submitter": false, "distinguished": null, "created_utc": 1628426140.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h85x2mi", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Yeah I can see it being a comfort thing for sure, or maybe as a way to help teach kids morals (since that conflation of religion/morals is really a thing both ways).  \n\n\nInteresting, thanks! I'll mull it over", "is_submitter": true, "distinguished": null, "created_utc": 1628426862.0, "parent_id": "t1_h85vyq0", "replies": [{"author": "Cognizant_Psyche", "id": "h85yo5v", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #151 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "Sure thing.  My two cents on the morality aspect though would be to never use a religion you don’t believe or agree with as a teaching vehicle for such an important element of development.  Again my experience is with Christianity, but the underlying element to every single moral, good or bad, is that you must believe and follow the rules and teachings in order to be good, and if you don’t you’re bad, even if you think it’s good.  That can really fuck with a developing mind, it certainly did a number on mine. The fact of the matter is anything good in a religion can be had without it, because let’s be honest - they didn’t come up with it nor hold a monopoly on it.", "is_submitter": false, "distinguished": null, "created_utc": 1628427863.0, "parent_id": "t1_h85x2mi", "replies": [{"author": "TesseractToo", "id": "h8622wz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "That's a good way to look at it but I think many people don't (in that they don't look into it, the religion used to teach morality is a shortcut for them).\n\nIn my opinion, most religions have really awful morals across the board, many things like \"don't steal\" etc are pretty ubiquitous but when it gets down to issues of slavery or rape or how women should be treated it gets pretty gruesome. I'll never have kids but hypothetically I wouldn't feel comfortable with something like the bi-ble\\* being a moral guide as my parents did.  \n\n\nAs for things good that is in an religion and can't be held without it, many people in it would have you believe otherwise, it's an abuse tactic done to keep people from leaving.\n\n\\*sorry trying to avoid a reply by the bot that always links the bible hehe", "is_submitter": true, "distinguished": null, "created_utc": 1628429869.0, "parent_id": "t1_h85yo5v", "replies": []}]}, {"author": "TheDeadMonument", "id": "h86ohfx", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "p0dcsv", "stickied": false, "body": "I think the 'comfort' and 'coping' are huge things here. I think most religious people, like *honestly* religious and faithful, truly need something to depend on. I personally don't judge it, because I think there's a lot of people out there that need hope. Even if those of us outside would consider it a false hope.", "is_submitter": false, "distinguished": null, "created_utc": 1628440887.0, "parent_id": "t1_h85x2mi", "replies": [{"author": "TesseractToo", "id": "h86y3yx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Definitely.  \n\n\nOne thing I find a bit distasteful about religion is going in as a person looking for hope, you might end up with a bunch of the Just World Fallacy people aka the \"it's god's will\" people. I think that kind of dismissiveness to someone can increase the feeling of alienation but fortunately that isn't in the majority.  \n\n\nAlso unfortunate how that kind of mindset creates closed mindedness and bigotry though.", "is_submitter": true, "distinguished": null, "created_utc": 1628445286.0, "parent_id": "t1_h86ohfx", "replies": [{"author": "TheDeadMonument", "id": "h86yp9k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "p0dcsv", "stickied": false, "body": "It does, certainly. And I hate to use the term since it's so overused incorrectly now, but I think there are truly spiritual people out there. And some are religious in this context. But I think they are few and far between", "is_submitter": false, "distinguished": null, "created_utc": 1628445564.0, "parent_id": "t1_h86y3yx", "replies": []}]}]}]}]}, {"author": "Paul_Thrush", "id": "h85wexo", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p0dcsv", "stickied": false, "body": "In r/atheism, I've seen credible stories that people tell about a friend or relative going back to religion. I believe it happens.", "is_submitter": false, "distinguished": null, "created_utc": 1628426438.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h85wu7y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "But how do you think they were able to do it?\n\nI wasn't being skeptical of it happening, I'm more curious about the reasoning. :)", "is_submitter": true, "distinguished": null, "created_utc": 1628426712.0, "parent_id": "t1_h85wexo", "replies": [{"author": "Paul_Thrush", "id": "h85xfti", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p0dcsv", "stickied": false, "body": "People don't use \"reasoning\" when it comes to faith. Faith is emotional.", "is_submitter": false, "distinguished": null, "created_utc": 1628427097.0, "parent_id": "t1_h85wu7y", "replies": [{"author": "TesseractToo", "id": "h85y35f", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Hmmm might be, that actually might be where my mental block is on this whole thing I'll mull it over, thanks!", "is_submitter": true, "distinguished": null, "created_utc": 1628427506.0, "parent_id": "t1_h85xfti", "replies": [{"author": "ciaomoose", "id": "h86qgay", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0dcsv", "stickied": false, "body": "I do think that is your mental block: you’re arguing on the assumption that people make decisions based on reason, which often (almost always?) isn’t the case. The whole purpose of “faith” is that it doesn’t require evidence. Ever hear people say that “love is an act of will.” People in good long-term relationships *choose* every day to love each other with their actions even if they have no real *reason* to do so. In the same way, I think people choose to keep faith or return to faith regardless of evidence, because faith isn’t supposed to be evidence-based to begin with.\n\nI should note that I’m an atheist, but not a very committed one. I recognize that the existence of deities makes absolutely no logical sense. But if someday I reach a point in my life where things are so bleak that I feel the need to reach out to a “higher power” I’m sure I could delude myself again. Humans will do anything we can to keep on living. And it doesn’t really matter all that much anyway, imo. You can be a good person or a garbage person with or without religious faith.", "is_submitter": false, "distinguished": null, "created_utc": 1628441790.0, "parent_id": "t1_h85y35f", "replies": [{"author": "TesseractToo", "id": "h86wu9q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "It's not that but it is from that population the ones who did do reasoning that i am more interested in because they can voice the reasons.  \n\n\nWhat does not being a committed atheist mean to you?  \n\n\nI was raised Friends Quaker and you can still be a member and be atheist, but I don't go to meetings or imagine that I'm waiting to hear from an god or whatever. I'm not practicing in the sense as others but I do keep the ethics of Humanism and pacifism and so on (although to be honest I have been questioning the pacifism as I don't think pacifism would have been the correct answer to situations like WWII, what was going on had to be stopped and that was the best means at the time).  \n\n\nI have explored religions but I never felt like I was part of any of them; I never experienced that 'love bombing\" that many people get that is so attractive that brings people in. I have kind of a chronic feeling of not belonging no matter where I go.", "is_submitter": true, "distinguished": null, "created_utc": 1628444708.0, "parent_id": "t1_h86qgay", "replies": [{"author": "ciaomoose", "id": "h86yk2x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0dcsv", "stickied": false, "body": "Being a “non-committed atheist” to me means that I recognize that I arrived at my conclusions to break with my faith for personal reasons, and so if my personal circumstances change, I could likely return to faith. My personal reasons for leaving the faith included some cultural ones (treatment of women and LGBT) as well as logical ones (competing faiths tell different stories all over the world, evidence of the supernatural is impossible, religious positions of power breed incentives for lying).\n\nCrucially, I decided to let the logic sway me. I could have just as easily seen the lack of evidence for god and decided that it didn’t matter because faith has nothing to do with evidence. I let the logic/reasoning guide me at that point in my life because my adherence to logic/reason at that time was a core part of my ego. Recognizing the illogicality of religion but adhering to it at that time would have caused mountains of cognitive dissonance.\n\nNow that I recognize that following logic was just as much a personal decision as following faith, I can acknowledge that it’s possible for me to return to faith. I don’t think it’s likely, but if my life circumstances made it that much more beneficial to me, I’m sure I could change my mind.\n\n…does that clear it up, or did I just muddy the waters more?", "is_submitter": false, "distinguished": null, "created_utc": 1628445495.0, "parent_id": "t1_h86wu9q", "replies": []}]}]}]}]}]}]}, {"author": "sweber145", "id": "h85tz2c", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #68", "submission": "p0dcsv", "stickied": false, "body": "As a human, i think almost anything is possible for us to do, mentally.  I have never encountered someone who was what i would call a true atheist, not a person who put aside religion for while to not be judged, who has gone back. I do know a few folks i would call agnostics who have.", "is_submitter": false, "distinguished": null, "created_utc": 1628424771.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h85xh6o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "I guess that brings up what is agnosticism? Like does it mean being unsure if god exists or being unsure of what a god would have to be for it to exist? (if that makes sense) :D", "is_submitter": true, "distinguished": null, "created_utc": 1628427121.0, "parent_id": "t1_h85tz2c", "replies": [{"author": "sweber145", "id": "h880mav", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #68", "submission": "p0dcsv", "stickied": false, "body": "That is a good question. The folks I have encountered have all been of the “don’t really care if there is a god or not” flavor.", "is_submitter": false, "distinguished": null, "created_utc": 1628463358.0, "parent_id": "t1_h85xh6o", "replies": [{"author": "S_thyrsoidea", "id": "h89c8at", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #101", "submission": "p0dcsv", "stickied": false, "body": "\"Apatheist\" is a term I've seen used for that.", "is_submitter": false, "distinguished": null, "created_utc": 1628491290.0, "parent_id": "t1_h880mav", "replies": [{"author": "sweber145", "id": "h89qxbu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #68", "submission": "p0dcsv", "stickied": false, "body": "Interesting, I’ve never encountered that one before. Thanks for the new word", "is_submitter": false, "distinguished": null, "created_utc": 1628504327.0, "parent_id": "t1_h89c8at", "replies": []}]}]}]}]}, {"author": "Btankersly66", "id": "h8675ae", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #169", "submission": "p0dcsv", "stickied": false, "body": "I call those kinds of people \"tourists.\" \n\nThey come over. See the sights, make some memories, and display a general disdain for the locals.\n\nAnd after much time and a great amount of sinning they're ready to give their \"Testimonials\" in front of their church about how the bad and evil atheists led them down a path of self destruction and devil worship. \n\nOn the other hand the atheists who frequent r/atheism have spent most of their lives living in the fear that they might be making a horrible mistake. Over time they don't make one big conclusion but a series of small conclusions that are hard to turn back on. For instance they might conclude that the holy books they have read are full of inconsistencies. Or, they discover that prayer doesn't do anything. Or, begin to see that there is a lot of hate and hypocrisy amongst believers. These small, almost insignificant, conclusions, over time, begin to add up until they have that \"Ah ha!\" moment when everything comes together and they realize there is something fundamentally flawed about their belief in the gods. They realize that the horrible mistake they feared so much isn't real but something they've imagined to be real. This is the point where there is no way back. Because now there is no way you can ever shake the feeling that \"belief\" is fake or imaginary. \n\nThere are many paths to the same conclusion. Not everyone has the same experience but they all, eventually, reach the same conclusion and once you're there there is no going back to what you had before. Because now you're just a tourists in theism. You might be able to fake it for appearances but the nagging doubt that theism is bs will always be in the back of your mind.", "is_submitter": false, "distinguished": null, "created_utc": 1628432572.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h86jmv0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Yeah I'm sure r/atheism is what got me invited here.  \n\n\nFor religion I always felt like I was on the outside looking in and that most of  i didn't apply to me, so atheism wasn't a huge leap for me.   \n\n\nBut that also means I didn't understand tourists and conversely didn't (until a too many of horrible personal experiences) learn that religious people make a lot of mischaracterizations towards atheists (like being used by guys who assumed that since I was atheist meant i didn't have any feelings or deserved respect so was treated very poorly). Those were hard lessons to learn because I felt like I was being kind by not discriminating but I didn't recognise I was being discriminated against in a more insipid and underhanded way. Although (just my luck) that when I joined the atheist community they were treating women like trash because gamergate was in full swing and that was for some reason big in the atheist commuunity so that was pretty fucked up lol.  \n\n\nOne of those you either way you lose situations hahaha :D", "is_submitter": true, "distinguished": null, "created_utc": 1628438639.0, "parent_id": "t1_h8675ae", "replies": [{"author": "MisanthropicScott", "id": "h89brvs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "> Yeah I'm sure r/atheism is what got me invited here. \n\nMe too.", "is_submitter": false, "distinguished": null, "created_utc": 1628490913.0, "parent_id": "t1_h86jmv0", "replies": []}]}]}, {"author": "ganznormal", "id": "h86nkyd", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #139", "submission": "p0dcsv", "stickied": false, "body": "I did, kinda. I started off catholic, lost my faith almost 20 years ago, lost touch with spirituality completely, reconnected via buddhism, then slowly turned christian again over the last year or so.\n\nI would have never called myself atheist, though. Even throughout the years I didn't believe in god I called myself agnostic. So don't know if it counts for you. If it does, Ama, I'm happy to give account on the how and why of returning to faith.", "is_submitter": false, "distinguished": null, "created_utc": 1628440475.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h86ybtf", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Wow. My stepmom started a Buddhist and is now Catholic so she went the other direction :D  \n\n\nWhat does agnostic mean to you?", "is_submitter": true, "distinguished": null, "created_utc": 1628445388.0, "parent_id": "t1_h86nkyd", "replies": [{"author": "ganznormal", "id": "h86z3n6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #139", "submission": "p0dcsv", "stickied": false, "body": "Well, it always felt like hubris to me to announce with your chest that god certainly doesn't exist. Says who? Just because we cannot prove it scientifically? And why should I believe that the universe can be thoroughly understood by human scientific methods as of the year 2021? On what grounds this confidence? \n\nSo it always felt like the more honest and fair assumption that I simply do not know.", "is_submitter": false, "distinguished": null, "created_utc": 1628445752.0, "parent_id": "t1_h86ybtf", "replies": [{"author": "FirstUser", "id": "h879yvd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #127", "submission": "p0dcsv", "stickied": false, "body": "> announce with your chest that god certainly doesn't exist\n\nThat's a caricature of atheism. Religion suits you really well.", "is_submitter": false, "distinguished": null, "created_utc": 1628450817.0, "parent_id": "t1_h86z3n6", "replies": []}]}]}]}, {"author": "Grievous1138", "id": "h86poga", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #133", "submission": "p0dcsv", "stickied": false, "body": "I know plenty of former atheists, just as I know plenty of former religious folks. It's sort of like hard-left religious types - they're fairly numerous, but are never talked about, and so plenty of people just aren't really aware of them.", "is_submitter": false, "distinguished": null, "created_utc": 1628441434.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h86xkd5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "I might be missing something but that feels like false equivalence to me.  \n\n\nLeaving religion isn't the same in that you are giving up beliefs that don't meet burden of proof, but atheism is acknowledging that lack of burden of proof.  As for hard left religious folk, I may be wrong but they end up in left leaning sects like Universal Unitarian or something for the most part (or they might end up in the biggest churches for the community contacts). This is assuming you don't mean traditional cold-war communism for \"hard-left\", that would be a different situation.", "is_submitter": true, "distinguished": null, "created_utc": 1628445036.0, "parent_id": "t1_h86poga", "replies": [{"author": "Grievous1138", "id": "h86xqy7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #133", "submission": "p0dcsv", "stickied": false, "body": "I'm not saying that the two are in any way similar other than how people don't notice them lol", "is_submitter": false, "distinguished": null, "created_utc": 1628445120.0, "parent_id": "t1_h86xkd5", "replies": []}]}]}, {"author": "smbell", "id": "h85uere", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #158", "submission": "p0dcsv", "stickied": false, "body": "I'm sure it's possible. People can do a lot of things for bad reasons.\n\nI don't think it's very common at all.", "is_submitter": false, "distinguished": null, "created_utc": 1628425080.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "YLASRO", "id": "h85ukjt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0dcsv", "stickied": false, "body": "its possible but its reliant on you not understanding the atheist position well in the firstplace or all of science beeing overturned by actual proof of a god or gods.", "is_submitter": false, "distinguished": null, "created_utc": 1628425189.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h85x567", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "What do you mean?", "is_submitter": true, "distinguished": null, "created_utc": 1628426908.0, "parent_id": "t1_h85ukjt", "replies": [{"author": "YLASRO", "id": "h860b1v", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0dcsv", "stickied": false, "body": "the basic propsition of atheism is that you reject gods because gods havent met their burden of proof. so if you switch away from the atheist position you eitehr got presented with worldchanging proof  or you dont understand that the atheist position is based on the lack of evidence for gods and got convinced by somethinge else, like a fallacy or alie or an emotional appeal.", "is_submitter": false, "distinguished": null, "created_utc": 1628428841.0, "parent_id": "t1_h85x567", "replies": [{"author": "TesseractToo", "id": "h861gei", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Right, so that's like the example I had in the OP where people who I'd met that said they went back to their faith had pretty much had an atheism hat on but were really just doing it to party or whatever and so their time as an atheist was somewhere insincere in my opinion.", "is_submitter": true, "distinguished": null, "created_utc": 1628429514.0, "parent_id": "t1_h860b1v", "replies": [{"author": "YLASRO", "id": "h86ldam", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0dcsv", "stickied": false, "body": "ye. its a superficial understanding that doesnt actually reject religion. its juat a temporary confusion that fails to aknowledge the actual issues of religion and properly reject them.", "is_submitter": false, "distinguished": null, "created_utc": 1628439452.0, "parent_id": "t1_h861gei", "replies": []}]}, {"author": "ciaomoose", "id": "h86pdwb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0dcsv", "stickied": false, "body": "Or maybe 1) your standards for burden of proof are lowered or 2) something happens in your life to motivate you to abandon need for proof.", "is_submitter": false, "distinguished": null, "created_utc": 1628441302.0, "parent_id": "t1_h860b1v", "replies": []}]}]}]}, {"author": "solongfish99", "id": "h861wmw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #183 | Classis Veritatus", "submission": "p0dcsv", "stickied": false, "body": "You may want to check out r/exatheist", "is_submitter": false, "distinguished": null, "created_utc": 1628429769.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h862iht", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Nice! I will, thanks!", "is_submitter": true, "distinguished": null, "created_utc": 1628430110.0, "parent_id": "t1_h861wmw", "replies": []}]}, {"author": "dashingThroughSnow12", "id": "h8643l7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p0dcsv", "stickied": false, "body": "> I don't know my thoughts are pretty scattered on this. What do you think?\n\nMy thoughts are pretty scattered too. So give me some grace for not 100% responding on topic.\n\n> I've been pondering this a lot lately, it might be my little brain can't imagine this, but do you think you can make the philosophical or metaphysical walk back to faith after understanding atheism?\n\nThe CEO of the first job I had out of university was a 55 year old man. He grew up in London in a very devout, conservative Hindu family.\n\nUniversity, typical story. Abandoned the family faith. At that point he was agnostic. As the years grew on and he learned more he was in the atheist tank.\n\nWhen we worked together infrequently but a number of times we talked about faith and morality. Eventually he converted to Christianity with Calvinist soteriology.\n\n> You hear from time to time about ex-pastors who are outspoken atheists- Matt Dillahunty and Dan Barker are two well known examples but for the other way around... there aren't many. \n\nNot all but many of these \"I wanted to be a pastor but now I'm a prominent ex-Christian\" were actually pastors or had a good grasp on Christianity. Some of them, Joshua Evans (Christian -> Muslim) comes to mind. If you take them at their word at what they learned while training to become pastors, you'd find they'd have had less knowledge on Christianity than my daughter at six before they decided to be a pastor.\n\nMatt Dillahunty, as far as I know, isn't an ex-pastor. He wanted to be one. Dan Barker was a pastor, for 17 years, but was Charismatic. Charismatics tend to be on the lower end of the knowledge of Christianity scale.", "is_submitter": false, "distinguished": null, "created_utc": 1628430965.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "Kelyaan", "id": "h867ded", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p0dcsv", "stickied": false, "body": "Yes it is - You just have to recognise that you are throwing away your human faculties to believe in something that has not in the 2000 years it's been around - Ever been proven to be true.  \n\n\nThere are unfortunately a lot of ex atheists that went back because  they couldn't handle being their own arbiter and needed the bible to tell them how to behave and how to be human.  \n\n\nAs someone who spends a lot of time in Atheist subs I see a lot of people claim there is evidence but there is none so every time I hear an Atheist going back it's a glorious delve into how much people need the comfort of lies and cognitive dissonance.", "is_submitter": false, "distinguished": null, "created_utc": 1628432686.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h86ilmr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Well there are other reasons like community or going back to what's comfortable but yeah, I was asking about the philosophical angle.", "is_submitter": true, "distinguished": null, "created_utc": 1628438158.0, "parent_id": "t1_h867ded", "replies": [{"author": "Kelyaan", "id": "h86nhwd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p0dcsv", "stickied": false, "body": "What philosophical angle? there's nothing to it other than sheer raw human need.  \n\n\nThey are people who have thrown away their human faculties to believe in something that is demonstrably false.", "is_submitter": false, "distinguished": null, "created_utc": 1628440435.0, "parent_id": "t1_h86ilmr", "replies": []}]}, {"author": "MisanthropicScott", "id": "h89cuk1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "While I don't disagree, I think people also sometimes go back to faith after a difficult time in their lives where they have some personal experience of having been helped by a deity. I don't know why they can't accept that they made it through under their own power. But, it seems to be another reason some people go back.\n\nMinor point: May I ask why you capitalize atheism? It's a pet peeve of mine and of others I've seen on the atheism sub. Capitalizing atheism seems to lend some credence to the theist claim that atheism is a religion. So, it feels like conceding their point to capitalize a word that actually isn't a proper noun.", "is_submitter": false, "distinguished": null, "created_utc": 1628491801.0, "parent_id": "t1_h867ded", "replies": [{"author": "Kelyaan", "id": "h8au9dg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p0dcsv", "stickied": false, "body": ">May I ask why you capitalize atheism?\n\nIt's muscle memory, I just can't help it after all these years. If anyone things that capitalising a word means anything other than capitalising a word then that's on them tbh. My mind reads it as a name of something thus it instinctively capitalises it.", "is_submitter": false, "distinguished": null, "created_utc": 1628525743.0, "parent_id": "t1_h89cuk1", "replies": [{"author": "MisanthropicScott", "id": "h8av954", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "> My mind reads it as a name of something thus it instinctively capitalises it.\n\nI read it the same way when you capitalize it. It's exactly why I don't.\n\nOh well, it was a minor point. We agree on way more than we disagree on.", "is_submitter": false, "distinguished": null, "created_utc": 1628526165.0, "parent_id": "t1_h8au9dg", "replies": []}]}]}]}, {"author": "roundearthervaxxer", "id": "h867er0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p0dcsv", "stickied": false, "body": "As a pastafarian, sure.", "is_submitter": false, "distinguished": null, "created_utc": 1628432706.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h86icod", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "May you be touched by its noodly appendages", "is_submitter": true, "distinguished": null, "created_utc": 1628438043.0, "parent_id": "t1_h867er0", "replies": []}]}, {"author": "Meep42", "id": "h87cz77", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #28", "submission": "p0dcsv", "stickied": false, "body": "I saw the word “faith” sprinkled here and there throughout the comments and that reminded me of Sr. Julia. You see…I’ve known I’ll be going to hell since I was in the third grade. No really. \n\nPer the sister, faith is a gift given by the Holy Spirit. You know if you have it, and you never question it, or the teachings behind it.\n\nI raised my hand at that point, “But why not?” Asked precocious and curious little me…”Because it’s just that way.” (No really!!)\n\nAnd my hand went up again, “And if a person doubts then you’re saying they were not given the gift?” Exasperated she said “exactly,” ready to move on. \n\nBut my hand went up again, “I’m doubting.”  And to me, in a room full of third graders, mind: “Then you did not receive the gift and you’re going to hell!”\n\nI realize now she was pissed I was not accepting her word as papal bull or whatever. She expected me to get scared straight or something. As an older kid/almost adult it pissed me the fuck off that she did that to me and was using fear and intimidation to what? Believe? \n\nAt the time I just nodded and accepted it as the rest of the class just kind of looked at me…I was already a bit odd (12th grade reading and math levels at 9…) \n\nSo I went home and told the babysitter that I was going to hell because the HS skipped me on “faith day” and worked on my math homework. I didn’t quite understand or even believe in hell by that point (it just didn’t make sense and wasn’t in the Bible and I was reading all about the Greek myths at the time so it really didn’t seem all that bad…if it was that after life…) so yeah. \n\nThe babysitter must have told my mom at some point though because her sister, a nun from a less ruthless sect, came to stay with us and told us all kinds of stories with interesting moral lessons and I kept getting them “right” and understanding “right” from “wrong” so they figured my soul was not possessed by the devil and I’d be okay…or something. \n\nShe and I wouldn’t be at lager heads until I was older and asked how she could believe in a misogynist religion based on a book that believes there is water above a dome in the sky with “floodgates”, etc. etc. And then she also brought up faith, and giving yourself to it with the “eyes of a child” that accepts what your “Father” tells you….\n\nSo yeah…with no faith I was back to going to hell…but opted not to be /that/ sassy. I loved my aunt to pieces. We could agree to disagree. I’m assuming she took my silence as accepting her truth as the correct answer. \n\nWill I ever “go back?” Probably not. They don’t like my kind. I ask too many questions. And there is that lack/absence of faith thing.", "is_submitter": false, "distinguished": null, "created_utc": 1628452232.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "MisanthropicScott", "id": "h89d98h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "Great story!", "is_submitter": false, "distinguished": null, "created_utc": 1628492142.0, "parent_id": "t1_h87cz77", "replies": []}]}, {"author": "MisanthropicScott", "id": "h89b69c", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "I think it's possible and it happens to some people. A former coworker went back to Christianity when he was battling drug addiction, prayed for help, and now feels he got that help. So, it was unverifiable personal experience in the only case I know personally. BTW, he knew this too and did not expect his experience to be convincing to anyone else.\n\n> do you think you can go back to faith?\n\nMe personally? Absolutely not. Mine was a long slow road from first doubts at age 8 to knowing the Abrahamic religion was false but still being agnostic about a more generic god in my teens to being an agnostic atheist (though I didn't know the term) in my late 20s to becoming a gnostic atheist sometime in my 30s. I'm now 57. My atheism has only ever grown stronger over time. My brain is pretty solid on the subject at this point.\n\n> do you think you can make the philosophical or metaphysical walk back to faith after understanding atheism? \n\nI didn't use either of these to get to atheism. So, definitely not for me. I made it to atheism when I decided that philosophy was incapable of answering the question of whether there is a god or gods. Since I didn't philosophize my way to atheism, I can't imagine how I'd philosophize my way to theism.\n\nFor me to even gain a hint of doubt, to even think that a god is a physical possibility, I would need to see a shred of hard scientific evidence of something supernatural ever having taken place anywhere in the observable universe. Until that shred of evidence is found, I do not even have a hint of a doubt. There are no gods.", "is_submitter": false, "distinguished": null, "created_utc": 1628490427.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "Karrion8", "id": "h8b4qb7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0dcsv", "stickied": false, "body": "As an atheist I've always said, if there is a god, said god is free to speak with me.  Not through a representative, though.", "is_submitter": false, "distinguished": null, "created_utc": 1628530168.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h8e6zfn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Why would it?", "is_submitter": true, "distinguished": null, "created_utc": 1628590499.0, "parent_id": "t1_h8b4qb7", "replies": [{"author": "Karrion8", "id": "h8goeil", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0dcsv", "stickied": false, "body": "I have no idea.  Why would a god want to talk one of billions of finite, powerless beings?  Further, if it's in the interest of some relationship, why wouldn't a god speak directly and personally to those with whom the god wishes to have a relationship?", "is_submitter": false, "distinguished": null, "created_utc": 1628632905.0, "parent_id": "t1_h8e6zfn", "replies": [{"author": "TesseractToo", "id": "h8i1wte", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "I dunno if I was god I'd talk to the people who build CERN and LAGO, I'd be al like \"Whatcha doooin'?\" And then I'd have to fire up the computer and make some really high res tiny things and some gravitational waves and it's been fun making far away stuff for Hubble to look at and that took you off guard and you had to make sure the lenses didn't work while you started to build stuff but now they are about to launch James Webb and uggggh humans >:| Why can't they just romp around in nature and eat figs?", "is_submitter": true, "distinguished": null, "created_utc": 1628658518.0, "parent_id": "t1_h8goeil", "replies": []}]}]}]}, {"author": "Zealousideal_Mix_629", "id": "h85xdi6", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p0dcsv", "stickied": false, "body": "Just follow your gut, don't overanalize it.", "is_submitter": false, "distinguished": null, "created_utc": 1628427055.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h85y7tj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Well my gut tells me they are being dishonest about understanding atheism but I'd like to know about cases where they might not be", "is_submitter": true, "distinguished": null, "created_utc": 1628427587.0, "parent_id": "t1_h85xdi6", "replies": [{"author": "Zealousideal_Mix_629", "id": "h8607bn", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p0dcsv", "stickied": false, "body": "I suggest looking at the work of Thomas Aquinas. If your question is can someone be a rationlist and religious. He may be a good resource to answer this question.", "is_submitter": false, "distinguished": null, "created_utc": 1628428780.0, "parent_id": "t1_h85y7tj", "replies": [{"author": "TesseractToo", "id": "h861isb", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "That wasn't my question, no :)", "is_submitter": true, "distinguished": null, "created_utc": 1628429553.0, "parent_id": "t1_h8607bn", "replies": [{"author": "Zealousideal_Mix_629", "id": "h862hh0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p0dcsv", "stickied": false, "body": "If your question is can a person go from being a complete atheist to being religious again, absolutely. There's plenty of examples online. \n\n>Doesn't faith sort of require a type of cognitive dissonance that you don't really investigate?\n\nThis is why I suggested his work.", "is_submitter": false, "distinguished": null, "created_utc": 1628430093.0, "parent_id": "t1_h861isb", "replies": []}]}, {"author": "MisanthropicScott", "id": "h89ci6j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "If you're genuinely curious, his arguments are surprisingly easy to dispute. Let me know if you'd like to have a discussion of how and why.", "is_submitter": false, "distinguished": null, "created_utc": 1628491518.0, "parent_id": "t1_h8607bn", "replies": [{"author": "Zealousideal_Mix_629", "id": "h89r8gw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p0dcsv", "stickied": false, "body": "If it's surprisingly easy to dispute it wouldn't much of a discussion, more of just a statement, wouldn't it?", "is_submitter": false, "distinguished": null, "created_utc": 1628504578.0, "parent_id": "t1_h89ci6j", "replies": [{"author": "MisanthropicScott", "id": "h8acz2q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "Well, it's easy for me. But, it does take me quite a bit of verbiage to explain. that may be because I'm not good at being concise ... at all.\n\nIf and only if you're interested, you can [click through to the most recent time I took on Aquinas.](https://www.reddit.com/r/DebateAnAtheist/comments/ornmff/anyone_wants_to_talk_about_god/h6k3emo/?context=3) I linked to my reply in its context, which may or may not help.\n\nI apologize in advance for the tone of that reply.\n\nThe OP of that post was incredibly condescending right from the start in assuming that if we didn't agree with Aquinas, then obviously we were just not understanding the arguments. So, my tone may not have been the best in my response. But, I believe my arguments about the problems of Aquinas's logic stands.", "is_submitter": false, "distinguished": null, "created_utc": 1628518049.0, "parent_id": "t1_h89r8gw", "replies": [{"author": "Zealousideal_Mix_629", "id": "h8ad6ym", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p0dcsv", "stickied": false, "body": "As Albert Einstein once said, \"If you can't explain it simply, you don't understand it well enough.\"", "is_submitter": false, "distinguished": null, "created_utc": 1628518151.0, "parent_id": "t1_h8acz2q", "replies": [{"author": "MisanthropicScott", "id": "h8afvb4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "Well, Aquinas couldn't explain it simply. Since he said a lot, it can take a lot to refute.\n\nSimply:\n\nQuantum mechanics undermines the axioms of the cosmological arguments.\n\nThe big bang theory does not say the universe came from nothing.\n\nAn immutable god cannot think or create.\n\nThe Christian god is anything but immutable and cannot be shoehorned into being the same god as Aristotle's god.\n\n---\n\nAristotle was a smart guy. But, he didn't know quantum mechanics.\n\nAquinas was a much less smart guy who could easily have realized that Aristotle's arguments cannot work for the Christian deity.", "is_submitter": false, "distinguished": null, "created_utc": 1628519399.0, "parent_id": "t1_h8ad6ym", "replies": [{"author": "Zealousideal_Mix_629", "id": "h8aheuj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p0dcsv", "stickied": false, "body": "Scientists working in the feild of Quantum mechanics barely understand Quantum mechanics.  Not a great example to hang the entire argument on. Same goes for the big bang, what the state of the universe was before is purely theoretical.", "is_submitter": false, "distinguished": null, "created_utc": 1628520109.0, "parent_id": "t1_h8afvb4", "replies": [{"author": "MisanthropicScott", "id": "h8aiphu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "> Scientists working in the feild of Quantum mechanics barely understand Quantum mechanics. Not a great example to hang the entire argument on.\n\nIt's not the understanding that is required. The simple fact of virtual particles, with real presence as demonstrated by the Casimir effect, is enough to say that quantum objects do not obey the same laws of cause and effect as human beings or bowling balls.\n\n> Same goes for the big bang, what the state of the universe was before is purely theoretical.\n\nBut, there is no part of the big bang theory that posits that the universe came from nothing.\n\nIn fact, nothing in physics hints at the possibility that a philosophical nothing is even physically possible. We have never observed such a nothing.", "is_submitter": false, "distinguished": null, "created_utc": 1628520691.0, "parent_id": "t1_h8aheuj", "replies": []}]}]}]}]}]}]}]}]}, {"author": "MisanthropicScott", "id": "h89c0kd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "Is this an attempt to answer how or why some people turn to religion or to get the OP to turn back to religion?", "is_submitter": false, "distinguished": null, "created_utc": 1628491110.0, "parent_id": "t1_h85xdi6", "replies": []}]}, {"author": "LoreleiOpine", "id": "h86j0ar", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "p0dcsv", "stickied": false, "body": "Of course it's possible. All it takes is some confluence of bad genes and bad environmental pressures for a person to believe a falsehood.", "is_submitter": false, "distinguished": null, "created_utc": 1628438348.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "MisanthropicScott", "id": "h89czsc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "I'm not sure if you're still blocking me. If you see this, I'd be genuinely curious whether you have any data to suggest that belief or non-belief has a genetic component?", "is_submitter": false, "distinguished": null, "created_utc": 1628491922.0, "parent_id": "t1_h86j0ar", "replies": []}]}, {"author": "SoyTuTocayo69", "id": "h86j32z", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #105", "submission": "p0dcsv", "stickied": false, "body": "I don't think so. I mean, at a base level, anyone can go from believing something to not- happens everyday. But if you mean, when one fully understands the logical and philosophical arguments against a theology or a diety? Nah. Not unless they're being very dishonest with themselves. \n\nAs an ex-Christian myself, I don't see myself going back after this. At this point, God, the God that I \"knew\", has become a distant memory that just couldn't be true for so many reasons. I think Christians are certainly dishonest with themselves when they believe in the first place, or they're comfortable with being on the obviously wrong answer.", "is_submitter": false, "distinguished": null, "created_utc": 1628438384.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "cocobisoil", "id": "h8719re", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #87", "submission": "p0dcsv", "stickied": false, "body": "Hmm I think anyone that goes back to religion was never atheist in the first place. That being said I've experimented a lot more with plants as I've grown older & have drifted from a position of nihilism to one of being unsure of wtf is going on but that outside this prison we've allowed ourselves to be locked in shit is beautiful.", "is_submitter": false, "distinguished": null, "created_utc": 1628446752.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "Cheomesh", "id": "h876dto", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "p0dcsv", "stickied": false, "body": "Yes", "is_submitter": false, "distinguished": null, "created_utc": 1628449142.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "FirstUser", "id": "h8777zv", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #127", "submission": "p0dcsv", "stickied": false, "body": "Sure: in case of brain damage, for example.", "is_submitter": false, "distinguished": null, "created_utc": 1628449531.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "jixxor", "id": "h88iuo1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #288", "submission": "p0dcsv", "stickied": false, "body": ">it was more to indulge in hedonistic things (ie party) without thinking about judgement, and then they returned to their faith later on. In these instances\n\nWell that sound super convenient.\n\nAbout your question, I guess someone who was convinced no god(s) exist(s) may return to his faith when he witnesses something he deems a miracle. Or some other event or change that happens in their life.\n\nDue to serious health issues in my family, I've spent a lot of time in hospitals when my grandfather, then my brother and later my father were in hospital for long times. I saw many people who were waiting for donor organs, and just as their time was about to come, they received an organ (most often because of the begin of summer and some motorcycle related accident). Many, after the organ was transplanted, instead of thanking the surgeons who saved their life, or the organ donor (for making the decision to become an organ donor), or the donor's family for not refusing their relative's organs to be donated, thanked god.\n\nThey genuinely believed it must have been god's doing, and one guy who shared a room with my brother for half a year, turned from being completely anti-religious to very religious after his life was saved.\n\nNow I am unsure if this qualifies for the \"the walk\" you mentioned, as these people mostly lost their faith (assuming they were religious before) due to the misfortune cast upon them. \"There can't be a god, because how could he allow this\" (often referring not only to themselves but all the sad fates they learned about while waiting for an organ) quickly turned into \"thank god\".", "is_submitter": false, "distinguished": null, "created_utc": 1628472684.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "zephyrsong888", "id": "h88o3bw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #140", "submission": "p0dcsv", "stickied": false, "body": "Yes. There's an anchoring effect in religion from upbringing and it makes older adults more likely to become religious when they get older even after deconversion.", "is_submitter": false, "distinguished": null, "created_utc": 1628475450.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "MisanthropicScott", "id": "h89fz8h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p0dcsv", "stickied": false, "body": "Hey! I found one for you. Of course, they pulled a cut and run on the atheism sub. But, this link has their original text.\n\nhttps://www.removeddit.com/r/atheism/comments/p0wf13/atheist_on_the_path_of_belief/\n\nWhat you may notice in this \"atheist\"->\"Christian\" conversion is that the OP has never evaluated whether the beliefs are true, hence the scare quotes I'm using on both sides.\n\nThey seem to have gone from thinking religion made people behave badly to thinking religion provides a sense of community and good music.\n\nAt no point have they ever considered whether God exists or whether Jesus died on the cross to absolve people of sin. They seem thoroughly unconcerned by the truth or falsehood of the most basic tenets of the religion, just as they seemed unconcerned by whether there are any gods when they were an \"atheist\".\n\nThis person is just seeking a community and doesn't care what beliefs will provide that.", "is_submitter": false, "distinguished": null, "created_utc": 1628494497.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "Niskanen204", "id": "h89qka4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #100", "submission": "p0dcsv", "stickied": false, "body": "I think it's possible - certainly not for an 'active' atheist who is engaged in thinking about atheism or evolutionary science, but rather for someone who has given up that critical faculty and let the culture and ideology of the day take over.\n\nIt must be rare, though. I can't think of anything short of a divine revelation causing me to believe again.", "is_submitter": false, "distinguished": null, "created_utc": 1628504021.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "atlasgaveup", "id": "h8aw8qd", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #89", "submission": "p0dcsv", "stickied": false, "body": "I am an atheist but encourage my children to believe. I think faith can be and do good. I feel like atheism needs to be a very mature decision that people make towards the end of their lives. The truth is that no one knows anything. What we do know is is such an insignificant fraction of what we do not know. Certainty is only for fools. If I found a god worth believing in then I could see a possibility of having faith.", "is_submitter": false, "distinguished": null, "created_utc": 1628526590.0, "parent_id": "t3_p0dcsv", "replies": []}, {"author": "BrynneRaine", "id": "h8h5jqj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #13", "submission": "p0dcsv", "stickied": false, "body": "There is a line of reasoning that says God wants to be chosen, not forcing Himself upon anyone, therefore on purpose provides plenty of evidence but no solid proof.  That way it is a choice.  The Bible says “you will seek me and find me when you seek me with all your heart.”  If you want to believe you will and you can. But if you don’t want to there will be no proof to stop you from making that choice.\n\nIf God exists, His reasoning is superior to our own, and we should submit to his authority, not demand that he prove himself to us on our terms.", "is_submitter": false, "distinguished": null, "created_utc": 1628641049.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h8i1kgt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "I was raised Friends Quaker and I've been lurking the sub and when they do silent worship they are waiting for God to talk to them and give them inspiration (how did I got for over 10 years and no one told me this?)  \n\n\nI don't know why god would want to talk to anyone, people would just want their personal problems solved and damn Quakers would want world peace and a solution to environmental catastrophes :D That of course is in direct conflict to other sects of Christianity, does god tell different groups different things to keep conflict up? Maybe it likes conflict. According to whats happened in the bible it seems to like natural disasters and destroying stuff...   \n\n\nI liked how Carl Sagan call this an adolescence of civilization. Sometimes i think I'll become a Saganist. :D", "is_submitter": true, "distinguished": null, "created_utc": 1628658282.0, "parent_id": "t1_h8h5jqj", "replies": [{"author": "BrynneRaine", "id": "h8ith35", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #13", "submission": "p0dcsv", "stickied": false, "body": "My last sentence.", "is_submitter": false, "distinguished": null, "created_utc": 1628681450.0, "parent_id": "t1_h8i1kgt", "replies": []}]}]}, {"author": "SybariteAussie", "id": "h9b7dpq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p0dcsv", "stickied": false, "body": "Perhaps those that find solace from prayer are receiving answers from something akin to genetic memory or a cosmic grid?", "is_submitter": false, "distinguished": null, "created_utc": 1629219601.0, "parent_id": "t3_p0dcsv", "replies": [{"author": "TesseractToo", "id": "h9bkdf8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "That's not any more implausible than a god is", "is_submitter": true, "distinguished": null, "created_utc": 1629226942.0, "parent_id": "t1_h9b7dpq", "replies": [{"author": "SybariteAussie", "id": "h9cmxjh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p0dcsv", "stickied": false, "body": "Have you ever had a epiphany or a sudden release of angst when struggling to comprehend an issue? Some philosophers have discussed the presence of a internal daemon or daimon that has directed them throughout their lives at crucial times. Socrates, Goethe, Kipling, Jung, Nietsche & Schopenhauer all discussed the presence of a daemon,instinct or inner voice that has guided them through their lives. If I become despondent & utilise music to process emotions instead of getting high. I have had sudden insights or answers to things that I have been wrestling with. It’s happened twice. Both times I was fasting. Not sure if that is connected or coincidental? Are epiphanies the consequence of controlling & managing your behaviour,instincts and thinking or the presence of the daemon? The mind tells the hand to move, pick something up & meets no resistance. The mind tries to set goals,change habits & behaviour, it meets resistance. When striving or working under pressure. Sometimes time management & efficiency seem synergistic. Have heard this described as flow.", "is_submitter": false, "distinguished": null, "created_utc": 1629244028.0, "parent_id": "t1_h9bkdf8", "replies": [{"author": "TesseractToo", "id": "h9dhl9y", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0dcsv", "stickied": false, "body": "Yeah but that feeling isn't actually any more evidence of a cosmic grid or whatever than it is of a god", "is_submitter": true, "distinguished": null, "created_utc": 1629260414.0, "parent_id": "t1_h9cmxjh", "replies": []}]}]}]}]}