{"title": "On male behaviour towards female gamers: Female-initiated disruption of a male hierarchy incites hostile behaviour from poor performing males who stand to lose the most", "name": "t3_p0zah6", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p0zah6/on_male_behaviour_towards_female_gamers/", "selftext": "A 2015 study found that lower-skilled male players of [*Halo 3*](https://en.wikipedia.org/wiki/Halo_3) were more hostile towards teammates with a female voice, but behaved more submissively to players with a male voice. Higher-skilled male players, on the other hand, behaved more positively towards female players. The authors argued the male hostility towards female gamers in terms of [evolutionary psychology](https://en.wikipedia.org/wiki/Evolutionary_psychology), writing, \"female-initiated disruption of a male hierarchy incites hostile behaviour from poor performing males who stand to lose the most status\".[\\[103\\]](https://en.wikipedia.org/wiki/Women_and_video_games#cite_note-109) \n\n[https://en.wikipedia.org/wiki/Women\\_and\\_video\\_games#Male\\_behavior\\_towards\\_female\\_gamers](https://en.wikipedia.org/wiki/Women_and_video_games#Male_behavior_towards_female_gamers)", "score": 56, "upvote_ratio": 0.89, "permalink": "/r/TheFlyingTree/comments/p0zah6/on_male_behaviour_towards_female_gamers/", "id": "p0zah6", "author": "TheLittlestHibou", "link_flair_text": "Discussion", "num_comments": 72, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628507176.0, "comments": [{"author": "Shouia", "id": "h89ww2d", "score": 25, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "This is observed in work enviroments too. There was a study who looked at the objectification of people. Women objectified men regardless of their or their own status. Men objectified women in higher positions then them much more then women with a lower status.\n\nShows how dehumanizing it is.", "is_submitter": false, "distinguished": null, "created_utc": 1628508925.0, "parent_id": "t3_p0zah6", "replies": [{"author": "CPlusPlusDeveloper", "id": "h8ac2ys", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #208", "submission": "p0zah6", "stickied": false, "body": "In some sense, objectification is the natural result of living in large, complex societies. Humans are evolved to live in tribes of a few hundred. Today we live in cities of millions. Our minds can't possibly help but \"objectify\" the huge number of people we encounter in any given day. \n\nFor example, I have a working relationship with my garbage man. He performs an essential service for my family. I even sometimes say hello and make brief small talk. Yet in my mind, he's fundamentally the garbage removal meatspace robot. I don't know anything about his hopes and dreams, friends and families, what are his favorite foods, what jokes he laughs at. \n\nThat's so alien to our evolved existence, where hunter-gatherers intimately know every pretty much every single human being they encounter on a daily basis. And whenever they encounter a person they don't know, it's usually in the context of a foreign, likely hostile, tribe. The human instinct, when around anyone not in their inner circle of friends, is to react with fear, loathing, and hostility.", "is_submitter": false, "distinguished": null, "created_utc": 1628517620.0, "parent_id": "t1_h89ww2d", "replies": [{"author": "NoSuchKotH", "id": "h8aojqo", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p0zah6", "stickied": false, "body": "I wouldn't call this objectification, but rather anonymization. Your garbage man is just one of many in your life that you meet, but don't have enough energy to engage with on a personal level.\n\nThis kind of effect/behavior can also be seen in large monkey populations. They go from \"know everyone\" to \"avoid eye contact with all but your own clique\" once the population living at a certain spot goes over a certain number.", "is_submitter": false, "distinguished": null, "created_utc": 1628523284.0, "parent_id": "t1_h8ac2ys", "replies": [{"author": "Shouia", "id": "h8b482v", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "Interesting. The paper called it objectification. As that is what they were looking at when studying people in a working enviroment.\n\nThe monkey behaviour is very different from what the paper is about. But it is still cool to read primates (and probably many other species) form their own little groups within some society.", "is_submitter": false, "distinguished": null, "created_utc": 1628529957.0, "parent_id": "t1_h8aojqo", "replies": []}]}]}, {"author": "PM-ME-YOUR-HANDBRA", "id": "h8a2png", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #15", "submission": "p0zah6", "stickied": false, "body": "The word \"dehumanizing\" is interesting in this context - it suggests it's making the targets less human despite being such a human behavior (since this effect stems from subconscious human psychology/behavioral patterns).\n\nThis is making me think a lot about the quirks of language and nomenclature this morning 😕\n\nEdit: After waking up a bit, this comment seems pretty silly in retrospect. Replies below make good points and now that I'm caffeinated I'm mildly embarrassed. C'est la vie.", "is_submitter": false, "distinguished": null, "created_utc": 1628512682.0, "parent_id": "t1_h89ww2d", "replies": [{"author": "QueenOfNights", "id": "h8aaia8", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #144", "submission": "p0zah6", "stickied": false, "body": "Objectification is the epitome of dehumanising someone. I wouldn't call it a quirk of language. It is however a unusual behaviour, I wouldn't say its a normal human function to objectify someone.", "is_submitter": false, "distinguished": null, "created_utc": 1628516861.0, "parent_id": "t1_h8a2png", "replies": [{"author": "PM-ME-YOUR-HANDBRA", "id": "h8aeawu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #15", "submission": "p0zah6", "stickied": false, "body": "The more I've thought about this, the more it reminded me of animal behaviors. Primate social hierarchy, etc.\n\nYou're right, I wasn't meaning to imply that objectification were normal or acceptable, but my pre-coffee brain took interest in the juxtaposition of \"dehumanizing\" with the results of a study on human behavior.", "is_submitter": false, "distinguished": null, "created_utc": 1628518673.0, "parent_id": "t1_h8aaia8", "replies": []}, {"author": "floofandmemes", "id": "h8b05wh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "p0zah6", "stickied": false, "body": "I would've thought the epitome of dehumanizing someone was straight up saying they weren't human and their lives didn't matter like slave owners and a certain group led by an Austrian dude with a funny mustache did.", "is_submitter": false, "distinguished": null, "created_utc": 1628528247.0, "parent_id": "t1_h8aaia8", "replies": [{"author": "TatianaAlena", "id": "h8b7zhr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #11", "submission": "p0zah6", "stickied": false, "body": "Led, not lead.", "is_submitter": false, "distinguished": null, "created_utc": 1628531530.0, "parent_id": "t1_h8b05wh", "replies": []}]}]}, {"author": "Shouia", "id": "h8a38g6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "Yeah. Maybe a strong word. But it's turning a person, your superior, into an object of lust in an sometimes (un)intentional attempt to view them as lesser.", "is_submitter": false, "distinguished": null, "created_utc": 1628512986.0, "parent_id": "t1_h8a2png", "replies": []}]}]}, {"author": "Orangewithblue", "id": "h8a2f2a", "score": 11, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "Yeah I made this experience in Overwatch. In low ranks you better shouldn't talk in voice chat as girl, it's less of a problem in higher ranks", "is_submitter": false, "distinguished": null, "created_utc": 1628512507.0, "parent_id": "t3_p0zah6", "replies": [{"author": "El_Duque_Caradura", "id": "h8ayilg", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #296", "submission": "p0zah6", "stickied": false, "body": "I've had this in CSGO, and I'm a man. I think that usually this \"miatreat\" it's genderless, if they got you, you're done. The fact if you're a woman or not it's just a topic of insults that will be thrown against you.", "is_submitter": false, "distinguished": null, "created_utc": 1628527551.0, "parent_id": "t1_h8a2f2a", "replies": [{"author": "Orangewithblue", "id": "h8bc8hf", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "Well, there is more general trash talking in lower ranks in general, that's true. But there is also something on top of that if you are a girl, which is more annoying to me than general trash talking. \n\nEspecially back then it was like, I joined vc, the game began, I was concentrated, started making calls and as soon as I talked some guy went off like \"Omg we have a girl on our team?!\"\n\nAnd after that you usually either hear sentences like:\"How are you, how old are you?\", \"Do you have a boyfriend?\", \"Why are you playing dps/tank and not heal?\", \"Are you a Mercy main?\"\n\nIf the team is performing bad you will start to hear things like:\"Of course we are loosing, we have a boosted e-girl on the team\", \"Bitch heal me\"/\"You suck as dps/tank\", \"Go back playing xy!\", \"Girls shouldn't play video games.\"\n\nAnd if you dare trying to say something, calm them down or get them group you will hear:\"Shut up and make me a sandwich!\", \"Go back to kitchen\", \"Are you on your period or what?\", \"Don't tell me what to do, I don't listen to girls!\"\n\nAnd I am not exaggerating, I heard all of these sentences and many of them very often. Alot of girls will never talk in vc on their own, because of this very reason.", "is_submitter": false, "distinguished": null, "created_utc": 1628533329.0, "parent_id": "t1_h8ayilg", "replies": [{"author": "TSM-", "id": "h8c1zkt", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #39", "submission": "p0zah6", "stickied": false, "body": "This is why custom voice chat voices will be so great. There are some startups already working on it. It would be fun if people sounded like their in-game character in voice chat, and also allow people to not worry about their accents or gender attracting unwanted attention.\n\nOne such company is https://www.modulate.ai/ - their tag line: \"*Voice Chat Shouldn't Have To Be Toxic*\".", "is_submitter": false, "distinguished": null, "created_utc": 1628544289.0, "parent_id": "t1_h8bc8hf", "replies": [{"author": "solarshado", "id": "h8cijpk", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #459", "submission": "p0zah6", "stickied": false, "body": "I'm *super* torn on this...\n\nI love it both as a cool technology and as a method of self-expression. The first game to ship the ability to VC *as* your in-game character will be huge for that feature alone. (And my brain, of course, reminds me that *there will be porn immediately*...)\n\nBut as a solution to harassment, it seems like sending someone with a broken leg home with nothing but a painkiller: it might superficially help with some of the symptoms, but does little-to-nothing for the underlying cause. And I worry that it might, as a result, delay attempts to actually *fix* the problem. Obviously, it's a big, complicated problem, and \"fixing\" it will be neither quick nor simple, but that just makes masking it all the more appealing.\n\nI absolutely don't say this to discourage anyone from using the tech if you can/want to. I just worry about the potential larger implications.", "is_submitter": false, "distinguished": null, "created_utc": 1628551934.0, "parent_id": "t1_h8c1zkt", "replies": []}, {"author": "Orangewithblue", "id": "h8c6cpk", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "That sound interesting", "is_submitter": false, "distinguished": null, "created_utc": 1628546226.0, "parent_id": "t1_h8c1zkt", "replies": []}]}]}, {"author": "DDumpTruckK", "id": "h8bw6j0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p0zah6", "stickied": false, "body": "Uh, really?  This has not been my experience after 700+ hours of CS:GO and at least 500 untracked hours in Source from before Steam tracked hours.\n\nIn my experience if a voice comes on CS:GO that's female the reaction is half the lobby going \"OMG GIRL?  THERE'S GRIL HERE?  WHAT IS GRIL DOING ON GAME?  OMG GIRLS!?  HEY GIRL, WHY ARE YOU PLAYING GAMES.  GIRL, COME SUCK MY DICK.  GIRL SHOULD BE IN KITCHEN!  GIRL ARE YOU SINGLE?  COME DATE ME GIRL!\"\n\nMeanwhile if you have a masculine voice they'll more likely just ignore you until you say something that they can easily riff off of or make a Your Mom joke from.\n\nGranted, most of this experience is from casual, but it's also worth noting that I hardly ever even play casual and for this to consistently be the experience is saying something. This might be an issue that carries over to ranked but I wouldn't know because I exclusively only ever 4 or 5 queue in ranked.", "is_submitter": false, "distinguished": null, "created_utc": 1628541771.0, "parent_id": "t1_h8ayilg", "replies": []}]}]}, {"author": "idiotsonfire", "id": "h8a2she", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "Well, if they need to harass women, they've already lost as much as they can, and they still don't get that they're the loser.", "is_submitter": false, "distinguished": null, "created_utc": 1628512728.0, "parent_id": "t3_p0zah6", "replies": [{"author": "NoSuchKotH", "id": "h8ap5ps", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p0zah6", "stickied": false, "body": "Yes, and they (subconsciously) know it. That's why they leash out at someone they perceive as an easy target. It's a coping mechanism for being not good at what they are doing. Putting themselves over others restores some of their self-esteem.", "is_submitter": false, "distinguished": null, "created_utc": 1628523551.0, "parent_id": "t1_h8a2she", "replies": [{"author": "epicgabe01", "id": "h8avng2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #108", "submission": "p0zah6", "stickied": false, "body": "I suck ass at competitive games, but at the same time, I tend to play games rather casually. I'd only 'lash out' if I was playing customs with friends who know I'm joking, as it's just fun and games. That said, I do notice a fucking mountain of salt from people who lose matches and take competitive games seriously, as their pride is genuinely wounded over something as trivial as their performance in a video game. I can understand frustration if you're playing against someone who's ridiculously good, or if you played a good game but still managed to lose, but there's a difference between that and outright unwarranted hostility like you describe.", "is_submitter": false, "distinguished": null, "created_utc": 1628526336.0, "parent_id": "t1_h8ap5ps", "replies": [{"author": "NoSuchKotH", "id": "h8ay2us", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p0zah6", "stickied": false, "body": "Yeah, there are different kinds of people. For some, games are the only thing they can derive some self-worth from. For others it's an inherent fear of not being good enough if they are not the best at everything. And for others, it's just something they do to pass time and it doesn't matter whether they win or lose.", "is_submitter": false, "distinguished": null, "created_utc": 1628527365.0, "parent_id": "t1_h8avng2", "replies": []}]}]}, {"author": "THF-Killingpro", "id": "h8ey75l", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "I completely agree with you.", "is_submitter": false, "distinguished": null, "created_utc": 1628606429.0, "parent_id": "t1_h8a2she", "replies": []}]}, {"author": "pine_ary", "id": "h8acw1e", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #74", "submission": "p0zah6", "stickied": false, "body": "There‘s some studies of this by intersectional feminists. They observed for example that white women during the time of the time of the suffrage movement were very susceptible for racist rhetoric. The idea is that when you have all these hierarchies intersecting there will always be someone who has a lower standing than you to shit on and feel superior about. Even though both are oppressed and working together would be much more effective at liberating them. It‘s a kind of substitude for the real fight, one they can win easily. You can also see this within oppressed groups as they gain more acceptance and thus power. You can see it with misogynistic gay men and transphobic lesbians, or with rich black men classist towards the poor.\n\nOf course the answer of intersectional feminism to this problem is solidarity. The recognition that we are much more effective in liberating people if we stop tearing each other down and stand with each other. It‘s a mindset and a responsibility of the environment to set up the right atmosphere. When instead of fighting each other we change the conditions that keep all of us down. \n\nA great example of this is when English [LGBT people](https://en.m.wikipedia.org/wiki/Lesbians_and_Gays_Support_the_Miners) stood together with the coal miners in the 80s. Miners used to be a very homophobic demographic. But because they were helped by these gay men and lesbians they came to empathize with each other‘s struggles. To this day the English miners communities can be seen at LGBT rallies. There‘s a great movie about it that I forgot the name of.\n\nSo yeah there‘s something useful 4th wave feminism has brought us.", "is_submitter": false, "distinguished": null, "created_utc": 1628518007.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "areyouseriousdotard", "id": "h89wjd2", "score": 14, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "p0zah6", "stickied": false, "body": "I'm a male nurse, this stuff is so interesting.\n\nI see the way female nurses get treated by some and how they treat me differently.\n\nI often have female bosses but most of the doctors are male.\n\nThey both treat me differently than my female colleagues.", "is_submitter": false, "distinguished": null, "created_utc": 1628508677.0, "parent_id": "t3_p0zah6", "replies": [{"author": "TheLittlestHibou", "id": "h8a12b0", "score": 12, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "p0zah6", "stickied": false, "body": "Same. Male and female colleagues, doctors and nurses treat me differently too and it certainly seems to be gender-based behaviour and bias.\n\nBeautiful-but-abusive women seem to hate me quite a bit, as do poor performing males.\n\nHigh-performing males seem to like me quite a bit, high-performing females treat me as a peer or trusted personal assistant.\n\nSo I think I'm doing alright and headed in the right direction given the types of people who tend to hate me vs the types of people who tend to love me.\n\nI must be... doing something right, despite all my fuck ups.", "is_submitter": true, "distinguished": null, "created_utc": 1628511685.0, "parent_id": "t1_h89wjd2", "replies": [{"author": "areyouseriousdotard", "id": "h8a79ix", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #109", "submission": "p0zah6", "stickied": false, "body": "Doctors, especially, tend to treat my female colleagues badly but treat me with respect.\n\nThe other nurse will sometimes ask me to call a doc so they don't get yelled at for waking them up at night.  I don't like the abuse my female colleagues get.  I have had to talk w a few patients about how they treat staff.", "is_submitter": false, "distinguished": null, "created_utc": 1628515211.0, "parent_id": "t1_h8a12b0", "replies": []}]}]}, {"author": "Trickybiz", "id": "h8a1vuo", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #7", "submission": "p0zah6", "stickied": false, "body": "TR;DR GeT gUd", "is_submitter": false, "distinguished": null, "created_utc": 1628512188.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "Upstairs_Ad_1126", "id": "h8a4yys", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #32", "submission": "p0zah6", "stickied": false, "body": "My online gaming group is split 50/50 pretty much as its mainly all couples. I like our balance its good fun. This makes a lot of sense though, I've played with some salty gamers before.", "is_submitter": false, "distinguished": null, "created_utc": 1628513962.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "ktpr", "id": "h8ap39x", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #90", "submission": "p0zah6", "stickied": false, "body": "I should have read the article but did they compare the gendered reverse in gaming: male initiated disruption of a female hierarchy. As rare as this would be it could reveal that women react the same way as men, just that those circumstances are extremely rare in gaming.", "is_submitter": false, "distinguished": null, "created_utc": 1628523521.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "therapythrowaway1205", "id": "h8an1ab", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #232", "submission": "p0zah6", "stickied": false, "body": "I’d be curious if that’s the case across different games. Obviously certain games attract a certain player base.\n\nDoes this change when the player base is mainly split 50/50? What about when it’s 75/25 favoring women? Does this change when it’s mainly a group of friends playing or when some of the players have a previously established relationship rather then being anonymous or just meeting each other?\n\nId be curious to see this study recreated with different games/gaming communities.\n\nStill an interesting study.", "is_submitter": false, "distinguished": null, "created_utc": 1628522623.0, "parent_id": "t3_p0zah6", "replies": [{"author": "TopCat0601", "id": "h8bwf3j", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #159", "submission": "p0zah6", "stickied": false, "body": "I can provide a little insight to this. One of the only games I play online is Overcooked 2, which I would guess is 75/25 favoring women. There are also lots of children online. The most toxic players IMO are the highly skilled females. There is constant yelling and berating from these women, but I have never heard anything derogatory about men specifically. I find it funny how these grown women are yelling at little kids with no shame, though.", "is_submitter": false, "distinguished": null, "created_utc": 1628541870.0, "parent_id": "t1_h8an1ab", "replies": [{"author": "solarshado", "id": "h8dg5qe", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #459", "submission": "p0zah6", "stickied": false, "body": "I'd guess that's more of a general \"pros raging at noobs\" than anything gender-specific. It does illustrate that women are also capable of being toxic asshats, but I'd be skeptical of anyone seriously claiming to doubt that.", "is_submitter": false, "distinguished": null, "created_utc": 1628568977.0, "parent_id": "t1_h8bwf3j", "replies": [{"author": "THF-Killingpro", "id": "h8eyx27", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "well pros against noobs is always a thing, espeacially when it is impacting the pros performance aswell, but in overcooked 2 screaming at little kids? wtf", "is_submitter": false, "distinguished": null, "created_utc": 1628606745.0, "parent_id": "t1_h8dg5qe", "replies": []}]}]}]}, {"author": "Brohozombie", "id": "h8atvsz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "[Here's a link to the actual article directly.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4503401/)", "is_submitter": false, "distinguished": null, "created_utc": 1628525581.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "theomniexperience", "id": "h8aukva", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "Gender is a construct. Binary is a lie. \n\nEverything is Nothing.", "is_submitter": false, "distinguished": null, "created_utc": 1628525878.0, "parent_id": "t3_p0zah6", "replies": [{"author": "TiggerBane", "id": "h8b3p1s", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #236", "submission": "p0zah6", "stickied": false, "body": "Nothing is everything.\n\nConstruct is a gender. Lie is a binary.", "is_submitter": false, "distinguished": null, "created_utc": 1628529734.0, "parent_id": "t1_h8aukva", "replies": [{"author": "theomniexperience", "id": "h8dz7xv", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "You got it", "is_submitter": false, "distinguished": null, "created_utc": 1628583541.0, "parent_id": "t1_h8b3p1s", "replies": []}]}]}, {"author": "iamnotroberts", "id": "h8c42pg", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": ">\"female-initiated disruption of a male hierarchy incites hostile behaviour from poor performing males who stand to lose the most status\"\n\nIf their status was based on random matches of Halo 3 then...they had nothing to lose in the first place. Nothing minus nothing still equals nothing...or negative nothing.", "is_submitter": false, "distinguished": null, "created_utc": 1628545213.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "Quetzatcoatl93", "id": "h8c8jtr", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #270", "submission": "p0zah6", "stickied": false, "body": "Well maybe it's just me but if you're bad regardless of who you are I'll try to cheer you up, and if you're good regardless of you being female or male I may follow you like a puppy for a few matches, I been playing videogames for about 20 years and the only player I care it's me, yes I know there are some assholes but tbh I always ignore or block them.", "is_submitter": false, "distinguished": null, "created_utc": 1628547228.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "Solenya-C137", "id": "h89xfv4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #126", "submission": "p0zah6", "stickied": false, "body": "Fascinating!", "is_submitter": false, "distinguished": null, "created_utc": 1628509309.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "1up_for_life", "id": "h8ad4m9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #277", "submission": "p0zah6", "stickied": false, "body": "If they got good would they stop being assholes?", "is_submitter": false, "distinguished": null, "created_utc": 1628518120.0, "parent_id": "t3_p0zah6", "replies": [{"author": "NoSuchKotH", "id": "h8apav1", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "p0zah6", "stickied": false, "body": "I don't know about gamers, but anecdotal evidence in a work environment suggest that once you are an asshole you always be an asshole.", "is_submitter": false, "distinguished": null, "created_utc": 1628523613.0, "parent_id": "t1_h8ad4m9", "replies": []}, {"author": "Some_Animal", "id": "h8cvbl8", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #118", "submission": "p0zah6", "stickied": false, "body": "I think that maybe mysogyny and stupidity go hand in hand.", "is_submitter": false, "distinguished": null, "created_utc": 1628558109.0, "parent_id": "t1_h8ad4m9", "replies": [{"author": "solarshado", "id": "h8dfeqc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #459", "submission": "p0zah6", "stickied": false, "body": "I think you're on to something. There're outliers to be sure, but not enough to disprove the existence of a noticeable correlation.", "is_submitter": false, "distinguished": null, "created_utc": 1628568524.0, "parent_id": "t1_h8cvbl8", "replies": [{"author": "Some_Animal", "id": "h8djrey", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #118", "submission": "p0zah6", "stickied": false, "body": "Yeah thats it", "is_submitter": false, "distinguished": null, "created_utc": 1628571270.0, "parent_id": "t1_h8dfeqc", "replies": []}]}]}]}, {"author": "Cause-Effect", "id": "h8aw8ep", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #152", "submission": "p0zah6", "stickied": false, "body": "I find this super interesting. Great post.", "is_submitter": false, "distinguished": null, "created_utc": 1628526586.0, "parent_id": "t3_p0zah6", "replies": [{"author": "PreOpTransCentaur", "id": "h8c1wxu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #221", "submission": "p0zah6", "stickied": false, "body": "All it says is \"whiny baby piss pants are insecure.\" It's not really interesting or surprising in any way.", "is_submitter": false, "distinguished": null, "created_utc": 1628544256.0, "parent_id": "t1_h8aw8ep", "replies": [{"author": "notdeepee", "id": "h8cpmk0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #80 | Legio Virtus", "submission": "p0zah6", "stickied": false, "body": "It's interesting because someone journalled  it in a scientific way.", "is_submitter": false, "distinguished": null, "created_utc": 1628555373.0, "parent_id": "t1_h8c1wxu", "replies": []}]}]}, {"author": "BuccaneerRex", "id": "h8ay4up", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p0zah6", "stickied": false, "body": "My interest in multiplayer gaming waned to nothing right about the time that ubiquitous voice chat was introduced. I can't even imagine how much worse it must be to be a woman on public chat.", "is_submitter": false, "distinguished": null, "created_utc": 1628527388.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "DDumpTruckK", "id": "h8bpxbm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p0zah6", "stickied": false, "body": "And it's gonna be those 12 year olds playing Halo that hate girl gamers who are gonna be the ones who grow up to become anti-SJWs, deny the notion of Toxic Masculinity (despite it blatantly ruining their lives) and will go on to be susceptible to the alt-right pipeline.  QAnon's favorite recruiting grounds, at lest when they're not busy recruiting from 4Chan.", "is_submitter": false, "distinguished": null, "created_utc": 1628539118.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "MLuminos", "id": "h8c4gx9", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #42", "submission": "p0zah6", "stickied": false, "body": "The scientific explanation of having a small e-peen", "is_submitter": false, "distinguished": null, "created_utc": 1628545390.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "LoreleiOpine", "id": "h8c88r4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "p0zah6", "stickied": false, "body": "Evolutionary psychology is one of the most important subfields of psychology in that it helps explain *most* behaviour, and yet there is a massive Left wing faction that rejects it because it indicates a reality free of cognitive equality, and one in which human behaviour is all too often influenced by naturally perverse, violent, and biased incentives. They wrongly see fatalism in it. And then of course an evolution-denying Right wing faction rejects because of their allegiance to a religion. This era is... something.", "is_submitter": false, "distinguished": null, "created_utc": 1628547085.0, "parent_id": "t3_p0zah6", "replies": [{"author": "solarshado", "id": "h8djcu9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #459", "submission": "p0zah6", "stickied": false, "body": "It doesn't help that there's a usually-secular, right-leaning/traditionalist faction who couches their arguments in evo-psych terms, but rarely-if-ever provides any data to back it up (and occasionally falls back on \"left-leaning academics are refusing to do the research/covering up its results\", which, I'm loathe to admit, sounds plausible, but is *also* a claim with no evidence).\n\nEven that aside, it quickly runs into some uncomfortable ideas:\n\n * how do we justify treating everyone equally if they're *scientifically provably* not?\n * how should we change our criminal justice system if we discover that a large amount of \"criminal\" behavior *isn't* a result of \"free will\" but circumstance + instinctual \"programming\"? (or, put another way, what if a lot of the \"justice\" we, as a society, have meted out was directed at people we would now understand as \"guilty but not at fault\"?)\n * as a more general case of the above: what if \"free will\" isn't nearly as \"free\" as we tend to assume? (admittedly not a question unique to evo-psych by any means)\n\nAll that said, I agree that it's an important field of study. But there are a lot of reasons why it makes a lot of people varying degrees of uncomfortable.", "is_submitter": false, "distinguished": null, "created_utc": 1628571000.0, "parent_id": "t1_h8c88r4", "replies": [{"author": "LoreleiOpine", "id": "h8ed6e6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "p0zah6", "stickied": false, "body": "> It doesn't help that there's a usually-secular, right-leaning/traditionalist faction who couches their arguments in evo-psych terms\n\nWhat arguments?\n\n> how do we justify treating everyone equally if they're scientifically provably not?\n\nWe don't give the same rights to people with intellectual disabilities (IQ less than 70), but everyone else is similar enough that it's simply *best* to give everyone the same rights. We don't have a reasonable way to give people special rights based on the spectrum of IQ and talent, but actually we *do* give people special rights based on IQ and talents in a way! Think of what a surgeon can do that you cannot legally do, for example, and think of what a mechanic can legally do that you cannot either. \n\n> how should we change our criminal justice system if we discover that a large amount of \"criminal\" behavior isn't a result of \"free will\" but circumstance + instinctual \"programming\"? (or, put another way, what if a lot of the \"justice\" we, as a society, have meted out was directed at people we would now understand as \"guilty but not at fault\"?)\n\nFree will makes no sense to begin with. Punishment should be based on protecting the public and deterring crime, not retribution. Retribution makes no sense. \n\n> as a more general case of the above: what if \"free will\" isn't nearly as \"free\" as we tend to assume? (admittedly not a question unique to evo-psych by any means)\n\nLike I said, it makes no sense. You can't choose to choose what you choose. The choice happens and then you are subjectively the awareness of the choice after it has happened. \n\n> But there are a lot of reasons why it makes a lot of people varying degrees of uncomfortable.\n\nYes, and I mentioned those. This lot of people are wrong about the subject.", "is_submitter": false, "distinguished": null, "created_utc": 1628595268.0, "parent_id": "t1_h8djcu9", "replies": []}]}]}, {"author": "H0bg0blin0verl0rd", "id": "h8dio7b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "This is kinda one of those moments where I can't really relate and I'm glad for it. Racism and sexism have always been pretty absurd to me, though I still have my biases to work through like everyone else. I never really communicated with other players in game, so I never really gave a damn if the people running alongside me were male or female. So long as they did their part and supported me, I would do the same. \n\nWatching this all come out now is kinda like watching a household you've known for years was rife with domestic abuse come apart at the seams in real time.", "is_submitter": false, "distinguished": null, "created_utc": 1628570561.0, "parent_id": "t3_p0zah6", "replies": [{"author": "TheLittlestHibou", "id": "h8f6rfw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "p0zah6", "stickied": false, "body": ">I never really gave a damn if the people running alongside me were male or female. So long as they did their part and supported me, I would do the same.\n\nsame, not just with gaming but irl too, as a general rule\n\ni just want to get along and achieve meaningful goals together, also, as a general rule.", "is_submitter": true, "distinguished": null, "created_utc": 1628610112.0, "parent_id": "t1_h8dio7b", "replies": [{"author": "H0bg0blin0verl0rd", "id": "h8fapz7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "I ask a simply question in the face of racism or sexism or any kind if extreme ideology like them: If I were bleeding out and someone came to save me, or at the very least hold my hand and make sure I wasn't alone when I died, would I genuinely give a damn whether or not they looked like me or thought like me, or would I simply be grateful for the compassion they gave me in that moment?", "is_submitter": false, "distinguished": null, "created_utc": 1628611780.0, "parent_id": "t1_h8f6rfw", "replies": []}]}]}, {"author": "Thorusss", "id": "h8dtmk2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "Very interesting", "is_submitter": false, "distinguished": null, "created_utc": 1628578682.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "iamgarlic", "id": "h8e41bu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #129", "submission": "p0zah6", "stickied": false, "body": "Ironically, these are the type of people that would subscribe to the whole sigma Male bullshit", "is_submitter": false, "distinguished": null, "created_utc": 1628587909.0, "parent_id": "t3_p0zah6", "replies": [{"author": "TheLittlestHibou", "id": "h8f5sr7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "p0zah6", "stickied": false, "body": "I don't know anything about this sigma male stuff but there's an argument to be made for hierarchies and benevolent domination, if such a thing can possibly exist.\n\nA good leader.\n\nA good parent.\n\nA good mentor.\n\nA good teacher.\n\nA good boss.\n\nGood people in positions of power.\n\nDisrupting old hierarchies and forging new ones.\n\nHierarchies are very very interesting.\n\nLike beekeeping. Fish keeping. Watching an ant farm. How they move in synchronicity with each other to achieve a common goal.\n\nFish move in schools. They can turn on a dime together all at once, it's amazing, birds do this too. Flocks flying together in unison... fascinating shit.\n\nAnimal husbandry.\n\nIsn't it weird that it's called animal *husbandry* rather than animal *mothering*?\n\nAnimals that we *mother*, we keep as pets and consider family members.\n\nAnimals that we *husband*, we raise as livestock to kill and eat and feed to other animals.\n\n\\*\\*\\*\n\nFOOD.\n\nI need to eat some food, I'm flying on caffeine and hypoglycemia right now, weeee", "is_submitter": true, "distinguished": null, "created_utc": 1628609706.0, "parent_id": "t1_h8e41bu", "replies": []}]}, {"author": "ctm-8400", "id": "h8etg0n", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p0zah6", "stickied": false, "body": "That must mean I'm super pro gamer, because I'm really nice to everyone I play with ;)", "is_submitter": false, "distinguished": null, "created_utc": 1628604286.0, "parent_id": "t3_p0zah6", "replies": [{"author": "xXxHelsinginHerraxXx", "id": "h8ipb80", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #197", "submission": "p0zah6", "stickied": false, "body": "Or so you say", "is_submitter": false, "distinguished": null, "created_utc": 1628678281.0, "parent_id": "t1_h8etg0n", "replies": []}]}, {"author": "cptnobveus", "id": "h8a7i1s", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #35", "submission": "p0zah6", "stickied": false, "body": "Makes sense", "is_submitter": false, "distinguished": null, "created_utc": 1628515336.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "TesseractToo", "id": "h8ih4et", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #96", "submission": "p0zah6", "stickied": false, "body": "First: TW for R\\*pe threats, stalking  \n\n\nFrom 2001-2006 I used to moderate a huge official game forum and got trolled very heavily- one group was just troublemakers and the other group was a combination of a modder who thought he'd been wronged by me by being banned (I didn't even ban him) combined with someone having a delusion that I was preventing him from being a moderator (I wasn't I was for him joining until he started personally attacking me). And combined I had about 1200 people hating on me over gossip and just coming along for the ride. Doxxing wasn't a word yet but that is what happened including a petition to have me fired for picking on the modder (despite the fact he had posts on modding forums saying that he was trying to see how far he can go before being banned, and an admin banned him) and the petition had over 850 signatures, over a lie.  \n\n\n Some people got my e-mail (it was a hotmail so pretty anonymous or so I thought) and I was taking a 3D animation course because I was interested in working there but in the class we communicated with MS Messenger and the trolls got in and they would post in bright pink things like \"FUCK YOU CUNT MODERATOR I HOPE YOU GET RAPED AND DIE\" and very graphic death threats (that were more disturbing because you knew the little asshat was 14 and it made it worse because they were babies typing this shit), this sort of thing was daily and it was embarrassing when I was having my piece critiqued and the messages would come up on the bug screen in front of the class, luckily they were very understanding about this.   \n\n\nNothing like this happened to any of the male moderators, BTW. That guy didn't think any of the male mods were preventing him from being a moderator, the modder didn't think a male banned him for his provocative post, he just assumed I was a prude and hated looking at \"realistic bouncing boobs\" (they were realistic at all they looked like semi-deflated saline bags sloshing around on that woman's chest- looked painful haha, but that wasn't for me to give a shit about lol).  \n\n\nAnyway the rape threats started appearing in my mail box... in note form (and sometimes on my windshield of my car) my physical one of my house. No idea how they learned what city I live in or my name let alone my actual mail box of my home... it was fucking scary and the cops did nothing. I had to start taking ativan.  \n\n\nThe harassment kept going for years, well into 2014 when I started being online less. It was most intense for about 2 1/2 years though.  \n\n\nSo fucking dumb, almost all those guys (and a few women!) were like people in a cult, they didn't know the real story or my side and they assume all women lie so they wouldn't have believed it anyway because they would have had to deal with the cognitive dissonance that the modder they like was maybe just a bit off his rocker. (BTW that guy made over 20 sock puppet accounts that messaged me and telling me to stop picking on him, they were supposed to be girls so he made them talk like anime bimbos, it was pretty funny and I could see his IP address. :D  \n\n\nSo yeah.... Also I spent a little time in some studios and some were awful to women and others where it seemed very calm and maybe.... average sexism for an office? haha hard to say. :)", "is_submitter": false, "distinguished": null, "created_utc": 1628670985.0, "parent_id": "t3_p0zah6", "replies": []}, {"author": "JaimelesBN", "id": "h8ad6re", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p0zah6", "stickied": false, "body": "Never experienced that, everytime a female player was shit talked on a game it's because they played like crap and the team didn't knew it was a female. When they heard the voice they almost everytime started being nice and tried getting their friend request accepted.\nIt was on cs go that I encountered the most female players BTW.", "is_submitter": false, "distinguished": null, "created_utc": 1628518148.0, "parent_id": "t3_p0zah6", "replies": [{"author": "DDumpTruckK", "id": "h8bx81b", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p0zah6", "stickied": false, "body": ">When they heard the voice they almost everytime started being nice and tried getting their friend request accepted.\n\nYou don't view this as a kind of harassment?  At the very least its proof that they're treating female gamers differently and unequally.  But without having to stretch too far, isn't harassing a girl about being friends, and falsely being polite to them because you want to have sex with them *also* still discriminatory behavior?", "is_submitter": false, "distinguished": null, "created_utc": 1628542210.0, "parent_id": "t1_h8ad6re", "replies": [{"author": "JaimelesBN", "id": "h8dll4v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p0zah6", "stickied": false, "body": "Well IRL women are treated differently too, nothing special about that.", "is_submitter": false, "distinguished": null, "created_utc": 1628572507.0, "parent_id": "t1_h8bx81b", "replies": [{"author": "DDumpTruckK", "id": "h8dlu8e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p0zah6", "stickied": false, "body": "No one said it was special.  What does it being special have to do with anything?  Shouldn't we be against harassments of all forms?  Or are you trying to argue that because women are harassed in real life they should also be harassed in video games?", "is_submitter": false, "distinguished": null, "created_utc": 1628572689.0, "parent_id": "t1_h8dll4v", "replies": [{"author": "JaimelesBN", "id": "h8dn66e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p0zah6", "stickied": false, "body": "Well the internet is pretty wild, you get bullied or harassed whatever your sex is. You can mute people if it bother you. So if you're especially concerned with this specific first world problem I'll let you explain to me how we can change that, without you telling me \"we have to change the mentality\".", "is_submitter": false, "distinguished": null, "created_utc": 1628573640.0, "parent_id": "t1_h8dlu8e", "replies": [{"author": "DDumpTruckK", "id": "h8dupoc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p0zah6", "stickied": false, "body": "Bro.  You make it sound like just because there are other problems that we can't address this one.  This is nonsense.  We can address world hunger AND gender discrimination.\n\n>So if you're especially concerned with this specific first world problem I'll let you explain to me how we can change that, without you telling me \"we have to change the mentality\".\n\nSeems to me like those people on the internet who harass girl gamers aren't the only ones who need to change their mentality.  I'm utterly shocked at how incapable of empathy you voluntarily would paint yourself.", "is_submitter": false, "distinguished": null, "created_utc": 1628579600.0, "parent_id": "t1_h8dn66e", "replies": [{"author": "JaimelesBN", "id": "h8dv9xt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #21", "submission": "p0zah6", "stickied": false, "body": "Well because I don't think this is a problem solvable or that it is a problem. I just think that time only will change how the women are seen in this male dominant world that is the gaming.", "is_submitter": false, "distinguished": null, "created_utc": 1628580076.0, "parent_id": "t1_h8dupoc", "replies": [{"author": "DDumpTruckK", "id": "h8dx01q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p0zah6", "stickied": false, "body": ">or that it is a problem.  \n>  \n>I just think that time only will change how the women are seen in this male dominant world that is the gaming.\n\nWait, I thought there wasn't a problem?  Why would something need to change if its not a problem?  Is it a problem or not?\n\nHow will time change how women are seen in the male-dominant world of gaming if there isn't a problem that needs to change?  You seem very willing to passively accept inequity just so long as you're not the one affected by the inequity.", "is_submitter": false, "distinguished": null, "created_utc": 1628581578.0, "parent_id": "t1_h8dv9xt", "replies": []}]}]}]}]}]}]}]}]}