{"title": "The Reinvention of Coley's Toxins", "name": "t3_p87pf5", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p87pf5/the_reinvention_of_coleys_toxins/", "selftext": " Coley's Toxins were invented in 1893 by Dr. William Coley when he was 29 years old. In the following 43 years Dr. Coley treated about one thousand inoperable (incurable) cancer patients with better results than would be expected for a comparable group of patients today.  \n\n\nUntil the last pharmaceutical manufacturer ceased production in 1951, Coley's Toxins was a mainstream cancer therapy with thousands of physicians treating many tens of thousands of patients. Outcomes were respectable but not as good as achieved by Dr. Coley. Dr. Coley's patients fared better than those treated by other physicians because Coley s Toxins prepared for Dr. Coley s personal use were more effective than the commercially available formulations.  \n\n\nBeginning in 2006, MBVax Bioscience produced a modern version of the formulation used by Dr. Coley and provided it free of charge to physicians anywhere in the world who could legally import the product and administer treatment.  \n\n\nClinical results included complete regressions (cures) of inoperable and/or metastatic breast cancer, lymphoma, melanoma, lung cancer, esophageal cancer and stomach cancer. In spite of these results and the support of leading cancer researchers, medical regulators in Canada, Europe and the U.S. denied permission to commence clinical trials. \n\n[https://www.goodreads.com/topic/show/22045491-synopsis-of-the-reinvention-of-coley-s-toxins](https://www.goodreads.com/topic/show/22045491-synopsis-of-the-reinvention-of-coley-s-toxins)", "score": 7, "upvote_ratio": 0.82, "permalink": "/r/TheFlyingTree/comments/p87pf5/the_reinvention_of_coleys_toxins/", "id": "p87pf5", "author": "TheLittlestHibou", "link_flair_text": "Discussion", "num_comments": 7, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629473942.0, "comments": [{"author": "Muroid", "id": "h9ochfg", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p87pf5", "stickied": false, "body": "Flipping around on Google, it seems like Coley’s toxins were an early, unintentional, venture into immunotherapy treatments for cancer, which were sidelined in favor of radiation and chemotherapy in part because they were easier to work with consistently and because the mechanism for their effect was actually understood.\n\nThe latter hurdle is no longer an issue, but the former still is, though to a lesser extent, but more importantly modern immunotherapy research has already progressed in parallel and there’s no strong evidence that going back to this particular formulation from the 1800s is going to be an improvement on more recent research in the same general field.\n\nIt’s historically interesting, but it’s not a secret magic cureall.", "is_submitter": false, "distinguished": null, "created_utc": 1629475034.0, "parent_id": "t3_p87pf5", "replies": [{"author": "parttimemuse", "id": "h9oemhr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p87pf5", "stickied": false, "body": "That’s interesting, because the big industry in oncology right now is immunotherapy. Major new treatment programs like CART cell therapy are a progression of that field. \n\nI’m interested in looking into this more", "is_submitter": false, "distinguished": null, "created_utc": 1629475895.0, "parent_id": "t1_h9ochfg", "replies": [{"author": "Muroid", "id": "h9of03i", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "p87pf5", "stickied": false, "body": "Well that seems to be the issue. Because that’s the major focus of research, the modern industry has already outpaced the work that William Coley was doing somewhat unwittingly since he didn’t fully understand that it even was an immunotherapy at the time.", "is_submitter": false, "distinguished": null, "created_utc": 1629476047.0, "parent_id": "t1_h9oemhr", "replies": [{"author": "parttimemuse", "id": "h9ofkzl", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p87pf5", "stickied": false, "body": "That would make sense for the time. The modern therapies use genetic modification and synthetic protein to produce results, none of which would have been available at the time. I would be more interested in seeing what compounds produced the immune response that taught the body to recognize the tumors as foreign. I’d also would be interested in what Coley’s thoughts were on the success of his treatment", "is_submitter": false, "distinguished": null, "created_utc": 1629476281.0, "parent_id": "t1_h9of03i", "replies": []}]}, {"author": "TheLittlestHibou", "id": "h9q4yf7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "p87pf5", "stickied": false, "body": "The problem is, injecting people with viruses and bacteria to cure cancer may work well in a lot of cases but the method of treatment must be tailored to the individual patient, so it can't be standardized, thus standardized results are very unpredictable and difficult to patent.\n\nThing is, standardized results do not reflect the reality of the illness or effectiveness of the treatment. Statistics are fallible. So the treatment may indeed be very effective, but it depends on the physician applying the treatment. They need to be a skilled diagnostician in order for the cancer treatment to be effective.\n\nIt's... a bit messy, for sure.", "is_submitter": true, "distinguished": null, "created_utc": 1629502089.0, "parent_id": "t1_h9oemhr", "replies": [{"author": "parttimemuse", "id": "h9qdham", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p87pf5", "stickied": false, "body": "I don’t know if I fully understood your meanings, but here are some thoughts I had from my first read through: \n\nIf you’re interested in standardizing care across different cancers, then yes, that would be incredibly difficult. But for specific mutations, there are standards of care that have the best overall outcomes. We know that certain treatments work for certain mutations. However, medicine is a science and an art, like you’ve implied. So experience and a certain ‘touch’ can help physicians see complications earlier. \n\nTypically we don’t use bacteria in lot of the new stuff coming out, but certain viruses are used in the genetic modification of cell in order to inject the new programming into the cell, if you will. More of a vehicle, though, than an inciting force. Many immunotherapies are actually synthetic antibodies that help train the immune system to target the offending cells in question. CAR-T is one case where we do take the patients’ cells and modify them, but is actually is patented in a number of its forms, although very expensive, and has been FDA approved for certain courses of treatment for malignancies. \n\nI think the physician has relatively little to do with beating statistics, when compared with the patient themselves. A highly skilled and insightful physician can have a higher than average number of patients who are stressed, unmotivated, and emotionally unfit to cope with their diagnosis and not be able to adequately treat any of them. And to the reverse, a less skilled physician could have a mentally strong population who adapts well and have a strong social network to help them through their treatment, and could have better results than the first physician.", "is_submitter": false, "distinguished": null, "created_utc": 1629506133.0, "parent_id": "t1_h9q4yf7", "replies": []}]}]}, {"author": "TheLittlestHibou", "id": "h9q4kj0", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #140 | Classis Veritatus", "submission": "p87pf5", "stickied": false, "body": ">It’s historically interesting, but it’s not a secret magic cureall.\n\nOh for sure. I haven't even read the book and have no opinion of Coley's toxins either way, it was just some interesting historical medical lore I thought I'd share with the sub.\n\nMedicine has always been a passion for me but am only now starting to study it more seriously now that I'm in my 40's.\n\nI don't believe in quack medicine, I just love historical medical lore.", "is_submitter": true, "distinguished": null, "created_utc": 1629501910.0, "parent_id": "t1_h9ochfg", "replies": []}]}]}