{"title": "Our population is almost at 8 Billion. Can we sustain this growth?", "name": "t3_pe3c0h", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pe3c0h/our_population_is_almost_at_8_billion_can_we/", "selftext": "(i) Can we actually sustain this population with our current resources? \n(ii) How much further can we go as a planet with this population growth? \n(iii) If it has to stop at one point, how and when?\n\nI like to hear your thoughts on this.", "score": 25, "upvote_ratio": 0.97, "permalink": "/r/TheFlyingTree/comments/pe3c0h/our_population_is_almost_at_8_billion_can_we/", "id": "pe3c0h", "author": "ThickEffective1265", "link_flair_text": "Discussion", "num_comments": 47, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630269835.0, "comments": [{"author": "RumoCrytuf", "id": "hauqof3", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Seeker #122", "submission": "pe3c0h", "stickied": false, "body": "I recall hearing that the population cap for humanity is between 10-12 billion. \n\nCan we sustain it? Absolutely.\n\nWill we? Probably not.", "is_submitter": false, "distinguished": null, "created_utc": 1630273307.0, "parent_id": "t3_pe3c0h", "replies": [{"author": "HecknChonker", "id": "haw0g96", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #137", "submission": "pe3c0h", "stickied": false, "body": "https://www.ted.com/talks/hans_rosling_global_population_growth_box_by_box\n\nThis is a bit dated, so we likely have much better projections now than we did 10 years ago - but it explains why we expect the population to stop growing forever.", "is_submitter": false, "distinguished": null, "created_utc": 1630295695.0, "parent_id": "t1_hauqof3", "replies": [{"author": "Golden-Snowflake", "id": "haw2bvw", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #222", "submission": "pe3c0h", "stickied": false, "body": "its really hard to give 10 billion people, good living conditions.   \n\n\nBetter to just Cull the ones who don't interact each week.", "is_submitter": false, "distinguished": null, "created_utc": 1630296768.0, "parent_id": "t1_haw0g96", "replies": [{"author": "Mr--Elephant", "id": "hax053t", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #72 | Ordo Cognitus", "submission": "pe3c0h", "stickied": false, "body": "That reminds me of a certain kind of tree that flies", "is_submitter": false, "distinguished": null, "created_utc": 1630322718.0, "parent_id": "t1_haw2bvw", "replies": []}]}]}]}, {"author": "Concrete_Grapes", "id": "hav00eu", "score": 10, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pe3c0h", "stickied": false, "body": "Global population will start to decline probably within the lifespans of anyone below 50 right now.   \n\n\nOver population doesnt seem possible, because at the rate at which the wealth of some countries is growing, they'll enter the territory that many advanced nations already have--and that's a natural population decline. Japan's the best known, but there are others, and the US recently joined the club as well. The US now will no longer gain population unless it allows immigration. That's how low the birth rate is, and there's every indication that it will only get lower.   \n\n\nIf you looked at studies for this, it's alarming. The most impoverished nations on the planet, the worst off, have MORE kids. One, it's to combat child mortality in these places, which is still astoundingly high, but it's ALSO the only real way they have been able to increase the labor pool in order to make enough to survive, or divide tasks over the number of people with the energy capacity to do them (why girls go fetch water--they have fat reserves higher than little boys, and CAN make that trip without falling over from exhaustion, where the boys will work closer, and in short-bursts building, hammering, cutting, etc).   \n\n\nWhen wealth increases, birth rates plummet. Bangladesh, for example. It was a HUGE example of racists and over-population nutjobs back in the 70's and 80's. Each woman there had an average of 7 kids in her life, and NOW--because the economy there developed, wealth increased, childhood mortality plummeted, access to healthcare increased--it's juuuuuuust barely 2 kids per woman, and factoring in how many people die before having kids of their own, they're ALREADY at a natural state of population DECLINE. That's 50 years, sure. India's population growth rate as a total, is about where the US's was in the 70-'s, known in the US as the 'baby bust' (\\*waves to the gen-x'rs, arnt you glad THAT name didnt stick to your generation?).  \n\n\nSo, just to go off on a related tangent, everyone knows china had the One Child policy, right, and the disaster it was. It worked though, it did what they wanted it to do, prematurely halt the birth of SO MANY poor rural children. It's what allowed them to funnel something like 50% of their population, inside of 2 generations, from rural to uban centers. It made such a massive difference, that they've eliminated it and now people are choosing not to have kids, because they see it as an economic choice that makes sense. It's no longer \"kids are a source of farm labor for us' it's 'kids COST money.'  \n\n\nBUT--china ALSO saw what was going on in the rest of the world, Japan, Germany, Italy, and even the US--where economic development would naturally scale back population growth, and they've done a LOT of that inside their own country (and it's partly why they refuse to lower carbon output until 2030--they need time to catch up to countries that already HAVE that level of economy)--but they're spreading this to other, poor, backwards countries with population problems. If you look in China, at some of the poorest countries with the biggest problems with population, China is stepping in and building them roads, infrastructure, and economies. They're MAKING the economic growth, so that 1. they have 'middle class' customers in the future, but TWO--so that THEIR population growth wont have to be curtailed to control world population. They're planting the seed to stop population growth through the economic tools we KNOW work, so that they're better off to not have to worry about theirs down the road.   \n\n\nWe'll likely never see 9 billion people. Heck, we're more likely to see 7 billion again before i die than we are 9.   \n\n\nThe population isnt the stressor, it's the resources they're using. We have to fix THAT. a SINGLE farm in eastern Washington, growing corn, pumps more water out of the ground than half a million people use for their homes every year. It's 100% turned into ethanol for fuel. Not eaten. We dont need to do that, it would be smarter to invest that SAME land area into solar, or wind, and upgrade the grid to accommodate the change.   \n\n\nThe carbon footprint of ALL the people that live in Africa, is so small that if the whole of the world lived like that, there'd be no climate change. So, we have to find a sustainable way to live, and make it seem like we're CHOOSING that, rather than being forced. That's the task ahead of us as a species. I personally think we'll fail.", "is_submitter": false, "distinguished": null, "created_utc": 1630277536.0, "parent_id": "t3_pe3c0h", "replies": [{"author": "ThickEffective1265", "id": "hawazji", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #293", "submission": "pe3c0h", "stickied": false, "body": "Can we do that? A sustainable lifestyle as a whole planet.\nWith the rapid climate change and even with this covid crisis, in the developing world, more and more people are dragged back to the poverty line. Climate change is affecting their limited resources as well as their economies. If this keeps getting worse, won't it drag developing countries back to where they were in a few years back as in economic conditions making them less accessible to that sustainable lifestyle? \n\nLet's say, 30-50% of the population of developing countries is well educated, wealthy, stable, and has more access to their resources. So, there is another half that is not or trying to be like the rest. So with the effects of climate disasters and the pandemic, the second part most likely will suffer than the first part. Wouldn't this make a big gap between the two parts in inequality for accessing resources? And how is this gonna affect their population growth?", "is_submitter": true, "distinguished": null, "created_utc": 1630302302.0, "parent_id": "t1_hav00eu", "replies": [{"author": "Concrete_Grapes", "id": "hawmkg3", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pe3c0h", "stickied": false, "body": "Can we? Of course we can.   \n\n\nWILL we? No, probably not.   \n\n\nLets focus on something, for a second--housing codes.   \n\n\nThe average house in the US is 37 years old. Lets, for the sake of making this easier, say it's 40 years.   \n\n\nBefore 1980, there was NO REQUIREMENT for homes to be insulated. The average home built before 1980 may have ZERO, to r-13 for insulation. R3 is more likely.   \n\n\nThe resources to heat these homes is massive. It's far and away the largest draw on the power grids, and in some states in some locations these homes can suck down 1700kwhrs--just MASSIVE power consumption.   \n\n\nThere are houses out there, built PAST the basic codes for insulation, that can be heated on LESS than a hair dryer. Some, are so energy efficient, it can be heated with your body heat alone. We're talking about homes that can be heated with LESS THAN a hair dyer, on low. About as much energy as leaving a 100 watt light on for a month.   \n\n\nWILL WE make those the codes? No. CAN WE? Yes of course we could. Imagine, if, in the span of the next 40 years, we could reduce the energy consumption of housing in the US by 90%? It's possible. not probable.   \n\n\nThe fields we currently use to grow corn, many of them are used to grow corn that's turned into Ethanol. Growing these crops, JUST THE ETHANOL crops, makes the US use 47 TRILLION gallons of water a year. (to put this in perspective, that's 2.5 times more water than humans use at home, and for ALL residential uses--300 gallon average per day). For JUST CORN, that we throw in our gas tanks. (Another way to see the corn--the Colorado river would have to run, for over two solid years, to add up to the amount of water we use for JUST corn to put in our gas tanks)  \n\n\nImagine if that same number of acreage, OR water, was used to generate electrical power--and how clean we could make a grid. We could power the entire US--and create water-storage, dam-like batteries for the over-production, on JUST the corn acres and water usage.   \n\n\nWe wont, but, COULD we? Yes.   \n\n\nSo, idk, we KNOW these things, we SEE these things, its possible to do these things--but it's not profitable.   \n\n\nSo, CAN we? Sure. We can live in a sustainable world. We wont.", "is_submitter": false, "distinguished": null, "created_utc": 1630311706.0, "parent_id": "t1_hawazji", "replies": [{"author": "ThickEffective1265", "id": "hawnu3h", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #293", "submission": "pe3c0h", "stickied": false, "body": "Thanks, dude. It's amazing how u explained it 👍", "is_submitter": true, "distinguished": null, "created_utc": 1630312834.0, "parent_id": "t1_hawmkg3", "replies": []}]}]}, {"author": "Th3Fel0n", "id": "haxjdgi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #374", "submission": "pe3c0h", "stickied": false, "body": "I may be mistaken, but isn't a main cause for Japan's population decline the horrible work culture that causes people to work overtime until late hours?", "is_submitter": false, "distinguished": null, "created_utc": 1630333027.0, "parent_id": "t1_hav00eu", "replies": [{"author": "Concrete_Grapes", "id": "haziht4", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "pe3c0h", "stickied": false, "body": "Partly, without question, you could add that as part of the economic development that leads to decline.   \n\n\nIt's also interesting, that when you look at average hours worked, the US is significantly higher per worker than Japan. The US average is 48 hours a week, and Japans is about 34 (across all workers). Yes, Japan has more workers working over 50 hours than the US does, but they're not the majority.   \n\n\nThe work-life ballence does get shifted, in either country, to make it so that children are seen as a cost to be avoided. THat's just the side-effect of advancing an economy, but it's why over-population wont happen, as the world spreads its development farther and children stop being born at the rates they used to be.", "is_submitter": false, "distinguished": null, "created_utc": 1630362940.0, "parent_id": "t1_haxjdgi", "replies": []}]}]}, {"author": "zebediah49", "id": "hav0gty", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #131", "submission": "pe3c0h", "stickied": false, "body": "An interesting counterpoint:  Not every country is increasing.  *Can we actually sustain this population loss?*\n\nFor centuries, we've been running economic systems that depend on having young overworked people producing, and a smaller older population living off of that.  We'll need to switch to something where fewer working people can sustain more non-working.\n\nOn the bright side, in the past 40 years in the US, workers have produced 80% more each.  So... we should only really need about 60% as many.  More automation will only improve that number.... though the trick will be a system to distribute the results of that productivity.", "is_submitter": false, "distinguished": null, "created_utc": 1630277752.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "Nietzsches_Therapist", "id": "havcaq7", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #187", "submission": "pe3c0h", "stickied": false, "body": "We can’t grow forever, but population growth is already slowing on its own as countries grow richer. I don’t think overpopulation is as big of an issue as people make it out to be.", "is_submitter": false, "distinguished": null, "created_utc": 1630283522.0, "parent_id": "t3_pe3c0h", "replies": [{"author": "DrinkingAtQuarks", "id": "haw38np", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #142", "submission": "pe3c0h", "stickied": false, "body": "I agree with the sentiment, and it really bugs me when people talk about overpopulation causing all of our problems. The planet could easily sustain 10 Billion people, but they would need to be environmentally conscious and living in reasonably dense urban high-tech societies (European dense, not Kowloon walled city dense). The planet would be far better off with 10 Billion mindful Earthlings than 5 billion lazy and destructive ones who throw their garbage into rivers and chop down forests to make way for cattle farms.", "is_submitter": false, "distinguished": null, "created_utc": 1630297275.0, "parent_id": "t1_havcaq7", "replies": [{"author": "ThickEffective1265", "id": "hawco4y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #293", "submission": "pe3c0h", "stickied": false, "body": "But it's not possible if that high-tech isn't accessible to everyone, right? There is still a part that is developing and there is another part that hasn't developed at all. What if most of the developing and the underdeveloped countries won't be able to reach that point or due to climate crisis or this pandemic? Wouldn't that make a big gap between the developed countries and the rest? So to make that society a reality, does the developed world has to drag the rest up?", "is_submitter": true, "distinguished": null, "created_utc": 1630303547.0, "parent_id": "t1_haw38np", "replies": [{"author": "DrinkingAtQuarks", "id": "hawgsj5", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #142", "submission": "pe3c0h", "stickied": false, "body": "Yeah absolutely- it's politics, education, and culture standing in the way; not technology.", "is_submitter": false, "distinguished": null, "created_utc": 1630306794.0, "parent_id": "t1_hawco4y", "replies": []}]}]}]}, {"author": "MisanthropicScott", "id": "hauktna", "score": 15, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pe3c0h", "stickied": false, "body": "No. Infinite growth on a finite planet is a physical impossibility.\n\nWorse, we're long past the point of sustainability. We're stealing from our children to feed ourselves. That's the real meaning of [Earth Overshoot Day](https://en.wikipedia.org/wiki/Earth_Overshoot_Day), a.k.a. ecological debt day. It means we're borrowing resources from the future by using more than the sustainable resources today.\n\nSomeone will have to pay that debt back. It won't be pretty.", "is_submitter": false, "distinguished": null, "created_utc": 1630270704.0, "parent_id": "t3_pe3c0h", "replies": [{"author": "Smoother-Bytes", "id": "haw68cw", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #54", "submission": "pe3c0h", "stickied": false, "body": "Never heard of the concept but it makes sense and is quite harrowing too", "is_submitter": false, "distinguished": null, "created_utc": 1630299077.0, "parent_id": "t1_hauktna", "replies": []}]}, {"author": "maxinstuff", "id": "haur9ie", "score": 14, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #243", "submission": "pe3c0h", "stickied": false, "body": "The rate of global population growth has actually halved since 1970.\n\nAt the current rate of around 1% it will take 30 years to reach 8 billion, but if the rate keeps dropping it will stabilise before reaching that level and perhaps even start declining.", "is_submitter": false, "distinguished": null, "created_utc": 1630273566.0, "parent_id": "t3_pe3c0h", "replies": [{"author": "Intrepid00", "id": "havyr96", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #20", "submission": "pe3c0h", "stickied": false, "body": ">\tperhaps even start declining.\n\nCovid-19 is going to be interesting if it declined still since kids aren't dieing like they did to earlier stuff. Disease is a big driver of population growth.", "is_submitter": false, "distinguished": null, "created_utc": 1630294748.0, "parent_id": "t1_haur9ie", "replies": [{"author": "maxinstuff", "id": "haw2qaz", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #243", "submission": "pe3c0h", "stickied": false, "body": "I wasn’t going to go there, but OK.\n\nChild mortality is lower than its ever been - the problem is fertility rates being at or below replacement levels in much of the developed world.\n\nI would expect the impact of COVID to be even lower fertility (as people defer having children due to the pandemic) combined with higher mortality rates amongst older people (who are themselves a large demographic).\n\nSo you don’t need higher child mortality for populations - particularly in the developed world - to decline appreciably due to COVID.", "is_submitter": false, "distinguished": null, "created_utc": 1630296990.0, "parent_id": "t1_havyr96", "replies": []}]}]}, {"author": "Skastrik", "id": "haup726", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "pe3c0h", "stickied": false, "body": "If we minimize waste and enforce strict living standards and ration food, I've seen some studies theorize that the planet could support around 10 - 12 billions if humans basically operated like a hive. It would be living but far from pleasant, extremely far from it to be honest. The likelihood of that happening is very slim.\n\nWith current standards in the west, the planet can support maybe 2 billion max.\n\nWe were 4,6 billion when I was born. Now we are closing in on 8 billions, that growth is mind boggling.", "is_submitter": false, "distinguished": null, "created_utc": 1630272648.0, "parent_id": "t3_pe3c0h", "replies": [{"author": "zebediah49", "id": "hauztft", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #131", "submission": "pe3c0h", "stickied": false, "body": "Pretty sure we could go a *lot* higher than that, if we were willing to accept poor conditions.\n\nConsider the absurd amount of crop production that is currently wasted, used as animal feed, or burned as fuel.  And that's with us more-or-less supporting nearly 8B people.\n\nWe could push the tech quite a bit and also turn large portions of Africa into usable farmland.  (Figure greenhouses to keep water loss down)  That kind of stunt could probably increase supported population to at least 20B people (in \"hive\" style).", "is_submitter": false, "distinguished": null, "created_utc": 1630277446.0, "parent_id": "t1_haup726", "replies": [{"author": "Skastrik", "id": "hav0qrf", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "pe3c0h", "stickied": false, "body": "The key was long term sustainability if I remember correctly, the resources needed for every billion after 7 billion rise exponentially. At 12 billion we are at the limit of modern technology and resources.", "is_submitter": false, "distinguished": null, "created_utc": 1630277884.0, "parent_id": "t1_hauztft", "replies": []}]}]}, {"author": "LoreleiOpine", "id": "hauwx1v", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #52", "submission": "pe3c0h", "stickied": false, "body": "i. Yes, but not at enormous ecological cost. \n\nii. A bit further. Maybe 11 billion? \n\niii. It's call the ecological carrying capacity. There won't be enough resources for population growth to continue at that point. The population could be sustained but not increased.", "is_submitter": false, "distinguished": null, "created_utc": 1630276124.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "eliminating_coasts", "id": "havfseh", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #129", "submission": "pe3c0h", "stickied": false, "body": "The answer to 1 is technically no; we actually can't sustain our current population with current resources, we're using far more every year than our planet can ecologically sustain. [Here's a map](https://data.footprintnetwork.org/#/) with a lot of red on it showing countries that are currently over their limit, in those people's estimation.\n\nHowever! That doesn't mean we can't race our population growth with improved sustainability; if you look at the [overall biocapacity](https://data.footprintnetwork.org/#/countryTrends?cn=5001&type=BCpc,EFCpc) info for the earth, you'll find that they estimate that we're maxed out on cropland, using 2/3 of available fishing, 70% of available grazing land, and less than half of forest resources.\n\nSo all of those are at or below capacity, and all the rest is down to our carbon emissions, so if we can get that down to zero, then this measure would put us in surplus again.\n\nThen if you consider that of the food we produce now, 1/3 is wasted, we could feed significantly more people at their current living standards than we do now, or lift many more people up to something closer to western living standards, (though probably our goal should be something more like japanese dietary standards).\n\nAll that said, one thing that the measure I gave above doesn't include is threats to [biodiversity](https://www.un.org/sustainabledevelopment/blog/2019/05/nature-decline-unprecedented-report/), ie. destroying habitats, causing extinctions, and generally reducing the variety of life on earth.\n\nThis is something that, in addition to climate change, we're particularly bad at at the moment, and will probably be something that needs its own solutions in the next 10-20 years, even as we start to get used to dealing with climate change. To some extent, we're just not living enough space for animals, and enough different kinds of spaces, which might end up putting further limits on what we can use.\n\nBut given that we're currently feeding 7.9 billion people, and so could probably feed 10.5 billion people without putting new tech into it, if we could deal with waste, then peaking at 9.7 billion as [some people estimate](https://www.sciencedaily.com/releases/2020/07/200715150444.htm), would give us some leeway in terms of food production, hopefully something we can find ways to do that doesn't lead to quite as much death of wild animals and insects.", "is_submitter": false, "distinguished": null, "created_utc": 1630285213.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "dogs_like_me", "id": "haw2wb2", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #156", "submission": "pe3c0h", "stickied": false, "body": "Bro, we all kinds of fucked. Don't forget that whole climate change thing fucking with our resource availability as well, not to mention energy resources on the decline while energy demand is blowing up with less-developed countries all over the world catching up to the resource hogs.", "is_submitter": false, "distinguished": null, "created_utc": 1630297082.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "SuddenProfile", "id": "haujzhg", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "pe3c0h", "stickied": false, "body": "No. Perpetual growth is never sustainable in a finite environment. Our best hope is to increase the size of the environment, while also allowing natural declines in reproduction rates (not pressuring people who don't want kids to have kids, making adoption more available...).", "is_submitter": false, "distinguished": null, "created_utc": 1630270338.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "cocobisoil", "id": "hauyh02", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #87", "submission": "pe3c0h", "stickied": false, "body": "There are enough resources for everything to thrive we just don't divide them equally & use abuse as the foundation for our economic model.", "is_submitter": false, "distinguished": null, "created_utc": 1630276824.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "agaminon22", "id": "hav01yr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #174", "submission": "pe3c0h", "stickied": false, "body": "Obviously not forever. Luckily, growth isn't infinite. Pretty much every developed country in the world has stagnated or is actually shrinking.", "is_submitter": false, "distinguished": null, "created_utc": 1630277556.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "TommyWiseau22", "id": "hav99qu", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #245", "submission": "pe3c0h", "stickied": false, "body": "i like how th down voat button sais this is shit lol", "is_submitter": false, "distinguished": null, "created_utc": 1630282023.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "patricktoba", "id": "hav9b3i", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #39", "submission": "pe3c0h", "stickied": false, "body": "There will be a Great Culling soon I believe. I have a feeling Covid is going to wipe out a couple billion people as the mutations start to become crazy deadly over the next 5 years or so. All of the other collapse factors will also help with the cull. Climate disasters, starvation, more war, and a fuckton of mass shootings are coming.", "is_submitter": false, "distinguished": null, "created_utc": 1630282042.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "floofandmemes", "id": "havbvsb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #149", "submission": "pe3c0h", "stickied": false, "body": "Population growth rates are never constant nor fully predictable. Generally populations have grown when we have more resources, yet wealthier countries today often have lower than replacement fertility rates. Even if we get more food, population growth is likely to stagnate as more and more countries become developed, as modern life significantly reduces incentives and sometimes outright discourages reproduction. It'll stop either from cultural and economic changes or from capping out our resources, most likely the former.\n\nTL:DR, we'll be fine, population growth has never been and never will be a problem for us. The use of carbon-based fuels, toxic pollutants, and humanity's infinite potential for stupidity are far more significant threats.", "is_submitter": false, "distinguished": null, "created_utc": 1630283317.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "Alatain", "id": "havctha", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pe3c0h", "stickied": false, "body": "Honestly, if we do it correctly, we can go far further than any main predictions while still giving vast amounts of open land to wildlife conservation. We can hit a trillion people and still be better than what we are doing today. We can even do this within the realm of existing technologies today. \n\nhttps://youtu.be/8lJJ_QqIVnc", "is_submitter": false, "distinguished": null, "created_utc": 1630283777.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "obiwanlenobi", "id": "havefdm", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "pe3c0h", "stickied": false, "body": "I definitely think we can. Less and less people are having children as time goes on. If the trend continues, I think we could see a population drop in the next 40 to 50 years. The thing is, almost no one has ever been right about what will happen in the future, so perhaps it will become popular again to have a lot of children; if that does happen, poverty will be the same as a death sentence and likely only the upper class will have a chance of survival. Although, even if we do have a drop in population, we will still eventually run out of resources unless we extend our reach to other worlds.", "is_submitter": false, "distinguished": null, "created_utc": 1630284555.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "TSM-", "id": "havwn3t", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #39", "submission": "pe3c0h", "stickied": false, "body": "Poorer, more poverty stricken communties and countries are especially affected by overpopulation. The higher the chance of offspring being unviable or dying is correlated with how many offspring animals produce, and this also proves true for humans, as data shows. Inevitably, this means overpopulation is going to be concentrated in poverty stricken areas that are least accessible for humanitarian aid. So yeah, there are gonna be some expected disasters on this front, I expect it to be migration from poor to wealthy countries as the poorer nations have way higher amount of children per capita and the wealthy countries are <2", "is_submitter": false, "distinguished": null, "created_utc": 1630293621.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "arr4k1s", "id": "haw3b7q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #90", "submission": "pe3c0h", "stickied": false, "body": "We can't sustain it the way we live now and I wish there were less people. But I heard about a study that found that life could be sustainable for 8 billion if we made some changes to the way we live.", "is_submitter": false, "distinguished": null, "created_utc": 1630297316.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "amitym", "id": "haw4wtz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pe3c0h", "stickied": false, "body": "i.  Yes, easily, but not without changing the way we do a lot of things.\n\nii.  What is \"this population growth?\"  In many highly developed countries, birth rates are now negative.  If we assume that every developing society will hit that point in the near future, then we are looking at negative growth in the long term -- obviously that is something we can maintain as long as we like.\n\niii.  In a sense, it is already stopping.  It's just that unlike individual humans or humans in small groups, humanity as a whole doesn't work out a plan, announce it in advance, and then declare one day, \"Okay this is the day, this is it.\"  Humanity as a whole is more like a cargo supercarrier.  It takes a while to turn or slow down.  But I think this is what that looks like -- we are bringing population growth to a halt.  It's happening right now.  You are living through it.", "is_submitter": false, "distinguished": null, "created_utc": 1630298254.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "Cheomesh", "id": "hawf53s", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #24", "submission": "pe3c0h", "stickied": false, "body": "Not really.", "is_submitter": false, "distinguished": null, "created_utc": 1630305462.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "Alert_Watercress4998", "id": "hawhr3q", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #34", "submission": "pe3c0h", "stickied": false, "body": "Most definitely not. Resources are finite and the atmosphere is getting worse and worse", "is_submitter": false, "distinguished": null, "created_utc": 1630307577.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "maniacallyhappy", "id": "hawkt57", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #373", "submission": "pe3c0h", "stickied": false, "body": "Global population growth rate is declining thanks to economics tilting over from \"We need a workforce to subsist\" to, \"Kids are expensive\". If I remember correctly, projected population predictions say we will probably never see 9 billion. \nWith current resources, we can sustain the population. Problem is that under current conditions, projected seasons left in our agricultural top soil is roughly about 60 seasons, which is VERY concerning as our agricultural systems are not long term sustainable. \nThere are amazing farmers that are currently working on sustainable farming methods that revolve around grass feeding and finishing their livestock, but it wont do anything if we dont kick useless subsidized cash crops for the sake of biofuels, especially with the advent and emergence of EV's. But it'll be too little too late without mass adoption of these practices to preemptively begging to renew top soil to continue to grow harvests. This is all not taking into account how soon fresh water will be recognized as the greatest commodity seeing how water supplies are becoming privatized in 3rd world countries.\nI fear the world that lies ahead for my children's children seems bleak given how everything moves in this world thanks to an unabated relentless pursuit of money.", "is_submitter": false, "distinguished": null, "created_utc": 1630310169.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "OstensibleBS", "id": "hay01yb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Druid #9", "submission": "pe3c0h", "stickied": false, "body": "Short answer no, long answer we're fucked", "is_submitter": false, "distinguished": null, "created_utc": 1630340109.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "neolthrowaway", "id": "haz6vv2", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #338", "submission": "pe3c0h", "stickied": false, "body": "Yes. Population explosion and resource limitations are debunked malthusian economics.\n\nPopulation growth is not a crisis. The crisis is going to be population stagnation or even shrinking once we reach 10-12 billion of population.", "is_submitter": false, "distinguished": null, "created_utc": 1630357840.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "anuddahuna", "id": "hav46dk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #302", "submission": "pe3c0h", "stickied": false, "body": "We can do way more like 10-20 billion\n\nJust not at western standards of living", "is_submitter": false, "distinguished": null, "created_utc": 1630279519.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "Study_Tryhard", "id": "haxosts", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #252", "submission": "pe3c0h", "stickied": false, "body": "Nah, we really need to cut down on 3rd world countries with people having like 6-8 kids each, and modern countries where most people have 2-3 kids, we really need that 1 child policy china had but globally, we will reach 11b people and just be completely fucked over because millenials couldnt keep it in their pants", "is_submitter": false, "distinguished": null, "created_utc": 1630335375.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "PsychAce", "id": "hauws95", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #310", "submission": "pe3c0h", "stickied": false, "body": "No and I agree with Thanos", "is_submitter": false, "distinguished": null, "created_utc": 1630276061.0, "parent_id": "t3_pe3c0h", "replies": []}, {"author": "raedr7n", "id": "hav5at2", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #49 | Legio Virtus", "submission": "pe3c0h", "stickied": false, "body": "Yes. We can sustain it forever. Ours is the chosen species to consume the resources of the infinite universes, superseding whatever gods there might be in the process. Humanity will overcome the heat death and outlive reality itself; I guarantee it.", "is_submitter": false, "distinguished": null, "created_utc": 1630280066.0, "parent_id": "t3_pe3c0h", "replies": [{"author": "MisanthropicScott", "id": "hawhvrz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "pe3c0h", "stickied": false, "body": "/s?", "is_submitter": false, "distinguished": null, "created_utc": 1630307685.0, "parent_id": "t1_hav5at2", "replies": []}]}]}