{"title": "Don't you think that the IPCC report still isn't showing the real depth of our climate crisis?", "name": "t3_pf2ugf", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pf2ugf/dont_you_think_that_the_ipcc_report_still_isnt/", "selftext": "", "score": 17, "upvote_ratio": 0.95, "permalink": "/r/TheFlyingTree/comments/pf2ugf/dont_you_think_that_the_ipcc_report_still_isnt/", "id": "pf2ugf", "author": "ThickEffective1265", "link_flair_text": "Question", "num_comments": 31, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630404413.0, "comments": [{"author": "boobiebuy", "id": "hb1kdwi", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #250", "submission": "pf2ugf", "stickied": false, "body": "It's already depressing af so why wouldn't they tell the whole thing? Wouldn't really make a difference.\n\nMaybe they want us to be hopeful", "is_submitter": false, "distinguished": null, "created_utc": 1630408121.0, "parent_id": "t3_pf2ugf", "replies": [{"author": "NoSuchKotH", "id": "hb1lmfg", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pf2ugf", "stickied": false, "body": "They don't tell it because we don't know how severe the situation is already. It is very hard to model such a complex system with all its components. E.g. in the 90s the most favored model showed discrepancies in CO2 increase, as the uptake of the oceans was underestimated. And, of course, it was used by neighsayers to discredit the whole model. We still have plenty of things in the model that we can only guess. Thus the predictions are a \"safe assumption\" of what is likely going to happen. It could get much worse. Or less so. We just don't know.", "is_submitter": false, "distinguished": null, "created_utc": 1630408939.0, "parent_id": "t1_hb1kdwi", "replies": []}]}, {"author": "amitym", "id": "hb1zq6o", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pf2ugf", "stickied": false, "body": "I agree, probably not.\n\nThe reason is, I think, due to a subtle but important cognitive bias among experts in the field.\n\nSo, climate scientists build models, right?  And these models comprise some set of parameters, based on what we know of how the real world works.  What I have observed, based on conversation with climate people over the years and on some of the things they write, is that when building any such model, you are inevitably going to run into parameters whose values you just don't know.  An average layperson like me wouldn't have any idea what to put for such a value.  We wouldn't even begin to know what kind of range to expect.  That is where scientific expertise comes into play.  Someone who has spent their life studying the interactions of various factors in real world climate data actually is going to have an idea of what to put there.\n\nThis requires a certain degree of scientific intuition.  That is ubiquitous in science.  All good researchers have that, and use it.  But here's the thing.  Scientific intuition is honed from years of experience -- *past* experience.  With past data.  So if we're all climate researchers and we all get together at some conference, one of the things we're going to talk about is what kind of estimates we're all making.  Maybe you think that when it comes to hoosgowgaskets per hectare -- a vital parameter for modeling the climate -- a reasonable range of values is between 100 and 150.  Maybe I, far more radical, argue that a reasonable range is between 250 and 750 hph.  Both of us base our estimates on our own intuition, honed from years of experience studying hoosegogasketry in nature and in the archeological record.\n\nSo we have this big debate, you end up creating your model, I end up creating my model, and maybe there are some other various models.  And collectively we all look at all the models, and we all say together, well, we don't all completely agree on the exact details, but at least we now have a range of possible outcomes, from the cautious estimate to the \"runaway hoosegowgasketry\" model on the other end.  From those models we distill a range of expected outcomes:  average sea levels will rise 5cm in the next century.  Or they will rise 10cm.  Or maybe 20cm.\n\nBut as Cate Blanchett once said... we are all of us deceived.\n\nThe problem is that nothing during the past 50 million years has ever come close to what is going on with the Earth right now.  Our intuitions are all out of date, because our experience of the past is inadequate to the scale of change today.  What happens is that over the next few years, some new hoosegowgasket data comes in, and we see that the actual hph value has gone from 50, to 500, to 1500.  All of our estimates were blown.  We all try to regroup and adjust our models... now we're saying maybe 50cm in a century, maybe 100cm.\n\nBut we're still just reacting, still making estimates based on past experience.  So we are going to make the same mistake again, and again.  In a sense, you can see it as a more subtle version of what many laypeople experience when trying to grasp the magnitude of what is happening around them.  They can't.  The most emotionally vulnerable retreat into complete denial.  Scientists aren't denialists, but they too struggle to adjust to the scale of the calamity.\n\nSo my hypothesis is that this phenomenon, of climate estimates being inadequate, will persist until an entire generation of climate scientists comes of age in the time of great change, whose expertise is thoroughly \"at home\" with the calamity.\n\nIn the meantime, you should probably mentally exaggerate every estimate they publish.  Eventually they will catch up.", "is_submitter": false, "distinguished": null, "created_utc": 1630416676.0, "parent_id": "t3_pf2ugf", "replies": [{"author": "plasma_phys", "id": "hb29s46", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #111", "submission": "pf2ugf", "stickied": false, "body": "This is a good post, but wanted to chime in and say that computational physicists do have tools to combat this - uncertainty quantification and/or uncertainty analysis. Put simply, if a parameter in a model is uncertain, one can run an ensemble of simulations for many values of that parameter and, using some fun math, determine the sensitivity of the model to the parameter. If you sample the values of the parameter from a normal or long-tailed distribution, you're going to be including not just the \"reasonable\" values, but also completely unreasonable ones (which may or may not be more realistic). No best-practices model would be using hand-tuned parameters without UQ.\n\nAre these tools always used? Nope! But a quick Google scholar search immediately pulls up a half dozen review papers on uncertainty analysis in climate modeling, so I wouldn't be surprised if the field is well aware of such pitfalls already. However, if a model is missing key *physics*, no amount of uncertainty quantification will bridge that gap.", "is_submitter": false, "distinguished": null, "created_utc": 1630421035.0, "parent_id": "t1_hb1zq6o", "replies": [{"author": "NoSuchKotH", "id": "hb2ez8k", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pf2ugf", "stickied": false, "body": "The field is indeed aware of this. These concerns have been brought up back in the 80s already. Models have been adjusted and refined over time. Sensitivities to values that cannot be measured has been reduced. Lots of values that were previously unknown have been measured in the past decades and our models are now much better.\n\nThat said, there is still a lot of guesswork. E.g. we don't know how much methane is in the deap sea. We don't know how much of it might get released due to the increasing acidity of the oceans (CO2 in water forms carbonic acid). All we know is that it's already affecting reefs, which in itself is already terrifying.", "is_submitter": false, "distinguished": null, "created_utc": 1630423163.0, "parent_id": "t1_hb29s46", "replies": []}, {"author": "amitym", "id": "hb2f3fp", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pf2ugf", "stickied": false, "body": "Thanks for that observation!\n\nI would love to learn that computational methods of bias correction were sufficient to quickly improve the overall accuracy of climate models.  As a complete outsider with only a generally concerned planet-dweller's relationship to the field, I am probably at least a few years behind in my sense of what is current.\n\nBut even so, as far as I can tell, \"consensus\" climate predications and even the extreme outlier models still consistently fail to predict just how rapidly our climate is going to change from one year to the next.  And the bias is almost all in one direction.  I can think of only a very few cases where some factor in climate dynamics was changing more slowly than the models predicted.  It's overwhelmingly the other way.\n\nSo is this a \"methods\" issue?  Are people culturally not open to the information that systematic bias analysis can provide?  Is it really the physics (or whatever fundamentals) that are lacking in these cases?", "is_submitter": false, "distinguished": null, "created_utc": 1630423209.0, "parent_id": "t1_hb29s46", "replies": [{"author": "plasma_phys", "id": "hb2ltws", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #111", "submission": "pf2ugf", "stickied": false, "body": "All good questions! Anecdotally at least, I have observed a lot of resistance to UQ and updating assumptions in my own field. UQ is new enough (not widely used in the big fusion research programs until about a decade ago) that many people simply don't know anything about it, and either ignore it or downplay its usefulness. If you've been modeling fusion plasma for 50 years and continuously matching experiments to within experimental error, why would you bother learning new mathematics to quantify model error? However, modeling for fusion is, relative to climate modeling, low stakes! There's very little incentive to update assumptions on model parameters when you're, say, modeling a machine that won't have first plasma until 2025.\n\nClimate modelers, however, have every incentive to get things right. Climate is easier to observe than an experiment that doesn't exist yet! As an outsider looking in, my impression is that many of the climate modeling misses in the past few decades have indeed been missed physics. Two that come to mind are the effect of clouds on climate and the effect of climate on specific weather events. For example, as far as I know, it's still not well understood what exactly about a warming climate is influencing the power and rainfall associated with hurricanes.", "is_submitter": false, "distinguished": null, "created_utc": 1630425929.0, "parent_id": "t1_hb2f3fp", "replies": []}]}]}]}, {"author": "ianovic69", "id": "hb1wrd3", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #216", "submission": "pf2ugf", "stickied": false, "body": "I'll just leave [THIS](https://www.amazon.co.uk/photos/share/dDMaU0z9oX85hgD1HH7dU8t8aTqePWivG9I5clLEKbq) here", "is_submitter": false, "distinguished": null, "created_utc": 1630415253.0, "parent_id": "t3_pf2ugf", "replies": [{"author": "ThickEffective1265", "id": "hb27k3g", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #293", "submission": "pf2ugf", "stickied": false, "body": "Holy shit man !!", "is_submitter": true, "distinguished": null, "created_utc": 1630420104.0, "parent_id": "t1_hb1wrd3", "replies": [{"author": "ianovic69", "id": "hb2cg50", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #216", "submission": "pf2ugf", "stickied": false, "body": "Worrying isn't it?\n\nAnd when you take the skeptical through it slowly, the look in their eyes as they realise how obvious it is, gives me no satisfaction whatsoever.", "is_submitter": false, "distinguished": null, "created_utc": 1630422129.0, "parent_id": "t1_hb27k3g", "replies": [{"author": "ThickEffective1265", "id": "hb2dcoi", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #293", "submission": "pf2ugf", "stickied": false, "body": "It's a real eye-opener", "is_submitter": true, "distinguished": null, "created_utc": 1630422497.0, "parent_id": "t1_hb2cg50", "replies": []}]}]}]}, {"author": "Gundamu0079", "id": "hb1js0b", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #257", "submission": "pf2ugf", "stickied": false, "body": "I cNt tell", "is_submitter": false, "distinguished": null, "created_utc": 1630407706.0, "parent_id": "t3_pf2ugf", "replies": []}, {"author": "cocobisoil", "id": "hb1qds0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #87", "submission": "pf2ugf", "stickied": false, "body": "I don't think we know how severe the problem is so I don't think the report is accurate, maybe as accurate as can be? I don't know.\n\nWhat I do know is we're putting in place feedback loops we had no idea existed. Too many unknown unknowns. We're fucked unless we stop immediately & even then a lot of people will suffer unless we change our attitude to living things on this planet.", "is_submitter": false, "distinguished": null, "created_utc": 1630411846.0, "parent_id": "t3_pf2ugf", "replies": []}, {"author": "bernpfenn", "id": "hb2ixxp", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #45", "submission": "pf2ugf", "stickied": false, "body": "any mention of increasing methane? no.", "is_submitter": false, "distinguished": null, "created_utc": 1630424764.0, "parent_id": "t3_pf2ugf", "replies": []}, {"author": "Immelmaneuver", "id": "hb2nlhr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #20", "submission": "pf2ugf", "stickied": false, "body": "Of course it's worse.  It's always worse.  Why did I have to buy land in a coastal state?", "is_submitter": false, "distinguished": null, "created_utc": 1630426641.0, "parent_id": "t3_pf2ugf", "replies": []}, {"author": "haz_mat_", "id": "hb2pxey", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #193", "submission": "pf2ugf", "stickied": false, "body": "We have no idea what we are messing around with. I think the earth will shake us off like a bad case of fleas.", "is_submitter": false, "distinguished": null, "created_utc": 1630427579.0, "parent_id": "t3_pf2ugf", "replies": []}, {"author": "SybariteAussie", "id": "hb1ip2k", "score": -10, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pf2ugf", "stickied": false, "body": "Geologists suggest that climate change is constant. The earths axis rotates slowly, our sun has a recorded history of minimums & maximums. Both effect weather & climate. They used to call it global warming. Not sure when it changed to climate change? Was a clever move as the term climate change is ambiguous & open to interpretation. They will use this cudgel to justify more taxes. Those with “The vision of the anointed” prefer to travel in private jets, stay in swank hotels & dine in fancy restaurants. Carbon tax paid by the peasants could finance this? Income tax was introduced during WW1 & we were assured it was only temporary. Nixon removed US$ from the gold standard in the 70s as a temporary measure. Lockdowns will help “flatten the curve”…..", "is_submitter": false, "distinguished": null, "created_utc": 1630406936.0, "parent_id": "t3_pf2ugf", "replies": [{"author": "NoSuchKotH", "id": "hb1ky2q", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pf2ugf", "stickied": false, "body": ">Not sure when it changed to climate change?\n\nIt changed in the mid 90s\n\n>Was a clever move as the term climate change is ambiguous & open to interpretation.\n\nIt was not a PR gag. It was not to make it ambiguous or open to interpretation.\n\nIt was made because the former term, global warming, as coined by mass media in the late 70s was inaccurate. By at latest mid 80s it was already clear that it was a change, not necessarily a warming as different areas would exhibit different weather pattern changes. Even on the North American continent, there will be areas that will see increased temperatures, while others will see a cooling down. Not to mention the eternal winter that Europe will see if/when the Gulf Stream collapses.\n\nYou seem to believe that this is all a hoax. But rest assured, all climate scientists agree that humans have changed our climate quite considerably and at a never preceded scale. The only disagreement is, whether we still have a chance to revert it before it causes irreparable damage to our economy and livelihoods. And don't worry. There will be taxes. You will pay. But in a couple of years you will also wish that you paid much more.\n\nHeck, a lot of the changes are already visible to the naked eye, yet people look away and pretend it isn't there. Exactly the same way as they did when forests were dying in the 60s and 70s....", "is_submitter": false, "distinguished": null, "created_utc": 1630408500.0, "parent_id": "t1_hb1ip2k", "replies": [{"author": "SybariteAussie", "id": "hb1o8ct", "score": -7, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pf2ugf", "stickied": false, "body": "My point is that climate change is constant. A wise scientist will run with the herd. Split & risk being picked off by predators. Velikovsky was canceled in the 70s. A cabal of angry scientists (lolz), forced Velikovsky’s publisher to cease printing a best seller. Has academia begun to become somewhat similar to, or reminiscent of some religions? Science is cool because of the scientific method. When science is no longer open to questions or debate it ceases being science. Is it propaganda, is it dogma? I’m worried about the Amish! If mayhem begins in America, who ever seeks to replace them should send a modern version of the Swiss guards that protected the Vatican when Rome was being plundered. It would be a PR coup! Justin T would have some lustre added to his & Canada’s reputation if he was to send troops. If Mexican cartels flew in to protect the Amish things could become extremely confusing! If Kamala can organise world heritage protection status for the Amish, the glory will be hers. 🖖", "is_submitter": false, "distinguished": null, "created_utc": 1630410570.0, "parent_id": "t1_hb1ky2q", "replies": [{"author": "NoSuchKotH", "id": "hb1vqv2", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pf2ugf", "stickied": false, "body": "Climate change is not constant. While it is true that earth climate has always been changing. It is now changing much much faster. Magnitudes faster than ever before. XKCD did a nice [visualization](https://xkcd.com/1732/) of this a while ago. Scroll through it, I'll be waiting for you.\n\nAs you, hopefully saw, Temperatures have changed more in the last 100 years, than at the fastest rate, after the last ice age, in a 1000 years. If that is not worrying you, I don't know what will.\n\nAnd no, we scientists (although i am not in climat science) do not follow a religion. Science is not a believe system. We also do not form cabals or go where the money tells us to go. Sure, some topics are more easy to get funded than others. But most of the research done worldwide is publicly funded in open-ended research. There is no \"find this answers\" type of research.\n\nI do not get where you get the impression that science should not be open to questions anymore. It is. And scientists contradict each other constantly. You just don't see this as it is hidden in scientific publications and buried in lots and lots of jargon. Heck, my research is based on the assumptions that flicker noise does not exist. Which goes against what everyone else in engineering and physics believes and that \"everyone\" means literally everyone, as I am the only one with this hypothesis. I still get grands and I am still a respected figure in my community. It does not matter what I believe or what I try to show. All that matters whether I work in a scientifically acceptable manner. And believe me, the repercussions for not working scientifically sound are harsh.\n\nBut it's Joe Average people like you who question the integrity of scientists. People like you who have not even a university degree, much less done science in any capacity. Yet you think that people are dogmatically spewing propaganda. People whom you have never met, who's work you have never read, and, quite frankly, don't have the knowledge to understand.\n\nUnless you get up from your lazy ass, and actually talk to scientists, walk in their shoes for a while, I deny you the right to talk down on them and discredit their work.", "is_submitter": false, "distinguished": null, "created_utc": 1630414746.0, "parent_id": "t1_hb1o8ct", "replies": [{"author": "SybariteAussie", "id": "hb2cvua", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pf2ugf", "stickied": false, "body": "Perhaps this is part of the cycle? The earths precession takes a long time. Rumours of a planet 9 given some credibility by Sumerian artefacts. Cuneiform writing has been deciphered & deserves further research. Perhaps there’s a longer cycle & a planet 9 or similar causes havoc in our galaxy every 500 precessions? Flood myths in cultures on every continent etc. Our civilisation is young. The tactics utilised in promotion of these views are the source of my hesitancy. People who think they know best are capable of committing atrocities as it’s for the greater good in their minds. Is scientific agnosticism a thing, or did I just make that up? 🤔It sounds nice, so I’m going to roll with that. A political sceptic, scientific, agnostic Mr Magoo, investigates the internet, undaunted by many setbacks, like a tourist he goes opinion exploring. *Gasping often at, opinion enthusiasts febrile zeal* there’s several discoveries, initially ridiculed are now accepted practice. Passionate debate is a positive! Making disagreement a form of scientific heresy seems unwise. Let the ugly ones speak & the flat earthers. We know who they are then & to avoid them. There’s people who identify as vampires and werewolves , they don’t get banned from public discourse. I prefer to not think what would happen to someone saying that 100 years ago. We have come a long way. Seem to be taking a step backwards,  culturally & politically. Uni professors & doctors losing jobs for expressing a different perspective. Hmmm smells a bit suspicious. I put the idea back on the shelf. It has become pungent from the coercion behind it & no longer sits well on my palate. The utilisation of Greta could face critique in the future from historians? I try to not notice sales & manipulation techniques, would be nice to believe, but I can’t. I am genuinely enjoying observing the unique events occurring. The way that words can change meaning swiftly. Some truly gifted linguistic gymnasts giving speeches with the conviction and blazing eyes of a fundamental Christian/Baptist etc preacher. While I may disagree with some. I can still appreciate the tactics & methods used or be critical. I don’t have a political party I identify with anymore. Unfettered by thoughts regulations I can lift lots of stones & have a look what’s under them 🖖", "is_submitter": false, "distinguished": null, "created_utc": 1630422308.0, "parent_id": "t1_hb1vqv2", "replies": []}]}]}]}, {"author": "Muroid", "id": "hb1p5wu", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "pf2ugf", "stickied": false, "body": "https://www.climate-lab-book.ac.uk/2020/2019-years/\n\nYes, temperatures fluctuate throughout history. You can see as much on the graph in this link. I’ll ask if you can see the difference at all between the last 2,000 years and what is happening now.\n\nEdit: The link is suddenly down for me, so here’s an archived version of the site in case it’s still down for anyone else when they see this comment: https://web.archive.org/web/20200202220240/https://www.climate-lab-book.ac.uk/2020/2019-years/", "is_submitter": false, "distinguished": null, "created_utc": 1630411134.0, "parent_id": "t1_hb1ip2k", "replies": [{"author": "amitym", "id": "hb1vs1l", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #14", "submission": "pf2ugf", "stickied": false, "body": "Those who are willfully blind will never see.\n\nBut thanks for posting that!", "is_submitter": false, "distinguished": null, "created_utc": 1630414763.0, "parent_id": "t1_hb1p5wu", "replies": []}, {"author": "SybariteAussie", "id": "hb1xk07", "score": -2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pf2ugf", "stickied": false, "body": "Your compassion is laudable! I remember being staunchly anti whaling as a child. Was horrified to see baby seal cubs thumped with these slightly wobbly clubs on the news. They were slain for their white fur to make hats & accessories. It was ended, that was a good thing. My opinions on whaling have changed. If Japanese people eat most of the whale & utilise the rest. We should permit them to eat some. The slogan of dolphin free tuna has made me ponder. Have I eaten dolphin in the past & not know? I am not a vegetarian. It’s a resource that can be managed like other fish species. It could be deemed as a cultural event by some fishing communities? Basic people discuss other people, regular people discuss or recall events or occasions, then there’s the people that discuss concepts. Am crudely quoting someone? Everyone is entitled to a opinion. Dialogue is good. Everyone should be encouraged to share their thoughts. Prohibition with ideas will have consequences. Am not clever enough to predict what that would be. Professors or doctors with a different opinion being sacked or being shunned & cancelled for offering their version of reality happens. A form of neo excommunication. History rhyming.", "is_submitter": false, "distinguished": null, "created_utc": 1630415643.0, "parent_id": "t1_hb1p5wu", "replies": [{"author": "Muroid", "id": "hb290vj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #128", "submission": "pf2ugf", "stickied": false, "body": "I’m not sure that noticing that your own house is on fire with you inside it requires a whole lot of compassion, to be honest.", "is_submitter": false, "distinguished": null, "created_utc": 1630420720.0, "parent_id": "t1_hb1xk07", "replies": [{"author": "NoSuchKotH", "id": "hb2fckt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pf2ugf", "stickied": false, "body": "I don't thinks SybariteAussie notices he is rambling incoherently. He changes topics almost every sentence.", "is_submitter": false, "distinguished": null, "created_utc": 1630423311.0, "parent_id": "t1_hb290vj", "replies": [{"author": "SybariteAussie", "id": "hb2fuc9", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pf2ugf", "stickied": false, "body": "I refer to these events as concept cascades.", "is_submitter": false, "distinguished": null, "created_utc": 1630423509.0, "parent_id": "t1_hb2fckt", "replies": []}]}, {"author": "SybariteAussie", "id": "hb2gnj7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pf2ugf", "stickied": false, "body": "A nice analogy. Is the “Build back better* slogan utilising onamatopoeia? Implying a bashing sound & that it’s going to be pushed through with no f*cks given about what the peasants think? 🤔I am merely lifting rocks & not making statements.n", "is_submitter": false, "distinguished": null, "created_utc": 1630423837.0, "parent_id": "t1_hb290vj", "replies": []}]}]}]}]}, {"author": "El_Duque_Caradura", "id": "hb1l5o6", "score": -5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #296", "submission": "pf2ugf", "stickied": false, "body": "Because it's the story of Peter and the Wolf: they've been telling during decades that the world would over if we didn't change inmediately (I remember data from the 60') and we didn't change for good, we even go worse and guess what... The world stills here. Even with 1 month of quarantine the whole show a recovery that shocked us. So the IPCC loose a lot of legitimity to keep threatening.", "is_submitter": false, "distinguished": null, "created_utc": 1630408638.0, "parent_id": "t3_pf2ugf", "replies": []}, {"author": "Paul_Thrush", "id": "hb1wjsw", "score": -3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "pf2ugf", "stickied": false, "body": "Do you really think the internet needs more conspiracy? Do we really need *more* hype about climate change?", "is_submitter": false, "distinguished": null, "created_utc": 1630415150.0, "parent_id": "t3_pf2ugf", "replies": [{"author": "NoSuchKotH", "id": "hb2fly1", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #91", "submission": "pf2ugf", "stickied": false, "body": "No, we don't need more conspiracies. But yes, we need more hype about climate change.\n\nBack in the 70s and 80s, the hype about acid rain and forest decline helped save our forests. It's now time to do the same with the bigger problem.", "is_submitter": false, "distinguished": null, "created_utc": 1630423416.0, "parent_id": "t1_hb1wjsw", "replies": []}]}]}