{"title": "Did you ever suffer of a mental illness?", "name": "t3_p4ts80", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p4ts80/did_you_ever_suffer_of_a_mental_illness/", "selftext": "If yes tell me your story", "score": 8, "upvote_ratio": 0.83, "permalink": "/r/TheFlyingTree/comments/p4ts80/did_you_ever_suffer_of_a_mental_illness/", "id": "p4ts80", "author": "ToniMCP109", "link_flair_text": "Question", "num_comments": 34, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629035554.0, "comments": [{"author": "SuddenProfile", "id": "h918rsh", "score": 9, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "p4ts80", "stickied": false, "body": "Autism, PTSD, MDD, and GAD here. My parents were part of an IRL cult that both worshipped autistic traits and suspected autism was demonic posession, so I got caught between their conflicted opinion.\n\nForced fasting, cleansing rituals, encouraged self harm, and the looming \"ascension\" ritual - prolonged torture, the only description they'd give - caused the development of everything but autism.\n\nInterestingly, autism makes me much better at my job and has helped me skip about four years ahead of my neutotypical colleagues in career growth (that's a lot at 22), and gives me about 20% more income.", "is_submitter": false, "distinguished": null, "created_utc": 1629037819.0, "parent_id": "t3_p4ts80", "replies": [{"author": "ganznormal", "id": "h91iwyd", "score": 6, "subreddit": "TheFlyingTree", "author_flair": "Seeker #139", "submission": "p4ts80", "stickied": false, "body": "I'm sorry you went through that abuse, that sounds awful. \n\nGood thing you are out of that cult now and can build your own life (being financially independent and all that). All the best going forward!", "is_submitter": false, "distinguished": null, "created_utc": 1629042297.0, "parent_id": "t1_h918rsh", "replies": [{"author": "SuddenProfile", "id": "h91j5l9", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "p4ts80", "stickied": false, "body": "Thanks :)", "is_submitter": false, "distinguished": null, "created_utc": 1629042397.0, "parent_id": "t1_h91iwyd", "replies": []}]}, {"author": "dashingThroughSnow12", "id": "h9399sj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p4ts80", "stickied": false, "body": "Autism is not mental illness.", "is_submitter": false, "distinguished": null, "created_utc": 1629069247.0, "parent_id": "t1_h918rsh", "replies": [{"author": "SuddenProfile", "id": "h93hwed", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "p4ts80", "stickied": false, "body": "Right. It's a neurodevelopmental condition. :) it's fairly well tied to the anxiety and the partial cause of the events that lead to depression and PTSD though.", "is_submitter": false, "distinguished": null, "created_utc": 1629073425.0, "parent_id": "t1_h9399sj", "replies": []}]}, {"author": "FirstUser", "id": "h95c8ee", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #127", "submission": "p4ts80", "stickied": false, "body": "What cult was that?", "is_submitter": false, "distinguished": null, "created_utc": 1629116251.0, "parent_id": "t1_h918rsh", "replies": [{"author": "SuddenProfile", "id": "h95dw0l", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "p4ts80", "stickied": false, "body": "A secret \"Pentecostal\" church that infiltrated about a dozen Baptist churches and recruited \"spiritual warriors\" for special sessions in an unmarked church.", "is_submitter": false, "distinguished": null, "created_utc": 1629117189.0, "parent_id": "t1_h95c8ee", "replies": []}]}]}, {"author": "Nothemagain", "id": "h916p8u", "score": 13, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #134", "submission": "p4ts80", "stickied": false, "body": "This one time I was invited to join a cult....everyone said I was crazy for joining...in the end i guess they were right... I mean a cult about a tree that flys... How could I bee sooo stupid....Turns out there really was a flying tree...some guy connected a bunch of ceiling fans to a baobab tree... Couple of people peed themselves they thought the world was ending or just beginning I can't remember on account of the tree gaining sentience plus the wine was pretty good it just makes you sleep tho.", "is_submitter": false, "distinguished": null, "created_utc": 1629036848.0, "parent_id": "t3_p4ts80", "replies": [{"author": "DmitryTheRussianSpy", "id": "h932j0k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #103", "submission": "p4ts80", "stickied": false, "body": "Hey! Me too!", "is_submitter": false, "distinguished": null, "created_utc": 1629066087.0, "parent_id": "t1_h916p8u", "replies": []}]}, {"author": "Alirezahjt", "id": "h9166od", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "p4ts80", "stickied": false, "body": "Depression and anxiety. Not very severe though, just a few periods of psychiatric helped to resolve it.\n\nAnd there is no story behind it I believe. I have high neuroticism so experiencing anxiety is normal. Kinda used to it. \n\nDepression was during my mandatory military service.", "is_submitter": false, "distinguished": null, "created_utc": 1629036596.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "ToniMCP109", "id": "h91l7jz", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #267 | Classis Veritatus", "submission": "p4ts80", "stickied": false, "body": "To be honest I never went to a professional to diagnose me with anything, but now i feel like i have a lot of anger and sadness trapped inside me because i always used to bottle up my emotions until 2 years ago (I'm 17).", "is_submitter": true, "distinguished": null, "created_utc": 1629043251.0, "parent_id": "t3_p4ts80", "replies": [{"author": "mikczas", "id": "h934usc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #146", "submission": "p4ts80", "stickied": false, "body": "Bruh, I was bottling my emotions till 21, that shit exploded so hard. I’m glad you stopped doing that earlier!", "is_submitter": false, "distinguished": null, "created_utc": 1629067175.0, "parent_id": "t1_h91l7jz", "replies": []}]}, {"author": "koboldkiller", "id": "h91p3zm", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Druid #17 | Legio Virtus", "submission": "p4ts80", "stickied": false, "body": "I never got diagnosed with anything, but I used to have almost all symptoms consistent with Generalized Anxiety Disorder in the DSM 5. Then I smoked weed everyday for a solid 6 months straight and now I don't get anxiety nearly as bad anymore. It's not persistent, to say the least. I'm not qualified to diagnose myself by any means, but I did study psychology for 3 years and I felt informed enough to consider seeing a doctor about it. Never did because I more or less fixed it.\n\nI also was depressed for a lot of my teenage years, but after how shitty last year was, I feel that I've never been better. Nothing can make you turn your life around like being at your lowest point.", "is_submitter": false, "distinguished": null, "created_utc": 1629044880.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "gemini_pain", "id": "h91j2l6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #43", "submission": "p4ts80", "stickied": false, "body": "Never bothered to get officially diagnosed with anything. I wouldn’t be surprised if I had depression at some point though. A condition I wish I would have known about earlier though, my academic level was always exaggerated simply because I was an above average reader and critical thinker. When I think back, I realize just because I wrote a (kind of deep but not really) story in elementary school, my parents thought I was some kind of genius. Apparently the school agreed and put me in gifted classes. As soon as middle school hit, I don’t know why it wasn’t painfully obvious I wasn’t as smart as they thought. It became a horrible balance act. Too smart for regular classes, but too dumb to do well in advanced placement. These days I like to think that averaging a C in advanced classes still meant smarter than average…but it sure didn’t feel like it then. Anything less than B+ was failing in my eyes, it did a number on my self esteem. Yet here we are, years later and understanding those letters meant nothing in the long run😑", "is_submitter": false, "distinguished": null, "created_utc": 1629042362.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "DylanowoX", "id": "h926ql7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #10", "submission": "p4ts80", "stickied": false, "body": "In the process of possibly getting diagnosed with ADHD. \n\nIf I do have ADHD, then it has ravaged all of my goals and passions in life. How? \n\nWell. \n\nADHD is a disorder basically ruining your executive function. Things like transitioning between tasks, staying on one task until completion, concept formation, etc. \n\nSo if I make a goal to play basketball everyday, I’ll probably never get it done. Why? Well, the thought of leaving my bed, changing into basketball clothes, walking, making sure I ate today so I don’t have an upset stomach after exercising, etc requires a lot of energy to do. These are all tasks. It’s hard for me to voluntarily switch between common tasks. (ADHD or not, that is true. It’s not confirmed yet whether ADHD is the cause or not. That’s why I went for a diagnosis). I do relate to a LOT of experiences others have with ADHD, and I check off around 75-85% of the symptoms.\n\nOh, also. Possibly depression around two years ago. Depression or not, here was my life for about a year straight. \n\nEvery day was the same. \n\nMy sense of happiness was completely stripped from me. If something good ever happened, I felt relief that I didn’t actively want to die, as opposed to plain happiness like everyone else. \n\nAt night - every night - I would experience dread. Dread because I knew as soon as I woke up, I’d be alive for another day. And that I hated. \n\nI hated school. Every moment I wasn’t in school was one to be grateful for. Whenever someone said the word “school” I’d just feel a sense of dread and anger. Every day that I was released from school I would feel a sense of disbelief; I couldn’t believe that I was finally released from class. \n\nI had a pathetically low self esteem. It was just ridiculous, man. I hated myself like I was my worst enemy. \n\nIt ended up getting better after I transferred schools and developed a social circle for myself. I’m still not super excited for life, but it may change soon. We’ll see. At least I know I’m nowhere near the level I was two years ago.", "is_submitter": false, "distinguished": null, "created_utc": 1629052264.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "linux_user_13", "id": "h91am92", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4ts80", "stickied": false, "body": "Depression, anxiety, gender confusion suicidal ideation. Just started therapy. Mostly lots leading towards childhood abuse neglect and general non acceptance of being who I really am.", "is_submitter": false, "distinguished": null, "created_utc": 1629038666.0, "parent_id": "t3_p4ts80", "replies": [{"author": "SuddenProfile", "id": "h91jfdb", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "p4ts80", "stickied": false, "body": "Good luck! It hurts at first, but then you start feeling things other than despair and anxiety sometimes. It's really weird.\n\nThe first relapse is awful though. It will happen, just remember that it doesn't cancel your previous progress and that it may be shorter.", "is_submitter": false, "distinguished": null, "created_utc": 1629042511.0, "parent_id": "t1_h91am92", "replies": [{"author": "linux_user_13", "id": "h91zsb2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4ts80", "stickied": false, "body": "Thanks. Right now I’m feeling a lot of invalidation thoughts. Like every thing I was doing before was just to get attention because I’m pathetic. Or it was just a way for me do deal with my feelings because I can’t deal with them like a normal person. All this makes me incredibly embarrassed and fills me with self hatred. I try to stay really busy so I don’t dwell on it. They gave me some meds but I don’t know if they are doing anything. Thanks for giving me a vent. I didn’t mean to dump but talking to a stranger is a good way to vent.", "is_submitter": false, "distinguished": null, "created_utc": 1629049298.0, "parent_id": "t1_h91jfdb", "replies": [{"author": "SuddenProfile", "id": "h92051j", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #147", "submission": "p4ts80", "stickied": false, "body": "Eh, the \"attention\" thing is rare. I've seen it, but only in people who denied they had any problems...\n\nAlso, feelings are hard. I only knew a few before this year.", "is_submitter": false, "distinguished": null, "created_utc": 1629049448.0, "parent_id": "t1_h91zsb2", "replies": []}]}]}, {"author": "synysterlemming", "id": "h9267y9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #138", "submission": "p4ts80", "stickied": false, "body": "Good luck with therapy! Do not be afraid to search for a new therapist (if possible) if you notice that there isn’t chemistry. Finding someone you are comfortable with and can trust are essential and incredibly helpful.", "is_submitter": false, "distinguished": null, "created_utc": 1629052041.0, "parent_id": "t1_h91am92", "replies": [{"author": "linux_user_13", "id": "h938kny", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4ts80", "stickied": false, "body": "I actually got lucky I think. I liked my main therapist right off the bat. She is easy to talk to and makes me at ease.", "is_submitter": false, "distinguished": null, "created_utc": 1629068912.0, "parent_id": "t1_h9267y9", "replies": []}]}]}, {"author": "synysterlemming", "id": "h925x4k", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #138", "submission": "p4ts80", "stickied": false, "body": "Anxiety and depression. Diagnosed at 14, and steadily medicated until I was 21. I certainly have a physiological disposition for such illnesses, but I think external factors and personal worldview drove my symptoms more than anything else. \n\nI certainly do not think my case is “normal”, especially with the family members I have who have similar disorders, but here is the synopsis:\n\nParents divorced at 13, and felt somehow responsible and that my world was falling apart. I looked for bad things happening just to satisfy the obsessive part of my brain and be able to say “See?! Everything is shit!” (I know I still do this from time to time). I loved that “emo” culture as it felt like a place to amplify my feelings. I tried to hide this from my family until one day a friend made his mom drive him over to my place because he was concerned I would commit suicide. From then on things got serious in the family scenario and I started going to a wonderful psychiatrist who kept a fantastic relationship with me and tried to find medications for me. Nothing seemed to help at all with the depression, but some of the SSRIs helped bring down the baseline anxiety level. This meant that ~once per year I changed medications. One medication in particular really fucked me up - that feeling you get when you have to pee in the middle of the night and can’t really tell if you’re asleep or awake, that is what it felt like for the 6 months I was on that.\n\nI stayed on different SSRIs into college, where once again I felt like my world was falling apart after the ending of a very destructive and co-dependent relationship. At that point I started seeing a fantastic therapist who helped me utilize my analytical brain to see behind the feelings, recognize when episodes were about to start, and how to focus on Valued Living. That same year I began experimenting with psychedelics (which motivated me to stop taking my medication), because getting educated about East/South East Asia “religions” and shifting my worldview. Since then I still have issues from time to time (especially at the start of the pandemic), but with coping mechanisms and feeling like I can be open about my mental health history and issues, I find that I am able to function >90% of the time.\n\nIn retrospect, I see that I was thrown into a system which functions on diagnosing and medicating issues, rather than finding their roots. As a result I would say that I am ‘pharmaceutical adverse’.\n\nTL;DR, thought life was bad, found a way to think it was bad, aided by a natural issue with serotonin re-uptake. Changing my worldview helped more than any pharmaceutical ever did. DO NOT take my experience as a general one as mental health issues are very real and serious, and still plague me (occasionally), loved ones and millions of people around the world!", "is_submitter": false, "distinguished": null, "created_utc": 1629051913.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "here_4_cat_memes", "id": "h92ip78", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #178 | Consortii Concordus", "submission": "p4ts80", "stickied": false, "body": "I have anxiety. I just remember being anxious as a kid. I was 12 when I had my first panic attack. \n\nIn high school, gosh I must have been 15/16, had a very intense nervous breakdown. Stayed home from school for a week. When to therapy for a year. Anxiety was more intense after that. Cried a lot. \n\nAfter high school I went to community college. Continued therapy for another year. Had another episode. Went to my general practitioner. She ‘diagnosed’ me with adjustment disorder with anxiety and put me on anti anxiety meds. Idk what exactly the disorder is tbh. But I just tell people I have an anxiety disorder. I don’t really like answering questions relating to my mentor health, and people get the idea I struggle with anxiety when I say “I have an anxiety disorder”.\n\nThe meds do help. I’ve stopped therapy too. But sometimes it is still a challenge", "is_submitter": false, "distinguished": null, "created_utc": 1629057461.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "gr13fy", "id": "h92qzeq", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #223", "submission": "p4ts80", "stickied": false, "body": "i am diagnosed with bpd and ptsd. part of my bpd (which is not a common symptom but if it is present it is usually severe) is i have positive symptoms (hallucinations, delusions) as well as extreme identity instability. \n\nthis can be really frightening because as much as i can apply dialectical behavioral therapy to improving my relationships and things, i cannot control whether i'm delusional or not.\n\nit can be very challenging. bpd is largely a disorder of stable/fixed traits (or your \"personality\") such as your opinions, thoughts, relational dynamics.\n\nfor me it involves logical processing and cognitive reasoning as well. i will for example if someone does not text me back or speak with me a while, i cannot \"hold\" a stable sense of this relationship in my mind and i just assume they hate me. \n\nor if someone says a little thing here and there i perceve it as passive aggressive or they actually are judging me or they don't like me, and i feel immense shame and try to \"fix\" it, i take minor slights as intense judgment/critism. that type of thing.\n\nthe relationship instability has improved i would say about 85%-90% with over 10 years of dbt. if you have borderline personality disorder you really can resolve a lot of it. it is not as hopeless as it first sounds.\n\nptsd is a beast all of its own and intersects in unusual ways. i get flash backs and ptsd comes with its own emotional dysregulation dysfunction, and it also deals with stress hormones like adrenaline and cortisol that are very difficult to control those impulses \n\n(on top of the impulsivity inherent in bpd.)\n\ni get really mad and fly off the handle very easily. i get startled easily. i perceive people as being abusive and threatening very easily. i'm afraid a lot of the time. i have nightmares. i \"flood\" and obsess about/ruminate over my trauma. \n\nand i also have some day to day amnesia and i dissociate a lot.", "is_submitter": false, "distinguished": null, "created_utc": 1629060988.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "Immelmaneuver", "id": "h92vn67", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #20", "submission": "p4ts80", "stickied": false, "body": "Depression, anxiety, avoidant personality disorder, aphantasia.  Technically my newly diagnosed Fibromyalgia would count, since it's a nerve/neurological disorder.\n\nStudied psychology and worked in the field to get a better understanding of it, helped me cope.  I got side effects from every med I tried and ended up going no med with lots of coping mechanisms.  \n\nThe Fisher Wallace neurostimulator is very helpful, though I don't use it as often as I should.", "is_submitter": false, "distinguished": null, "created_utc": 1629062996.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "mikczas", "id": "h934lyn", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #146", "submission": "p4ts80", "stickied": false, "body": "ADHD + ASD (though not officialy diagnosed with the second one yet)", "is_submitter": false, "distinguished": null, "created_utc": 1629067061.0, "parent_id": "t3_p4ts80", "replies": [{"author": "chocol8cek", "id": "h97wgoo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #107 | Legio Virtus", "submission": "p4ts80", "stickied": false, "body": "Hey! Samesies!!", "is_submitter": false, "distinguished": null, "created_utc": 1629154531.0, "parent_id": "t1_h934lyn", "replies": []}]}, {"author": "journeyofthemudman", "id": "h9364se", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4ts80", "stickied": false, "body": "I was diagnosed with depression and anxiety that I've been medicated for since my early teens. Plus ptsd due to early childhood trauma but that's it. Not anything particularly interesting.", "is_submitter": false, "distinguished": null, "created_utc": 1629067768.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "enhtie", "id": "h9447qb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #67", "submission": "p4ts80", "stickied": false, "body": "various eating disorders (still suffering) specifically bed, bulimia, and anorexia. not gonna get into it too much because it’s too long of a story, but i developed bed and bulimia when i was 11 (started by self esteem issues and also deaths in the family). it kinda kept developing and got really bad during lockdown.", "is_submitter": false, "distinguished": null, "created_utc": 1629084655.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "PsychologicalGroup86", "id": "h94elzy", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #152", "submission": "p4ts80", "stickied": false, "body": "i go through what i think are manic episodes every so often. i lose my sense of myself, reality, and consequence. i'll just totally lose it for about two hours. \n\ni'm not ever breaking shit or hurting people, sometimes i'll smack myself but that's it really. mostly i just rant and rave, send regrettable texts, and move like some kind of paleolithic ape-man. \n\nit gets bad enough to be worrying but i don't know how to approach it with a therapist, i'm worried about being medicated and what that could do to my creative output.", "is_submitter": false, "distinguished": null, "created_utc": 1629090894.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "ennovyelechim", "id": "h94jjge", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "p4ts80", "stickied": false, "body": "I currently have c- ptsd which comes with panic attacks and bouts of agoraphobia.", "is_submitter": false, "distinguished": null, "created_utc": 1629094391.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "freyalorelei", "id": "h96h7oi", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #97", "submission": "p4ts80", "stickied": false, "body": "Diagnosed with ADHD at age 12, AvPD in my 20s, and currently medicated for my ADHD, depression, and anxiety. I'm doing MUCH better.\n\nIf you can't make your own dopamine, store-bought is fine. :)", "is_submitter": false, "distinguished": null, "created_utc": 1629133891.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "MalfoysApple", "id": "h986awb", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p4ts80", "stickied": false, "body": "I currently suffer from depression, anxiety, ptsd, dpdr and adhd lol", "is_submitter": false, "distinguished": null, "created_utc": 1629159020.0, "parent_id": "t3_p4ts80", "replies": []}, {"author": "SybariteAussie", "id": "h99ypbe", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p4ts80", "stickied": false, "body": "Depression. I self medicate with weed. Times of extreme trauma I utilise phenergan. It’s a antihistamine used to treat hives which can be purchased without a prescription. Phenergan is also used as a calmative. It knocks you out and you feel sedated for the bulk of the next day. You swiftly develop a resistance to it. So I utilise it sparingly. Reading & audiobooks on Stoic philosophy also assist.", "is_submitter": false, "distinguished": null, "created_utc": 1629199163.0, "parent_id": "t3_p4ts80", "replies": []}]}