{"title": "Thoughts on \"the world is full of monsters\" by jeff vandermeer?", "name": "t3_oqu827", "url": "https://www.reddit.com/r/TheFlyingTree/comments/oqu827/thoughts_on_the_world_is_full_of_monsters_by_jeff/", "selftext": "Has anyone read that book? If so, what are your thoughts on it?\n\nI'll start, i like jeff's way of telling a story, i have also read his southern reach trilogy and i must say he is a master of the craft, even i dont really fully get his books. As for the book in questions themes, i think there are none but the inability of man to comprehend even a speck of the universe, and as for the literal things in the book, i think it's about an organism with lifecycle that uses entire planets to reproduce, there are also some deep parts about the nature of carnivorous organisms\n\nI inted to start a discussion", "score": 0, "upvote_ratio": 0.5, "permalink": "/r/TheFlyingTree/comments/oqu827/thoughts_on_the_world_is_full_of_monsters_by_jeff/", "id": "oqu827", "author": "UptightBean", "link_flair_text": "Discussion", "num_comments": 2, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1627147227.0, "comments": [{"author": "shig23", "id": "h6e7r4h", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "oqu827", "stickied": false, "body": "The only Vandemeer I’ve read is Southern Reach. I spend a lot of time in the wildlife refuge that inspired it, so it’s pretty close to home. I find his style a little richer and denser than I like.", "is_submitter": false, "distinguished": null, "created_utc": 1627153612.0, "parent_id": "t3_oqu827", "replies": [{"author": "UptightBean", "id": "h6ecz44", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #122", "submission": "oqu827", "stickied": false, "body": "I like the way he implements the horror ideas into the stories with tiny things, like for example at the very begining of \"the world is full of monsters\" he writes about a story that gets into his house, he then realizes it is not a story, but a creature that presented itself as a story so the protagonist would let it get into his head", "is_submitter": true, "distinguished": null, "created_utc": 1627156264.0, "parent_id": "t1_h6e7r4h", "replies": []}]}]}