{"title": "Anyone here had success with lucid dreaming?", "name": "t3_pea1wf", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pea1wf/anyone_here_had_success_with_lucid_dreaming/", "selftext": "I’ve been trying for a while but I’ve never had any success. I’ve tried WBTB, and other methods associated with it, but to to merit. Anyone want to share how they managed? I can never keep up with constantly doing reality checks, so that doesn’t really work for me.\n\n\n\nPs. I’m posting this before bed so I won’t be responding to comments for a while", "score": 4, "upvote_ratio": 0.83, "permalink": "/r/TheFlyingTree/comments/pea1wf/anyone_here_had_success_with_lucid_dreaming/", "id": "pea1wf", "author": "wh0-am-l", "link_flair_text": "Question", "num_comments": 9, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630294031.0, "comments": [{"author": "Alatain", "id": "hax98m7", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "pea1wf", "stickied": false, "body": "I got into lucid dreaming as a way to counter a bout of sleep paralysis I suddenly started having several years ago. One of the first key steps for me was doing an accounting of the previous night's dreams before getting out of bed in the morning. This can be a dream journal, or as I did it, just reviewing them in your mind before fully waking up. \n\nThe next thing I felt was helpful was trying to keep awareness as I began to fall asleep. This one takes a lot of getting used to and learning meditation techniques will definitely help. But I basically slowly let my sleep paralysis kick in on purpose. Because I am in control of it, it is not scary and it will often land me in a lucid dreaming state.\n\nThe other aspect I used was indeed reality checks and mnemonics to prime me to be able to recognize a dreaming state. It gets easier with time, and you can choose to stop doing it if you are not interested in having lucid dreams for a period.\n\nI did experiment with Wake Induced Lucid Dreaming, but did not find it particularly helpful compared to the hassle. Another thing I noticed was that higher doses of melatonin gave me more vivid dreams and a slightly higher likelihood of having a lucid period.", "is_submitter": false, "distinguished": null, "created_utc": 1630328163.0, "parent_id": "t3_pea1wf", "replies": [{"author": "dotieeeee", "id": "haxavwa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #286", "submission": "pea1wf", "stickied": false, "body": "Amen to this: dream journals work, if not, just \"review\" your dreams lol. I often stay in bed after I wake up for a good 15-20 mins just recalling what happened. I have naturally vivid dreams but melatonin has indeed enhanced that. It's weird, but I can recognize when the dream is turning into something bad, and there I'd be aware and do something to turn it around and make it sort of fun.", "is_submitter": false, "distinguished": null, "created_utc": 1630329020.0, "parent_id": "t1_hax98m7", "replies": []}]}, {"author": "SilverWolf5476", "id": "hawetr0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #337", "submission": "pea1wf", "stickied": false, "body": "When I was on a polyphasic schedule sleeping 4 hours a night I had lucid dreams almost every night. \n\nMy 2 hour sleep schedule was even more intense when it came to lucid dreaming. (Hard to keep up with societal norms there though) ha", "is_submitter": false, "distinguished": null, "created_utc": 1630305218.0, "parent_id": "t3_pea1wf", "replies": []}, {"author": "dotieeeee", "id": "hax7qa3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #286", "submission": "pea1wf", "stickied": false, "body": "I do it very often. I remember reading an article when I was a kid about it, it suggested trying to fly when you get stuck in a sitution in your dream you don't want to be in. When you're being chased, for instance.\n\nIt's the reason why I rarely have bad dreams/nightmares. I once had a dream about someone chasing me with a knife or a sword (idk it was something pointy) so what I did was I faced that person and \"willed\" a sword to appear in my hand and we duelled.\n\nAnother timen I was stuck in a bad place I don't remember anymore, but I willed a wand to appear in my pocket and whipped it out and cast some sort of spell. \n\nThis I dreamed just two nights ago: I met a teenage girl who was in a cult and she was trying to get out of it (Save Me, a Korean drama, anyone) so I helped her escape. Somehow they found out about our plans and cultists were chasing us in the middle of this dark market. At that point I already knew I was dreaming and it sounds creepy but I'm telling you, I was having so much fun, I felt the adrenaline rush even in the dream and I LOVED it. So anywayn we were being chased and I knew they were already about to close in on us so what I did was \"willed\" a phone in my pocket and called my boyfriend in the dream (I have no boyfriend irl lol and it's funny because that boyfriend happened to be a famous local celebrity in my country that I didn't even have a crush on) to pick us up at this corner of the market. The boyfriend arrived and got us out of there safely. Next thing I knew I was in a seminar with the teenage girl where she was describing her experiences in the cult and I felt really proud of both of us for getting her out there. This is a true dream, I swear.\n\nNow have been other dreams that I found really disturbing, and I would be aware, but sometimes I like to just go with the flow and see what happens, because I know if I get stuck I have a method to get out of it.\n\nSo yeah, try flying maybe?", "is_submitter": false, "distinguished": null, "created_utc": 1630327355.0, "parent_id": "t3_pea1wf", "replies": []}, {"author": "shig23", "id": "havxs3o", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #5", "submission": "pea1wf", "stickied": false, "body": "I tried LaBerge’s MILD technique, long ago, and had a little success but not much.", "is_submitter": false, "distinguished": null, "created_utc": 1630294221.0, "parent_id": "t3_pea1wf", "replies": []}, {"author": "Kelyaan", "id": "haw09zr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pea1wf", "stickied": false, "body": "Tried many external methods and it never worked, I have had it happen a few times naturally but with all \"lucid dreaming\" the moment you realise it you begin to wake up.", "is_submitter": false, "distinguished": null, "created_utc": 1630295593.0, "parent_id": "t3_pea1wf", "replies": []}, {"author": "roundearthervaxxer", "id": "haw3a2m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "pea1wf", "stickied": false, "body": "Yes, when I was younger. One or two a week. They still happen on occasion. I had an imaginary turquoise ring that I would think about when going to sleep. If I saw the ring in my finger in a dream, that was my sign.", "is_submitter": false, "distinguished": null, "created_utc": 1630297297.0, "parent_id": "t3_pea1wf", "replies": []}, {"author": "Nexusoffate17", "id": "hayj4im", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #358", "submission": "pea1wf", "stickied": false, "body": "I have. I used to he very good at it, but I've started to lose the ability. For me the trick was analyzing my dreams and understanding how they usually play out, and then doing reality checks on the dreams if I ever got conscious enough. However, it did lead to many scary situations where I no longer was sure if I was in control of my own mind...", "is_submitter": false, "distinguished": null, "created_utc": 1630347997.0, "parent_id": "t3_pea1wf", "replies": []}, {"author": "Mulligan315", "id": "hb0eap1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #181", "submission": "pea1wf", "stickied": false, "body": "Only had one lucid dream. It was amazing. I hadn’t tried to lucid dream. It just happened. I’ve never been able to replicate the experience.", "is_submitter": false, "distinguished": null, "created_utc": 1630377840.0, "parent_id": "t3_pea1wf", "replies": []}]}