{"title": "A thing that always freaks me out", "name": "t3_piuaqa", "url": "https://www.reddit.com/r/TheFlyingTree/comments/piuaqa/a_thing_that_always_freaks_me_out/", "selftext": "You know that feeling you have when you're driving and just at some point just REALIZE you're driving because you kinda spaced out and drove on autopilot?\n\nI have been getting that feeling about the planet we're on and how we're just small specks of life on a large wet rock hurtling through space being tugged along by a giant ball of flaming gas. If we even go a step further, our star is also in the orbit of a much stronger gravitational force, the black hole at the center of our galaxy. It may be long after humans die out, but one day that black hole will swallow the solar system if the sun doesnt supernova first.\n\nI guess it's a way of saying cosmic horror doesnt need to have a face when at any time, a huge celestial body could collide with our planet and absolutely body the entire earths population", "score": 2, "upvote_ratio": 0.75, "permalink": "/r/TheFlyingTree/comments/piuaqa/a_thing_that_always_freaks_me_out/", "id": "piuaqa", "author": "WhatMacabrePeach", "link_flair_text": "Other", "num_comments": 2, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630911553.0, "comments": [{"author": "Background_Macaron57", "id": "hbx1kbj", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Initiate", "submission": "piuaqa", "stickied": false, "body": "I've been stuck on autopilot for the past month or so. Survival while going through depression? The monotony of the matrix? Idk", "is_submitter": false, "distinguished": null, "created_utc": 1631012590.0, "parent_id": "t3_piuaqa", "replies": []}, {"author": "baalroo", "id": "hbtv71n", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #120 | Legio Virtus", "submission": "piuaqa", "stickied": false, "body": "Think about this...\n\nReally, all measurements of speed are actually measuring the rate at which the distance between two objects is either growing or shrinking.\n\nAll movement is relative, meaning that if you go out into deep space and Thing A zips past Thing B at 100 mph, it's just as reasonable to say Thing B is moving at 100 mph and Thing A is stationary as it is to say that A is moving and B is stationary. \n\nFrom the perspective of B, A zipped past... but from the perspective of A, B zipped past.\n\nWe really only decide which is moving and which is stationary by examining which of the two is moving more generally in line with the majority of the surrounding things around it.\n\nThis includes us and our local cluster of stuff.", "is_submitter": false, "distinguished": null, "created_utc": 1630948484.0, "parent_id": "t3_piuaqa", "replies": []}]}