{"title": "What do you feel is necessary when making a setting hack for a Tabletop RPG?", "name": "t3_p4jyi3", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p4jyi3/what_do_you_feel_is_necessary_when_making_a/", "selftext": "I’m currently working on a hack for a generic RPG called Genesys (very good, very flexible to play when learned, you’ll have to get used to some funny multicolored dice though).\n\nThe setting hack is set in the Hazbin Hotel universe if you’re wondering (indie animated show about the Princess of Hell trying to redeem sinners and being made fun of for it. You might also have heard of Helluva Boss, set in the same universe, about quirky demons running a hit man service).\n\nSo far I’ve got things like Archetypes (like D&D’s races), Careers (like Classes), some Elite Advances (extra things to take at the start of character creation), I shamelessly stole the talent list from the fan made Genesys Talents Expanded list (basically the community pooling all talents from all sorts of sourcebooks into one list), and have begun laying out most of the weapons. I’ve also commissioned art to be included in various parts of the book (and once the guts of the hack is in place I will write flavor text in full).\n\nMy question is what do you think I might have overlooked of have forgotten to mention? \n\nI intend to share this with people in order to play test/identify sections for errata (perhaps to this sub since you are all fellow initiated ones), but that will come once it’s in a semi-stable condition.", "score": 3, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/p4jyi3/what_do_you_feel_is_necessary_when_making_a/", "id": "p4jyi3", "author": "WikiContributor83", "link_flair_text": "Question", "num_comments": 5, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628989319.0, "comments": [{"author": "agaminon22", "id": "h8z9zp7", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #174", "submission": "p4jyi3", "stickied": false, "body": "Items that are not weaponry I find are some of the coolest parts in tabletop RPGs. You could create some.", "is_submitter": false, "distinguished": null, "created_utc": 1628990714.0, "parent_id": "t3_p4jyi3", "replies": [{"author": "WikiContributor83", "id": "h8zae3x", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #120", "submission": "p4jyi3", "stickied": false, "body": "*This* I must do. There’s just so many to do that I instinctively look away, I feel. Of particular note is the various drug items (Hell in the Hazbin Hotel universe has drug vending machines).", "is_submitter": true, "distinguished": null, "created_utc": 1628990912.0, "parent_id": "t1_h8z9zp7", "replies": []}]}, {"author": "Kelyaan", "id": "h8zb40y", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p4jyi3", "stickied": false, "body": "Hacks are systems and rules - Settings are not part of hacks as they don't care for the rules.  \n\n\nThe main thing most people forget when making hacks is the fun aspects of the system it's coming from, I knew someone who made a 5E hack that was so fucking boring but he put so much time into it, They removed everything that made the base fun so the main thing is to play test yo game.", "is_submitter": false, "distinguished": null, "created_utc": 1628991275.0, "parent_id": "t3_p4jyi3", "replies": [{"author": "WikiContributor83", "id": "h8zc9q2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #120", "submission": "p4jyi3", "stickied": false, "body": "I suppose this is just a setting book then, but I’ve seen Genesys be described as very hackable, and easy to add extra rules to fit the setting).\n\nThe good news is that it’s really hard to make Genesys into something NOT Genesys as long as it’s somewhat cinematic. One of the things Genesys doesn’t do well is stuff like gritty/tactical realism as well as high lethality (and in Hazbin Hotel, “Sinners” can’t permanently die except to divine weaponry).", "is_submitter": true, "distinguished": null, "created_utc": 1628991852.0, "parent_id": "t1_h8zb40y", "replies": []}]}, {"author": "DragonFromHell", "id": "h90e51s", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #22", "submission": "p4jyi3", "stickied": false, "body": "I like open magic sort of systems where spells aren't set in stone. D&D has specific spells with specified ranges and such, which is very balanced, but I like systems where you have a pool of magic points that can slightly change spells.\n\nI think the older editions of RuneQuest did that well, since you had a bare spell that you could change or combine with other spells by burning magic points.\n\nI feel like needlessly limiting spell usage with levels and very specified effects is handicapping the magic system overall. Magic point systems that allow you (or even the players) to create costier spells with more powerful effects have a special place in my heart and is the first thing I would look into when designing a hack \n\nDon't know how relevant this is to the thread, because it's not necessary. I just wanted to give my opinion.", "is_submitter": false, "distinguished": null, "created_utc": 1629016700.0, "parent_id": "t3_p4jyi3", "replies": []}]}