{"title": "I was just added, can we discuss Jehovah’s Witnesses for a moment?", "name": "t3_pgxfy0", "url": "https://www.reddit.com/r/TheFlyingTree/comments/pgxfy0/i_was_just_added_can_we_discuss_jehovahs/", "selftext": "First of all it’s pretty cool to be added to this group. No idea how or why I made it here but I’ll take it! \n\nI want to take a moment to discuss Jehovah’s Witnesses. I know the rules say no harassment so I will attempt to keep this rather level headed. I want to address why they should be looked up skeptically and deserve more public pressure and criticism. \n\nJWs are a religion that I feel is better described as a cult. I spent 23 years in it because I was born in it and I still live with active JWs. The rank and file members are constantly bombarded with anti LGBT propaganda, they are taught to refuse life saving blood transfusions for themselves, and they are highly encouraged to shun members who disagree with official doctrine but also those who leave the “organization”. Not only this, they are on the level with the Catholic Church in regards to how they cover up child sex abuse (see https://youtu.be/EmfyhQo8yNI). \n\nDo not get me wrong, the average JW comes across as nice and well meaning, and they usually are, but they are part of a toxic cult. Before engaging with one be sure to do your research about what they actually believe. Check out JWfacts.com for good info as well as r/exJW. \n\nAlso, do not be an asshole to JWs if they show up at your house. They believe they are the only ones god will save and everyone else is controlled by the devil, if you are hostile with them it will feed the idea they are hated because they are right. Instead try to engage in an actual conversation with them and tactfully challenge their ideas. If you don’t want to do that then ask to be put on their “Do Not Call” list and they will leave you alone and will not come to your door.", "score": 15, "upvote_ratio": 0.89, "permalink": "/r/TheFlyingTree/comments/pgxfy0/i_was_just_added_can_we_discuss_jehovahs/", "id": "pgxfy0", "author": "wondering-soul", "link_flair_text": "Discussion", "num_comments": 27, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1630640981.0, "comments": [{"author": "neolthrowaway", "id": "hberdac", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #338", "submission": "pgxfy0", "stickied": false, "body": "Excuse me, do you have a moment to talk about our lord and savior?", "is_submitter": false, "distinguished": null, "created_utc": 1630644403.0, "parent_id": "t3_pgxfy0", "replies": [{"author": "wondering-soul", "id": "hbere30", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #539", "submission": "pgxfy0", "stickied": false, "body": "No", "is_submitter": true, "distinguished": null, "created_utc": 1630644416.0, "parent_id": "t1_hberdac", "replies": [{"author": "neolthrowaway", "id": "hbero54", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #338", "submission": "pgxfy0", "stickied": false, "body": "This is so sad 😢😭\n\nAlexa play I am a child of God", "is_submitter": false, "distinguished": null, "created_utc": 1630644586.0, "parent_id": "t1_hbere30", "replies": [{"author": "gemini_pain", "id": "hbfldv5", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #43", "submission": "pgxfy0", "stickied": false, "body": "After that song I’ll take “One is the loneliest number” please!", "is_submitter": false, "distinguished": null, "created_utc": 1630667560.0, "parent_id": "t1_hbero54", "replies": []}]}]}]}, {"author": "timPerfect", "id": "hbf5mo1", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #414", "submission": "pgxfy0", "stickied": false, "body": "so ironic that those Jehovah's witnesses feel persecuted by others when their fantasy is everybody else to burn in hell for eternity", "is_submitter": false, "distinguished": null, "created_utc": 1630654539.0, "parent_id": "t3_pgxfy0", "replies": [{"author": "penguin_clubber", "id": "hbnf6cz", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #576", "submission": "pgxfy0", "stickied": false, "body": "They don't believe in hell", "is_submitter": false, "distinguished": null, "created_utc": 1630814700.0, "parent_id": "t1_hbf5mo1", "replies": [{"author": "timPerfect", "id": "hbnfk02", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #414", "submission": "pgxfy0", "stickied": false, "body": "Watch Tower publications teach that hell (hades or sheol) is not a place of fiery torment, but rather the \"common grave of mankind\", a place of unconscious non-existence.", "is_submitter": false, "distinguished": null, "created_utc": 1630814931.0, "parent_id": "t1_hbnf6cz", "replies": [{"author": "timPerfect", "id": "hbnflij", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #414", "submission": "pgxfy0", "stickied": false, "body": "so yea schooled, thank you for correcting me", "is_submitter": false, "distinguished": null, "created_utc": 1630814958.0, "parent_id": "t1_hbnfk02", "replies": []}]}]}]}, {"author": "ennovyelechim", "id": "hbfjb9s", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "pgxfy0", "stickied": false, "body": "I went to school with a couple of JWs truly lovely girls trying to navigate the world between home and heathens bless em. So I've never had a problem when they turned up at the door. I just told them I'm not likely to catch any religion from a door knock but they're welcome to meet my cat Lucifurr usually they can't get away fast enough at that point. Then I met Jeff who started work at my office, he told me he was on the path and was stunned when I knew what he was talking about. I knew about ' the path' but I didn't want to be on it. He was a bit of a bullying ass bit lots of people are so I didn't think much about it until my son came out as gay. I was discussing it with a gay colleague asking what I should or shouldn't do to make him feel accepted and Jeff pipes up that my 15 year old son was evil, dirty, disgusting and deserves to burn in the hell he was inevitably going to. I'm British we regard religion like we do private parts, if you've got one and your proud of it that's awesome just do not wave it in anyone's face. This tirade of hate that spewed from Jeff was horrendous the whole office heard and the whole office gave him what for at the same time. He slunk off into his corner into his righteous indignation where he stayed, no more chit chat from anyone. So personally, if you want to take any path you want crack on,  but do beware of where you spout hate because you might get a cumuppance. I don't even open the door to be polite to JWs anymore. I don't allow hate over my threshold. I'm sure there are truly lovely well meaning people there but I cannot and will not engage with people who would condemn a minor to hell because of their sexuality its screwed up on so many levels it's beyond funny.", "is_submitter": false, "distinguished": null, "created_utc": 1630666087.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "olyfilmgirl", "id": "hberucw", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #365", "submission": "pgxfy0", "stickied": false, "body": "My husband married into a JW family in the 90s. They split over 12 years ago, and the church is still trying to solicit his membership. He's an agnostic, so anybody attempting to solicit him is wasting their time.", "is_submitter": false, "distinguished": null, "created_utc": 1630644693.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "CactiIlluminati", "id": "hbew6x0", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #175", "submission": "pgxfy0", "stickied": false, "body": "The sheer volume of rejection they endure going door to door being annoying reinforces the us and them cult like vibes and is part of the plan. It's big in my town, mind so is religion.", "is_submitter": false, "distinguished": null, "created_utc": 1630647470.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "Eisenthorne", "id": "hbfx06u", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #18", "submission": "pgxfy0", "stickied": false, "body": "My grandmother used to ask them in, offer them food, and tell them all about the Bible and why they didn’t understand it right.", "is_submitter": false, "distinguished": null, "created_utc": 1630674213.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "TiPirate", "id": "hbfz31i", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #400", "submission": "pgxfy0", "stickied": false, "body": "My FIL (scream-from-the-pulpit Baptist) loves to invite them in and debate with them for hours. Such a bore.", "is_submitter": false, "distinguished": null, "created_utc": 1630675223.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "Kelyaan", "id": "hbepblk", "score": 7, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "pgxfy0", "stickied": false, "body": "> I want to address why they should be looked up skeptically and deserve more public pressure and criticism.\n\nAll of the abrahamic beliefs do  \n\n\n>JWs are a religion that I feel is better described as a cult. I spent 23 years in it because I was born in it and I still live with active JWs.\n\nAll the abrahamic beliefs meet the criteria for a cult not just JW.  \n\n\n>do not be an asshole to JWs if they show up at your house. They believe they are the only ones god will save and everyone else is controlled by the devil, if you are hostile with them it will feed the idea they are hated because they are right.\n\nI don't care what they believe, it impacts me in no way at all, When a religious person comes to my door I simply say \"Sorry I do not believe what you're claiming as it does not agree with reality, Thank you for your time but I will please ask you to not come back again.\"  \n\n\n> Instead try to engage in an actual conversation with them and tactfully challenge their ideas.\n\nYou cannot reason a person out of a position they did not reason themselves into - This is coming from someone who spent a lot of their live in Atheistic debates, It doesn't work like people hope it does.  \n\n\n> If you don’t want to do that then ask to be put on their “Do Not Call” list and they will leave you alone and will not come to your door.\n\nOr answer the door in a Cradle of filth tshirt with a nun going at it with a cross ... that does it aswel (was not on purpose)", "is_submitter": false, "distinguished": null, "created_utc": 1630643171.0, "parent_id": "t3_pgxfy0", "replies": [{"author": "wondering-soul", "id": "hbepp5f", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #539", "submission": "pgxfy0", "stickied": false, "body": "This is a fair response", "is_submitter": true, "distinguished": null, "created_utc": 1630643395.0, "parent_id": "t1_hbepblk", "replies": []}, {"author": "pockets-of-soup", "id": "hbeyodr", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #494", "submission": "pgxfy0", "stickied": false, "body": "You cant reason a person out of a position they did not reason themselves into, is sooo true, no matter if it's religion,sports teams,cars, watches or, books.... most don't question there own beliefs enough, even I. In todays fast pace world opinions turn into facts and no-one questions it. But even the act of questioning can be dangerous if you are too eager to connect the dots, makes you wonder if we would have a better society without modern technology", "is_submitter": false, "distinguished": null, "created_utc": 1630649180.0, "parent_id": "t1_hbepblk", "replies": []}, {"author": "KuriousKhemicals", "id": "hbgjvyt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #106", "submission": "pgxfy0", "stickied": false, "body": ">I don't care what they believe, it impacts me in no way at all\n\nI don't think this is true. What one random person believes doesn't affect you immediately, but if your behavior feeds their belief that they are right, and they make greater efforts to convert others and have greater success, eventually you can end up in the middle of a hostile society that agrees with them more than you. Some people won't respond to almost anything by weakening their belief, but we can at least be as neutral as possible and not give them fuel. \n\nYour response doesn't sound particularly rude so I don't think you're necessarily doing anything counterproductive - but I do think the kind of interactions we have with these people *matter.*", "is_submitter": false, "distinguished": null, "created_utc": 1630684137.0, "parent_id": "t1_hbepblk", "replies": []}]}, {"author": "doegred", "id": "hbfba6o", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #191", "submission": "pgxfy0", "stickied": false, "body": "Ha, my mother let in some JW once because she felt sorry for them. They came a couple of times. They talked to her about the eternal happiness of the afterlife, to which she responded: 'what, so there's never anything new or different? That sounds horrible.' They didn't come back.", "is_submitter": false, "distinguished": null, "created_utc": 1630659483.0, "parent_id": "t3_pgxfy0", "replies": [{"author": "ennovyelechim", "id": "hbfjfke", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #111", "submission": "pgxfy0", "stickied": false, "body": "I kinda love your mum.", "is_submitter": false, "distinguished": null, "created_utc": 1630666173.0, "parent_id": "t1_hbfba6o", "replies": []}]}, {"author": "SybariteAussie", "id": "hbfl8du", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "pgxfy0", "stickied": false, "body": "Religious and ideologically intoxicated people are dangerous! Those with “The vision of the anointed” feel that they know what’s best for mankind and are immune to facts. They are prepared to do what is necessary to achieve utopia. Including cultural vandalism, destruction of economy, intimidate, riot or kill. History is rhyming again.", "is_submitter": false, "distinguished": null, "created_utc": 1630667455.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "PenguinInDistress", "id": "hbg2rks", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #156", "submission": "pgxfy0", "stickied": false, "body": "JW kids were always my friends at school. I had ultra strict parents and we all just had the time of our lives together. They all got out towards the end. I used to hide pants in my locker for one of my bff's. \n\nReally cool kids, but the adults suck.", "is_submitter": false, "distinguished": null, "created_utc": 1630676925.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "OccamsRazorstrop", "id": "hbgxdif", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #180", "submission": "pgxfy0", "stickied": false, "body": "Is it true that if you say \"Jehovah's Witnesses\" five times in front of a mirror that they'll immediately knock on your front door? 😁\n\nBut about the \"cult\" thing: There is no recognized definition of the word \"cult\" except \"a bad religion\" (as if there are any good ones) or \"a religion I don't like\" (or the technical definition of \"a group of people devoted to something\" which includes all religions and isn't what we're talking about here). There are various definitions and models floating around out there - the BITE model being perhaps the best known - but none of them are widely accepted and, indeed, most of them are ideosyncratic definitions made up by one or two people. The BITE model is one of those, made up by a \"cult expert/ex-cult member\" who makes a living off of it. Calling a religion a \"cult\" really doesn't mean much.\n\nBut the OP is right about asking to be put on the \"Do Not Call\" list. Find out where your nearest Kingdom Hall (aka JW church) is located and give them a call or send them a letter.", "is_submitter": false, "distinguished": null, "created_utc": 1630689717.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "penguin_clubber", "id": "hbngr8x", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #576", "submission": "pgxfy0", "stickied": false, "body": "https://youtu.be/lhiohyCT5OQ", "is_submitter": false, "distinguished": null, "created_utc": 1630815683.0, "parent_id": "t3_pgxfy0", "replies": [{"author": "wondering-soul", "id": "hbngzci", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #539", "submission": "pgxfy0", "stickied": false, "body": "😂😂😂\n\nThank you for this", "is_submitter": true, "distinguished": null, "created_utc": 1630815829.0, "parent_id": "t1_hbngr8x", "replies": []}]}, {"author": "SuperWeebLegend", "id": "hbeuoy5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #281", "submission": "pgxfy0", "stickied": false, "body": "Thanks for sharing", "is_submitter": false, "distinguished": null, "created_utc": 1630646489.0, "parent_id": "t3_pgxfy0", "replies": []}, {"author": "penguin_clubber", "id": "hbnf31q", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #576", "submission": "pgxfy0", "stickied": false, "body": "I deprogrammed when I was 24. The most arrogant religion I've come across. Everyone is so repressed and deluded. And they like it that way!", "is_submitter": false, "distinguished": null, "created_utc": 1630814646.0, "parent_id": "t3_pgxfy0", "replies": [{"author": "wondering-soul", "id": "hbnf6mk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #539", "submission": "pgxfy0", "stickied": false, "body": "Glad to hear you made it out! Yeah they are, it’s pathetic.", "is_submitter": true, "distinguished": null, "created_utc": 1630814704.0, "parent_id": "t1_hbnf31q", "replies": []}]}]}