{"title": "Do you think humans could ever truly understand the nature of the universe and reality?", "name": "t3_p7d7hy", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p7d7hy/do_you_think_humans_could_ever_truly_understand/", "selftext": "The age old question: if an alien or entity came down with all the knowledge in existence, do you think we'd be able to fully comprehend the nature of reality itself by what this thing tells us?", "score": 9, "upvote_ratio": 0.92, "permalink": "/r/TheFlyingTree/comments/p7d7hy/do_you_think_humans_could_ever_truly_understand/", "id": "p7d7hy", "author": "yeetoveeto", "link_flair_text": "Question", "num_comments": 66, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629373495.0, "comments": [{"author": "DoglessDyslexic", "id": "h9it0ff", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p7d7hy", "stickied": false, "body": "Somewhat depends on what the nature of reality is doesn't it?", "is_submitter": false, "distinguished": null, "created_utc": 1629373875.0, "parent_id": "t3_p7d7hy", "replies": [{"author": "yeetoveeto", "id": "h9it9ik", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #62", "submission": "p7d7hy", "stickied": false, "body": "Well that's exactly what the question asks, would the nature of reality be too complicated to understand or would it fit into our current models to an extent that it could be understood through math with our current levels of intelligence.", "is_submitter": true, "distinguished": null, "created_utc": 1629374033.0, "parent_id": "t1_h9it0ff", "replies": [{"author": "DoglessDyslexic", "id": "h9iup0z", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p7d7hy", "stickied": false, "body": "Your question seems contingent on an unknowable quantity.  Since we do not know the complexity of reality, we cannot possibly estimate whether the complexity of reality is beyond our ability to comprehend.", "is_submitter": false, "distinguished": null, "created_utc": 1629374900.0, "parent_id": "t1_h9it9ik", "replies": [{"author": "yeetoveeto", "id": "h9iv3tx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #62", "submission": "p7d7hy", "stickied": false, "body": "Oh I'm aware of that, I know there is no definite answer that we could pull from right now, rather, I'm interested in the subjective viewpoints to this question. Do YOU think we could, on a personal observation basis. It's more a question into the individuals perspective and thoughts rather than the definitive truth. I just love the way we all see things differently and are optimistic/pessimistic based on our subjective experience.", "is_submitter": true, "distinguished": null, "created_utc": 1629375143.0, "parent_id": "t1_h9iup0z", "replies": [{"author": "DoglessDyslexic", "id": "h9iwfb8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #170", "submission": "p7d7hy", "stickied": false, "body": "Ah, understood.  My intuition is that humankind in it's current form is incapable of fully comprehending the full complexity of the universe.  Not only are a number of our perceptual biases very difficult to overcome, we are also almost certainly unaware of a number of those perceptual biases.  We have evolved to see what we need to survive, not necessarily the true nature of reality.  If we throw in the possibility of extra-dimensional realities and/or multiverse, it's highly likely that it is too much for us to comprehend.\n\nWith that said, if we do manage to reach an AI singularity situation (and survive the process), it is likely that some will elect to use that AI to enhance humankind's capabilities.  If that does happen, we cannot possibly predict the eventual outcome of humankind's capabilities, as it is likely some of those capabilities are beyond our current ability to comprehend.", "is_submitter": false, "distinguished": null, "created_utc": 1629375905.0, "parent_id": "t1_h9iv3tx", "replies": []}]}]}, {"author": "Yermo45", "id": "h9j26l0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #150", "submission": "p7d7hy", "stickied": false, "body": "I feel like we probably would not simply because we see reality and life from a relatively small perspective, we know only what we understand and only understand what we construct. In the big picture there really is no meaning to it all and we base our beliefs only on what we can comprehend so if an alien or all knowing being were to appear(if the governments doesn't try to contain it and hide the truth from the public, which i feel is what would happen but that's a different conversation) i don't believe we would be able to fully understand everything it has to tell us. There's just no possible way we as humans on this one rock existing in one point in the entirety of reality could comprehend everything there is to know. Im sure some would try and some might make progress but not everyone is competent enough or has the mental fortitude to try. And im not saying i do either because sure i feel like the smartest person in the room sometimes but i also understand in reality we all know different things and no one is innately smarter than anyone else, just more knowledgeable in certain aspects. And until every human being can come to terms with that and we all apply our own experiences and knowledge and share our combined understanding of reality we will not progress as a species.", "is_submitter": false, "distinguished": null, "created_utc": 1629378918.0, "parent_id": "t1_h9it9ik", "replies": [{"author": "yeetoveeto", "id": "h9j2y2a", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #62", "submission": "p7d7hy", "stickied": false, "body": "I'd say You and u/DoglessDyslexic hit the nail on the head with this one in my personal opinion. The fact that we are a speck of dust in an unimaginably big universe just seems to shit on the prospect of us finding out true purpose if there is one. I 100% agree. Cognitive biases and our mind blowingly small scale are definitely the two biggest hurdles to jump and I honestly do not have hope in that. There (hypothetically) could be a system in our brains that try distract us from finding out (ex. Religion) and there would be no way to tell because that is the natural way of our thinking. It's all weird man, fuck it it's turtles all the way down.", "is_submitter": true, "distinguished": null, "created_utc": 1629379283.0, "parent_id": "t1_h9j26l0", "replies": [{"author": "Yermo45", "id": "h9j5w50", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #150", "submission": "p7d7hy", "stickied": false, "body": "I am christian, but being honest with myself i feel i say and act that way more for my wife than for myself. I don't know what i believe simply because i seek information and fact and feel your beliefs limiting what you say or how you act, to me just isn't right. I don't mean to say what you believe is wrong, i just feel that we should be able to believe what we want without remorse. However im not agnostic either im not saying there is or is not a higher being, just simply put being a mere speck of matter in reality gives me no right to assume or construct ideas of what is or what is not. I see sunlight and understand the waves being transmitted into my eyes that create \"light\" and i smell food and understand how my nose can notice and recognize those smells. And im sure one day we may progress further technologically and become aware of more reactions and happenings within reality that we currently could not comprehend. But it wont matter to me because i will no longer \"be\". So i am aware of what there to be aware of and try my best to live in unison with all that is around me while exploring different ideas and possibilities.", "is_submitter": false, "distinguished": null, "created_utc": 1629380683.0, "parent_id": "t1_h9j2y2a", "replies": []}]}]}]}]}, {"author": "Abraculax", "id": "h9j2kzp", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Seeker #147", "submission": "p7d7hy", "stickied": false, "body": "Yes, eventually", "is_submitter": false, "distinguished": null, "created_utc": 1629379112.0, "parent_id": "t3_p7d7hy", "replies": [{"author": "Boundary-Layer", "id": "h9m3ojb", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #78", "submission": "p7d7hy", "stickied": false, "body": "Agreed (useless comment to avoid culling lol)", "is_submitter": false, "distinguished": null, "created_utc": 1629426225.0, "parent_id": "t1_h9j2kzp", "replies": []}, {"author": "Stfudeal", "id": "h9kdnag", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #114", "submission": "p7d7hy", "stickied": false, "body": "Agreed.", "is_submitter": false, "distinguished": null, "created_utc": 1629398933.0, "parent_id": "t1_h9j2kzp", "replies": []}]}, {"author": "Kelyaan", "id": "h9jqz5o", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #271 | Consortii Concordus", "submission": "p7d7hy", "stickied": false, "body": "No - The universe is far beyond our comprehension and probably always will be", "is_submitter": false, "distinguished": null, "created_utc": 1629389544.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "An_Dr01d", "id": "h9kd3vw", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #66", "submission": "p7d7hy", "stickied": false, "body": "No. But we must try.", "is_submitter": false, "distinguished": null, "created_utc": 1629398708.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "BuccaneerRex", "id": "h9j4p6s", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p7d7hy", "stickied": false, "body": "There will always be more questions.\n\nThat said, if some phenomenon has an effect in reality, it can be studied scientifically. If a phenomenon has no effect in reality, how do you know it's there?\n\nIf some alien entity came down and claimed to have 'all the knowledge in existence', the only possible response is 'Prove it.' And I'd still remain unconvinced that it wasn't a party trick. \n\nI suspect that 'reality' is quite a lot simpler than most people make it out to be. This is why we have to invent all kinds of philosophies and religions to fill in what we see as gaps. \n\nAt the most fundamental level everything that happens is the dust settling out of the vacuum phase shift that was the big bang, and the transformation of potential energy into kinetic. \n\nThat it makes pretty and interesting patterns as it does so doesn't change what those patterns are at the lowest level.\n\nBut the fun part about the universe is that it has emergence, in that those interesting patterns can, with a shift of perspective, become the foundation for a different set of patterns themselves, and so on. \n\nThe problem with questions like 'the nature of the universe' or statements like 'all the knowledge' is that they do not account for incompatible paradigms or emergent phenomena. \n\nThe other thing is that 'all the knowledge' isn't going to be useful. Take, for example, the air in the room you are currently in. There exists a set of quantum information regarding the position and momentum of every single particle in the room. But what are you going to do with that? Far more useful would be the emergent properties of temperature and pressure and current. \n\nKnowledge by itself is just information, and information at its most simplified is literally just 'form'. (quantum information is not separate from the systems it describes. it IS those systems.) \n\nAt all levels, appropriate context is required to change 'form' into knowledge. Whether that is the shapes of ripples in the sand informing the shapes of the waves above them, or the alignment of carefully impure silicon crystals to hump electrical potentials around , if the alien tells us something we can test, then it's knowledge.\n\nIf we can't test it, and there's no way to tell whether it's true or not, then it's irrelevant. It might be true, but it won't matter.", "is_submitter": false, "distinguished": null, "created_utc": 1629380126.0, "parent_id": "t3_p7d7hy", "replies": [{"author": "LoneQuietus81", "id": "h9nqfx8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #202", "submission": "p7d7hy", "stickied": false, "body": "I agree with you on every point, but I think our potential for understanding what they might bring us is going to be hinged upon being taught new ways to think and process information.\n\nI read a long article once (or was it a Reddit thread?) where it was discussed at great length what if a modern smartphone dropped into the year 1900, what could they do with it?\n\nThe short answer was: a lot, but not nearly enough to comprehend and replicate what they find. Even in our short window since then, our technology has exploded in complexity. \n\nMy argument is that if we can only get that much out of Earth technology that is 100 years advanced, I can't fathom that a civilization capable of reaching, communicating with, and teaching us wouldn't have a massively difficult job ahead of them. It would be like teaching cave man homo sapiens to program on a Mac; They have the capacity and could eventually get there, but the road is going to be very long and very difficult. They're probably better off teaching our young from infancy.", "is_submitter": false, "distinguished": null, "created_utc": 1629465794.0, "parent_id": "t1_h9j4p6s", "replies": [{"author": "BuccaneerRex", "id": "h9o7g50", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p7d7hy", "stickied": false, "body": "I think we're getting culturally (very broadly, and referring to all human culture in general) to the point where our attitudes towards the world are fundamentally different from where they were in the 1900s. (obviously not for everyone. Some people are moving backwards).\n\nA smartphone in 1921 would be pretty out of context, but not like a monkey in front of a monolith. The 100 years between then and now have been the most accelerationist of any before, and I think that the mental leap that you or I would have to take to understand alien tech would be less than the one my great grandfather might need to take to understand a Samsung Galaxy. \n\nI don't think that the biggest challenge to understanding alien tech is going to be the tech itself. The real challenge will be understanding an alien UI.", "is_submitter": false, "distinguished": null, "created_utc": 1629473016.0, "parent_id": "t1_h9nqfx8", "replies": [{"author": "LoneQuietus81", "id": "h9qjcyh", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #202", "submission": "p7d7hy", "stickied": false, "body": ">The 100 years between then and now have been the most accelerationist of any before,\n\nThat's a valid point. I have to wonder how many big discoveries would lie between us and them, like microscopic biology, quantum physics, and microprocessors.  \nThat said, I'm not excluding the possibility that an alien civilization might have made discoveries that, as the saying goes, would appear to be magic to us.\n\n>would be less than the one my great grandfather might need to take to understand a Samsung Galaxy. \n\nI'm not sure if I miscommunicated, but I was intending the scenario that the future technology would be examined by experts, not laymen. Not that it makes much of a difference.\n\n>The real challenge will be understanding an alien UI.\n\nInteresting thought. The possibilities are limited only by your imagination. A simple console UI could be a string between cans as far as they're concerned, not to mention the actual interface mechanics and cultural aspects. Thanks for the fat to chew.", "is_submitter": false, "distinguished": null, "created_utc": 1629508931.0, "parent_id": "t1_h9o7g50", "replies": [{"author": "BuccaneerRex", "id": "h9qrrxa", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p7d7hy", "stickied": false, "body": ">That said, I'm not excluding the possibility that an alien civilization might have made discoveries that, as the saying goes, would appear to be magic to us.\n\nSure, sure. Clarke's law and all that. But I find myself in the same position as I do on assertions of the supernatural. If there's a phenomenon, we can study it and understand it. Personally, I've always been a fan of the contrapositive to Clarke's Law: Any technology distinguishable from magic is insufficiently advanced. \n\n>I'm not sure if I miscommunicated, but I was intending the scenario that the future technology would be examined by experts, not laymen. Not that it makes much of a difference.\n\nAre you calling my great-grandfather a layman?! Have at thee, sirrah! Seriously though, my GG was a WWI pilot and then an engineer. But yes, I assumed the same thing. Experts, not lay people. But we shouldn't neglect that an expert is only an expert in their area of expertise. By your definition here we're dealing with technology that we don't already understand, therefore any expertise is the same as any other. Granted, throwing the world's best potato salad at it probably isn't going to make the alien gizmo work, but then again, who knows?\n\n>The possibilities are limited only by your imagination.\n\nMore practically, the possibilities will be limited by physics, biology, and the contingent history of the aliens in question. \n\nLook at human UIs. More less we've settled on some variation on the keyboard and mouse for most interfaces. Even touch interfaces are often skeuomorphic to the familiar layouts. Alternatives do exist, but they're niche or simply don't catch on. But the keyboards we all type on for most things are descended from their technological forebears in typewriters, and there's a semi-apocryphal story that the QWERTY layout was deliberately designed to slow typists down because they went so fast that the keys would jam up. (by separating common letters into opposite hands the keys would be able to more often strike true without jamming.)\n\nTouch screens themselves are keyed off of human biology, at least with some versions. They respond to the change that the human body adds to the circuit, (which is why some screens don't work with gloves). But a scaly lizard finger won't work a touch screen.\n\nThen think about the possible modalities of communication. We use electromagnetic (light) and acoustic (pressure wave in atmosphere) sensors for the vast majority of our interface outputs. But even on Earth there are lots of species that do other kinds of investigation and communication and interaction with their environments. \n\nWhat would a computer for a species that communicates with pheromones need for an interface?", "is_submitter": false, "distinguished": null, "created_utc": 1629512990.0, "parent_id": "t1_h9qjcyh", "replies": []}]}]}]}]}, {"author": "SybariteAussie", "id": "h9iujl5", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p7d7hy", "stickied": false, "body": "Perhaps we can construct a AI with the capacity?", "is_submitter": false, "distinguished": null, "created_utc": 1629374812.0, "parent_id": "t3_p7d7hy", "replies": [{"author": "yeetoveeto", "id": "h9j3944", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #62", "submission": "p7d7hy", "stickied": false, "body": "I'd say this would be our best bet currently, but that would entail having an ultra intelligence sorting out the math and actual heavy thinking of the theory and then just put into words for us. I want to know if you think we'd be able to do all the heavy lifting ourselves.", "is_submitter": true, "distinguished": null, "created_utc": 1629379431.0, "parent_id": "t1_h9iujl5", "replies": [{"author": "Cregaleus", "id": "h9k3jzc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "p7d7hy", "stickied": false, "body": "We do the math too. Von Neumann was right, math is t learned; it is accepted.\n\nAn assumption people tend to make when talking about cognition is that perception precedes analysis. The nervous system actually does a lot of signal analysis prior to our perceived experience. Sensory illusions like optical illusions or auditory tricks are good and fun, but they also prove that our experience is a mediated one.\n\nWithout an intuitive a priori knowledge of math an information system would be unable to detect the sorts of signals required to turn electrical and chemical events into coherent sensory experience.\n\nWhatever AI humanity is capable of creating will necessarily be consistent with how we are capable of understanding the world. I think the idea that an AI could better understand reality than humans is a non-starter on many levels. For one, we've yet to prove whether or not senses are capable of corresponding with truth to start with. Beyond that, a human created artificial intelligence necessarily is based on a human model of reality. Any sort of extrapolation from this human mode of reality must be consistent with it.", "is_submitter": false, "distinguished": null, "created_utc": 1629394705.0, "parent_id": "t1_h9j3944", "replies": []}]}, {"author": "SybariteAussie", "id": "h9j8vrq", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p7d7hy", "stickied": false, "body": "This entity would be accused of being the anti christ by zealots and require a lot of security! Perhaps reality is not as complicated as we assume? We each have our own version of reality. Reality changes the further your viewpoint zooms out.", "is_submitter": false, "distinguished": null, "created_utc": 1629382023.0, "parent_id": "t1_h9iujl5", "replies": []}, {"author": "Paul_Thrush", "id": "h9jafam", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": "AI is a misnomer. It isn't intelligent. It's computer programs.", "is_submitter": false, "distinguished": null, "created_utc": 1629382699.0, "parent_id": "t1_h9iujl5", "replies": [{"author": "Cregaleus", "id": "h9k0iai", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "p7d7hy", "stickied": false, "body": "What is so special about meat that meat-based information systems get to be referred to as intelligent, but not non-meat based systems? Seems discriminatory to me.", "is_submitter": false, "distinguished": null, "created_utc": 1629393441.0, "parent_id": "t1_h9jafam", "replies": [{"author": "Paul_Thrush", "id": "h9kbe0u", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": "Why deprecate animal life by calling it meat?", "is_submitter": false, "distinguished": null, "created_utc": 1629397991.0, "parent_id": "t1_h9k0iai", "replies": [{"author": "Cregaleus", "id": "h9kokzc", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "p7d7hy", "stickied": false, "body": "Well, I can't answer that until you answer my question: what's is so special about meat? Why does a thing need to be made out of meat to be considered animal life? What exactly is life anyway? Why does it need to be meat?", "is_submitter": false, "distinguished": null, "created_utc": 1629403414.0, "parent_id": "t1_h9kbe0u", "replies": [{"author": "Paul_Thrush", "id": "h9nq40e", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": "I never said that you're arguing with your own strawman.", "is_submitter": false, "distinguished": null, "created_utc": 1629465636.0, "parent_id": "t1_h9kokzc", "replies": [{"author": "Cregaleus", "id": "h9nrmp4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "p7d7hy", "stickied": false, "body": "You still haven't yet responded to my question or made an argument of your own. I can only infer your position because you refuse to state it.\n\nState your argument or I'm going to have to assume that you're just butt hurt about my calling organic intelligence meat.\n\nAnswer this: what is it about organic intelligence that makes it intelligent? Is it the meat that it is made out of, or something else? Is it the evolutionary nature of the intelligence?", "is_submitter": false, "distinguished": null, "created_utc": 1629466352.0, "parent_id": "t1_h9nq40e", "replies": [{"author": "Paul_Thrush", "id": "h9o0tzs", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": "https://www.youtube.com/watch?v=FG1NrQYXjLU", "is_submitter": false, "distinguished": null, "created_utc": 1629470316.0, "parent_id": "t1_h9nrmp4", "replies": [{"author": "Cregaleus", "id": "h9o1ub7", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "p7d7hy", "stickied": false, "body": "I'm not going to watch your youtube video. Articulate your own argument", "is_submitter": false, "distinguished": null, "created_utc": 1629470730.0, "parent_id": "t1_h9o0tzs", "replies": []}]}]}]}]}]}]}, {"author": "SavnetSinn", "id": "h9k55bk", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #73 | Ordo Cognitus", "submission": "p7d7hy", "stickied": false, "body": "And why, exactly, can't a computer program be intelligent?", "is_submitter": false, "distinguished": null, "created_utc": 1629395371.0, "parent_id": "t1_h9jafam", "replies": [{"author": "Paul_Thrush", "id": "h9kcm2q", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": "A computer program is instructions stored in a file. Like words are stored in a book. Both are created by (somewhat) intelligent people, but do not possess their own intelligence.", "is_submitter": false, "distinguished": null, "created_utc": 1629398501.0, "parent_id": "t1_h9k55bk", "replies": [{"author": "SavnetSinn", "id": "h9kfluk", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #73 | Ordo Cognitus", "submission": "p7d7hy", "stickied": false, "body": "By that logic, a brain is simply a collection of neurons and glial cells and their connections. It doesn't possess intelligence either, but intelligence emerges from the concerted dynamics between its components. I am someone who would argue that a computer program (or, more likely, very many programs and databases communicating in a suitable framework) can result in emergent intelligence, as well.", "is_submitter": false, "distinguished": null, "created_utc": 1629399748.0, "parent_id": "t1_h9kcm2q", "replies": [{"author": "Paul_Thrush", "id": "h9kgnm7", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": ">By that logic\n\nPlease don't strawman me.\n\n&#x200B;\n\n>can result in emergent intelligence\n\nHow would you demonstrate that's true? By your feels?", "is_submitter": false, "distinguished": null, "created_utc": 1629400186.0, "parent_id": "t1_h9kfluk", "replies": [{"author": "SavnetSinn", "id": "h9kosvt", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #73 | Ordo Cognitus", "submission": "p7d7hy", "stickied": false, "body": ">Please don't strawman me.\n\nI'm not; I'm just following the implications of your own words. Defining a program as a list of instructions or a book as a list of words is reductive and paves the way to my own analogy about brains. The only license I took is to assume that you hold intelligence to be a characteristic of brains, but correct me if you consider that inaccurate.\n\n&#x200B;\n\n>How would you demonstrate that's true? By your feels?\n\nTo my understanding, intelligent actions in narrowly-focused expert systems have already been demonstrated, and the range of behaviors that have been historically limited to human or animal cognition appears to become smaller with technological advancement.\n\nBroader, 'general' intelligence is probably something more than a simple gestalt of expert systems, but I don't see any issue with replicating general intelligence in a non-biological medium. The prerequisite is a more comprehensive understanding of intelligence itself.\n\nPerhaps we'll find middle ground, though. Are you simply saying that existing technologies often referred to as AI are not intelligence, or are you precluding the development of artificial intelligence entirely? That would give us something more interesting to talk about.", "is_submitter": false, "distinguished": null, "created_utc": 1629403500.0, "parent_id": "t1_h9kgnm7", "replies": [{"author": "Paul_Thrush", "id": "h9nr5zx", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": "Your problem is that you asked why a computer program can't be intelligent when what you meant is that the computer can be intelligent while it is executing the program. They're very different things. And it's accurate, not reductive, to say a computer program is a list of instructions in a file.", "is_submitter": false, "distinguished": null, "created_utc": 1629466135.0, "parent_id": "t1_h9kosvt", "replies": [{"author": "SavnetSinn", "id": "h9o0han", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #73 | Ordo Cognitus", "submission": "p7d7hy", "stickied": false, "body": ">you asked why a computer program can't be intelligent when what you meant is that the computer can be intelligent while it is executing the program\n\nThis is a fair point, but I would still refer back to your original assessment about AI being a misnomer and I hope you would also acknowledge that to be the superseding point on which we're basing the discussion. Yes, an unused file is just as inert as an unread book or a dead brain. I'm curious to know your thoughts, then, on the possibility of a computer program exhibiting intelligence at runtime.\n\n&#x200B;\n\n>it's accurate, not reductive\n\nI would never say that a reductive characterization is necessarily inaccurate, as the two qualities are not mutually-exclusive. I am thinking in terms of phenomenological analysis, vis-à-vis Daniel Dennett's 'stance' strategy. The physical stance, for example, is inherently reductive but certainly not inaccurate.", "is_submitter": false, "distinguished": null, "created_utc": 1629470170.0, "parent_id": "t1_h9nr5zx", "replies": [{"author": "Paul_Thrush", "id": "h9o5cnw", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": ">I'm curious to know your thoughts, then, on the possibility of a computer program exhibiting intelligence at runtime.\n\nThere's a lot of hype and fantasy around this subject. People have biases towards wanting a computer to be intelligent and the people who sell these systems want people to believe the systems are intelligent. But what definition of intelligence are you using? What objective measures do you have? Do they apply equally to insects and computers?\n\nOne important feature of a human brain is that it alters itself. Computers don't alter themselves or their programs. By that measure computers don't learn. Also they cannot adapt themselves to new tasks or new environments. They do what they're programmed to do.", "is_submitter": false, "distinguished": null, "created_utc": 1629472160.0, "parent_id": "t1_h9o0han", "replies": []}]}, {"author": "Cregaleus", "id": "h9nx8pf", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #290", "submission": "p7d7hy", "stickied": false, "body": "Your problem is you have no understanding of the subject matter in question. Cognitive science has two main approaches to understanding intelligence. A Biological approach, where the emergent behavior of neurons is replicated through neural networks, and a logic based approach which has us creating machines through logic.  \n\n\nWhat evidence do you have that we are not just a list of instructions in a meaty-file? Do you posses the expertise to even be able to dispel such a flimsy argument, or will you just resort to being petulant?\n\nWhat makes you so confident in your understanding of this subject anyway? What is your experience with artificial intelligence?", "is_submitter": false, "distinguished": null, "created_utc": 1629468818.0, "parent_id": "t1_h9nr5zx", "replies": [{"author": "Paul_Thrush", "id": "h9nyl32", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": ">What evidence do you have that we are not just a list of instructions in a meaty-file?\n\nBecause we're alive, moron. We have life processes. We have awareness and consciousness. You still need to learn the difference between a computer program and a computer executing the program. Look up Turing machines. It simplifies the subject.", "is_submitter": false, "distinguished": null, "created_utc": 1629469387.0, "parent_id": "t1_h9nx8pf", "replies": []}]}]}]}]}]}, {"author": "RiderHood", "id": "h9loiac", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "p7d7hy", "stickied": false, "body": "The field of machine learning is changing this.  Computer programs can and will become intelligent on their own, much more so than its creator.", "is_submitter": false, "distinguished": null, "created_utc": 1629419045.0, "parent_id": "t1_h9kcm2q", "replies": []}]}]}, {"author": "RiderHood", "id": "h9lo2bi", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "p7d7hy", "stickied": false, "body": "Not currently. But one day it will become sentient.", "is_submitter": false, "distinguished": null, "created_utc": 1629418838.0, "parent_id": "t1_h9jafam", "replies": []}]}]}, {"author": "roundearthervaxxer", "id": "h9j8udt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #273", "submission": "p7d7hy", "stickied": false, "body": "AIs might have a better chance.", "is_submitter": false, "distinguished": null, "created_utc": 1629382006.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "NotSkyve", "id": "h9k3ixz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #17", "submission": "p7d7hy", "stickied": false, "body": "I mean we could easily assume we already know a lot of it, so idk. We of course have no idea how \"deep\" everything can still go. In theory I suppose it would take quite a bit of getting used to new understanding if the distance from the current one to the \"final\" state is to far, but it could be manageable.", "is_submitter": false, "distinguished": null, "created_utc": 1629394693.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "Transparency2Thee", "id": "h9k6ko2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #32", "submission": "p7d7hy", "stickied": false, "body": "Nope. Lol\n\nHumans are generally very slow when it comes to replacing modern assumptions/belief with fact. In addition to that, the sheer volume of information would be more than any consenting individual could fathom. It would take a very long time, even with the aid of the exponential growth of AI to organize the whole of that data. Even then, it feels disingenuous to credit ourselves with the achievements of our “tools”. The day when we relinquish our title of “operator”to become mere observers is quickly approaching. We have been successful within our given range, but I don’t think it’s rational to expect ourselves to be capable of being limitless.", "is_submitter": false, "distinguished": null, "created_utc": 1629395962.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "Botwmaster23", "id": "h9kei1b", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #97", "submission": "p7d7hy", "stickied": false, "body": "no, because as intelligent as we may be we will never fully comprehend the nature of the universe. Unless we gene modificate the future humans to have even bigger brains", "is_submitter": false, "distinguished": null, "created_utc": 1629399288.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "prajnadhyana", "id": "h9kqwec", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #168", "submission": "p7d7hy", "stickied": false, "body": "No, not truly. We can have a pretty good idea of how things work from a practical perspective, but the human mind just isn't capable of understanding how truly odd the Universe is.", "is_submitter": false, "distinguished": null, "created_utc": 1629404344.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "MisanthropicScott", "id": "h9l79hs", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #6 | Ordo Cognitus", "submission": "p7d7hy", "stickied": false, "body": "We may be capable of at least getting as far as a grand unified theory or theory of everything. Beyond that, I have no idea.\n\nThe real problem is surviving long enough to do it. I'm not seeing any evidence of us even trying to survive this century.", "is_submitter": false, "distinguished": null, "created_utc": 1629411107.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "patricktoba", "id": "h9l7vyw", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #39", "submission": "p7d7hy", "stickied": false, "body": "I believe that a select few of us could be able to grasp  the nature of reality CONCEPTUALLY but I don't believe we have the evolutionary tools to be able to fully observe or experience reality in any sort of way that's much more profound than some us currently do.", "is_submitter": false, "distinguished": null, "created_utc": 1629411377.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "here_4_cat_memes", "id": "h9ljdds", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #178 | Consortii Concordus", "submission": "p7d7hy", "stickied": false, "body": "Sure. I don’t see why not. We discovered math, the planets, insanely difficult physics and how particles behave on the quantum level, and we learned how to fly heavy ass airplanes. Sure, there are stuff we don’t understand, but 1) we have time to figure it out and 2) there are some crazy smart people out there", "is_submitter": false, "distinguished": null, "created_utc": 1629416621.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "RiderHood", "id": "h9lns5t", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #5", "submission": "p7d7hy", "stickied": false, "body": "Not with the human brains we have now. But one day, we will merge our consciousness with the Singularity, and then we will begin to understand.", "is_submitter": false, "distinguished": null, "created_utc": 1629418710.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "eliminating_coasts", "id": "h9lujat", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #129", "submission": "p7d7hy", "stickied": false, "body": "I think if we think about them bringing all knowledge, that wouldn't be that helpful, because he'd either have to bring it in a container some large fraction of the universe, or potentially a black hole, or he'd have to stick it in another kind of space with different physical properties, and we'd just have difficulty getting through all that information without having to be a black hole ourselves.\n\n(That's in a sense of having a storage system that knows \"all true facts\" about the configuration of the universe.)\n\nSo that's not going to work, but let's say he has not all knowledge, but the compression of all knowledge, so that everything that is the same is ignored. Then I feel like even knowing *how* it's compressed will tell us some pretty profound stuff, if it's possible to describe some reasonable subset of the important facts of the world using a much simpler description, that will put us a huge way towards understanding how things are.", "is_submitter": false, "distinguished": null, "created_utc": 1629421839.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "UptightBean", "id": "h9luu8e", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #122", "submission": "p7d7hy", "stickied": false, "body": "Yes, imagination and abstract thought allow us to understand things otside of our physical limit", "is_submitter": false, "distinguished": null, "created_utc": 1629421980.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "Happy_INTP", "id": "h9m6amc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #69", "submission": "p7d7hy", "stickied": false, "body": "I'm going with no.  Humans really don't even do very large numbers well, much less visualize higher dimensions.", "is_submitter": false, "distinguished": null, "created_utc": 1629427534.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "IamTJcon", "id": "h9mm5v8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Druid #10 | Ordo Cognitus", "submission": "p7d7hy", "stickied": false, "body": "You mean Enlightenment?\n\nPpl say when they get Enlightend their perception opens up to the Experience of the whole Universe....\n\nAlso there are rumers that the originator of Yoga was a being from another realm. ( yes if he were an alien we already living OPs scenario, trying to do all body twisting and bending to be able to grasp this knowledge even today - this could be the alien language we are seeded to learn from an evolved alien) \n\nLol 😂 sounds funny. But what it were true", "is_submitter": false, "distinguished": null, "created_utc": 1629436674.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "PhilboBaggins111", "id": "h9mnly5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #145", "submission": "p7d7hy", "stickied": false, "body": "No. I dont beleive any part of a system can understand wholly the system it is part of. There is simply too much to grasp. \n\nAdditionally, there are possibilities that we just simply cannot prove or disprove. No matter how much information we gather. We will never see past the edge or our universe due to laws of physics and such. There could be more out there but we will never know, and knowing is required to fully grasp reality. We could be in an elaborate simulation, but we may never know if the simulation is advanced enough, thus we couldn't fully grasp our reality.", "is_submitter": false, "distinguished": null, "created_utc": 1629437679.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "dnixl", "id": "h9n9bi5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #201 | Consortii Concordus", "submission": "p7d7hy", "stickied": false, "body": "No, we couldn't. I'm pretty sure our perception isn't able to catch the necessary elements to understand our reality. I think everything regulates themselves with their proper rules. We've tried creating the concept of science to have something to call \"an universal rule\", but it's actually a product of the universal human's perception of reality. We're like a cell trying to understand the house where the body lives.", "is_submitter": false, "distinguished": null, "created_utc": 1629455666.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "ResidentIdaKozuke", "id": "h9o5ma2", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #198", "submission": "p7d7hy", "stickied": false, "body": "I don’t want to be mean, I mean this genuinely, but the question is meaningless. Because the question runs on so many assumptions and undefined variables that it’s impossible to reach a conclusion based on any actual logic.\n\nFirst off, what is knowledge? That question on its own is going to be infinitely explorable without defined variables. In what means do we have this knowledge transferred to us? If it were through a sensual medium, we’d be completely incapable of learning all of it before we die of old age. Then there is the question of certainty. \n\nNow to make this even more annoying than it already is, we have to consider the fact that knowledge itself is defined mostly by the knower as opposed to some pre existing force or form of matter. Sadly, this alone makes it nigh impossible for an alien to possess information within our definition of knowledge. \n\nLets say (even though it is definitely not the case) that the hypothetical was posed with this knowledge (pun intended) on the nature of knowledge being taken into account, then humans would have no option but to be able to fully comprehend all of the knowledge granted by the entity. Why? Because the entity is capable of grasping all of that knowledge, and the only way the entity is capable of grasping that form of information is if it was bound to the same level of consciousness and awareness as we are. \n\nSee what I mean? No meaningful answer can be cultivated through discussing a hypothetical like this without agreeing on definitions!", "is_submitter": false, "distinguished": null, "created_utc": 1629472271.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "19374729", "id": "h9obite", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p7d7hy", "stickied": false, "body": "I think we can approach it but not reach absolute.\n\nhumans are a fragment of the whole and while we are part of the whole and connected to it I think we can approach it and understand way much more than we do… but on a complete true overview level I say no, like for example your toe nail if sentient fully comprehending your nervous system and psychology and muscular system etc \n\nRough analogy but you get the point", "is_submitter": false, "distinguished": null, "created_utc": 1629474651.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "1up_for_life", "id": "h9oxhci", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #277", "submission": "p7d7hy", "stickied": false, "body": "Probably not, we can't even understand what the dolphins are trying to tell us.", "is_submitter": false, "distinguished": null, "created_utc": 1629483484.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "obiwanlenobi", "id": "haqto7u", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #295", "submission": "p7d7hy", "stickied": false, "body": "No. But I don't think there's one way to view the truth, perhaps we can comprehend it.", "is_submitter": false, "distinguished": null, "created_utc": 1630195476.0, "parent_id": "t3_p7d7hy", "replies": []}, {"author": "Paul_Thrush", "id": "h9jasuk", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #142", "submission": "p7d7hy", "stickied": false, "body": "Have you seen this?\n\n[The Nature of Reality](https://www.youtube.com/watch?v=pLbSlC0Pucw)", "is_submitter": false, "distinguished": null, "created_utc": 1629382856.0, "parent_id": "t3_p7d7hy", "replies": [{"author": "1i_rd", "id": "h9mf54i", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #199", "submission": "p7d7hy", "stickied": false, "body": "Saving this for later. I love these talks", "is_submitter": false, "distinguished": null, "created_utc": 1629432307.0, "parent_id": "t1_h9jasuk", "replies": []}]}, {"author": "celtic_cuchulainn", "id": "h9kj6uq", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #168", "submission": "p7d7hy", "stickied": false, "body": "Sometimes I think part of being human is forgetting the nature of the universe and reality. So if any entity explained everything, you would take away what it is to be human.", "is_submitter": false, "distinguished": null, "created_utc": 1629401229.0, "parent_id": "t3_p7d7hy", "replies": []}]}