{"title": "Just random toilet thoughts", "name": "t3_p9cuca", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p9cuca/just_random_toilet_thoughts/", "selftext": "Were all familiar with the \"everything has gone downhill since 2016 meme/idea\" but has society really downgraded or gotten that bad where we all see the world for the shitty place it is or has our gained interest in social media and our increased amount of time spent on it just opened our eyes to everything going on in the world and led to a larger scale of that study(i think most people or familiar with or at least heard of the idea) that says that the more time we spend on social media the greater correlation of depression there is\n\n\nPs i dont really ever start threads well, i just cant get the idea out quite right but i follow the conversation well and the idea point there", "score": 6, "upvote_ratio": 0.76, "permalink": "/r/TheFlyingTree/comments/p9cuca/just_random_toilet_thoughts/", "id": "p9cuca", "author": "Yermo45", "link_flair_text": "Idea", "num_comments": 26, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1629640388.0, "comments": [{"author": "SmileFirstThenSpeak", "id": "h9wsm8d", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "p9cuca", "stickied": false, "body": "All I know is I used to have this idea  that most people are respectable until they prove otherwise. Now, I am skeptical of most people, because idiots are showing their beliefs more openly. I had no idea how bad it was.", "is_submitter": false, "distinguished": null, "created_utc": 1629641330.0, "parent_id": "t3_p9cuca", "replies": [{"author": "Yermo45", "id": "h9wt4vi", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #150", "submission": "p9cuca", "stickied": false, "body": "As a kid we think the worlds sunshine and rainbows, but growing up, life sucks, people are usually assholes, and there's nothing actually required of us in life but to pay taxes and die and that realization hits swiftly and hard. I think at some point we all have a \"what's the point of all this\" moment and tbh rn i just got married and i have my first child on the way (its a boy btw) and i couldn't be more happy with where im at in life especially when compared to even just a year ago, yet at the same time it all feels so monotonous and pointless.", "is_submitter": true, "distinguished": null, "created_utc": 1629641582.0, "parent_id": "t1_h9wsm8d", "replies": [{"author": "SmileFirstThenSpeak", "id": "h9wug78", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "p9cuca", "stickied": false, "body": "You’re considerably younger than I am, and have the “advantage” of social media so you can more easily spot when a potential friend is someone you want to bring closer or slowly back away from. When I was growing up, you only saw/heard what you saw/heard. Ignorance was probably bliss, I guess.", "is_submitter": false, "distinguished": null, "created_utc": 1629642205.0, "parent_id": "t1_h9wt4vi", "replies": []}]}, {"author": "DDumpTruckK", "id": "h9zf7n6", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #79", "submission": "p9cuca", "stickied": false, "body": "I find a lot of people saying this, and maybe I was just too cynical as a teen, but I haven't seen a change from 15 years ago.  People always were this way.  Maybe the brash and blatant bigotry used to have a thin veil over it back then, but I saw right through it so now that the veil is off I don't see a real change. People are just more honest about what they believe.\n\nIf you want a relentlessly optimistic view of it we could consider this a good thing.  Where people were apparently unable to see the ugly, ignorant, racist side of people we now can very clearly identify them by their own words.\n\nNow let me be clear.  Donald Trump, his supporters, and the others who may not support him but still indulge in racism and bigotry are bad.  It is not a good thing that we have these shameless racists around.  However, I would rather have them where we can see them than have them hiding their true thoughts behind lies and veneers.  I would also rather have them expressing their honest thoughts and opinions, rather than weaseling their way around it without ever saying it.  We can fight Nazis.  Fighting crypto-nazis is way, way harder (and sadly still a problem for us today anyway).\n\nBasically: ignorance is better in the open air than hiding and rotting behind a poorly managed façade.  It's why I interact the way I do with people.  I give them brutal honesty and I expect nothing less in return, because what's the point of talking with someone who keeps saying \"Yeah but some dogs have a higher bite rate than other dogs.\"  Just fucking say what you mean and let's talk about it.", "is_submitter": false, "distinguished": null, "created_utc": 1629684289.0, "parent_id": "t1_h9wsm8d", "replies": [{"author": "SmileFirstThenSpeak", "id": "h9zjx2v", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #190", "submission": "p9cuca", "stickied": false, "body": "I agree. I was in high school at the end of the 70’s, graduated college in ‘81. We didn’t have any social media at all. You met someone in class and became friends based on shared interests. We didn’t know what lurked underneath. Now, all these years later, and my school friends are talking such crap online. I don’t associate with 99% of them anymore. \n\nI have fewer friends, but those friends are higher quality (IMO) and I have no regrets.", "is_submitter": false, "distinguished": null, "created_utc": 1629686679.0, "parent_id": "t1_h9zf7n6", "replies": []}]}, {"author": "CemeteryWind213", "id": "h9xvewp", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #175 | Classis Veritatus", "submission": "p9cuca", "stickied": false, "body": "Many people have removed their masks (ie persona) since 2015/2016.", "is_submitter": false, "distinguished": null, "created_utc": 1629658273.0, "parent_id": "t1_h9wsm8d", "replies": []}]}, {"author": "arr4k1s", "id": "h9xuhc4", "score": 8, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #90", "submission": "p9cuca", "stickied": false, "body": "I think the world actually changed. Latent developments in politics and society finally surfaced, brought about by the election of fascists and the pandemic.", "is_submitter": false, "distinguished": null, "created_utc": 1629657869.0, "parent_id": "t3_p9cuca", "replies": []}, {"author": "dashingThroughSnow12", "id": "h9wvkdz", "score": 5, "subreddit": "TheFlyingTree", "author_flair": "Seeker #24", "submission": "p9cuca", "stickied": false, "body": "Ben Shapiro has said that Donald Trump did not kill American politics, he was the mortician diagnosing the death.\n\nI was re-watching some old Thunderf00t videos from 2014. They could have been released today and been as relevant.\n\nWe could go back to the past for thousands of years and keep hearing words about how awful things are and how they are getting worse.", "is_submitter": false, "distinguished": null, "created_utc": 1629642718.0, "parent_id": "t3_p9cuca", "replies": [{"author": "SybariteAussie", "id": "h9x25s3", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p9cuca", "stickied": false, "body": "I stumbled upon Ben Shapiro when I was researching antifa. I thought it stood for anti firearms so I was listening to debates on gun control. Responsible citizens that carry firearms and perish trying to protect innocents from predators, should not have to pay medical expenses or funeral costs. Ben beat the obnoxious Piers Morgan & changed my opinion on guns. They are not carved in stone. I am open to new data. The propaganda campaign in recent years is reminiscent of Europe, post WW1. The French intellectual brigade drained French morale. Similar occurred in Britain. Thomas Sowell & Victor Davis Hanson both discuss this. Society is changing swiftly. Hitlers willing executioners by Daniel Jonah Goldhagen makes more sense now. Orwell is beginning to feel like a prophet. Things could have been worse. Luckily Germany & Russia did not join forces. Hitler was the only world leader that Stalin kept his word to. 8 out of 11 German soldiers died vs Russia. I am not a doomer. I don’t hate people with opinions different from mine. I was despondent before I joined Reddit. Morale is improving, but slowly.", "is_submitter": false, "distinguished": null, "created_utc": 1629645706.0, "parent_id": "t1_h9wvkdz", "replies": []}, {"author": "Yermo45", "id": "h9wwfv1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #150", "submission": "p9cuca", "stickied": false, "body": "While you have a good point i wasn't nagging it in a political sense i just don't touch on it with really anywhere just to avoid the discussion", "is_submitter": true, "distinguished": null, "created_utc": 1629643119.0, "parent_id": "t1_h9wvkdz", "replies": []}]}, {"author": "SybariteAussie", "id": "h9wyg0e", "score": 4, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p9cuca", "stickied": false, "body": "2moro is day 13 on Reddit for me. I have been utilising the app for venting & deluding myself that me assuming a persona that I describe as benevolent Commander Data in atonement mode. Thought I was offering thoughtful & sage counsel but thinking I may have been wasting my time & interacting with camouflaged adverts that masquerade as people posting?🤔. Boom! The atonement points I had earned in my head turn to smoke and vanish. Trying to not be too cynical. I suggest our culture has been in decline since the 70s. Nixon promised that removing gold standard to US$ was a temporary measure. Inflation is the secret tax. If people fully understood the reserve banking system & economics. The riots would be savage. Income tax was only temporary. Citizens were happy to contribute to the war effort as they were assured it would cease when WW1. The Great War, the war to end all wars had ceased.", "is_submitter": false, "distinguished": null, "created_utc": 1629644037.0, "parent_id": "t3_p9cuca", "replies": [{"author": "step-lego-wat-u-doin", "id": "ha0h8rf", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p9cuca", "stickied": false, "body": "I wasn't alive back then, but the 70s was arguably the most pivotal point in recent (post WW2) history. Most of the shit we put up with today can be traced back to decision-making that took place in the 70s. Especially in terms of geopolitics and macro economics.", "is_submitter": false, "distinguished": null, "created_utc": 1629710652.0, "parent_id": "t1_h9wyg0e", "replies": []}]}, {"author": "entropyStable", "id": "h9wx9fp", "score": 3, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "p9cuca", "stickied": false, "body": "In 2015 everyone looked at the 2008 crash and downturn and say how we have gone down hill since then. I'm guessing we can play this game back all the way to WW2 pretty easily.", "is_submitter": false, "distinguished": null, "created_utc": 1629643496.0, "parent_id": "t3_p9cuca", "replies": [{"author": "Yermo45", "id": "h9wxqc9", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #150", "submission": "p9cuca", "stickied": false, "body": "But put that in perspective for a second and humour me, if we've been saying that for this long wouldn't you think there's at least some chance that we actually have been declining, as a country we've gotten too comfortable and ignorant, and we at least as a population have declined.", "is_submitter": true, "distinguished": null, "created_utc": 1629643713.0, "parent_id": "t1_h9wx9fp", "replies": [{"author": "entropyStable", "id": "h9x3mw8", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "p9cuca", "stickied": false, "body": "A valid question but much of the stuff we value in our daily life has only been around recently. Just imagine a life without computers for a few minutes. \n\nAs for the ignorant, 20 years ago you were reminded how dumb you were all the time;  when you didn't know something you couldn't easily look it up and would go your entire life without finding out. Now you can read 3 paragraphs on a topic and feel qualified to spout off about how you can solve drug prices or Afghanistan. This seems to be the price we pay for democratizing information. \n\nAn argument can be made that now vs 2007 we are worse, but you are comparing to a time when the middle class was living off of debt in an unsustainable way. Now this isn't to say certain policy choices haven't had negative societal impacts but overall I'm glad I have all these nice amenities compared to 20 yers ago.", "is_submitter": false, "distinguished": null, "created_utc": 1629646372.0, "parent_id": "t1_h9wxqc9", "replies": [{"author": "Yermo45", "id": "h9x6v44", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #150", "submission": "p9cuca", "stickied": false, "body": "You raise a good point, i hadn't thought of it that light. But the addition of newer technology and increased access to knowledge i feel while it has made a positive impact on us in general it can be argued that it has also led to our comfort and ignorance equally especially when looking at the younger generations and seeing how much they obsess over how to impress and \"influence\" and is causing a more negative impact.", "is_submitter": true, "distinguished": null, "created_utc": 1629647770.0, "parent_id": "t1_h9x3mw8", "replies": [{"author": "entropyStable", "id": "h9xmhyg", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "p9cuca", "stickied": false, "body": "First, comfort is a good thing and this technology doesn't make us more ignorant as we know more. The problem is we are still climbing the dunning-kruger curve but this in unavoidable. People appear dumber they aren't dumber. \n\n  \nIdk about you but my high school was equally full of people trying to impress and influence but it wasn't visible to those outside the school. Being an influencer is also a more valid path than sports, music or writing so you would need to judge these people as negatively.  There is an observation bias due to the internet over representing some aspect but it isn't clear there is an actual change. Reddit is a great example of this, dumbfucks can now spout out BS to the world as opposed to just their 3 friends.", "is_submitter": false, "distinguished": null, "created_utc": 1629654411.0, "parent_id": "t1_h9x6v44", "replies": [{"author": "Yermo45", "id": "h9y31ob", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #150", "submission": "p9cuca", "stickied": false, "body": "I feel like i just got told off so respectfully, you have a good point. Touché", "is_submitter": true, "distinguished": null, "created_utc": 1629661612.0, "parent_id": "t1_h9xmhyg", "replies": []}]}]}]}]}, {"author": "AlternativeMint", "id": "h9x26ht", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #214", "submission": "p9cuca", "stickied": false, "body": "I can tell it has been downhill since 2001 and the Twin Towers.\n\nThe frightening thing is that this seems to have s snowball effect.", "is_submitter": false, "distinguished": null, "created_utc": 1629645716.0, "parent_id": "t1_h9wx9fp", "replies": [{"author": "entropyStable", "id": "h9xnhca", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "p9cuca", "stickied": false, "body": "One terrorist attack completely destroyed society? I have hard time believing that is plausible. \n\nThe deployment of US troops has had little impact on US society in general, of course it has had a significant impact on those deployed and their family. While it has cost money it hasn't impacted our taxes or inflation negatively so it is hard to argue the finical impact has caused this downward trend.", "is_submitter": false, "distinguished": null, "created_utc": 1629654835.0, "parent_id": "t1_h9x26ht", "replies": [{"author": "Kweldulf", "id": "h9y80ac", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #208 | Consortii Concordus", "submission": "p9cuca", "stickied": false, "body": "Oh sweet summer child. Yes american government overreacted to 9/11. And it broke the world.\n\n>it hasn't impacted our taxes negatively\n\n\nIn year 2000 the US spent 320 billion (3.1% GDP) on military. In 2002 it was 378 billion (3.4%), and it kept rising peaking in 2010 at nice even 738 billion (4.9%). US tax structure is highly confusing and non uniform so it may be so that the taxes weren't raised to fund that bs, but if they weren't - the money had to come from somewhere. So the cost to society came in slower development of healthcare and education. Coolio.\n\nBut not only that. Lives of thousands of immigrants have been made significantly worse due to raise in racism and racially motivated crime. And conversly an unprecedentet raise of nationalism which has its own problems. \n\nBut say you are a white guy with enough money for private schools and healthcare. Good for you, and maybe you think 9/11 did not impact you. Well then just go to the airport and spend 3 hours on security checks - which only became a thing after 9/11. Before you could get on a plane as easily as on a train. And you could have fluids with you and scissors and whatever you wanted. And be there 15 minutes earlier.\n\nThat reminds me, with the taxes - you do realise that TSA was created as a direct consequence of 9/11? It was a part of the official government response. Cool right? TSA's annual budget is around 7 billion$. So add that to increase in military spending. But wait actually the whole Department of Homeland Security was created as a response to 9/11 (again official communications) - 51 billion of annual budget.\n\nSo in summary your claim is that none of the tax increases in the past 21 years have been caused by ~380 billion increase in spending which can be attributed to 9/11? And that TSA, ICE and other agencies of Homeland Security have little impact on everyday Americans? I'm sorry mate, are you crazy?\n\nAnd that's only considering the US, 9/11 impacted in different ways Europe as well.", "is_submitter": false, "distinguished": null, "created_utc": 1629663815.0, "parent_id": "t1_h9xnhca", "replies": [{"author": "entropyStable", "id": "h9z2ih5", "score": -1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #205", "submission": "p9cuca", "stickied": false, "body": "You need to posit what impact 9/11 had on America/the world such that it led to the decline of the US/the world. You haven't even come close to this but I will address the points you put forward. \n\n \n\n>tax structure is highly confusing and non uniform so it may be so that the taxes weren't raised to fund that bs, but if they weren't - the money had to come from somewhere. So the cost to society came in slower development of healthcare and education. Coolio.\n\nYes money is fungible but you are incorrect in assuming the money has to come from somewhere else. The US doesn't run neutral budgets and just because it will deficit spend for one program doesn't mean it will do so for another. I agree the wars have been expensive but the average American hasn't felt the economic impact. The idea that the GOP would approver large scale deficit spending for health care and education, is absurd based on their current and historical stance on those issues. You are also missing a key piece of the argument, even if what you said is correct how would a slower increase in health and education spending lead to a declining of society. \n\n&#x200B;\n\n>But not only that. Lives of thousands of immigrants have been made significantly worse due to raise in racism and racially motivated crime.\n\nYes it created increased xenophobia against Muslims and that is terrible but again you need to link this to some continuous decline of society. While you did see a spike after 9/11 the xenophobia seemed to drop until more recently when it has risen but also expanded to other groups. You are going to have a hard time crafting a narrative that links that back to 9/11 and some snowball effect after that. I posit the current trend in xenophobia is largely a result of the  2008 crash combined with an increasing push towards a service economy leading to economic hardship to traditionally stable classes but there are other theories for this trend. \n\n&#x200B;\n\n>maybe you think 9/11 did not impact you. Well then just go to the airport and spend 3 hours on security checks - which only became a thing after 9/11. Before you could get on a plane as easily as on a train. And you could have fluids with you and scissors and whatever you wanted. And be there 15 minutes earlier.\n\nSo a 3 hour wait when you have to fly is what broke the world? Your first point was weak but this is laughable.  \n\n&#x200B;\n\n>So in summary your claim is that none of the tax increases in the past 21 years have been caused by \\~380 billion increase in spending which can be attributed to 9/11? \n\nGiven that my response was 4 sentence it is shocking you failed to read them. The statement I made is \"While it has cost money it hasn't impacted our taxes or inflation negatively so it is hard to argue the finical impact has caused this downward trend\". I never once said it didn't cause spending, to the contrary I said it did cost money but that the average American hasn't felt the ecominc impact.\n\nWe've run massive deficits to pay for the wars and so taxes haven't really changed since 2001 (you can say they have risen or fallen a small amount depending on how you compute the metric). But the important question is where are Americans feeling the impact of this spending? and how has it caused society to decline for 20 years? I'll give you a hint, you are going to need to show that this impact was comparable to the 2008 crash else that crash and hardship both on American house-holds and the US budget would be a more proximal cause to the decline.  \n\n&#x200B;\n\n>And that TSA, ICE and other agencies of Homeland Security have little impact on everyday Americans? \n\nTSA has very little impact, it is absurd to argue otherwise. Most Americans (by this I mean people living here not just citizens) haven't had meaningful interactions with ICE of HS. Wether or on not these departments should exist or if they are over zealous are separate questions. If you have some evidence that TSA, ICE and HS were fundamentally changing US society year after year from 2001-2020 I'd love to hear it, but I doubt you even knew much about ICE in 2005.", "is_submitter": false, "distinguished": null, "created_utc": 1629678011.0, "parent_id": "t1_h9y80ac", "replies": []}]}]}]}]}, {"author": "Alirezahjt", "id": "h9yby1k", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #70", "submission": "p9cuca", "stickied": false, "body": "I agree with you... up until COVID.\n\nCOVID really messed things up, globally. So I kinda agree that the older we get the better, perhaps fake, image we have from the past, but I think COVID objectively made things go downhill.", "is_submitter": false, "distinguished": null, "created_utc": 1629665566.0, "parent_id": "t3_p9cuca", "replies": []}, {"author": "calmlikeasexbobomb", "id": "h9z8jkx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #262", "submission": "p9cuca", "stickied": false, "body": "The country has been going downhill since its inception. The things we see today that we think are new, that couldn’t have happened in decades past, they did. People and politics don’t change, just the players. We managed to get our act together about the ozone layer, and that gave me hope. But now we have climate change, and no political will to do anything about it, though we could. When the internet came along, it seemed like something that could revolutionize the world in the best ways. And we’ve seen the unfortunate ways that has played out with social media, the patriot act, and such.", "is_submitter": false, "distinguished": null, "created_utc": 1629680980.0, "parent_id": "t3_p9cuca", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h9xmgz0", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p9cuca", "stickied": false, "body": "Nothing has really changed, some people use to have the luxury of living in a fantasy world.", "is_submitter": false, "distinguished": null, "created_utc": 1629654399.0, "parent_id": "t3_p9cuca", "replies": []}, {"author": "Skastrik", "id": "ha0jfb8", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #272", "submission": "p9cuca", "stickied": false, "body": "Honestly I think given any period in history with very few exceptions. You'd always be of the opinion that things are going extremely downhill. It might be different things but there is always some general feeling of things having gotten worse overall.", "is_submitter": false, "distinguished": null, "created_utc": 1629712543.0, "parent_id": "t3_p9cuca", "replies": []}]}