{"title": "Let's talk about cars", "name": "t3_p29f44", "url": "https://www.reddit.com/r/TheFlyingTree/comments/p29f44/lets_talk_about_cars/", "selftext": "I have a good number of car things going on right now, myself.  The big one is that my car (a C5 or so Audi A6 2.7T) is in the shop for a rather drawn out and expensive clutch rebuild.  I've known the clutch was going to die eventually since I got the car, of course, but it started seriously slipping about a month or so ago.  You could feel it getting worse as you were driving, so it was either that, or buy a replacement, and to be honest I *really* like that car.  Two turbos, AWD, slip protection that literally lets you steer on ice as if it were dry pavement, and the six speed manual gearbox.  Anyway, I'm having it repaired.  It's hard to find a manual version of that car, and mine is the last year they made them.  I'll probably keep it for a good while longer if I can manage.  ... but of course it's never that simple.  The mechanics had to order some shift linkages that were also wearing down, some engine mounting bits that were rusted, and the exhaust system was in pretty bad shape too.  All reasonable, but of course they had to wait a day or two a couple times for all the parts, and then they ordered at least one wrong one, so they had to re-order that.  They tell me everything is back in except the exhaust now, the car runs and shifts and things are going fine, so maybe it will be done any time.\n\nIn addition, we've bought a truck recently.  It's a second generation Ram 2500 that used to be a railroad maintenance vehicle until recently.  It has the 5.9L gasoline engine in it, automatic transmission, flashing orange emergency strobe, spotlight, big Knapheide frame built into the back with tons of toolboxes and what not built in.  Otherwise it's quite spartan, even to the point of having manual windows and no AC.  Needs a good cleaning.  Also a number of other things: The rear window latch is busted, the head liner is hanging down in spots, the cabin is leaking a bit of water, the plastic of the dash is breaking apart in places.  It has some rust spots; bit of exhaust rot too, out past the muffler where it doesn't matter all that much yet.  Mostly minor annoyances.  When we got it the drivers side seat adjust mechanism was seized up and would not work.  I fixed that, and I've started on a couple of the other things.  The difference in acceleration between the Audi and the Dodge is, well, substantial.  That's not surprising, since trucks are geared for torque, but I'm wondering whether it can't do a bit better.  The factory air box sets right on top of the engine so it seems like an aftermarket air intake might be dead simple.  I have a kit with the right pipes on order as well as a K&N high flow filter.  Either it will help, or it will not hurt and save me a bit of money on filter replacements.  Could probably use a tune up too.\n\nAnyway, what has everyone else got going on?", "score": 6, "upvote_ratio": 1.0, "permalink": "/r/TheFlyingTree/comments/p29f44/lets_talk_about_cars/", "id": "p29f44", "author": "zoharel", "link_flair_text": "Discussion", "num_comments": 24, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1628673072.0, "comments": [{"author": "ISTP_Loner", "id": "h8iojjo", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p29f44", "stickied": false, "body": "Back in the 80’s I had a mercury Lynx wagon with a manual transmission. Reverse was right up next to first gear. Couple times trying to back out a parking spots (after some cocktaiIs) accidentally had it first and rammed the car in front of me. 🤭. I was a teenager. I also had a Nissan pick up with a manual trans. Had to get out and manually lock the hubs to put it in 4WD.", "is_submitter": false, "distinguished": null, "created_utc": 1628677640.0, "parent_id": "t3_p29f44", "replies": [{"author": "zoharel", "id": "h8mu2cr", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p29f44", "stickied": false, "body": "In this one, reverse is push, left, up.  Unfortunately, when I drive a 5 speed, it can be a problem because reverse is where 6 is on my car.  Fortunately there are lock outs these days that prevent you from shifting directly from fifth to reverse.", "is_submitter": true, "distinguished": null, "created_utc": 1628759135.0, "parent_id": "t1_h8iojjo", "replies": []}]}, {"author": "sweber145", "id": "h8iqsh7", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #68", "submission": "p29f44", "stickied": false, "body": "I’m driving a prius right now. I really like it. \n\nI’ve got my eye on a 1948 Cadillac Limo though, to turn into a hot rod. If i get it, i’m pretty sure the only original thing left will be the body, maybe the front seat. It’ll have a 383 stroker, 6 speed, and I’m not sure on the rear end yet. It’s black currently, but it will end up very dark green, with a custom hood ornament, and some pinstriping. Also, the passenger compartment will have the benches pulled out, replica ww2 bomber seats put in, and it’ll have a pretty decent sound system. Debating on getting the body acid dipped to reduce weight. Should be a pretty fun multi-year project.\n\nAlso looking at trucks, but I want something from the 30’s or 40’s. Maybe a Studebaker, if i can find one, or a little mack, a Mack that they only built for about 5 years in the 30’s for the personal/ light duty market. It was a flop, because Mack was known for their heavy duty, but man do they look good.", "is_submitter": false, "distinguished": null, "created_utc": 1628679468.0, "parent_id": "t3_p29f44", "replies": []}, {"author": "ISTP_Loner", "id": "h8img18", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #153", "submission": "p29f44", "stickied": false, "body": "I just got a Kia K5 which is the new version of the optima.  This exact model, gray with red interior  \nhttps://www.caranddriver.com/reviews/a33325501/2021-kia-k5-drive/\nI had a 1997 Deville but the side mirror came off at the car wash so I figured it was time. Lol. \nI used to have a Taurus SHO and my most favorite car was a 2009 G8 GT with a 6.0. The SHO was nicer inside and more comfortable, but the G8 was faster. I also have a Honda 750 Shadow.", "is_submitter": false, "distinguished": null, "created_utc": 1628675813.0, "parent_id": "t3_p29f44", "replies": []}, {"author": "John__Nash", "id": "h8iydi4", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #17", "submission": "p29f44", "stickied": false, "body": "We have a real clunker with our 2014 Nissan quest. They clearly went cheap in a number of places to keep the cost down. We've had to replace the transmission, shocks, etc. And way too often get new brakes and tires. \n\nThis weekend during a rainstorm water started leaking through the headboard. After a bit of experimentation I figured out it was the drain tubes in the sunroof being clogged up that caused it. So I ran a bit of tubing from the kids fish tank in there and blasted it with compressed air. Et voila!  Fixed.", "is_submitter": false, "distinguished": null, "created_utc": 1628684602.0, "parent_id": "t3_p29f44", "replies": []}, {"author": "BuccaneerRex", "id": "h8j0yjz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #96", "submission": "p29f44", "stickied": false, "body": "Eh. Cars are things to get me from point A to point B. Like shoes, I use them until they fall apart and get a new one. \n\nExcept for some reason cars have a lot more paperwork.", "is_submitter": false, "distinguished": null, "created_utc": 1628686083.0, "parent_id": "t3_p29f44", "replies": []}, {"author": "Zealousideal_Mix_629", "id": "h8j7nvm", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #13 | Legio Virtus", "submission": "p29f44", "stickied": false, "body": "I drive a German car as well, maintenance is just the cost of a great driving experience. I would buy another in a heartbeat maintenance bill and all.", "is_submitter": false, "distinguished": null, "created_utc": 1628689550.0, "parent_id": "t3_p29f44", "replies": []}, {"author": "s1gnalZer0", "id": "h8j7qxg", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #16", "submission": "p29f44", "stickied": false, "body": ">slip protection that literally lets you steer on ice\n\nWith good tires and AWD you have an advantage on ice, but it's still ice and if you're overconfident, you might still have a bad time\n\n>The difference in acceleration between the Audi and the Dodge is, well, substantial. That's not surprising, since trucks are geared for torque, but I'm wondering whether it can't do a bit better.\n\nThe difference is most likely from the gear ratios in the transmission and the differential than from airflow, although it wouldn't hurt anything to improve the airflow. \n\nMy dad had a work truck similar to what you have, it was an old Dodge from the late 70s/early 80s. It was very very slow, the only way you could get a zero to 60 time would be to drive it off a cliff. It had a ton of torque though, it could probably pull a house off the foundation. He used it to pull a tree stump in our yard. Out it in 4 low, first gear, and basically let the clutch out and barely hit the gas, and the stump came out like nothing.\n\nAs far as my cars, my daily driver is a Lincoln MKX. I bought it a couple months ago to replace my Pontiac G6 that was closing in on 200,000 miles and was starting to have steering and engine issues. I decided it wasn't worth throwing money at it. I still have the Pontiac though, because the dealership was only willing to give me $150 for it, which they thought was generous because they \"were probably going to take a loss trying to get rid of it.\" I use it for short trips around town when I'm by myself.", "is_submitter": false, "distinguished": null, "created_utc": 1628689592.0, "parent_id": "t3_p29f44", "replies": [{"author": "zoharel", "id": "h8loiih", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p29f44", "stickied": false, "body": ">With good tires and AWD you have an advantage on ice, but it's still ice and if you're overconfident, you might still have a bad time\n\nAs you said, ice is ice.  You always need to be careful in poor weather, but you if you end up hitting some of it in an unfortunate way, you'll be much better off in one of these than in most other cars.\n\n>The difference is most likely from the gear ratios in the transmission and the differential than from airflow, although it wouldn't hurt anything to improve the airflow. \n\nThat's my thought, yes.  Got the intake kit in today, in fact.  Easy enough install.  It sounds a bit different, but I can't drive it right now since it's not registered yet.  We'll see in a week or so, probably.", "is_submitter": true, "distinguished": null, "created_utc": 1628727595.0, "parent_id": "t1_h8j7qxg", "replies": []}]}, {"author": "TheDeadMonument", "id": "h8jogl3", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "p29f44", "stickied": false, "body": "I have a 2002 Mazda Protegé5. It's a 5spd (I won't happily drive anything else. Except a 6sp.)  I sanded some rusted parts with the intention to repaint it, and I haven't gotten to it so there's MORE rust. I need to have the front wheels checked, I think I might have thrown a balance weight. And it needs a valve cover gasket job, which I have. But I've been lazing about in pairing the replacement valve cover. 😑\n\nBUT all that sleeping said, it's fun to drive and once the power and hits, it has some pull.", "is_submitter": false, "distinguished": null, "created_utc": 1628696879.0, "parent_id": "t3_p29f44", "replies": [{"author": "zoharel", "id": "h8ke5cx", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p29f44", "stickied": false, "body": "Our roommate has a Protege5, and it's a fun little car.  Also has the 5 speed.  It's got a number of problems now, unfortunately.  Will be getting replaced soon, with another A6, similar to mine but automatic.", "is_submitter": true, "distinguished": null, "created_utc": 1628707631.0, "parent_id": "t1_h8jogl3", "replies": [{"author": "TheDeadMonument", "id": "h8kf4bs", "score": 2, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #94", "submission": "p29f44", "stickied": false, "body": "Not surprising considering it's almost a 20yo car. I was lucky to buy mine a few years ago from the original owner. He worked from home so the car only had like 70k miles on it.", "is_submitter": false, "distinguished": null, "created_utc": 1628708023.0, "parent_id": "t1_h8ke5cx", "replies": []}]}]}, {"author": "Concrete_Grapes", "id": "h8l52yj", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #165", "submission": "p29f44", "stickied": false, "body": "air intakes are nearly worthless, The joke among most car guys is that they become 'hot air' intakes. K&N often lists the possible power difference in their entire box assembly if you look at their website. It's often very tiny when you finally dig into it--1-3 horsepower. Something no one will actually notice. That, and the maintence on those filters can drive you insane, and the cost of it isnt fun. Disposable is the way to go. A lot of people just.. cut stuff off and jam an open filter under the hood somewhere, and those will lose you power every time.   \n\n\nIf you want more power it'll have to be more drastic.   \n\n\nAnyway, my car stuff is going nowhere. Too damn broke. I have a 64 impala with some shit tier 305 in it, and it burned the valves out and i'm too piss poor to buy new heads for it, or get the ones i do have machined (they're so torched they need valve seats), and it's a 305, so no one in the right mind should save this engine anyway. My car is parked. Probably until my kids are old enough to drive. The oldest is 8.   \n\n\nI left my baby, my love, my favorite thing in the world to drive, in storage in a different state and i'm fucking sad about it. My 68 winnebago. I love it. It's CRAP, but god it's amazing--reminds me of my freedom, my roaming days, when the only care in the world i had was trying to get the 65 gallon gas tank filled, for my next trip at 7mpg. I wish i had the 3k+ to go get it, but it's been 5 years and i've never managed to save up to that amount. Fucking sad.   \n\n\nFor now i drive a 99 hyundai, that's on it's 9th life. I have a knack for keeping cares running and going well beyond what they were ever intended to, or what their first owners expected them to get to. This one's no exception. Bought at 140k miles with a bad front end, blown motor mounts, a shoestring timing belt, and a transmission that wouldnt shift into overdrive--it now has 230k miles, and just keeps on trucking. Just dont ask it to go anywhere when its more than 95 outside, or it vaporlocks and bucks like a pissed off bull in a rodeo.", "is_submitter": false, "distinguished": null, "created_utc": 1628718810.0, "parent_id": "t3_p29f44", "replies": [{"author": "zoharel", "id": "h8lpods", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p29f44", "stickied": false, "body": ">The joke among most car guys is that they become 'hot air' intakes. K&N often lists the possible power difference in their entire box assembly if you look at their website. It's often very tiny when you finally dig into it--1-3 horsepower\n\nYeah, I've seen such installations.  This one does have a box.  It's not perfectly well sealed, but it's pretty airtight around the sides, so it's likely to draw in more cold air than hot.  We'll see how it goes.", "is_submitter": true, "distinguished": null, "created_utc": 1628728135.0, "parent_id": "t1_h8l52yj", "replies": []}]}, {"author": "Alatain", "id": "h8l8zi1", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p29f44", "stickied": false, "body": "I have been driving a Tesla for a little over a year now, and will never go back to an internal combustion engine vehicle. Electric is just so much better than anything I have ever driven that it is hard to explain without having the experience of driving it on a daily basis.", "is_submitter": false, "distinguished": null, "created_utc": 1628720495.0, "parent_id": "t3_p29f44", "replies": [{"author": "zoharel", "id": "h8lptoz", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p29f44", "stickied": false, "body": "I do love the idea of a Tesla, but until there's a healthy used market, I'll probably avoid them.", "is_submitter": true, "distinguished": null, "created_utc": 1628728204.0, "parent_id": "t1_h8l8zi1", "replies": [{"author": "Alatain", "id": "h8lr5pu", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p29f44", "stickied": false, "body": "And that is definitely a healthy way to look at it, but currently the development cycle is pretty strong. As newer models come out, the general benefit for getting a newer model is more enticing than waiting for a last-gen used model. \n\nI will at the very least say that I do not regret picking up the cheapest of the models when I had to get a new car due to an untimely accident.", "is_submitter": false, "distinguished": null, "created_utc": 1628728829.0, "parent_id": "t1_h8lptoz", "replies": [{"author": "zoharel", "id": "h8m3wyc", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p29f44", "stickied": false, "body": "I just don't like the idea of spending $new-car on something I'll be tempted to discard in fifteen years.  The value proposition has never been good.", "is_submitter": true, "distinguished": null, "created_utc": 1628740045.0, "parent_id": "t1_h8lr5pu", "replies": [{"author": "Alatain", "id": "h8pvg3m", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #31", "submission": "p29f44", "stickied": false, "body": "Yeah, that makes sense if you are being conservative with money and only buying used and I totally support that. But buying new does have its benefits. \n\nI look at it like this. I am only going to live so long. I can wait for the developments and save some money, or I can enjoy a car that is always full in the morning and that does most of my driving for me. It is certainly a personal choice, but having a partially self-driving EV, I will never go back.", "is_submitter": false, "distinguished": null, "created_utc": 1628811274.0, "parent_id": "t1_h8m3wyc", "replies": []}]}]}]}]}, {"author": "TheCanadianGame", "id": "h8nf750", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p29f44", "stickied": false, "body": "Here's the winning idea: You take a Minivan, and you cut the roof off. Bonus, you don't cut the pillars off, but you cut just a square in the roof.\n\nYou can have you and 6 mates enjoy ALL the benefits of a minivan: the wind in your hair and millions of miles of headroom. The ceiling? That's the moon.", "is_submitter": false, "distinguished": null, "created_utc": 1628773681.0, "parent_id": "t3_p29f44", "replies": [{"author": "zoharel", "id": "h8o39on", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p29f44", "stickied": false, "body": "What exactly are the benefits of a minivan?", "is_submitter": true, "distinguished": null, "created_utc": 1628784208.0, "parent_id": "t1_h8nf750", "replies": [{"author": "TheCanadianGame", "id": "h8o3yj5", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "", "submission": "p29f44", "stickied": false, "body": "Well, I'm open to a 7 seater behemoth of an SUV like an Expedition to cut the roof off, but i would think that a minivan like a Grand Caravan might be easier to drive. \n\nThe benefits however would be the ability to enjoy motoring with the sun shining, with more than just 4 people at the same time.", "is_submitter": false, "distinguished": null, "created_utc": 1628784493.0, "parent_id": "t1_h8o39on", "replies": [{"author": "zoharel", "id": "h8o4lm6", "score": 0, "subreddit": "TheFlyingTree", "author_flair": "Seeker #82", "submission": "p29f44", "stickied": false, "body": "So it's like a bus but somehow enjoyable, then...", "is_submitter": true, "distinguished": null, "created_utc": 1628784756.0, "parent_id": "t1_h8o3yj5", "replies": []}]}]}]}, {"author": "SybariteAussie", "id": "h9ayfnt", "score": 1, "subreddit": "TheFlyingTree", "author_flair": "Acolyte #177", "submission": "p29f44", "stickied": false, "body": "I have never had any emotional connections with a vehicle. To me they are simply a form of transportation.", "is_submitter": false, "distinguished": null, "created_utc": 1629215902.0, "parent_id": "t3_p29f44", "replies": []}]}